RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#ifndef NULL
#define NULL            (0)
#endif


/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

typedef struct
{
    __IO uint8_t STRT                       : 1;
} stc_adc_str_field_t;

typedef struct
{
    __IO uint16_t MS                        : 2;
    uint16_t RESERVED2                      : 2;
    __IO uint16_t ACCSEL                    : 2;
    __IO uint16_t CLREN                     : 1;
    __IO uint16_t DFMT                      : 1;
    __IO uint16_t AVCNT                     : 3;
    uint16_t RESERVED11                     : 4;
    __IO uint16_t ADAVEN                    : 1;
} stc_adc_cr0_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 8;
    __IO uint16_t SEQPR                     : 1;
    __IO uint16_t SEQBRSEN                  : 1;
    __IO uint16_t RSTCHSEL                  : 1;
} stc_adc_cr1_field_t;

typedef struct
{
    __IO uint16_t TRGSELA                   : 3;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t TRGSELB                   : 3;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t TRGSEL                    : 1;
    uint16_t RESERVED9                      : 3;
    __IO uint16_t TRGEN                     : 1;
} stc_adc_trgsr_field_t;

typedef struct
{
    __IO uint8_t CHSELA                     : 5;
} stc_adc_chselra_field_t;

typedef struct
{
    __IO uint8_t CHSELB                     : 5;
} stc_adc_chselrb_field_t;

typedef struct
{
    __IO uint8_t AVCHSEL                    : 5;
} stc_adc_avchselr_field_t;

typedef struct
{
    __IO uint16_t SHT                       : 8;
    __IO uint16_t SHSEL                     : 3;
} stc_adc_shcr_field_t;

typedef struct
{
    __IO uint16_t EOCAIEN                   : 1;
    __IO uint16_t EOCBIEN                   : 1;
    uint16_t RESERVED2                      : 6;
    __IO uint16_t EOCAF                     : 1;
    __IO uint16_t EOCBF                     : 1;
} stc_adc_iscr_field_t;

typedef struct
{
    __IO uint16_t AWDEN                     : 1;
    uint16_t RESERVED1                      : 6;
    __IO uint16_t AWDMD                     : 1;
    __IO uint16_t AWDIEN                    : 1;
} stc_adc_awdcr_field_t;

typedef struct
{
    __IO uint8_t AWDCND                     : 5;
} stc_adc_awdcndsr_field_t;

typedef struct
{
    __IO uint8_t AWDCH                      : 5;
} stc_adc_awdchsr_field_t;

typedef struct
{
    __IO uint8_t AWDF                       : 5;
} stc_adc_awdsr_field_t;

typedef struct
{
    __IO uint16_t CH0CTL                    : 4;
    __IO uint16_t CH1CTL                    : 4;
    __IO uint16_t CH2CTL                    : 4;
} stc_adc_pgacr_field_t;

typedef struct
{
    __IO uint16_t CH0GAIN                   : 4;
    __IO uint16_t CH1GAIN                   : 4;
    __IO uint16_t CH2GAIN                   : 4;
} stc_adc_pgagsr_field_t;

typedef struct
{
    __IO uint8_t STRT                       : 1;
} stc_adc2_str_field_t;

typedef struct
{
    __IO uint16_t MS                        : 2;
    uint16_t RESERVED2                      : 2;
    __IO uint16_t ACCSEL                    : 2;
    __IO uint16_t CLREN                     : 1;
    __IO uint16_t DFMT                      : 1;
    __IO uint16_t AVCNT                     : 3;
    uint16_t RESERVED11                     : 4;
    __IO uint16_t ADAVEN                    : 1;
} stc_adc2_cr0_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 8;
    __IO uint16_t SEQPR                     : 1;
    __IO uint16_t SEQBRSEN                  : 1;
    __IO uint16_t RSTCHSEL                  : 1;
} stc_adc2_cr1_field_t;

typedef struct
{
    __IO uint16_t TRGSELA                   : 3;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t TRGSELB                   : 3;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t TRGSEL                    : 1;
    uint16_t RESERVED9                      : 3;
    __IO uint16_t TRGEN                     : 1;
} stc_adc2_trgsr_field_t;

typedef struct
{
    __IO uint16_t CHSELA                    :12;
} stc_adc2_chselra_field_t;

typedef struct
{
    __IO uint16_t CHSELB                    :12;
} stc_adc2_chselrb_field_t;

typedef struct
{
    __IO uint16_t AVCHSEL                   :12;
} stc_adc2_avchselr_field_t;

typedef struct
{
    __IO uint16_t EOCAIEN                   : 1;
    __IO uint16_t EOCBIEN                   : 1;
    uint16_t RESERVED2                      : 6;
    __IO uint16_t EOCAF                     : 1;
    __IO uint16_t EOCBF                     : 1;
} stc_adc2_iscr_field_t;

typedef struct
{
    __IO uint16_t AWDEN                     : 1;
    uint16_t RESERVED1                      : 6;
    __IO uint16_t AWDMD                     : 1;
    __IO uint16_t AWDIEN                    : 1;
} stc_adc2_awdcr_field_t;

typedef struct
{
    __IO uint16_t AWDCND                    :12;
} stc_adc2_awdcndsr_field_t;

typedef struct
{
    __IO uint16_t AWDCH                     :12;
} stc_adc2_awdchsr_field_t;

typedef struct
{
    __IO uint16_t AWDF                      :12;
} stc_adc2_awdsr_field_t;

typedef struct
{
    __IO uint16_t START                     : 1;
    __IO uint16_t FUNC                      : 2;
    __IO uint16_t KEY_SEL                   : 2;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t DFAST                     : 1;
    uint16_t RESERVED9                      : 2;
    __IO uint16_t DMY_SEL                   : 2;
} stc_aes_cr_field_t;

typedef struct
{
    __IO uint8_t STRG                       : 1;
} stc_aos_intsfttrg_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_adc0_itrgselr0_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_adc0_itrgselr1_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_adc1_itrgselr0_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_adc1_itrgselr1_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_adc2_itrgselr0_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_adc2_itrgselr1_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_tmr0_htssr_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_tmr2_htssr_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_pevnttrgsr1_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_pevnttrgsr2_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_pevnttrgsr3_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_pevnttrgsr4_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_tmr6_htssr0_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_tmr6_htssr1_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_tmr6_htssr2_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_tmr6_htssr3_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_dcu0_trgsel_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_dcu1_trgsel_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_dcu2_trgsel_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_dcu3_trgsel_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_dma_trgsel0_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_dma_trgsel1_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_dma_trgsel2_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_dma_trgsel3_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_dma_trgsel4_field_t;

typedef struct
{
    __IO uint16_t TRGSEL                    : 9;
} stc_aos_dma_trgsel5_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_dma_trgsel6_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 9;
    uint32_t RESERVED9                      :21;
    __IO uint32_t COMTRG_EN                 : 2;
} stc_aos_dma_trgsel7_field_t;

typedef struct
{
    __IO uint32_t COMTRG                    : 9;
    uint32_t RESERVED9                      :22;
    __IO uint32_t RESV                      : 1;
} stc_aos_comtrg1_field_t;

typedef struct
{
    __IO uint32_t COMTRG                    : 9;
    uint32_t RESERVED9                      :22;
    __IO uint32_t RESV                      : 1;
} stc_aos_comtrg2_field_t;

typedef struct
{
    __IO uint32_t NFEN1                     : 1;
    __IO uint32_t DIVS1                     : 2;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t NFEN2                     : 1;
    __IO uint32_t DIVS2                     : 2;
    uint32_t RESERVED11                     : 5;
    __IO uint32_t NFEN3                     : 1;
    __IO uint32_t DIVS3                     : 2;
    uint32_t RESERVED19                     : 5;
    __IO uint32_t NFEN4                     : 1;
    __IO uint32_t DIVS4                     : 2;
} stc_aos_pevntnfcr_field_t;

typedef struct
{
    __IO uint8_t BUSOFF                     : 1;
    __IO uint8_t TACTIVE                    : 1;
    __IO uint8_t RACTIVE                    : 1;
    __IO uint8_t TSSS                       : 1;
    __IO uint8_t TPSS                       : 1;
    __IO uint8_t LBMI                       : 1;
    __IO uint8_t LBME                       : 1;
    __IO uint8_t RESET                      : 1;
} stc_can_0_cfg_stat_field_t;

typedef struct
{
    __IO uint8_t TSA                        : 1;
    __IO uint8_t TSALL                      : 1;
    __IO uint8_t TSONE                      : 1;
    __IO uint8_t TPA                        : 1;
    __IO uint8_t TPE                        : 1;
    __IO uint8_t STBY                       : 1;
    __IO uint8_t LOM                        : 1;
    __IO uint8_t TBSEL                      : 1;
} stc_can_0_tcmd_field_t;

typedef struct
{
    __IO uint8_t TSSTAT                     : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t TTBM                       : 1;
    __IO uint8_t TSMODE                     : 1;
    __IO uint8_t TSNEXT                     : 1;
} stc_can_0_tctrl_field_t;

typedef struct
{
    __IO uint8_t RSSTAT                     : 2;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t RBALL                      : 1;
    __IO uint8_t RREL                       : 1;
    __IO uint8_t ROV                        : 1;
    __IO uint8_t ROM                        : 1;
    __IO uint8_t SACK                       : 1;
} stc_can_0_rctrl_field_t;

typedef struct
{
    __IO uint8_t TSFF                       : 1;
    __IO uint8_t EIE                        : 1;
    __IO uint8_t TSIE                       : 1;
    __IO uint8_t TPIE                       : 1;
    __IO uint8_t RAFIE                      : 1;
    __IO uint8_t RFIE                       : 1;
    __IO uint8_t ROIE                       : 1;
    __IO uint8_t RIE                        : 1;
} stc_can_0_rtie_field_t;

typedef struct
{
    __IO uint8_t AIF                        : 1;
    __IO uint8_t EIF                        : 1;
    __IO uint8_t TSIF                       : 1;
    __IO uint8_t TPIF                       : 1;
    __IO uint8_t RAFIF                      : 1;
    __IO uint8_t RFIF                       : 1;
    __IO uint8_t ROIF                       : 1;
    __IO uint8_t RIF                        : 1;
} stc_can_0_rtif_field_t;

typedef struct
{
    __IO uint8_t BEIF                       : 1;
    __IO uint8_t BEIE                       : 1;
    __IO uint8_t ALIF                       : 1;
    __IO uint8_t ALIE                       : 1;
    __IO uint8_t EPIF                       : 1;
    __IO uint8_t EPIE                       : 1;
    __IO uint8_t EPASS                      : 1;
    __IO uint8_t EWARN                      : 1;
} stc_can_0_errint_field_t;

typedef struct
{
    __IO uint8_t EWL                        : 4;
    __IO uint8_t AFWL                       : 4;
} stc_can_0_limit_field_t;

typedef struct
{
    __IO uint32_t S_SEG_1                   : 8;
    __IO uint32_t S_SEG_2                   : 7;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t S_SJW                     : 7;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t S_PRESC                   : 8;
} stc_can_0_s_seg_field_t;

typedef struct
{
    __IO uint8_t ALC                        : 5;
    __IO uint8_t KOER                       : 3;
} stc_can_0_ealcap_field_t;

typedef struct
{
    __IO uint8_t SSPOFF                     : 7;
    __IO uint8_t TDCEN                      : 1;
} stc_can_0_tdc_field_t;

typedef struct
{
    __IO uint8_t ACFADR                     : 4;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t SELMASK                    : 1;
} stc_can_0_acfctrl_field_t;

typedef struct
{
    __IO uint8_t AE_0                       : 1;
    __IO uint8_t AE_1                       : 1;
    __IO uint8_t AE_2                       : 1;
    __IO uint8_t AE_3                       : 1;
    __IO uint8_t AE_4                       : 1;
    __IO uint8_t AE_5                       : 1;
    __IO uint8_t AE_6                       : 1;
    __IO uint8_t AE_7                       : 1;
} stc_can_0_acf_en_0_field_t;

typedef struct
{
    __IO uint32_t ACODEORAMASK              :29;
    __IO uint32_t AIDE                      : 1;
    __IO uint32_t AIDEE                     : 1;
} stc_can_0_acf_0_field_t;

typedef struct
{
    __IO uint8_t TBPTR                      : 6;
    __IO uint8_t TBF                        : 1;
    __IO uint8_t TBE                        : 1;
} stc_can_0_tbslot_field_t;

typedef struct
{
    __IO uint8_t TTEN                       : 1;
    __IO uint8_t T_PRESC                    : 2;
    __IO uint8_t TTIF                       : 1;
    __IO uint8_t TTIE                       : 1;
    __IO uint8_t TEIF                       : 1;
    __IO uint8_t WTIF                       : 1;
    __IO uint8_t WTIE                       : 1;
} stc_can_0_ttcfg_field_t;

typedef struct
{
    __IO uint16_t TTPTR                     : 6;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t TTYPE                     : 3;
    uint16_t RESERVED11                     : 1;
    __IO uint16_t TEW                       : 4;
} stc_can_0_trg_cfg_field_t;

typedef struct
{
    __IO uint8_t BUSOFF                     : 1;
    __IO uint8_t TACTIVE                    : 1;
    __IO uint8_t RACTIVE                    : 1;
    __IO uint8_t TSSS                       : 1;
    __IO uint8_t TPSS                       : 1;
    __IO uint8_t LBMI                       : 1;
    __IO uint8_t LBME                       : 1;
    __IO uint8_t RESET                      : 1;
} stc_can_1_cfg_stat_field_t;

typedef struct
{
    __IO uint8_t TSA                        : 1;
    __IO uint8_t TSALL                      : 1;
    __IO uint8_t TSONE                      : 1;
    __IO uint8_t TPA                        : 1;
    __IO uint8_t TPE                        : 1;
    __IO uint8_t STBY                       : 1;
    __IO uint8_t LOM                        : 1;
    __IO uint8_t TBSEL                      : 1;
} stc_can_1_tcmd_field_t;

typedef struct
{
    __IO uint8_t TSSTAT                     : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t TTBM                       : 1;
    __IO uint8_t TSMODE                     : 1;
    __IO uint8_t TSNEXT                     : 1;
} stc_can_1_tctrl_field_t;

typedef struct
{
    __IO uint8_t RSSTAT                     : 2;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t RBALL                      : 1;
    __IO uint8_t RREL                       : 1;
    __IO uint8_t ROV                        : 1;
    __IO uint8_t ROM                        : 1;
    __IO uint8_t SACK                       : 1;
} stc_can_1_rctrl_field_t;

typedef struct
{
    __IO uint8_t TSFF                       : 1;
    __IO uint8_t EIE                        : 1;
    __IO uint8_t TSIE                       : 1;
    __IO uint8_t TPIE                       : 1;
    __IO uint8_t RAFIE                      : 1;
    __IO uint8_t RFIE                       : 1;
    __IO uint8_t ROIE                       : 1;
    __IO uint8_t RIE                        : 1;
} stc_can_1_rtie_field_t;

typedef struct
{
    __IO uint8_t AIF                        : 1;
    __IO uint8_t EIF                        : 1;
    __IO uint8_t TSIF                       : 1;
    __IO uint8_t TPIF                       : 1;
    __IO uint8_t RAFIF                      : 1;
    __IO uint8_t RFIF                       : 1;
    __IO uint8_t ROIF                       : 1;
    __IO uint8_t RIF                        : 1;
} stc_can_1_rtif_field_t;

typedef struct
{
    __IO uint8_t BEIF                       : 1;
    __IO uint8_t BEIE                       : 1;
    __IO uint8_t ALIF                       : 1;
    __IO uint8_t ALIE                       : 1;
    __IO uint8_t EPIF                       : 1;
    __IO uint8_t EPIE                       : 1;
    __IO uint8_t EPASS                      : 1;
    __IO uint8_t EWARN                      : 1;
} stc_can_1_errint_field_t;

typedef struct
{
    __IO uint8_t EWL                        : 4;
    __IO uint8_t AFWL                       : 4;
} stc_can_1_limit_field_t;

typedef struct
{
    __IO uint32_t S_SEG_1                   : 8;
    __IO uint32_t S_SEG_2                   : 7;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t S_SJW                     : 7;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t S_PRESC                   : 8;
} stc_can_1_s_seg_field_t;

typedef struct
{
    __IO uint8_t ALC                        : 5;
    __IO uint8_t KOER                       : 3;
} stc_can_1_ealcap_field_t;

typedef struct
{
    __IO uint8_t SSPOFF                     : 7;
    __IO uint8_t TDCEN                      : 1;
} stc_can_1_tdc_field_t;

typedef struct
{
    __IO uint8_t ACFADR                     : 4;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t SELMASK                    : 1;
} stc_can_1_acfctrl_field_t;

typedef struct
{
    __IO uint8_t AE_0                       : 1;
    __IO uint8_t AE_1                       : 1;
    __IO uint8_t AE_2                       : 1;
    __IO uint8_t AE_3                       : 1;
    __IO uint8_t AE_4                       : 1;
    __IO uint8_t AE_5                       : 1;
    __IO uint8_t AE_6                       : 1;
    __IO uint8_t AE_7                       : 1;
} stc_can_1_acf_en_0_field_t;

typedef struct
{
    __IO uint32_t ACODEORAMASK              :29;
    __IO uint32_t AIDE                      : 1;
    __IO uint32_t AIDEE                     : 1;
} stc_can_1_acf_0_field_t;

typedef struct
{
    __IO uint8_t TBPTR                      : 6;
    __IO uint8_t TBF                        : 1;
    __IO uint8_t TBE                        : 1;
} stc_can_1_tbslot_field_t;

typedef struct
{
    __IO uint8_t TTEN                       : 1;
    __IO uint8_t T_PRESC                    : 2;
    __IO uint8_t TTIF                       : 1;
    __IO uint8_t TTIE                       : 1;
    __IO uint8_t TEIF                       : 1;
    __IO uint8_t WTIF                       : 1;
    __IO uint8_t WTIE                       : 1;
} stc_can_1_ttcfg_field_t;

typedef struct
{
    __IO uint16_t TTPTR                     : 6;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t TTYPE                     : 3;
    uint16_t RESERVED11                     : 1;
    __IO uint16_t TEW                       : 4;
} stc_can_1_trg_cfg_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 7;
    __IO uint16_t OREV                      : 1;
    __IO uint16_t IEN                       : 1;
    __IO uint16_t EDG                       : 2;
    __IO uint16_t FLTR                      : 2;
    __IO uint16_t IOEN                      : 1;
    __IO uint16_t OEN                       : 1;
    __IO uint16_t CMPON                     : 1;
} stc_cmp_cmpctl0_field_t;

typedef struct
{
    __IO uint16_t RVSEL                     : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t CVSEL                     : 4;
} stc_cmp_cmpvltsel0_field_t;

typedef struct
{
    __IO uint8_t OMON                       : 1;
} stc_cmp_cmpmon0_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 7;
    __IO uint16_t OREV                      : 1;
    __IO uint16_t IEN                       : 1;
    __IO uint16_t EDG                       : 2;
    __IO uint16_t FLTR                      : 2;
    __IO uint16_t IOEN                      : 1;
    __IO uint16_t OEN                       : 1;
    __IO uint16_t CMPON                     : 1;
} stc_cmp_cmpctl1_field_t;

typedef struct
{
    __IO uint16_t RVSEL                     : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t CVSEL                     : 4;
} stc_cmp_cmpvltsel1_field_t;

typedef struct
{
    __IO uint8_t OMON                       : 1;
} stc_cmp_cmpmon1_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 7;
    __IO uint16_t OREV                      : 1;
    __IO uint16_t IEN                       : 1;
    __IO uint16_t EDG                       : 2;
    __IO uint16_t FLTR                      : 2;
    __IO uint16_t IOEN                      : 1;
    __IO uint16_t OEN                       : 1;
    __IO uint16_t CMPON                     : 1;
} stc_cmp_cmpctl2_field_t;

typedef struct
{
    __IO uint16_t RVSEL                     : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t CVSEL                     : 4;
} stc_cmp_cmpvltsel2_field_t;

typedef struct
{
    __IO uint8_t OMON                       : 1;
} stc_cmp_cmpmon2_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 7;
    __IO uint16_t OREV                      : 1;
    __IO uint16_t IEN                       : 1;
    __IO uint16_t EDG                       : 2;
    __IO uint16_t FLTR                      : 2;
    __IO uint16_t IOEN                      : 1;
    __IO uint16_t OEN                       : 1;
    __IO uint16_t CMPON                     : 1;
} stc_cmp_cmpctl3_field_t;

typedef struct
{
    __IO uint16_t RVSEL                     : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t CVSEL                     : 4;
} stc_cmp_cmpvltsel3_field_t;

typedef struct
{
    __IO uint8_t OMON                       : 1;
} stc_cmp_cmpmon3_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 1;
    __IO uint8_t CRC_SEL                    : 1;
    __IO uint8_t REFIN                      : 1;
    __IO uint8_t REFOUT                     : 1;
    __IO uint8_t XOROUT                     : 1;
} stc_crc_cr_field_t;

typedef struct
{
    __IO uint8_t CRC_FLAG                   : 1;
} stc_crc_flg_field_t;

