RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint16_t DR0                       : 1;
    __IO uint16_t DR1                       : 1;
    __IO uint16_t DR2                       : 1;
    __IO uint16_t DR3                       : 1;
    __IO uint16_t DL0R4                     : 1;
    __IO uint16_t DL1R5                     : 1;
    __IO uint16_t DL2R6                     : 1;
    __IO uint16_t DL3R7                     : 1;
    __IO uint16_t DL4R8                     : 1;
    __IO uint16_t DL5R9                     : 1;
    __IO uint16_t DL6R10                    : 1;
    __IO uint16_t DL7R11                    : 1;
    __IO uint16_t DL8                       : 1;
    __IO uint16_t DL9                       : 1;
    __IO uint16_t DL10                      : 1;
    __IO uint16_t DL11                      : 1;
} stc_dac_dadr0_field_t;

typedef struct
{
    __IO uint16_t DR0                       : 1;
    __IO uint16_t DR1                       : 1;
    __IO uint16_t DR2                       : 1;
    __IO uint16_t DR3                       : 1;
    __IO uint16_t DL0R4                     : 1;
    __IO uint16_t DL1R5                     : 1;
    __IO uint16_t DL2R6                     : 1;
    __IO uint16_t DL3R7                     : 1;
    __IO uint16_t DL4R8                     : 1;
    __IO uint16_t DL5R9                     : 1;
    __IO uint16_t DL6R10                    : 1;
    __IO uint16_t DL7R11                    : 1;
    __IO uint16_t DL8                       : 1;
    __IO uint16_t DL9                       : 1;
    __IO uint16_t DL10                      : 1;
    __IO uint16_t DL11                      : 1;
} stc_dac_dadr1_field_t;

typedef struct
{
    __IO uint16_t DAE                       : 1;
    __IO uint16_t DA0E                      : 1;
    __IO uint16_t DA1E                      : 1;
    uint16_t RESERVED3                      : 6;
    __IO uint16_t DPSEL                     : 1;
    __IO uint16_t DAAMP0                    : 1;
    __IO uint16_t DAAMP1                    : 1;
} stc_dac_dacr_field_t;

typedef struct
{
    __IO uint16_t ADPSL0                    : 1;
    __IO uint16_t ADPSL1                    : 1;
    __IO uint16_t ADPSL2                    : 1;
    __IO uint16_t ADPSL3                    : 1;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t DA0SF                     : 1;
    __IO uint16_t DA1SF                     : 1;
    uint16_t RESERVED10                     : 5;
    __IO uint16_t ADPEN                     : 1;
} stc_dac_daadpcr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 6;
    __IO uint8_t DADIV0                     : 1;
    __IO uint8_t DADIV1                     : 1;
} stc_dac_dadivcr_field_t;

typedef struct
{
    __IO uint16_t DIVPR11B                  : 5;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t DIVPR11A                  : 5;
} stc_dac_divpr11ab_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 8;
    __IO uint16_t DIVPR11C                  : 5;
} stc_dac_divpr11c_field_t;

typedef struct
{
    __IO uint16_t DIVPR10B                  : 5;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t DIVPR10A                  : 5;
} stc_dac_divpr10ab_field_t;

typedef struct
{
    __IO uint16_t DIVPR8                    : 5;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t DIVPR9                    : 5;
} stc_dac_divpr98_field_t;

typedef struct
{
    __IO uint16_t DIVPR6                    : 5;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t DIVPR7                    : 5;
} stc_dac_divpr76_field_t;

typedef struct
{
    __IO uint16_t DIVPR4                    : 5;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t DIVPR5                    : 5;
} stc_dac_divpr54_field_t;

typedef struct
{
    __IO uint16_t DIVPR2                    : 5;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t DIVPR3                    : 5;
} stc_dac_divpr32_field_t;

typedef struct
{
    __IO uint16_t DIVPR0                    : 5;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t DIVPR1                    : 5;
} stc_dac_divpr10_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 6;
    __IO uint8_t DAODIS0                    : 1;
    __IO uint8_t DAODIS1                    : 1;
} stc_dac_daodis_field_t;

typedef struct
{
    __IO uint16_t AUTH                      : 1;
    __IO uint16_t REMVLOCK                  : 1;
    __IO uint16_t SAFTYLOCK1                : 1;
    __IO uint16_t SAFTYLOCK2                : 1;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t CPUSTOP                   : 1;
    __IO uint16_t CPUSLEEP                  : 1;
} stc_dbgc_mcustat_field_t;

typedef struct
{
    __IO uint16_t EDBGRQ                    : 1;
    __IO uint16_t RESTART                   : 1;
    uint16_t RESERVED2                      : 6;
    __IO uint16_t DIRQ                      : 1;
} stc_dbgc_mcuctl_field_t;

typedef struct
{
    __IO uint8_t ERASEREQ                   : 1;
    __IO uint8_t ERASEACK                   : 1;
    __IO uint8_t ERASEERR                   : 1;
} stc_dbgc_fmcctl_field_t;

typedef struct
{
    __IO uint8_t CDBGPWRUPREQ               : 1;
    __IO uint8_t CDBGPWRUPACK               : 1;
} stc_dbgc_mcudbgstat_field_t;

typedef struct
{
    __IO uint32_t SWDTSTP                   : 1;
    __IO uint32_t WDTSTP                    : 1;
    __IO uint32_t RTCSTP                    : 1;
    __IO uint32_t VDU0STP                   : 1;
    __IO uint32_t VDU1STP                   : 1;
    __IO uint32_t VDU2STP                   : 1;
    uint32_t RESERVED6                      : 8;
    __IO uint32_t TM00STP                   : 1;
    __IO uint32_t TM01STP                   : 1;
    __IO uint32_t TM20STP                   : 1;
    __IO uint32_t TM21STP                   : 1;
    __IO uint32_t TM22STP                   : 1;
    __IO uint32_t TM23STP                   : 1;
    __IO uint32_t TM40STP                   : 1;
    __IO uint32_t TM41STP                   : 1;
    __IO uint32_t TM60STP                   : 1;
    __IO uint32_t TM61STP                   : 1;
    __IO uint32_t TM62STP                   : 1;
    __IO uint32_t TM63STP                   : 1;
    __IO uint32_t TM64STP                   : 1;
    __IO uint32_t TM65STP                   : 1;
    __IO uint32_t TM66STP                   : 1;
    __IO uint32_t TM67STP                   : 1;
    __IO uint32_t TM68STP                   : 1;
    __IO uint32_t TM69STP                   : 1;
} stc_dbgc_mcustpctl_field_t;

typedef struct
{
    __IO uint8_t TRACEIOEN                  : 1;
    __IO uint8_t TRACEMODE                  : 2;
} stc_dbgc_mcutracectl_field_t;

typedef struct
{
    __IO uint32_t MODE                      : 3;
    __IO uint32_t DATASIZE                  : 2;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t COMP_TRG                  : 1;
    uint32_t RESERVED9                      :22;
    __IO uint32_t INTEN                     : 1;
} stc_dcu0_ctl_field_t;

typedef struct
{
    __IO uint8_t FLAG_OP                    : 1;
    __IO uint8_t FLAG_LS2                   : 1;
    __IO uint8_t FLAG_EQ2                   : 1;
    __IO uint8_t FLAG_GT2                   : 1;
    __IO uint8_t FLAG_LS1                   : 1;
    __IO uint8_t FLAG_EQ1                   : 1;
    __IO uint8_t FLAG_GT1                   : 1;
} stc_dcu0_flag_field_t;

typedef struct
{
    __IO uint8_t CLR_OP                     : 1;
    __IO uint8_t CLR_LS2                    : 1;
    __IO uint8_t CLR_EQ2                    : 1;
    __IO uint8_t CLR_GT2                    : 1;
    __IO uint8_t CLR_LS1                    : 1;
    __IO uint8_t CLR_EQ1                    : 1;
    __IO uint8_t CLR_GT1                    : 1;
} stc_dcu0_flagclr_field_t;

typedef struct
{
    __IO uint16_t INT_OP                    : 1;
    __IO uint16_t INT_LS2                   : 1;
    __IO uint16_t INT_EQ2                   : 1;
    __IO uint16_t INT_GT2                   : 1;
    __IO uint16_t INT_LS1                   : 1;
    __IO uint16_t INT_EQ1                   : 1;
    __IO uint16_t INT_GT1                   : 1;
    __IO uint16_t INT_WIN                   : 2;
} stc_dcu0_intsel_field_t;

typedef struct
{
    __IO uint32_t MODE                      : 3;
    __IO uint32_t DATASIZE                  : 2;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t COMP_TRG                  : 1;
    uint32_t RESERVED9                      :22;
    __IO uint32_t INTEN                     : 1;
} stc_dcu1_ctl_field_t;

typedef struct
{
    __IO uint8_t FLAG_OP                    : 1;
    __IO uint8_t FLAG_LS2                   : 1;
    __IO uint8_t FLAG_EQ2                   : 1;
    __IO uint8_t FLAG_GT2                   : 1;
    __IO uint8_t FLAG_LS1                   : 1;
    __IO uint8_t FLAG_EQ1                   : 1;
    __IO uint8_t FLAG_GT1                   : 1;
} stc_dcu1_flag_field_t;

typedef struct
{
    __IO uint8_t CLR_OP                     : 1;
    __IO uint8_t CLR_LS2                    : 1;
    __IO uint8_t CLR_EQ2                    : 1;
    __IO uint8_t CLR_GT2                    : 1;
    __IO uint8_t CLR_LS1                    : 1;
    __IO uint8_t CLR_EQ1                    : 1;
    __IO uint8_t CLR_GT1                    : 1;
} stc_dcu1_flagclr_field_t;

typedef struct
{
    __IO uint16_t INT_OP                    : 1;
    __IO uint16_t INT_LS2                   : 1;
    __IO uint16_t INT_EQ2                   : 1;
    __IO uint16_t INT_GT2                   : 1;
    __IO uint16_t INT_LS1                   : 1;
    __IO uint16_t INT_EQ1                   : 1;
    __IO uint16_t INT_GT1                   : 1;
    __IO uint16_t INT_WIN                   : 2;
} stc_dcu1_intsel_field_t;

typedef struct
{
    __IO uint32_t MODE                      : 3;
    __IO uint32_t DATASIZE                  : 2;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t COMP_TRG                  : 1;
    uint32_t RESERVED9                      :22;
    __IO uint32_t INTEN                     : 1;
} stc_dcu2_ctl_field_t;

typedef struct
{
    __IO uint8_t FLAG_OP                    : 1;
    __IO uint8_t FLAG_LS2                   : 1;
    __IO uint8_t FLAG_EQ2                   : 1;
    __IO uint8_t FLAG_GT2                   : 1;
    __IO uint8_t FLAG_LS1                   : 1;
    __IO uint8_t FLAG_EQ1                   : 1;
    __IO uint8_t FLAG_GT1                   : 1;
} stc_dcu2_flag_field_t;

typedef struct
{
    __IO uint8_t CLR_OP                     : 1;
    __IO uint8_t CLR_LS2                    : 1;
    __IO uint8_t CLR_EQ2                    : 1;
    __IO uint8_t CLR_GT2                    : 1;
    __IO uint8_t CLR_LS1                    : 1;
    __IO uint8_t CLR_EQ1                    : 1;
    __IO uint8_t CLR_GT1                    : 1;
} stc_dcu2_flagclr_field_t;

typedef struct
{
    __IO uint16_t INT_OP                    : 1;
    __IO uint16_t INT_LS2                   : 1;
    __IO uint16_t INT_EQ2                   : 1;
    __IO uint16_t INT_GT2                   : 1;
    __IO uint16_t INT_LS1                   : 1;
    __IO uint16_t INT_EQ1                   : 1;
    __IO uint16_t INT_GT1                   : 1;
    __IO uint16_t INT_WIN                   : 2;
} stc_dcu2_intsel_field_t;

typedef struct
{
    __IO uint32_t MODE                      : 3;
    __IO uint32_t DATASIZE                  : 2;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t COMP_TRG                  : 1;
    uint32_t RESERVED9                      :22;
    __IO uint32_t INTEN                     : 1;
} stc_dcu3_ctl_field_t;

typedef struct
{
    __IO uint8_t FLAG_OP                    : 1;
    __IO uint8_t FLAG_LS2                   : 1;
    __IO uint8_t FLAG_EQ2                   : 1;
    __IO uint8_t FLAG_GT2                   : 1;
    __IO uint8_t FLAG_LS1                   : 1;
    __IO uint8_t FLAG_EQ1                   : 1;
    __IO uint8_t FLAG_GT1                   : 1;
} stc_dcu3_flag_field_t;

typedef struct
{
    __IO uint8_t CLR_OP                     : 1;
    __IO uint8_t CLR_LS2                    : 1;
    __IO uint8_t CLR_EQ2                    : 1;
    __IO uint8_t CLR_GT2                    : 1;
    __IO uint8_t CLR_LS1                    : 1;
    __IO uint8_t CLR_EQ1                    : 1;
    __IO uint8_t CLR_GT1                    : 1;
} stc_dcu3_flagclr_field_t;

typedef struct
{
    __IO uint16_t INT_OP                    : 1;
    __IO uint16_t INT_LS2                   : 1;
    __IO uint16_t INT_EQ2                   : 1;
    __IO uint16_t INT_GT2                   : 1;
    __IO uint16_t INT_LS1                   : 1;
    __IO uint16_t INT_EQ1                   : 1;
    __IO uint16_t INT_GT1                   : 1;
    __IO uint16_t INT_WIN                   : 2;
} stc_dcu3_intsel_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
} stc_dmac_en_field_t;

typedef struct
{
    __IO uint32_t TRNERR                    : 8;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t REQERR                    : 8;
    __IO uint32_t RESV0                     : 1;
} stc_dmac_intstat0_field_t;

typedef struct
{
    __IO uint32_t TC                        : 8;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t BTC                       : 8;
    __IO uint32_t RESV1                     : 1;
} stc_dmac_intstat1_field_t;

typedef struct
{
    __IO uint32_t MSKTRNERR                 : 8;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t MSKREQERR                 : 8;
    __IO uint32_t RESV2                     : 1;
} stc_dmac_intmask0_field_t;

typedef struct
{
    __IO uint32_t MSKTC                     : 8;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t MSKBTC                    : 8;
    __IO uint32_t RESV3                     : 1;
} stc_dmac_intmask1_field_t;

typedef struct
{
    __IO uint32_t CLRTRNERR                 : 8;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t CLRREQERR                 : 8;
    __IO uint32_t RESV4                     : 1;
} stc_dmac_intclr0_field_t;

typedef struct
{
    __IO uint32_t CLRTC                     : 8;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t CLRBTC                    : 8;
    __IO uint32_t RESV5                     : 1;
} stc_dmac_intclr1_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dmac_dtctl0_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
} stc_dmac_rpt0_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dmac_snseqctl0_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dmac_dnseqctl0_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LLP                       :30;
} stc_dmac_llp0_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t PROT                      : 3;
} stc_dmac_ch0ctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dmac_dtctl1_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
} stc_dmac_rpt1_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dmac_snseqctl1_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dmac_dnseqctl1_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LLP                       :30;
} stc_dmac_llp1_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t PROT                      : 3;
} stc_dmac_ch1ctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dmac_dtctl2_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
} stc_dmac_rpt2_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dmac_snseqctl2_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dmac_dnseqctl2_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LLP                       :30;
} stc_dmac_llp2_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t PROT                      : 3;
} stc_dmac_ch2ctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dmac_dtctl3_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
} stc_dmac_rpt3_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dmac_snseqctl3_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dmac_dnseqctl3_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LLP                       :30;
} stc_dmac_llp3_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t PROT                      : 3;
} stc_dmac_ch3ctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dmac_dtctl4_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
} stc_dmac_rpt4_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dmac_snseqctl4_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dmac_dnseqctl4_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LLP                       :30;
} stc_dmac_llp4_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t PROT                      : 3;
} stc_dmac_ch4ctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dmac_dtctl5_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
} stc_dmac_rpt5_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dmac_snseqctl5_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dmac_dnseqctl5_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LLP                       :30;
} stc_dmac_llp5_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t PROT                      : 3;
} stc_dmac_ch5ctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dmac_dtctl6_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
} stc_dmac_rpt6_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dmac_snseqctl6_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dmac_dnseqctl6_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LLP                       :30;
} stc_dmac_llp6_field_t;

