RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t PROT                      : 3;
} stc_dmac_ch6ctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dmac_dtctl7_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
} stc_dmac_rpt7_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dmac_snseqctl7_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dmac_dnseqctl7_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LLP                       :30;
} stc_dmac_llp7_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    __IO uint32_t PROT                      : 3;
} stc_dmac_ch7ctl_field_t;

typedef struct
{
    __IO uint8_t FSTP                       : 1;
} stc_efm_fstp_field_t;

typedef struct
{
    __IO uint32_t SLPMD                     : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t FLWT                      : 4;
    __IO uint32_t LVRM                      : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t CACHE                     : 1;
    __IO uint32_t PREFETE                   : 1;
    uint32_t RESERVED18                     : 6;
    __IO uint32_t CRST                      : 1;
} stc_efm_frmc_field_t;

typedef struct
{
    __IO uint8_t PEMODE                     : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t PEMOD                      : 3;
} stc_efm_fwmc_field_t;

typedef struct
{
    __IO uint16_t PEWERR                    : 1;
    __IO uint16_t PEPRTERR                  : 1;
    __IO uint16_t PGSZERR                   : 1;
    __IO uint16_t PGMISMTCH                 : 1;
    __IO uint16_t OPTEND                    : 1;
    __IO uint16_t RDCOLERR                  : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t RDY                       : 1;
} stc_efm_fsr_field_t;

typedef struct
{
    __IO uint8_t PEWERRCLR                  : 1;
    __IO uint8_t PEPRTERRCLR                : 1;
    __IO uint8_t PGSZERRCLR                 : 1;
    __IO uint8_t PGMISMTCHCLR               : 1;
    __IO uint8_t OPTENDCLR                  : 1;
    __IO uint8_t RDCOLERRCLR                : 1;
} stc_efm_fsclr_field_t;

typedef struct
{
    __IO uint8_t PEERRITE                   : 1;
    __IO uint8_t OPTENDITE                  : 1;
    __IO uint8_t RDCOLERRITE                : 1;
} stc_efm_fite_field_t;

typedef struct
{
    __IO uint8_t FSWP                       : 1;
} stc_efm_fswp_field_t;

typedef struct
{
    __IO uint32_t FPMTSW                    :20;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV0                     : 1;
} stc_efm_fpmtsw_field_t;

typedef struct
{
    __IO uint32_t FPMTEW                    :20;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV1                     : 1;
} stc_efm_fpmtew_field_t;

typedef struct
{
    __IO uint32_t RM0SIZE                   : 5;
    uint32_t RESERVED5                      : 7;
    __IO uint32_t RM0TADDR                  :17;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t EN0                       : 1;
} stc_efm_remcr0_field_t;

typedef struct
{
    __IO uint32_t RM1SIZE                   : 5;
    uint32_t RESERVED5                      : 7;
    __IO uint32_t RM1TADDR                  :17;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t EN1                       : 1;
} stc_efm_remcr1_field_t;

typedef struct
{
    __IO uint8_t FSTP                       : 1;
} stc_efmd_dfstp_field_t;

typedef struct
{
    __IO uint16_t SLPMD                     : 1;
    uint16_t RESERVED1                      : 3;
    __IO uint16_t FLWT                      : 4;
    __IO uint16_t LVRM                      : 1;
} stc_efmd_dfrmc_field_t;

typedef struct
{
    __IO uint8_t PEMODE                     : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t PEMOD                      : 3;
} stc_efmd_dfwmc_field_t;

typedef struct
{
    __IO uint16_t PEWERR                    : 1;
    uint16_t RESERVED1                      : 1;
    __IO uint16_t PGSZERR                   : 1;
    __IO uint16_t PGMISMTCH                 : 1;
    __IO uint16_t OPTEND                    : 1;
    __IO uint16_t RDCOLERR                  : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t RDY                       : 1;
} stc_efmd_dfsr_field_t;

typedef struct
{
    __IO uint8_t PEWERRCLR                  : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t PGSZERRCLR                 : 1;
    __IO uint8_t PGMISMTCHCLR               : 1;
    __IO uint8_t OPTENDCLR                  : 1;
    __IO uint8_t RDCOLERRCLR                : 1;
} stc_efmd_dfsclr_field_t;

typedef struct
{
    __IO uint8_t PEERRITE                   : 1;
    __IO uint8_t OPTENDITE                  : 1;
    __IO uint8_t RDCOLERRITE                : 1;
} stc_efmd_dfite_field_t;

typedef struct
{
    __IO uint32_t PORTINEN                  : 1;
    __IO uint32_t CMPEN                     : 4;
    __IO uint32_t OSCSTPEN                  : 1;
    __IO uint32_t PWMSEL                    :13;
    uint32_t RESERVED19                     : 9;
    __IO uint32_t NFSEL                     : 2;
    __IO uint32_t NFEN                      : 1;
    __IO uint32_t INVSEL                    : 1;
} stc_emb_ctl0_field_t;

typedef struct
{
    __IO uint32_t PWMLV                     :13;
    uint32_t RESERVED13                     :18;
    __IO uint32_t RESV                      : 1;
} stc_emb_pwmlv0_field_t;

typedef struct
{
    __IO uint32_t SOE                       : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RESV                      : 1;
} stc_emb_soe0_field_t;

typedef struct
{
    __IO uint32_t PORTINF                   : 1;
    __IO uint32_t PWMSF                     : 1;
    __IO uint32_t CMPF                      : 1;
    __IO uint32_t OSF                       : 1;
    __IO uint32_t PORTINST                  : 1;
    __IO uint32_t PWMST                     : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RESV                      : 1;
} stc_emb_stat0_field_t;

typedef struct
{
    __IO uint32_t PORTINFCLR                : 1;
    __IO uint32_t PWMSFCLR                  : 1;
    __IO uint32_t CMPFCLR                   : 1;
    __IO uint32_t OSFCLR                    : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_statclr0_field_t;

typedef struct
{
    __IO uint32_t PORTINTEN                 : 1;
    __IO uint32_t PWMINTEN                  : 1;
    __IO uint32_t CMPINTEN                  : 1;
    __IO uint32_t OSINTEN                   : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_inten0_field_t;

typedef struct
{
    __IO uint32_t PORTINFCLR                : 1;
    __IO uint32_t PWMSFCLR                  : 1;
    __IO uint32_t CMPFCLR                   : 1;
    __IO uint32_t OSFCLR                    : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_statclr1_field_t;

typedef struct
{
    __IO uint32_t PWMLV                     :10;
    uint32_t RESERVED10                     :21;
    __IO uint32_t RESV                      : 1;
} stc_emb_pwmlv1_field_t;

typedef struct
{
    __IO uint32_t SOE                       : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RESV                      : 1;
} stc_emb_soe1_field_t;

typedef struct
{
    __IO uint32_t PORTINF                   : 1;
    __IO uint32_t PWMSF                     : 1;
    __IO uint32_t CMPF                      : 1;
    __IO uint32_t OSF                       : 1;
    __IO uint32_t PORTINST                  : 1;
    __IO uint32_t PWMST                     : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RESV                      : 1;
} stc_emb_stat1_field_t;

typedef struct
{
    __IO uint32_t PORTINTEN                 : 1;
    __IO uint32_t PWMINTEN                  : 1;
    __IO uint32_t CMPINTEN                  : 1;
    __IO uint32_t OSINTEN                   : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_inten1_field_t;

typedef struct
{
    __IO uint32_t PORTINEN                  : 1;
    __IO uint32_t CMPEN                     : 4;
    __IO uint32_t OSCSTPEN                  : 1;
    __IO uint32_t PWMSEL                    :10;
    uint32_t RESERVED16                     :12;
    __IO uint32_t NFSEL                     : 2;
    __IO uint32_t NFEN                      : 1;
    __IO uint32_t INVSEL                    : 1;
} stc_emb_ctl2_field_t;

typedef struct
{
    __IO uint32_t PWMLV                     :10;
    uint32_t RESERVED10                     :21;
    __IO uint32_t RESV                      : 1;
} stc_emb_pwmlv2_field_t;

typedef struct
{
    __IO uint32_t SOE                       : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RESV                      : 1;
} stc_emb_soe2_field_t;

typedef struct
{
    __IO uint32_t PORTINF                   : 1;
    __IO uint32_t PWMSF                     : 1;
    __IO uint32_t CMPF                      : 1;
    __IO uint32_t OSF                       : 1;
    __IO uint32_t PORTINST                  : 1;
    __IO uint32_t PWMST                     : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RESV                      : 1;
} stc_emb_stat2_field_t;

typedef struct
{
    __IO uint32_t PORTINFCLR                : 1;
    __IO uint32_t PWMSFCLR                  : 1;
    __IO uint32_t CMPFCLR                   : 1;
    __IO uint32_t OSFCLR                    : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_statclr2_field_t;

typedef struct
{
    __IO uint32_t PORTINTEN                 : 1;
    __IO uint32_t PWMINTEN                  : 1;
    __IO uint32_t CMPINTEN                  : 1;
    __IO uint32_t OSINTEN                   : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_inten2_field_t;

typedef struct
{
    __IO uint32_t PORTINEN                  : 1;
    __IO uint32_t CMPEN                     : 4;
    __IO uint32_t OSCSTPEN                  : 1;
    __IO uint32_t PWMSEL                    :10;
    uint32_t RESERVED16                     :12;
    __IO uint32_t NFSEL                     : 2;
    __IO uint32_t NFEN                      : 1;
    __IO uint32_t INVSEL                    : 1;
} stc_emb_ctl3_field_t;

typedef struct
{
    __IO uint32_t PWMLV                     :10;
    uint32_t RESERVED10                     :21;
    __IO uint32_t RESV                      : 1;
} stc_emb_pwmlv3_field_t;

typedef struct
{
    __IO uint32_t SOE                       : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RESV                      : 1;
} stc_emb_soe3_field_t;

typedef struct
{
    __IO uint32_t PORTINF                   : 1;
    __IO uint32_t PWMSF                     : 1;
    __IO uint32_t CMPF                      : 1;
    __IO uint32_t OSF                       : 1;
    __IO uint32_t PORTINST                  : 1;
    __IO uint32_t PWMST                     : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RESV                      : 1;
} stc_emb_stat3_field_t;

typedef struct
{
    __IO uint32_t PORTINFCLR                : 1;
    __IO uint32_t PWMSFCLR                  : 1;
    __IO uint32_t CMPFCLR                   : 1;
    __IO uint32_t OSFCLR                    : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_statclr3_field_t;

typedef struct
{
    __IO uint32_t PORTINTEN                 : 1;
    __IO uint32_t PWMINTEN                  : 1;
    __IO uint32_t CMPINTEN                  : 1;
    __IO uint32_t OSINTEN                   : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_inten3_field_t;

typedef struct
{
    __IO uint32_t PORTINEN                  : 1;
    __IO uint32_t CMPEN                     : 4;
    __IO uint32_t OSCSTPEN                  : 1;
    __IO uint32_t PWMSEL                    : 3;
    uint32_t RESERVED9                      :19;
    __IO uint32_t NFSEL                     : 2;
    __IO uint32_t NFEN                      : 1;
    __IO uint32_t INVSEL                    : 1;
} stc_emb_ctl4_field_t;

typedef struct
{
    __IO uint32_t PWMLV                     : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RESV                      : 1;
} stc_emb_pwmlv4_field_t;

typedef struct
{
    __IO uint32_t SOE                       : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RESV                      : 1;
} stc_emb_soe4_field_t;

typedef struct
{
    __IO uint32_t PORTINF                   : 1;
    __IO uint32_t PWMSF                     : 1;
    __IO uint32_t CMPF                      : 1;
    __IO uint32_t OSF                       : 1;
    __IO uint32_t PORTINST                  : 1;
    __IO uint32_t PWMST                     : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RESV                      : 1;
} stc_emb_stat4_field_t;

typedef struct
{
    __IO uint32_t PORTINFCLR                : 1;
    __IO uint32_t PWMSFCLR                  : 1;
    __IO uint32_t CMPFCLR                   : 1;
    __IO uint32_t OSFCLR                    : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_statclr4_field_t;

typedef struct
{
    __IO uint32_t PORTINTEN                 : 1;
    __IO uint32_t PWMINTEN                  : 1;
    __IO uint32_t CMPINTEN                  : 1;
    __IO uint32_t OSINTEN                   : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_inten4_field_t;

typedef struct
{
    __IO uint32_t PORTINEN                  : 1;
    __IO uint32_t CMPEN                     : 4;
    __IO uint32_t OSCSTPEN                  : 1;
    __IO uint32_t PWMSEL                    : 3;
    uint32_t RESERVED9                      :19;
    __IO uint32_t NFSEL                     : 2;
    __IO uint32_t NFEN                      : 1;
    __IO uint32_t INVSEL                    : 1;
} stc_emb_ctl5_field_t;

typedef struct
{
    __IO uint32_t PWMLV                     : 3;
    uint32_t RESERVED3                      :28;
    __IO uint32_t RESV                      : 1;
} stc_emb_pwmlv5_field_t;

typedef struct
{
    __IO uint32_t SOE                       : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RESV                      : 1;
} stc_emb_soe5_field_t;

typedef struct
{
    __IO uint32_t PORTINF                   : 1;
    __IO uint32_t PWMSF                     : 1;
    __IO uint32_t CMPF                      : 1;
    __IO uint32_t OSF                       : 1;
    __IO uint32_t PORTINST                  : 1;
    __IO uint32_t PWMST                     : 1;
    uint32_t RESERVED6                      :25;
    __IO uint32_t RESV                      : 1;
} stc_emb_stat5_field_t;

typedef struct
{
    __IO uint32_t PORTINFCLR                : 1;
    __IO uint32_t PWMSFCLR                  : 1;
    __IO uint32_t CMPFCLR                   : 1;
    __IO uint32_t OSFCLR                    : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_statclr5_field_t;

typedef struct
{
    __IO uint32_t PORTINTEN                 : 1;
    __IO uint32_t PWMINTEN                  : 1;
    __IO uint32_t CMPINTEN                  : 1;
    __IO uint32_t OSINTEN                   : 1;
    uint32_t RESERVED4                      :27;
    __IO uint32_t RESV                      : 1;
} stc_emb_inten5_field_t;

typedef struct
{
    __IO uint8_t IFSEL                      : 1;
} stc_eth_mac_ifconfr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t RE                        : 1;
    __IO uint32_t TE                        : 1;
    __IO uint32_t DC                        : 1;
    __IO uint32_t BL                        : 2;
    __IO uint32_t ACS                       : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t DRTY                      : 1;
    __IO uint32_t IPCO                      : 1;
    __IO uint32_t DM                        : 1;
    __IO uint32_t LM                        : 1;
    __IO uint32_t DO                        : 1;
    __IO uint32_t FES                       : 1;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t DCRS                      : 1;
    __IO uint32_t IFG                       : 3;
    uint32_t RESERVED20                     : 2;
    __IO uint32_t MJB                       : 1;
    __IO uint32_t MWD                       : 1;
    uint32_t RESERVED24                     : 1;
    __IO uint32_t CST                       : 1;
    uint32_t RESERVED26                     : 2;
    __IO uint32_t SAIRC                     : 3;
} stc_eth_mac_configr_field_t;

typedef struct
{
    __IO uint32_t PR                        : 1;
    __IO uint32_t HUC                       : 1;
    __IO uint32_t HMC                       : 1;
    __IO uint32_t DAIF                      : 1;
    __IO uint32_t PMF                       : 1;
    __IO uint32_t DBF                       : 1;
    __IO uint32_t PCF                       : 2;
    __IO uint32_t SAIF                      : 1;
    __IO uint32_t SAF                       : 1;
    __IO uint32_t HPF                       : 1;
    uint32_t RESERVED11                     : 5;
    __IO uint32_t VTFE                      : 1;
    uint32_t RESERVED17                     : 3;
    __IO uint32_t IPFE                      : 1;
    __IO uint32_t DNTU                      : 1;
    uint32_t RESERVED22                     : 9;
    __IO uint32_t RA                        : 1;
} stc_eth_mac_fltctlr_field_t;

typedef struct
{
    __IO uint16_t SMIB                      : 1;
    __IO uint16_t SMIW                      : 1;
    __IO uint16_t SMIC                      : 4;
    __IO uint16_t SMIR                      : 5;
    __IO uint16_t SMIA                      : 5;
} stc_eth_mac_smiaddr_field_t;

typedef struct
{
    __IO uint32_t FCA_BPA                   : 1;
    __IO uint32_t TFE                       : 1;
    __IO uint32_t RFE                       : 1;
    __IO uint32_t UNP                       : 1;
    __IO uint32_t PLT                       : 2;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t DZPQ                      : 1;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t PAUSET                    :16;
} stc_eth_mac_floctlr_field_t;

typedef struct
{
    __IO uint32_t VLFLT                     :16;
    __IO uint32_t VTAL                      : 1;
    __IO uint32_t VTIM                      : 1;
    uint32_t RESERVED18                     : 1;
    __IO uint32_t VTHM                      : 1;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV0                     : 1;
} stc_eth_mac_vtafltr_field_t;

typedef struct
{
    __IO uint32_t MREA                      : 1;
    __IO uint32_t MRS                       : 2;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t RFWA                      : 1;
    __IO uint32_t RFRS                      : 2;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t RFFL                      : 2;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t MTEA                      : 1;
    __IO uint32_t MTS                       : 2;
    __IO uint32_t MTP                       : 1;
    __IO uint32_t TFRS                      : 2;
    __IO uint32_t TFWA                      : 1;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t TFNE                      : 1;
    __IO uint32_t TFF                       : 1;
} stc_eth_mac_macstsr_field_t;

typedef struct
{
    __IO uint32_t PWDN                      : 1;
    __IO uint32_t MPEN                      : 1;
    __IO uint32_t WKEN                      : 1;
    uint32_t RESERVED3                      : 2;
    __IO uint32_t MPFR                      : 1;
    __IO uint32_t WKFR                      : 1;
    uint32_t RESERVED7                      : 2;
    __IO uint32_t GLUB                      : 1;
    __IO uint32_t RTWKTR                    : 1;
    uint32_t RESERVED11                     :13;
    __IO uint32_t RTWKPT                    : 3;
    uint32_t RESERVED27                     : 4;
    __IO uint32_t RTWKFR                    : 1;
} stc_eth_mac_pmtctlr_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 3;
    __IO uint16_t PMTIS                     : 1;
    __IO uint16_t MMCIS                     : 1;
    __IO uint16_t MMCRXIS                   : 1;
    __IO uint16_t MMCTXIS                   : 1;
    uint16_t RESERVED7                      : 2;
    __IO uint16_t TSPIS                     : 1;
} stc_eth_mac_intstsr_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 3;
    __IO uint16_t PMTIM                     : 1;
    uint16_t RESERVED4                      : 5;
    __IO uint16_t TSPIM                     : 1;
} stc_eth_mac_intmskr_field_t;

typedef struct
{
    __IO uint32_t ADDRH0                    :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t AE0                       : 1;
} stc_eth_mac_macadhr0_field_t;

typedef struct
{
    __IO uint32_t ADDRH1                    :16;
    uint32_t RESERVED16                     : 8;
    __IO uint32_t MBC1                      : 6;
    __IO uint32_t SA1                       : 1;
    __IO uint32_t AE1                       : 1;
} stc_eth_mac_macadhr1_field_t;

typedef struct
{
    __IO uint32_t ADDRH2                    :16;
    uint32_t RESERVED16                     : 8;
    __IO uint32_t MBC2                      : 6;
    __IO uint32_t SA2                       : 1;
    __IO uint32_t AE2                       : 1;
} stc_eth_mac_macadhr2_field_t;

typedef struct
{
    __IO uint32_t ADDRH3                    :16;
    uint32_t RESERVED16                     : 8;
    __IO uint32_t MBC3                      : 6;
    __IO uint32_t SA3                       : 1;
    __IO uint32_t AE3                       : 1;
} stc_eth_mac_macadhr3_field_t;

