RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint32_t ADDRH4                    :16;
    uint32_t RESERVED16                     : 8;
    __IO uint32_t MBC4                      : 6;
    __IO uint32_t SA4                       : 1;
    __IO uint32_t AE4                       : 1;
} stc_eth_mac_macadhr4_field_t;

typedef struct
{
    __IO uint8_t CRST                       : 1;
    __IO uint8_t COS                        : 1;
    __IO uint8_t ROR                        : 1;
    __IO uint8_t MCF                        : 1;
    __IO uint8_t MCPSET                     : 1;
    __IO uint8_t MCPSEL                     : 1;
} stc_eth_mmc_mmcctlr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 3;
    __IO uint32_t RXBGIS                    : 1;
    __IO uint32_t RXMGIS                    : 1;
    __IO uint32_t RXCEIS                    : 1;
    __IO uint32_t RXAEIS                    : 1;
    __IO uint32_t RXREIS                    : 1;
    uint32_t RESERVED8                      : 9;
    __IO uint32_t RXUGIS                    : 1;
    __IO uint32_t RXLEIS                    : 1;
    __IO uint32_t RXOEIS                    : 1;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV3                     : 1;
} stc_eth_mmc_revstsr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t TXBGIS                    : 1;
    __IO uint32_t TXMGIS                    : 1;
    uint32_t RESERVED4                      :12;
    __IO uint32_t TXDEEIS                   : 1;
    __IO uint32_t TXLCEIS                   : 1;
    __IO uint32_t TXECEIS                   : 1;
    __IO uint32_t TXCAEIS                   : 1;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t TXUGIS                    : 1;
    __IO uint32_t TXEDEIS                   : 1;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t RESV4                     : 1;
} stc_eth_mmc_trsstsr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 3;
    __IO uint32_t RXBGIM                    : 1;
    __IO uint32_t RXMGIM                    : 1;
    __IO uint32_t RXCEIM                    : 1;
    __IO uint32_t RXAEIM                    : 1;
    __IO uint32_t RXREIM                    : 1;
    uint32_t RESERVED8                      : 9;
    __IO uint32_t RXUGIM                    : 1;
    __IO uint32_t RXLEIM                    : 1;
    __IO uint32_t RXOEIM                    : 1;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV5                     : 1;
} stc_eth_mmc_ritctlr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t TXBGIM                    : 1;
    __IO uint32_t TXMGIM                    : 1;
    uint32_t RESERVED4                      :12;
    __IO uint32_t TXDEEIM                   : 1;
    __IO uint32_t TXLCEIM                   : 1;
    __IO uint32_t TXECEIM                   : 1;
    __IO uint32_t TXCAEIM                   : 1;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t TXUGIM                    : 1;
    __IO uint32_t TXEDEIM                   : 1;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t RESV6                     : 1;
} stc_eth_mmc_titctlr_field_t;

typedef struct
{
    __IO uint32_t L3PEN                     : 1;
    uint32_t RESERVED1                      : 1;
    __IO uint32_t L3SAM                     : 1;
    __IO uint32_t L3SAIM                    : 1;
    __IO uint32_t L3DAM                     : 1;
    __IO uint32_t L3DAIM                    : 1;
    __IO uint32_t L3HSBM                    : 5;
    __IO uint32_t L3HDBM                    : 5;
    __IO uint32_t L4PEN                     : 1;
    uint32_t RESERVED17                     : 1;
    __IO uint32_t L4SPM                     : 1;
    __IO uint32_t L4SPIM                    : 1;
    __IO uint32_t L4DPM                     : 1;
    __IO uint32_t L4DPIM                    : 1;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t RESV1                     : 1;
} stc_eth_mac_l34ctlr_field_t;

typedef struct
{
    __IO uint32_t L4SPVAL                   :16;
    __IO uint32_t L4DPVAL                   :16;
} stc_eth_mac_l4portr_field_t;

typedef struct
{
    __IO uint32_t VLANV                     :16;
    __IO uint32_t VLANC                     : 2;
    uint32_t RESERVED18                     : 6;
    __IO uint32_t RESV7                     : 1;
} stc_eth_mac_vtactlr_field_t;

typedef struct
{
    __IO uint32_t TSPEN                     : 1;
    __IO uint32_t TSPUPSEL                  : 1;
    __IO uint32_t TSPINI                    : 1;
    __IO uint32_t TSPUP                     : 1;
    __IO uint32_t TSPINT                    : 1;
    __IO uint32_t TSPADUP                   : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t TSPEALL                   : 1;
    __IO uint32_t TSPSSR                    : 1;
    __IO uint32_t TSPVER                    : 1;
    __IO uint32_t TSPOVETH                  : 1;
    __IO uint32_t TSPOVIPV6                 : 1;
    __IO uint32_t TSPOVIPV4                 : 1;
    __IO uint32_t TSPMTSEL                  : 4;
    __IO uint32_t TSPADF                    : 1;
    uint32_t RESERVED19                     : 5;
    __IO uint32_t RESV2                     : 1;
} stc_eth_ptp_tspctlr_field_t;

typedef struct
{
    __IO uint8_t TSOVF                      : 1;
    __IO uint8_t TSTAR0                     : 1;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t TSERR0                     : 1;
    __IO uint8_t TSTAR1                     : 1;
    __IO uint8_t TSERR1                     : 1;
} stc_eth_ptp_tspstsr_field_t;

typedef struct
{
    __IO uint16_t PPSFRE0                   : 4;
    __IO uint16_t PPSOMD                    : 1;
    __IO uint16_t TT0SEL                    : 2;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PPSFRE1                   : 3;
    uint16_t RESERVED11                     : 2;
    __IO uint16_t TT1SEL                    : 2;
} stc_eth_ptp_ppsctlr_field_t;

typedef struct
{
    __IO uint32_t SWR                       : 1;
    __IO uint32_t DMAA                      : 1;
    __IO uint32_t DSL                       : 5;
    __IO uint32_t DSEN                      : 1;
    __IO uint32_t TPBL                      : 6;
    __IO uint32_t PRAT                      : 2;
    __IO uint32_t FBST                      : 1;
    __IO uint32_t RPBL                      : 6;
    __IO uint32_t SPBL                      : 1;
    __IO uint32_t M8PBL                     : 1;
    __IO uint32_t AAL                       : 1;
    __IO uint32_t MBST                      : 1;
    __IO uint32_t TXPR                      : 1;
} stc_eth_dma_busmodr_field_t;

typedef struct
{
    __IO uint32_t TIS                       : 1;
    __IO uint32_t TSS                       : 1;
    __IO uint32_t TUS                       : 1;
    __IO uint32_t TJS                       : 1;
    __IO uint32_t OVS                       : 1;
    __IO uint32_t UNS                       : 1;
    __IO uint32_t RIS                       : 1;
    __IO uint32_t RUS                       : 1;
    __IO uint32_t RSS                       : 1;
    __IO uint32_t RWS                       : 1;
    __IO uint32_t ETS                       : 1;
    uint32_t RESERVED11                     : 2;
    __IO uint32_t FBS                       : 1;
    __IO uint32_t ERS                       : 1;
    __IO uint32_t AIS                       : 1;
    __IO uint32_t NIS                       : 1;
    __IO uint32_t RSTS                      : 3;
    __IO uint32_t TSTS                      : 3;
    __IO uint32_t EBUS                      : 3;
    uint32_t RESERVED26                     : 1;
    __IO uint32_t MMCS                      : 1;
    __IO uint32_t PMTS                      : 1;
    __IO uint32_t PTPS                      : 1;
} stc_eth_dma_dmastsr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t STR                       : 1;
    __IO uint32_t OSF                       : 1;
    __IO uint32_t RTC                       : 2;
    __IO uint32_t DGF                       : 1;
    __IO uint32_t FUF                       : 1;
    __IO uint32_t FEF                       : 1;
    uint32_t RESERVED8                      : 5;
    __IO uint32_t STT                       : 1;
    __IO uint32_t TTC                       : 3;
    uint32_t RESERVED17                     : 3;
    __IO uint32_t FTF                       : 1;
    __IO uint32_t TSF                       : 1;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t DFRF                      : 1;
    __IO uint32_t RSF                       : 1;
    __IO uint32_t DTCOE                     : 1;
} stc_eth_dma_oprmodr_field_t;

typedef struct
{
    __IO uint32_t TIE                       : 1;
    __IO uint32_t TSE                       : 1;
    __IO uint32_t TUE                       : 1;
    __IO uint32_t TJE                       : 1;
    __IO uint32_t OVE                       : 1;
    __IO uint32_t UNE                       : 1;
    __IO uint32_t RIE                       : 1;
    __IO uint32_t RUE                       : 1;
    __IO uint32_t RSE                       : 1;
    __IO uint32_t RWE                       : 1;
    __IO uint32_t ETE                       : 1;
    uint32_t RESERVED11                     : 2;
    __IO uint32_t FBE                       : 1;
    __IO uint32_t ERE                       : 1;
    __IO uint32_t AIE                       : 1;
    __IO uint32_t NIE                       : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV8                     : 1;
} stc_eth_dma_intenar_field_t;

typedef struct
{
    __IO uint32_t UNACNT                    :16;
    __IO uint32_t UNAOVF                    : 1;
    __IO uint32_t OVFCNT                    :11;
    __IO uint32_t OVFOVF                    : 1;
} stc_eth_dma_rfrcntr_field_t;

typedef struct
{
    __IO uint8_t DMCEN                      : 1;
    __IO uint8_t SMCEN                      : 1;
    __IO uint8_t NFCEN                      : 1;
} stc_exmc_exmc_excr0_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t DMCMW                     : 2;
    uint32_t RESERVED3                      : 6;
    __IO uint32_t SMCMUX                    : 1;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t NFCOPENP                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV12                    : 1;
} stc_exmc_exmc_excr1_field_t;

typedef struct
{
    __IO uint8_t STATUS                     : 2;
    __IO uint8_t MEMMW                      : 2;
} stc_exmc_dmc_stsr_field_t;

typedef struct
{
    __IO uint8_t STCTL                      : 3;
} stc_exmc_dmc_stcr_field_t;

typedef struct
{
    __IO uint32_t CMDADD                    :14;
    uint32_t RESERVED14                     : 2;
    __IO uint32_t CMDBA                     : 2;
    __IO uint32_t CMD                       : 2;
    __IO uint32_t CMDCHIP                   : 2;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t RESV5                     : 1;
} stc_exmc_dmc_cmdr_field_t;

typedef struct
{
    __IO uint32_t COLBS                     : 3;
    __IO uint32_t ROWBS                     : 3;
    __IO uint32_t APBS                      : 1;
    __IO uint32_t CKEDISPRD                 : 6;
    __IO uint32_t CKEDIS                    : 1;
    __IO uint32_t CKSTOP                    : 1;
    __IO uint32_t BURST                     : 3;
    uint32_t RESERVED18                     : 3;
    __IO uint32_t ACTCP                     : 2;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t RESV6                     : 1;
} stc_exmc_dmc_bacr_field_t;

typedef struct
{
    __IO uint16_t REFPRD                    :15;
} stc_exmc_dmc_rfcr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 1;
    __IO uint8_t T_CASL                     : 3;
} stc_exmc_dmc_tmcr_t_casl_field_t;

typedef struct
{
    __IO uint8_t T_DQSS                     : 2;
} stc_exmc_dmc_tmcr_t_dqss_field_t;

typedef struct
{
    __IO uint8_t T_MRD                      : 7;
} stc_exmc_dmc_tmcr_t_mrd_field_t;

typedef struct
{
    __IO uint8_t T_RAS                      : 4;
} stc_exmc_dmc_tmcr_t_ras_field_t;

typedef struct
{
    __IO uint8_t T_RC                       : 4;
} stc_exmc_dmc_tmcr_t_rc_field_t;

typedef struct
{
    __IO uint8_t T_RCD                      : 3;
} stc_exmc_dmc_tmcr_t_rcd_field_t;

typedef struct
{
    __IO uint8_t T_RFC                      : 5;
} stc_exmc_dmc_tmcr_t_rfc_field_t;

typedef struct
{
    __IO uint8_t T_RP                       : 3;
} stc_exmc_dmc_tmcr_t_rp_field_t;

typedef struct
{
    __IO uint8_t T_RRD                      : 4;
} stc_exmc_dmc_tmcr_t_rrd_field_t;

typedef struct
{
    __IO uint8_t T_WR                       : 3;
} stc_exmc_dmc_tmcr_t_wr_field_t;

typedef struct
{
    __IO uint8_t T_WTR                      : 3;
} stc_exmc_dmc_tmcr_t_wtr_field_t;

typedef struct
{
    __IO uint32_t ADDMSK0                   : 8;
    __IO uint32_t ADDMAT0                   : 8;
    __IO uint32_t BRC0                      : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV8                     : 1;
} stc_exmc_dmc_cpcr0_field_t;

typedef struct
{
    __IO uint32_t ADDMSK1                   : 8;
    __IO uint32_t ADDMAT1                   : 8;
    __IO uint32_t BRC1                      : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV9                     : 1;
} stc_exmc_dmc_cpcr1_field_t;

typedef struct
{
    __IO uint32_t ADDMSK2                   : 8;
    __IO uint32_t ADDMAT2                   : 8;
    __IO uint32_t BRC2                      : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV10                    : 1;
} stc_exmc_dmc_cpcr2_field_t;

typedef struct
{
    __IO uint32_t ADDMSK3                   : 8;
    __IO uint32_t ADDMAT3                   : 8;
    __IO uint32_t BRC3                      : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV11                    : 1;
} stc_exmc_dmc_cpcr3_field_t;

typedef struct
{
    __IO uint8_t STATUS                     : 1;
} stc_exmc_smc_stsr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 2;
    __IO uint8_t LPWIR                      : 1;
} stc_exmc_smc_stcr0_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 2;
    __IO uint8_t LPWOR                      : 1;
} stc_exmc_smc_stcr1_field_t;

typedef struct
{
    __IO uint32_t CMDADD                    :20;
    __IO uint32_t CRES                      : 1;
    __IO uint32_t CMD                       : 2;
    __IO uint32_t CMDCHIP                   : 3;
} stc_exmc_smc_cmdr_field_t;

typedef struct
{
    __IO uint32_t T_RC                      : 4;
    __IO uint32_t T_WC                      : 4;
    __IO uint32_t T_CEOE                    : 3;
    __IO uint32_t T_WP                      : 3;
    __IO uint32_t T_PC                      : 3;
    __IO uint32_t T_TR                      : 3;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV0                     : 1;
} stc_exmc_smc_tmcr_field_t;

typedef struct
{
    __IO uint16_t MW                        : 2;
    __IO uint16_t RSYN                      : 1;
    __IO uint16_t RBL                       : 3;
    __IO uint16_t WSYN                      : 1;
    __IO uint16_t WBL                       : 3;
    __IO uint16_t BAAS                      : 1;
    __IO uint16_t ADVS                      : 1;
    __IO uint16_t BLSS                      : 1;
} stc_exmc_smc_bacr_field_t;

typedef struct
{
    __IO uint8_t REFPRD                     : 4;
} stc_exmc_smc_rfcr_field_t;

typedef struct
{
    __IO uint32_t T_RC0                     : 4;
    __IO uint32_t T_WC0                     : 4;
    __IO uint32_t T_CEOE0                   : 3;
    __IO uint32_t T_WP0                     : 3;
    __IO uint32_t T_PC0                     : 3;
    __IO uint32_t T_TR0                     : 3;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV1                     : 1;
} stc_exmc_smc_tmsr0_field_t;

typedef struct
{
    __IO uint32_t MW0                       : 2;
    __IO uint32_t RSYN0                     : 1;
    __IO uint32_t RBL0                      : 3;
    __IO uint32_t WSYN0                     : 1;
    __IO uint32_t WBL0                      : 3;
    __IO uint32_t BAAS0                     : 1;
    __IO uint32_t ADVS0                     : 1;
    __IO uint32_t BLSS0                     : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t ADDMSK0                   : 8;
    __IO uint32_t ADDMAT0                   : 8;
} stc_exmc_smc_basr0_field_t;

typedef struct
{
    __IO uint32_t T_RC1                     : 4;
    __IO uint32_t T_WC1                     : 4;
    __IO uint32_t T_CEOE1                   : 3;
    __IO uint32_t T_WP1                     : 3;
    __IO uint32_t T_PC1                     : 3;
    __IO uint32_t T_TR1                     : 3;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV2                     : 1;
} stc_exmc_smc_tmsr1_field_t;

typedef struct
{
    __IO uint32_t MW1                       : 2;
    __IO uint32_t RSYN1                     : 1;
    __IO uint32_t RBL1                      : 3;
    __IO uint32_t WSYN1                     : 1;
    __IO uint32_t WBL1                      : 3;
    __IO uint32_t BAAS1                     : 1;
    __IO uint32_t ADVS1                     : 1;
    __IO uint32_t BLSS1                     : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t ADDMSK1                   : 8;
    __IO uint32_t ADDMAT1                   : 8;
} stc_exmc_smc_basr1_field_t;

typedef struct
{
    __IO uint32_t T_RC2                     : 4;
    __IO uint32_t T_WC2                     : 4;
    __IO uint32_t T_CEOE2                   : 3;
    __IO uint32_t T_WP2                     : 3;
    __IO uint32_t T_PC2                     : 3;
    __IO uint32_t T_TR2                     : 3;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV3                     : 1;
} stc_exmc_smc_tmsr2_field_t;

typedef struct
{
    __IO uint32_t MW2                       : 2;
    __IO uint32_t RSYN2                     : 1;
    __IO uint32_t RBL2                      : 3;
    __IO uint32_t WSYN2                     : 1;
    __IO uint32_t WBL2                      : 3;
    __IO uint32_t BAAS2                     : 1;
    __IO uint32_t ADVS2                     : 1;
    __IO uint32_t BLSS2                     : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t ADDMSK2                   : 8;
    __IO uint32_t ADDMAT2                   : 8;
} stc_exmc_smc_basr2_field_t;

typedef struct
{
    __IO uint32_t T_RC3                     : 4;
    __IO uint32_t T_WC3                     : 4;
    __IO uint32_t T_CEOE3                   : 3;
    __IO uint32_t T_WP3                     : 3;
    __IO uint32_t T_PC3                     : 3;
    __IO uint32_t T_TR3                     : 3;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV4                     : 1;
} stc_exmc_smc_tmsr3_field_t;

typedef struct
{
    __IO uint32_t MW3                       : 2;
    __IO uint32_t RSYN3                     : 1;
    __IO uint32_t RBL3                      : 3;
    __IO uint32_t WSYN3                     : 1;
    __IO uint32_t WBL3                      : 3;
    __IO uint32_t BAAS3                     : 1;
    __IO uint32_t ADVS3                     : 1;
    __IO uint32_t BLSS3                     : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t ADDMSK3                   : 8;
    __IO uint32_t ADDMAT3                   : 8;
} stc_exmc_smc_basr3_field_t;

typedef struct
{
    __IO uint8_t ECCBSY                     : 1;
} stc_exmc_exmc_exsr0_field_t;

typedef struct
{
    __IO uint32_t CMD                       : 8;
    __IO uint32_t ARG                       :24;
} stc_exmc_nfc_cmdr_field_t;

typedef struct
{
    __IO uint32_t ECCEUEN                   : 1;
    __IO uint32_t ECCECEN                   : 1;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t ECCCEN                    : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t ECCEEN                    : 1;
    __IO uint32_t ECCDIS                    : 1;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_ienr_field_t;

typedef struct
{
    __IO uint32_t ECCEUST                   : 1;
    __IO uint32_t ECCECST                   : 1;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t ECCCST                    : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t ECCEST                    : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t RBST                      : 8;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_istr_field_t;

typedef struct
{
    __IO uint32_t ECCEURS                   : 1;
    __IO uint32_t ECCECRS                   : 1;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t ECCCRS                    : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t ECCERS                    : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t RBRS                      : 8;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_irsr_field_t;

typedef struct
{
    __IO uint32_t IDX1                      : 8;
    uint32_t RESERVED8                      :23;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_idxr1_field_t;

typedef struct
{
    __IO uint32_t TS                        : 8;
    __IO uint32_t TWP                       : 8;
    __IO uint32_t TRP                       : 8;
    __IO uint32_t TH                        : 8;
} stc_exmc_nfc_tmcr0_field_t;

typedef struct
{
    __IO uint32_t TWH                       : 8;
    __IO uint32_t TRH                       : 8;
    __IO uint32_t TRR                       : 8;
    __IO uint32_t TWB                       : 8;
} stc_exmc_nfc_tmcr1_field_t;

typedef struct
{
    __IO uint32_t SIZE                      : 3;
    __IO uint32_t B16BIT                    : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t BANK                      : 2;
    __IO uint32_t PAGE                      : 2;
    __IO uint32_t WP                        : 1;
    __IO uint32_t ECCM                      : 2;
    __IO uint32_t RAC                       : 1;
    uint32_t RESERVED14                     : 2;
    __IO uint32_t SCS                       : 8;
    __IO uint32_t RESV7                     : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_bacr_field_t;

typedef struct
{
    __IO uint32_t TCCS                      : 8;
    __IO uint32_t TWTR                      : 8;
    __IO uint32_t TRTW                      : 8;
    __IO uint32_t TADL                      : 8;
} stc_exmc_nfc_tmcr2_field_t;

typedef struct
{
    __IO uint32_t ERRLOC                    :12;
    __IO uint32_t SE                        : 1;
    __IO uint32_t ME                        : 1;
    uint32_t RESERVED14                     :17;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_eccr0_field_t;

