RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint32_t ERRLOC                    :12;
    __IO uint32_t SE                        : 1;
    __IO uint32_t ME                        : 1;
    uint32_t RESERVED14                     :17;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_eccr1_field_t;

typedef struct
{
    __IO uint32_t ERRLOC                    :12;
    __IO uint32_t SE                        : 1;
    __IO uint32_t ME                        : 1;
    uint32_t RESERVED14                     :17;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_eccr2_field_t;

typedef struct
{
    __IO uint32_t ERRLOC                    :12;
    __IO uint32_t SE                        : 1;
    __IO uint32_t ME                        : 1;
    uint32_t RESERVED14                     :17;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_eccr3_field_t;

typedef struct
{
    __IO uint32_t ERRLOC                    :12;
    __IO uint32_t SE                        : 1;
    __IO uint32_t ME                        : 1;
    uint32_t RESERVED14                     :17;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_eccr4_field_t;

typedef struct
{
    __IO uint32_t ERRLOC                    :12;
    __IO uint32_t SE                        : 1;
    __IO uint32_t ME                        : 1;
    uint32_t RESERVED14                     :17;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_eccr5_field_t;

typedef struct
{
    __IO uint32_t ERRLOC                    :12;
    __IO uint32_t SE                        : 1;
    __IO uint32_t ME                        : 1;
    uint32_t RESERVED14                     :17;
    __IO uint32_t RESV                      : 1;
} stc_exmc_nfc_eccr6_field_t;

typedef struct
{
    __IO uint32_t ERRSEC                    :16;
    uint32_t RESERVED16                     :15;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_stat_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd0_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd0_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd0_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd0_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd1_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd1_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd1_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd1_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd2_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd2_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd2_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd2_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd3_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd3_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd3_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd3_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd4_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd4_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd4_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd4_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd5_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd5_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd5_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd5_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd6_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd6_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd6_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd6_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd7_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd7_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd7_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd7_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd8_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd8_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd8_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd8_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd9_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd9_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd9_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd9_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd10_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd10_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd10_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd10_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd11_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd11_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd11_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd11_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd12_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd12_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd12_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd12_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd13_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd13_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd13_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd13_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd14_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd14_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd14_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd14_3_field_t;

typedef struct
{
    __IO uint32_t S1                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S2                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd15_0_field_t;

typedef struct
{
    __IO uint32_t S3                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S4                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd15_1_field_t;

typedef struct
{
    __IO uint32_t S5                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S6                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd15_2_field_t;

typedef struct
{
    __IO uint32_t S7                        :13;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t S8                        :13;
    uint32_t RESERVED29                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_exmc_ecc_synd15_3_field_t;

typedef struct
{
    __IO uint32_t START                     : 1;
} stc_fcm_str_field_t;

typedef struct
{
    __IO uint8_t MDIVS                      : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t MCKS                       : 4;
} stc_fcm_mccr_field_t;

typedef struct
{
    __IO uint16_t RDIVS                     : 2;
    uint16_t RESERVED2                      : 1;
    __IO uint16_t RCKS                      : 4;
    __IO uint16_t INEXS                     : 1;
    __IO uint16_t DNFS                      : 2;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t EDGES                     : 2;
    uint16_t RESERVED14                     : 1;
    __IO uint16_t EXREFE                    : 1;
} stc_fcm_rccr_field_t;

typedef struct
{
    __IO uint8_t ERRIE                      : 1;
    __IO uint8_t MENDIE                     : 1;
    __IO uint8_t OVFIE                      : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t ERRINTRS                   : 1;
    uint8_t RESERVED5                       : 2;
    __IO uint8_t ERRE                       : 1;
} stc_fcm_rier_field_t;

typedef struct
{
    __IO uint8_t ERRF                       : 1;
    __IO uint8_t MENDF                      : 1;
    __IO uint8_t OVF                        : 1;
} stc_fcm_sr_field_t;

typedef struct
{
    __IO uint8_t ERRFCLR                    : 1;
    __IO uint8_t MENDFCLR                   : 1;
    __IO uint8_t OVFCLR                     : 1;
} stc_fcm_clr_field_t;

typedef struct
{
    __IO uint8_t START                      : 1;
    __IO uint8_t FST_GRP                    : 1;
} stc_hash_cr_field_t;

typedef struct
{
    __IO uint16_t SDAM                      : 1;
    __IO uint16_t SCLM                      : 1;
    uint16_t RESERVED2                      : 4;
    __IO uint16_t SWRST                     : 1;
    __IO uint16_t PE                        : 1;
    uint16_t RESERVED8                      : 1;
    __IO uint16_t START                     : 1;
    __IO uint16_t RESTART                   : 1;
    __IO uint16_t STOP                      : 1;
    uint16_t RESERVED12                     : 1;
    __IO uint16_t TRA                       : 1;
    __IO uint16_t MSL                       : 1;
    __IO uint16_t BUSY                      : 1;
} stc_i2c_i2ccr1_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 4;
    __IO uint32_t CKDIV                     : 3;
    __IO uint32_t MSLWE                     : 1;
    __IO uint32_t TMOUTM                    : 1;
    __IO uint32_t LTMOUT                    : 1;
    __IO uint32_t HTMOUT                    : 1;
    uint32_t RESERVED11                     : 5;
    __IO uint32_t DNF                       : 2;
    __IO uint32_t ACKRF                     : 1;
    __IO uint32_t ACK                       : 1;
    __IO uint32_t ACKWEN                    : 1;
    uint32_t RESERVED21                     : 3;
    __IO uint32_t RESV                      : 1;
} stc_i2c_i2ccr2_field_t;

