RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint32_t TMOUTEN                   : 1;
    __IO uint32_t MARLOEN                   : 1;
    __IO uint32_t NACKAREN                  : 1;
    uint32_t RESERVED3                      : 2;
    __IO uint32_t DNFEN                     : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t SLADDR0EN                 : 1;
    __IO uint32_t SLADDR1EN                 : 1;
    __IO uint32_t SLADDR2EN                 : 1;
    __IO uint32_t GCEN                      : 1;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t TMOUTIE                   : 1;
    __IO uint32_t ARLOIE                    : 1;
    __IO uint32_t STARTIE                   : 1;
    __IO uint32_t STOPIE                    : 1;
    __IO uint32_t NACKIE                    : 1;
    __IO uint32_t RFULLIE                   : 1;
    __IO uint32_t TENDIE                    : 1;
    __IO uint32_t TEMPTYIE                  : 1;
    __IO uint32_t RESV                      : 1;
} stc_i2c_i2ccr3_field_t;

typedef struct
{
    __IO uint8_t SLADDR0F                   : 1;
    __IO uint8_t SLADDR1F                   : 1;
    __IO uint8_t SLADDR2F                   : 1;
    __IO uint8_t GCF                        : 1;
} stc_i2c_i2csr0_field_t;

typedef struct
{
    __IO uint16_t SLADDR070                 : 8;
    __IO uint16_t ADDRMOD0                  : 1;
    __IO uint16_t SLADDR0109                : 2;
} stc_i2c_i2cslr0_field_t;

typedef struct
{
    __IO uint16_t SLADDR170                 : 8;
    __IO uint16_t ADDRMOD1                  : 1;
    __IO uint16_t SLADDR1109                : 2;
} stc_i2c_i2cslr1_field_t;

typedef struct
{
    __IO uint16_t SLADDR270                 : 8;
    __IO uint16_t ADDRMOD2                  : 1;
    __IO uint16_t SLADDR2109                : 2;
} stc_i2c_i2cslr2_field_t;

typedef struct
{
    __IO uint16_t SLOWW                     : 5;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t SHIGHW                    : 5;
} stc_i2c_i2cbr_field_t;

typedef struct
{
    __IO uint8_t TMOUTF                     : 1;
    __IO uint8_t ARLOF                      : 1;
    __IO uint8_t STARTF                     : 1;
    __IO uint8_t STOPF                      : 1;
    __IO uint8_t NACKF                      : 1;
    __IO uint8_t RFULLF                     : 1;
    __IO uint8_t TENDF                      : 1;
    __IO uint8_t TEMPTYF                    : 1;
} stc_i2c_i2csr1_field_t;

typedef struct
{
    __IO uint32_t SWDTAUTS                  : 1;
    __IO uint32_t SWDTITS                   : 1;
    __IO uint32_t SWDTPERI                  : 2;
    __IO uint32_t SWDTCKS                   : 4;
    __IO uint32_t SWDTWDPT                  : 4;
    __IO uint32_t SWDTSLPOFF                : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t WDTAUTS                   : 1;
    __IO uint32_t WDTITS                    : 1;
    __IO uint32_t WDTPERI                   : 2;
    __IO uint32_t WDTCKS                    : 4;
    __IO uint32_t WDTWDPT                   : 4;
    __IO uint32_t WDTSLPOFF                 : 1;
} stc_icg_icg0_field_t;

typedef struct
{
    __IO uint32_t HRCFREQSEL                : 2;
    uint32_t RESERVED2                      : 6;
    __IO uint32_t HRCSTOP                   : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t VDU0T                     : 2;
    __IO uint32_t VDU0DIS                   : 1;
    uint32_t RESERVED19                     : 7;
    __IO uint32_t SMPCLK                    : 2;
    __IO uint32_t NMITRG                    : 1;
    __IO uint32_t NMIMR                     : 1;
    __IO uint32_t NFEN                      : 1;
    __IO uint32_t NMIICGENA                 : 1;
} stc_icg_icg1_field_t;

typedef struct
{
    __IO uint32_t ADDMAT0                   : 8;
    __IO uint32_t ADDMAT1                   : 8;
    __IO uint32_t ADDMAT2                   : 8;
    __IO uint32_t ADDMAT3                   : 8;
} stc_icg_icg2_field_t;

typedef struct
{
    __IO uint32_t ADDMSK0                   : 8;
    __IO uint32_t ADDMSK1                   : 8;
    __IO uint32_t ADDMSK2                   : 8;
    __IO uint32_t ADDMSK3                   : 8;
} stc_icg_icg3_field_t;

typedef struct
{
    __IO uint8_t NMITRG                     : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t NSMPCLK                    : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t NFEN                       : 1;
} stc_intc_nmicr_field_t;

typedef struct
{
    __IO uint16_t SWDTMR                    : 1;
    __IO uint16_t WDTMR                     : 1;
    __IO uint16_t VDU1MR                    : 1;
    __IO uint16_t VDU2MR                    : 1;
    uint16_t RESERVED4                      : 1;
    __IO uint16_t SRCSTMR                   : 1;
    __IO uint16_t MRCSTMR                   : 1;
    __IO uint16_t NMIMR                     : 1;
    __IO uint16_t RPEMR                     : 1;
    __IO uint16_t RDEDMR                    : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t BUSMMR                    : 1;
} stc_intc_nmimr_field_t;

typedef struct
{
    __IO uint16_t SWDTPR                    : 1;
    __IO uint16_t WDTPR                     : 1;
    __IO uint16_t VDU1PR                    : 1;
    __IO uint16_t VDU2PR                    : 1;
    uint16_t RESERVED4                      : 1;
    __IO uint16_t SRCSTPR                   : 1;
    __IO uint16_t MRCSTPR                   : 1;
    __IO uint16_t NMIPR                     : 1;
    __IO uint16_t RPEPR                     : 1;
    __IO uint16_t RDEDPR                    : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t BUSMPR                    : 1;
} stc_intc_nmipr_field_t;

typedef struct
{
    __IO uint16_t SWDTCPR                   : 1;
    __IO uint16_t WDTCPR                    : 1;
    __IO uint16_t VDU1CPR                   : 1;
    __IO uint16_t VDU2CPR                   : 1;
    uint16_t RESERVED4                      : 1;
    __IO uint16_t SRCSTCPR                  : 1;
    __IO uint16_t MRCSTCPR                  : 1;
    __IO uint16_t NMICPR                    : 1;
    __IO uint16_t RPECPR                    : 1;
    __IO uint16_t RDEDCPR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t BUSMCPR                   : 1;
} stc_intc_nmicpr_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr0_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr1_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr2_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr3_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr4_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr5_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr6_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr7_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr8_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr9_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr10_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr11_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr12_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr13_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr14_field_t;

typedef struct
{
    __IO uint8_t EIRQTRG                    : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t EISMPCLK                   : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t EFEN                       : 1;
} stc_intc_eirqcr15_field_t;

typedef struct
{
    __IO uint32_t EIRQWUEN                  :16;
    __IO uint32_t SWDTWUEN                  : 1;
    uint32_t RESERVED17                     : 1;
    __IO uint32_t VDU1WUEN                  : 1;
    __IO uint32_t VDU2WUEN                  : 1;
    uint32_t RESERVED20                     : 2;
    __IO uint32_t CMPI0WUEN                 : 1;
    __IO uint32_t WKTMWUEN                  : 1;
    __IO uint32_t RTCALMWUEN                : 1;
    __IO uint32_t RTCPRDWUEN                : 1;
    uint32_t RESERVED26                     : 2;
    __IO uint32_t TMR0WUEN                  : 1;
    __IO uint32_t TMR2WUEN                  : 1;
    __IO uint32_t SCIWUEN                   : 1;
    __IO uint32_t IICWUEN                   : 1;
} stc_intc_wupen_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel0_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel1_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel2_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel3_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel4_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel5_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel6_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel7_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel8_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel9_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel10_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel11_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel12_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel13_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel14_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel15_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel16_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel17_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel18_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel19_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel20_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel21_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel22_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel23_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel24_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel25_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel26_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel27_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel28_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel29_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel30_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel31_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel32_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel33_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel34_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel35_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel36_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel37_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel38_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel39_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel40_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel41_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel42_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel43_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel44_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel45_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel46_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel47_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel48_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel49_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel50_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel51_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel52_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel53_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel54_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel55_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel56_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel57_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel58_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel59_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel60_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel61_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel62_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel63_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel64_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel65_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel66_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel67_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel68_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel69_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel70_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel71_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel72_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel73_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel74_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel75_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel76_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel77_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel78_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel79_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel80_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel81_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel82_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel83_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel84_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel85_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel86_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel87_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel88_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel89_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel90_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel91_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel92_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel93_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel94_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel95_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel96_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel97_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel98_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel99_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel100_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel101_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel102_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel103_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel104_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel105_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel106_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel107_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel108_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel109_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel110_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel111_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel112_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel113_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel114_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel115_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel116_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel117_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel118_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel119_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel120_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel121_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel122_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel123_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel124_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel125_field_t;

