RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel126_field_t;

typedef struct
{
    __IO uint16_t INTSEL                    : 9;
} stc_intc_intsel127_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 2;
    __IO uint8_t TXIE                       : 1;
    __IO uint8_t RXIE                       : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MODE                       : 3;
} stc_msc_i2c_smr_field_t;

typedef struct
{
    __IO uint8_t INTF                       : 1;
    __IO uint8_t BERF                       : 1;
    __IO uint8_t INTFE                      : 1;
    __IO uint8_t CNDDIE                     : 1;
    __IO uint8_t WTSEL                      : 1;
    __IO uint8_t ACKE                       : 1;
    __IO uint8_t OFITS                      : 1;
    __IO uint8_t MSS                        : 1;
} stc_msc_i2c_scr_field_t;

typedef struct
{
    __IO uint8_t BSS                        : 1;
    __IO uint8_t STPCC                      : 1;
    __IO uint8_t ITSCC                      : 1;
    __IO uint8_t ABL                        : 1;
    __IO uint8_t TRX                        : 1;
    __IO uint8_t RAD                        : 1;
    __IO uint8_t ACKF                       : 1;
    __IO uint8_t FBSS                       : 1;
} stc_msc_i2c_bs_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 1;
    __IO uint8_t TDEF                       : 1;
    __IO uint8_t RDFF                       : 1;
    __IO uint8_t ORF                        : 1;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t TEFS                       : 1;
    __IO uint8_t RECLR                      : 1;
} stc_msc_i2c_sr_field_t;

typedef struct
{
    __IO uint16_t BRR0                      : 8;
    __IO uint16_t ADDR                      : 7;
    __IO uint16_t AE                        : 1;
    __IO uint16_t BRR1                      : 7;
    __IO uint16_t SA                        : 3;
} stc_msc_i2c_brs_field_t;

typedef struct
{
    __IO uint8_t MSK0                       : 1;
    __IO uint8_t MSK1                       : 1;
    __IO uint8_t MSK2                       : 1;
    __IO uint8_t MSK3                       : 1;
    __IO uint8_t MSK4                       : 1;
    __IO uint8_t MSK5                       : 1;
    __IO uint8_t MSK6                       : 1;
    __IO uint8_t EN                         : 1;
} stc_msc_i2c_samsk_field_t;

typedef struct
{
    __IO uint8_t BEC                        : 1;
    __IO uint8_t DOE                        : 1;
    __IO uint8_t SCL0C                      : 1;
    __IO uint8_t SDA0C                      : 1;
    __IO uint8_t SCLS                       : 1;
    __IO uint8_t SDAS                       : 1;
} stc_msc_i2c_ebcr_field_t;

typedef struct
{
    __IO uint8_t DOE                        : 1;
    uint8_t RESERVED1                       : 1;
    __IO uint8_t TDS                        : 1;
    __IO uint8_t SBLS                       : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MODE                       : 3;
} stc_msc_sci_smr_field_t;

typedef struct
{
    __IO uint8_t TXE                        : 1;
    __IO uint8_t RXE                        : 1;
    __IO uint8_t TBIE                       : 1;
    __IO uint8_t TXIE                       : 1;
    __IO uint8_t RXIE                       : 1;
    uint8_t RESERVED5                       : 2;
    __IO uint8_t PCL                        : 1;
} stc_msc_sci_scr_field_t;

typedef struct
{
    __IO uint8_t DL                         : 3;
    __IO uint8_t PS                         : 1;
    __IO uint8_t PE                         : 1;
    __IO uint8_t INV                        : 1;
    __IO uint8_t ESBLS                      : 1;
    __IO uint8_t FCEB                       : 1;
} stc_msc_sci_ecr_field_t;

typedef struct
{
    __IO uint8_t TBIF                       : 1;
    __IO uint8_t TDEF                       : 1;
    __IO uint8_t RDFF                       : 1;
    __IO uint8_t ORF                        : 1;
    __IO uint8_t FEF                        : 1;
    __IO uint8_t PEF                        : 1;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t RECLR                      : 1;
} stc_msc_sci_sr_field_t;

typedef struct
{
    __IO uint16_t BRS                       :15;
    __IO uint16_t EXT                       : 1;
} stc_msc_sci_brs_field_t;

typedef struct
{
    __IO uint8_t CE0                        : 1;
    __IO uint8_t CE1                        : 1;
    __IO uint8_t CE2                        : 1;
    __IO uint8_t CE3                        : 1;
    __IO uint8_t CE4                        : 1;
    __IO uint8_t CE5                        : 1;
    __IO uint8_t CE6                        : 1;
    __IO uint8_t CE7                        : 1;
} stc_msc_sci_comp0_field_t;

typedef struct
{
    __IO uint8_t CE8                        : 1;
    __IO uint8_t CE9                        : 1;
    uint8_t RESERVED2                       : 5;
    __IO uint8_t COE                        : 1;
} stc_msc_sci_comp1_field_t;

typedef struct
{
    __IO uint8_t DOE                        : 1;
    __IO uint8_t CKE                        : 1;
    __IO uint8_t TDS                        : 1;
    __IO uint8_t CINV                       : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MODE                       : 3;
} stc_msc_spi_smr_field_t;

typedef struct
{
    __IO uint8_t TXE                        : 1;
    __IO uint8_t RXE                        : 1;
    __IO uint8_t TBIE                       : 1;
    __IO uint8_t TXIE                       : 1;
    __IO uint8_t RXIE                       : 1;
    __IO uint8_t SPIMODE                    : 1;
    __IO uint8_t MSS                        : 1;
    __IO uint8_t PCL                        : 1;
} stc_msc_spi_scr_field_t;

typedef struct
{
    __IO uint8_t DL                         : 3;
    __IO uint8_t DTRWS                      : 2;
    __IO uint8_t CSFE                       : 1;
    __IO uint8_t DL3                        : 1;
    __IO uint8_t SOPS                       : 1;
} stc_msc_spi_ecr_field_t;

typedef struct
{
    __IO uint8_t TBIF                       : 1;
    __IO uint8_t TDEF                       : 1;
    __IO uint8_t RDFF                       : 1;
    __IO uint8_t ORF                        : 1;
    uint8_t RESERVED4                       : 3;
    __IO uint8_t RECLR                      : 1;
} stc_msc_spi_sr_field_t;

typedef struct
{
    __IO uint16_t BRS0                      : 8;
    __IO uint16_t BRS1                      : 7;
} stc_msc_spi_brs_field_t;

typedef struct
{
    uint16_t RESERVED0                      :11;
    __IO uint16_t CSER                      : 1;
    __IO uint16_t CSEIE                     : 1;
    __IO uint16_t TBEE                      : 1;
} stc_msc_spi_eacr_field_t;

typedef struct
{
    __IO uint16_t CSOE                      : 1;
    __IO uint16_t CSEN0                     : 1;
    __IO uint16_t CSEN1                     : 1;
    __IO uint16_t CSEN2                     : 1;
    uint16_t RESERVED4                      : 1;
    __IO uint16_t CSLVS                     : 1;
    __IO uint16_t CSTODIV                   : 3;
    __IO uint16_t CSAH                      : 1;
    __IO uint16_t CSAD                      : 2;
    __IO uint16_t CSAE                      : 2;
    __IO uint16_t CSAS                      : 2;
} stc_msc_spi_cscr_field_t;

typedef struct
{
    __IO uint8_t DL                         : 4;
    __IO uint8_t TDS                        : 1;
    uint8_t RESERVED5                       : 1;
    __IO uint8_t CINV                       : 1;
    __IO uint8_t CSLVS                      : 1;
} stc_msc_spi_csfr1_field_t;

typedef struct
{
    __IO uint8_t DL                         : 4;
    __IO uint8_t TDS                        : 1;
    uint8_t RESERVED5                       : 1;
    __IO uint8_t CINV                       : 1;
    __IO uint8_t CSLVS                      : 1;
} stc_msc_spi_csfr2_field_t;

typedef struct
{
    __IO uint32_t RAMHS                     : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t RAM0                      : 1;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t ECCRAM                    : 1;
    uint32_t RESERVED9                      : 1;
    __IO uint32_t BRAM                      : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t SMI                       : 1;
    uint32_t RESERVED13                     : 1;
    __IO uint32_t DMA                       : 1;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t FCM                       : 1;
    __IO uint32_t AOS                       : 1;
    uint32_t RESERVED18                     : 2;
    __IO uint32_t AES                       : 1;
    __IO uint32_t HASH                      : 1;
    __IO uint32_t TRNG                      : 1;
    __IO uint32_t CRC                       : 1;
    __IO uint32_t DCU0                      : 1;
    __IO uint32_t DCU1                      : 1;
    __IO uint32_t DCU2                      : 1;
    __IO uint32_t DCU3                      : 1;
} stc_mstp_fcg0_field_t;

typedef struct
{
    __IO uint32_t CAN0                      : 1;
    __IO uint32_t CAN1                      : 1;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t QSPI                      : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t IIC                       : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t USBFS                     : 1;
    __IO uint32_t USBHS                     : 1;
    uint32_t RESERVED10                     : 1;
    __IO uint32_t ETHER                     : 1;
    uint32_t RESERVED12                     : 1;
    __IO uint32_t EXMC_SMC                  : 1;
    __IO uint32_t EXMC_DMC                  : 1;
    __IO uint32_t EXMC_NFC                  : 1;
    __IO uint32_t SPI                       : 1;
    uint32_t RESERVED17                     : 3;
    __IO uint32_t MSC0                      : 1;
    __IO uint32_t MSC1                      : 1;
    __IO uint32_t MSC2                      : 1;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t SCI0                      : 1;
    __IO uint32_t SCI1                      : 1;
    __IO uint32_t SCI2                      : 1;
    __IO uint32_t SCI3                      : 1;
    __IO uint32_t SCI4                      : 1;
    __IO uint32_t SCI5                      : 1;
    __IO uint32_t SCI6                      : 1;
} stc_mstp_fcg1_field_t;

typedef struct
{
    __IO uint32_t TIMER0_01                 : 1;
    __IO uint32_t TIMER0_23                 : 1;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t TIMER2_01                 : 1;
    __IO uint32_t TIMER2_23                 : 1;
    __IO uint32_t TIMER2_45                 : 1;
    __IO uint32_t TIMER2_67                 : 1;
    __IO uint32_t TIMER4_0                  : 1;
    __IO uint32_t TIMER4_1                  : 1;
    uint32_t RESERVED10                     : 5;
    __IO uint32_t EMB                       : 1;
    __IO uint32_t TIMER6_0                  : 1;
    __IO uint32_t TIMER6_1                  : 1;
    __IO uint32_t TIMER6_2                  : 1;
    __IO uint32_t TIMER6_3                  : 1;
    __IO uint32_t TIMER6_4                  : 1;
    __IO uint32_t TIMER6_5                  : 1;
    __IO uint32_t TIMER6_6                  : 1;
    __IO uint32_t TIMER6_7                  : 1;
    __IO uint32_t TIMER6_8                  : 1;
    __IO uint32_t TIMER6_9                  : 1;
} stc_mstp_fcg2_field_t;

typedef struct
{
    __IO uint16_t ADC0                      : 1;
    __IO uint16_t ADC1                      : 1;
    __IO uint16_t ADC2                      : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DAC                       : 1;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t CMP                       : 1;
} stc_mstp_fcg3_field_t;

typedef struct
{
    __IO uint32_t PRT0                      : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t FCG0PCWE                  :16;
} stc_mstp_fcg0pc_field_t;

typedef struct
{
    __IO uint16_t USFRAC                    : 1;
    __IO uint16_t USHRAC                    : 1;
    uint16_t RESERVED2                      : 2;
    __IO uint16_t CANRA0C                   : 1;
    __IO uint16_t CANRA1C                   : 1;
    __IO uint16_t ETHRXRAC                  : 1;
    __IO uint16_t ETHTXRAC                  : 1;
    __IO uint16_t EXMCRAC                   : 1;
} stc_mstp_pramlpc_field_t;

typedef struct
{
    __IO uint16_t PIN00                     : 1;
    __IO uint16_t PIN01                     : 1;
    __IO uint16_t PIN02                     : 1;
    __IO uint16_t PIN03                     : 1;
    __IO uint16_t PIN04                     : 1;
    __IO uint16_t PIN05                     : 1;
    __IO uint16_t PIN06                     : 1;
    __IO uint16_t PIN07                     : 1;
    __IO uint16_t PIN08                     : 1;
    __IO uint16_t PIN09                     : 1;
    __IO uint16_t PIN10                     : 1;
    __IO uint16_t PIN11                     : 1;
    __IO uint16_t PIN12                     : 1;
    __IO uint16_t PIN13                     : 1;
    __IO uint16_t PIN14                     : 1;
    __IO uint16_t PIN15                     : 1;
} stc_port_pidr0_field_t;

typedef struct
{
    __IO uint16_t POUT00                    : 1;
    __IO uint16_t POUT01                    : 1;
    __IO uint16_t POUT02                    : 1;
    __IO uint16_t POUT03                    : 1;
    __IO uint16_t POUT04                    : 1;
    __IO uint16_t POUT05                    : 1;
    __IO uint16_t POUT06                    : 1;
    __IO uint16_t POUT07                    : 1;
    __IO uint16_t POUT08                    : 1;
    __IO uint16_t POUT09                    : 1;
    __IO uint16_t POUT10                    : 1;
    __IO uint16_t POUT11                    : 1;
    __IO uint16_t POUT12                    : 1;
    __IO uint16_t POUT13                    : 1;
    __IO uint16_t POUT14                    : 1;
    __IO uint16_t POUT15                    : 1;
} stc_port_podr0_field_t;

typedef struct
{
    __IO uint16_t POUTE00                   : 1;
    __IO uint16_t POUTE01                   : 1;
    __IO uint16_t POUTE02                   : 1;
    __IO uint16_t POUTE03                   : 1;
    __IO uint16_t POUTE04                   : 1;
    __IO uint16_t POUTE05                   : 1;
    __IO uint16_t POUTE06                   : 1;
    __IO uint16_t POUTE07                   : 1;
    __IO uint16_t POUTE08                   : 1;
    __IO uint16_t POUTE09                   : 1;
    __IO uint16_t POUTE10                   : 1;
    __IO uint16_t POUTE11                   : 1;
    __IO uint16_t POUTE12                   : 1;
    __IO uint16_t POUTE13                   : 1;
    __IO uint16_t POUTE14                   : 1;
    __IO uint16_t POUTE15                   : 1;
} stc_port_poer0_field_t;

typedef struct
{
    __IO uint16_t POS00                     : 1;
    __IO uint16_t POS01                     : 1;
    __IO uint16_t POS02                     : 1;
    __IO uint16_t POS03                     : 1;
    __IO uint16_t POS04                     : 1;
    __IO uint16_t POS05                     : 1;
    __IO uint16_t POS06                     : 1;
    __IO uint16_t POS07                     : 1;
    __IO uint16_t POS08                     : 1;
    __IO uint16_t POS09                     : 1;
    __IO uint16_t POS10                     : 1;
    __IO uint16_t POS11                     : 1;
    __IO uint16_t POS12                     : 1;
    __IO uint16_t POS13                     : 1;
    __IO uint16_t POS14                     : 1;
    __IO uint16_t POS15                     : 1;
} stc_port_posr0_field_t;

typedef struct
{
    __IO uint16_t POR00                     : 1;
    __IO uint16_t POR01                     : 1;
    __IO uint16_t POR02                     : 1;
    __IO uint16_t POR03                     : 1;
    __IO uint16_t POR04                     : 1;
    __IO uint16_t POR05                     : 1;
    __IO uint16_t POR06                     : 1;
    __IO uint16_t POR07                     : 1;
    __IO uint16_t POR08                     : 1;
    __IO uint16_t POR09                     : 1;
    __IO uint16_t POR10                     : 1;
    __IO uint16_t POR11                     : 1;
    __IO uint16_t POR12                     : 1;
    __IO uint16_t POR13                     : 1;
    __IO uint16_t POR14                     : 1;
    __IO uint16_t POR15                     : 1;
} stc_port_porr0_field_t;

typedef struct
{
    __IO uint16_t POT00                     : 1;
    __IO uint16_t POT01                     : 1;
    __IO uint16_t POT02                     : 1;
    __IO uint16_t POT03                     : 1;
    __IO uint16_t POT04                     : 1;
    __IO uint16_t POT05                     : 1;
    __IO uint16_t POT06                     : 1;
    __IO uint16_t POT07                     : 1;
    __IO uint16_t POT08                     : 1;
    __IO uint16_t POT09                     : 1;
    __IO uint16_t POT10                     : 1;
    __IO uint16_t POT11                     : 1;
    __IO uint16_t POT12                     : 1;
    __IO uint16_t POT13                     : 1;
    __IO uint16_t POT14                     : 1;
    __IO uint16_t POT15                     : 1;
} stc_port_potr0_field_t;

typedef struct
{
    __IO uint16_t PIN00                     : 1;
    __IO uint16_t PIN01                     : 1;
    __IO uint16_t PIN02                     : 1;
    __IO uint16_t PIN03                     : 1;
    __IO uint16_t PIN04                     : 1;
    __IO uint16_t PIN05                     : 1;
    __IO uint16_t PIN06                     : 1;
    __IO uint16_t PIN07                     : 1;
    __IO uint16_t PIN08                     : 1;
    __IO uint16_t PIN09                     : 1;
    __IO uint16_t PIN10                     : 1;
    __IO uint16_t PIN11                     : 1;
    __IO uint16_t PIN12                     : 1;
    __IO uint16_t PIN13                     : 1;
    __IO uint16_t PIN14                     : 1;
    __IO uint16_t PIN15                     : 1;
} stc_port_pidr1_field_t;

typedef struct
{
    __IO uint16_t POUT00                    : 1;
    __IO uint16_t POUT01                    : 1;
    __IO uint16_t POUT02                    : 1;
    __IO uint16_t POUT03                    : 1;
    __IO uint16_t POUT04                    : 1;
    __IO uint16_t POUT05                    : 1;
    __IO uint16_t POUT06                    : 1;
    __IO uint16_t POUT07                    : 1;
    __IO uint16_t POUT08                    : 1;
    __IO uint16_t POUT09                    : 1;
    __IO uint16_t POUT10                    : 1;
    __IO uint16_t POUT11                    : 1;
    __IO uint16_t POUT12                    : 1;
    __IO uint16_t POUT13                    : 1;
    __IO uint16_t POUT14                    : 1;
    __IO uint16_t POUT15                    : 1;
} stc_port_podr1_field_t;

typedef struct
{
    __IO uint16_t POUTE00                   : 1;
    __IO uint16_t POUTE01                   : 1;
    __IO uint16_t POUTE02                   : 1;
    __IO uint16_t POUTE03                   : 1;
    __IO uint16_t POUTE04                   : 1;
    __IO uint16_t POUTE05                   : 1;
    __IO uint16_t POUTE06                   : 1;
    __IO uint16_t POUTE07                   : 1;
    __IO uint16_t POUTE08                   : 1;
    __IO uint16_t POUTE09                   : 1;
    __IO uint16_t POUTE10                   : 1;
    __IO uint16_t POUTE11                   : 1;
    __IO uint16_t POUTE12                   : 1;
    __IO uint16_t POUTE13                   : 1;
    __IO uint16_t POUTE14                   : 1;
    __IO uint16_t POUTE15                   : 1;
} stc_port_poer1_field_t;

typedef struct
{
    __IO uint16_t POS00                     : 1;
    __IO uint16_t POS01                     : 1;
    __IO uint16_t POS02                     : 1;
    __IO uint16_t POS03                     : 1;
    __IO uint16_t POS04                     : 1;
    __IO uint16_t POS05                     : 1;
    __IO uint16_t POS06                     : 1;
    __IO uint16_t POS07                     : 1;
    __IO uint16_t POS08                     : 1;
    __IO uint16_t POS09                     : 1;
    __IO uint16_t POS10                     : 1;
    __IO uint16_t POS11                     : 1;
    __IO uint16_t POS12                     : 1;
    __IO uint16_t POS13                     : 1;
    __IO uint16_t POS14                     : 1;
    __IO uint16_t POS15                     : 1;
} stc_port_posr1_field_t;

typedef struct
{
    __IO uint16_t POR00                     : 1;
    __IO uint16_t POR01                     : 1;
    __IO uint16_t POR02                     : 1;
    __IO uint16_t POR03                     : 1;
    __IO uint16_t POR04                     : 1;
    __IO uint16_t POR05                     : 1;
    __IO uint16_t POR06                     : 1;
    __IO uint16_t POR07                     : 1;
    __IO uint16_t POR08                     : 1;
    __IO uint16_t POR09                     : 1;
    __IO uint16_t POR10                     : 1;
    __IO uint16_t POR11                     : 1;
    __IO uint16_t POR12                     : 1;
    __IO uint16_t POR13                     : 1;
    __IO uint16_t POR14                     : 1;
    __IO uint16_t POR15                     : 1;
} stc_port_porr1_field_t;

typedef struct
{
    __IO uint16_t POT00                     : 1;
    __IO uint16_t POT01                     : 1;
    __IO uint16_t POT02                     : 1;
    __IO uint16_t POT03                     : 1;
    __IO uint16_t POT04                     : 1;
    __IO uint16_t POT05                     : 1;
    __IO uint16_t POT06                     : 1;
    __IO uint16_t POT07                     : 1;
    __IO uint16_t POT08                     : 1;
    __IO uint16_t POT09                     : 1;
    __IO uint16_t POT10                     : 1;
    __IO uint16_t POT11                     : 1;
    __IO uint16_t POT12                     : 1;
    __IO uint16_t POT13                     : 1;
    __IO uint16_t POT14                     : 1;
    __IO uint16_t POT15                     : 1;
} stc_port_potr1_field_t;

typedef struct
{
    __IO uint16_t PIN00                     : 1;
    __IO uint16_t PIN01                     : 1;
    __IO uint16_t PIN02                     : 1;
    __IO uint16_t PIN03                     : 1;
    __IO uint16_t PIN04                     : 1;
    __IO uint16_t PIN05                     : 1;
    __IO uint16_t PIN06                     : 1;
    __IO uint16_t PIN07                     : 1;
    __IO uint16_t PIN08                     : 1;
    __IO uint16_t PIN09                     : 1;
    __IO uint16_t PIN10                     : 1;
    __IO uint16_t PIN11                     : 1;
    __IO uint16_t PIN12                     : 1;
    __IO uint16_t PIN13                     : 1;
    __IO uint16_t PIN14                     : 1;
    __IO uint16_t PIN15                     : 1;
} stc_port_pidr2_field_t;

