RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint16_t POT00                     : 1;
    __IO uint16_t POT01                     : 1;
    __IO uint16_t POT02                     : 1;
    __IO uint16_t POT03                     : 1;
    __IO uint16_t POT04                     : 1;
    __IO uint16_t POT05                     : 1;
    __IO uint16_t POT06                     : 1;
    __IO uint16_t POT07                     : 1;
    __IO uint16_t POT08                     : 1;
    __IO uint16_t POT09                     : 1;
    __IO uint16_t POT10                     : 1;
    __IO uint16_t POT11                     : 1;
    __IO uint16_t POT12                     : 1;
    __IO uint16_t POT13                     : 1;
    __IO uint16_t POT14                     : 1;
    __IO uint16_t POT15                     : 1;
} stc_port_potr6_field_t;

typedef struct
{
    __IO uint8_t PIN00                      : 1;
    __IO uint8_t PIN01                      : 1;
    __IO uint8_t PIN02                      : 1;
    __IO uint8_t PIN03                      : 1;
    __IO uint8_t PIN04                      : 1;
} stc_port_pidr7_field_t;

typedef struct
{
    __IO uint8_t POUT00                     : 1;
    __IO uint8_t POUT01                     : 1;
    __IO uint8_t POUT02                     : 1;
    __IO uint8_t POUT03                     : 1;
    __IO uint8_t POUT04                     : 1;
} stc_port_podr7_field_t;

typedef struct
{
    __IO uint8_t POUTE00                    : 1;
    __IO uint8_t POUTE01                    : 1;
    __IO uint8_t POUTE02                    : 1;
    __IO uint8_t POUTE03                    : 1;
    __IO uint8_t POUTE04                    : 1;
} stc_port_poer7_field_t;

typedef struct
{
    __IO uint8_t POS00                      : 1;
    __IO uint8_t POS01                      : 1;
    __IO uint8_t POS02                      : 1;
    __IO uint8_t POS03                      : 1;
    __IO uint8_t POS04                      : 1;
} stc_port_posr7_field_t;

typedef struct
{
    __IO uint8_t POR00                      : 1;
    __IO uint8_t POR01                      : 1;
    __IO uint8_t POR02                      : 1;
    __IO uint8_t POR03                      : 1;
    __IO uint8_t POR04                      : 1;
} stc_port_porr7_field_t;

typedef struct
{
    __IO uint8_t POT00                      : 1;
    __IO uint8_t POT01                      : 1;
    __IO uint8_t POT02                      : 1;
    __IO uint8_t POT03                      : 1;
    __IO uint8_t POT04                      : 1;
} stc_port_potr7_field_t;

typedef struct
{
    __IO uint16_t BFSEL                     : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t PINAE                     : 1;
    uint16_t RESERVED9                      : 6;
    __IO uint16_t NORDWAIT                  : 1;
} stc_port_pccr_field_t;

typedef struct
{
    __IO uint16_t WE                        : 1;
    uint16_t RESERVED1                      : 7;
    __IO uint16_t WP                        : 8;
} stc_port_pwpr_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr000_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr000_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr001_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr001_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr002_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr002_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr003_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr003_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr004_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr004_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr005_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr005_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr006_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr006_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr007_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr007_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr008_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr008_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr009_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr009_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr010_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr010_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr011_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr011_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr012_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr012_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr013_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr013_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr014_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr014_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr015_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr015_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr100_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr100_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr101_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr101_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr102_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr102_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr103_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr103_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr104_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr104_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr105_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr105_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr106_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr106_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr107_field_t;

