RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr107_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr108_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr108_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr109_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr109_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr110_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr110_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr111_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr111_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr112_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr112_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr113_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr113_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr114_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr114_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr115_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr115_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr200_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr200_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr201_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr201_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr202_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr202_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr203_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr203_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr204_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr204_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr205_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr205_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr206_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr206_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr207_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr207_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr208_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr208_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr209_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr209_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr210_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr210_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr211_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr211_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr212_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr212_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr213_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr213_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr214_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr214_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr215_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr215_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr300_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr300_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr301_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr301_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr302_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr302_field_t;

