RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr303_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr303_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr304_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr304_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr305_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr305_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr306_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr306_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr307_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr307_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr308_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr308_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr309_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr309_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr310_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr310_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr311_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr311_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr312_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr312_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr313_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr313_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr314_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr314_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr315_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr315_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr400_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr400_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr401_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr401_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr402_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr402_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr403_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr403_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr404_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr404_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr405_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr405_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr406_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr406_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr407_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr407_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr408_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr408_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr409_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr409_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr410_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr410_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr411_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr411_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr412_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr412_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr413_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr413_field_t;

