RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr414_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr414_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr415_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr415_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr500_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr500_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr501_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr501_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr502_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr502_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr503_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr503_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr504_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr504_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr505_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr505_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr506_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr506_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr507_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr507_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr508_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr508_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr509_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr509_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr510_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr510_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr511_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr511_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr512_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr512_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr513_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr513_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr514_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr514_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr515_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr515_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr600_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr600_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr601_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr601_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr602_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr602_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr603_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr603_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr604_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr604_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr605_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr605_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr606_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr606_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr607_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr607_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr608_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr608_field_t;

