RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr609_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr609_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr610_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr610_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr611_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr611_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr612_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr612_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr613_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr613_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr614_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr614_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr615_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr615_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr700_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr700_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr701_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr701_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr702_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr702_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr703_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr703_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 2;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t INTE                      : 1;
    uint16_t RESERVED13                     : 2;
    __IO uint16_t DDIS                      : 1;
} stc_port_pcr704_field_t;

typedef struct
{
    __IO uint16_t FSEL                      : 4;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t BFE                       : 1;
} stc_port_pfsr704_field_t;

typedef struct
{
    __IO uint32_t MDSEL                     : 3;
    __IO uint32_t WPOSL                     : 1;
    __IO uint32_t PRSL                      : 2;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t SPIMD3                    : 1;
    __IO uint32_t PFE                       : 1;
    __IO uint32_t PFSAE                     : 1;
    __IO uint32_t DCOME                     : 1;
    __IO uint32_t RICE                      : 1;
    uint32_t RESERVED12                     : 3;
    __IO uint32_t XIPE                      : 1;
    __IO uint32_t DIV                       : 6;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_qspi_qscr_field_t;

typedef struct
{
    __IO uint8_t SSHW                       : 4;
    __IO uint8_t SSNW                       : 2;
} stc_qspi_qscscr_field_t;

typedef struct
{
    __IO uint16_t AWSL                      : 2;
    __IO uint16_t FOUR_BIC                  : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t SSNHD                     : 1;
    __IO uint16_t SSNLD                     : 1;
    __IO uint16_t WPOL                      : 1;
    __IO uint16_t SCMTE                     : 1;
    __IO uint16_t DMCYCN                    : 4;
    __IO uint16_t OEW                       : 1;
    __IO uint16_t CKHW                      : 1;
    __IO uint16_t CKLW                      : 1;
    __IO uint16_t DUTY                      : 1;
} stc_qspi_qsfcr_field_t;

typedef struct
{
    __IO uint16_t BUSY                      : 1;
    uint16_t RESERVED1                      : 5;
    __IO uint16_t XIPF                      : 1;
    __IO uint16_t RAER                      : 1;
    __IO uint16_t PFNUM                     : 5;
    uint16_t RESERVED13                     : 1;
    __IO uint16_t PFFUL                     : 1;
    __IO uint16_t PFAN                      : 1;
} stc_qspi_qssr_field_t;

typedef struct
{
    __IO uint8_t DCD                        : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t DCL                        : 2;
} stc_qspi_qsdtc_field_t;

typedef struct
{
    uint32_t RESERVED0                      :26;
    __IO uint32_t EXADR                     : 6;
} stc_qspi_qsexar_field_t;

typedef struct
{
    __IO uint8_t RESET                      : 1;
} stc_rtc_cr0_field_t;

typedef struct
{
    __IO uint8_t PRDS                       : 3;
    __IO uint8_t AMPM                       : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t ONEHZOE                    : 1;
    __IO uint8_t ONEHZSEL                   : 1;
    __IO uint8_t START                      : 1;
} stc_rtc_cr1_field_t;

typedef struct
{
    __IO uint8_t WAIT                       : 1;
    __IO uint8_t WAITF                      : 1;
    __IO uint8_t PRDF                       : 1;
    __IO uint8_t ALMF                       : 1;
    __IO uint8_t CRIE                       : 1;
    __IO uint8_t PRDIE                      : 1;
    __IO uint8_t ALMIE                      : 1;
    __IO uint8_t ALME                       : 1;
} stc_rtc_cr2_field_t;

typedef struct
{
    __IO uint8_t XTAL32EN                   : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t LRCEN                      : 1;
    uint8_t RESERVED5                       : 2;
    __IO uint8_t RCKSEL                     : 1;
} stc_rtc_cr3_field_t;

typedef struct
{
    __IO uint8_t SECU                       : 4;
    __IO uint8_t SECD                       : 3;
} stc_rtc_sec_field_t;

typedef struct
{
    __IO uint8_t MINU                       : 4;
    __IO uint8_t MIND                       : 3;
} stc_rtc_min_field_t;

typedef struct
{
    __IO uint8_t HOURU                      : 4;
    __IO uint8_t HOURD                      : 2;
} stc_rtc_hour_field_t;

typedef struct
{
    __IO uint8_t WEEK                       : 3;
} stc_rtc_week_field_t;

typedef struct
{
    __IO uint8_t DAYU                       : 4;
    __IO uint8_t DAYD                       : 2;
} stc_rtc_day_field_t;

typedef struct
{
    __IO uint8_t MON                        : 5;
} stc_rtc_mon_field_t;

typedef struct
{
    __IO uint8_t YEARU                      : 4;
    __IO uint8_t YEARD                      : 4;
} stc_rtc_year_field_t;

typedef struct
{
    __IO uint8_t ALMMINU                    : 4;
    __IO uint8_t ALMMIND                    : 3;
} stc_rtc_almmin_field_t;

typedef struct
{
    __IO uint8_t ALMHOURU                   : 4;
    __IO uint8_t ALMHOURD                   : 2;
} stc_rtc_almhour_field_t;

typedef struct
{
    __IO uint8_t ALMWEEK                    : 7;
} stc_rtc_almweek_field_t;

typedef struct
{
    __IO uint8_t CR8                        : 1;
    uint8_t RESERVED1                       : 6;
    __IO uint8_t CREEN                      : 1;
} stc_rtc_errcra_field_t;

typedef struct
{
    __IO uint8_t TPCR0                      : 2;
    __IO uint8_t TPNF0                      : 2;
    __IO uint8_t TPRSTE0                    : 1;
    __IO uint8_t TPIE0                      : 1;
    __IO uint8_t TSTPE0                     : 1;
    __IO uint8_t TPEN0                      : 1;
} stc_rtc_tpcr0_field_t;

typedef struct
{
    __IO uint8_t TPCR1                      : 2;
    __IO uint8_t TPNF1                      : 2;
    __IO uint8_t TPRSTE1                    : 1;
    __IO uint8_t TPIE1                      : 1;
    __IO uint8_t TSTPE1                     : 1;
    __IO uint8_t TPEN1                      : 1;
} stc_rtc_tpcr1_field_t;

typedef struct
{
    __IO uint8_t TPF0                       : 1;
    __IO uint8_t TPF1                       : 1;
    __IO uint8_t TPOVF                      : 1;
} stc_rtc_tpsr_field_t;

typedef struct
{
    __IO uint8_t SECTPU                     : 4;
    __IO uint8_t SECTPD                     : 3;
} stc_rtc_sectp_field_t;

typedef struct
{
    __IO uint8_t MINTPU                     : 4;
    __IO uint8_t MINTPD                     : 3;
} stc_rtc_mintp_field_t;

typedef struct
{
    __IO uint8_t HOURTPU                    : 4;
    __IO uint8_t HOURTPD                    : 2;
} stc_rtc_hourtp_field_t;

typedef struct
{
    __IO uint8_t DAYTPU                     : 4;
    __IO uint8_t DAYTPD                     : 2;
} stc_rtc_daytp_field_t;

typedef struct
{
    __IO uint8_t MONTPU                     : 4;
    __IO uint8_t MONTPD                     : 2;
} stc_rtc_montp_field_t;

typedef struct
{
    __IO uint32_t CLKDIV                    : 8;
    __IO uint32_t CKO                       : 1;
    __IO uint32_t ATCK                      : 1;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CDTO                      : 4;
    __IO uint32_t TO                        : 4;
    __IO uint32_t TOMSK                     : 1;
    uint32_t RESERVED25                     : 5;
    __IO uint32_t WIDTH                     : 2;
} stc_sdioc_ctl_field_t;

typedef struct
{
    __IO uint32_t CMDIDX                    : 6;
    __IO uint32_t ACMD                      : 1;
    uint32_t RESERVED7                      :24;
    __IO uint32_t RESV                      : 1;
} stc_sdioc_cmd_field_t;

typedef struct
{
    __IO uint32_t RESP3                     :24;
    uint32_t RESERVED24                     : 7;
    __IO uint32_t RESV                      : 1;
} stc_sdioc_resp3_field_t;

typedef struct
{
    __IO uint32_t TRANSTP                   : 1;
    uint32_t RESERVED1                      : 7;
    __IO uint32_t ATS                       : 1;
    uint32_t RESERVED9                      :22;
    __IO uint32_t RESV                      : 1;
} stc_sdioc_tec_field_t;

typedef struct
{
    __IO uint32_t BLKLEN                    :10;
    uint32_t RESERVED10                     :21;
    __IO uint32_t RESV                      : 1;
} stc_sdioc_blklen_field_t;

typedef struct
{
    __IO uint32_t RESPEND                   : 1;
    __IO uint32_t ACSEND                    : 1;
    __IO uint32_t BFF                       : 1;
    __IO uint32_t BFE                       : 1;
    __IO uint32_t SDCDRM                    : 1;
    __IO uint32_t SDCDIN                    : 1;
    __IO uint32_t SDCDST                    : 1;
    __IO uint32_t SDWPST                    : 1;
    __IO uint32_t SDDT3RM                   : 1;
    __IO uint32_t SDDT3IN                   : 1;
    __IO uint32_t SDDT3ST                   : 1;
    uint32_t RESERVED11                     : 5;
    __IO uint32_t CMDERR                    : 1;
    __IO uint32_t CRCERR                    : 1;
    __IO uint32_t ENDERR                    : 1;
    __IO uint32_t DATTO                     : 1;
    __IO uint32_t BFWERR                    : 1;
    __IO uint32_t BFRERR                    : 1;
    __IO uint32_t RESPTO                    : 1;
    __IO uint32_t DTOST                     : 1;
    __IO uint32_t CMDBSY                    : 1;
    __IO uint32_t ACSERR                    : 1;
    __IO uint32_t SDCKEN                    : 1;
    uint32_t RESERVED27                     : 4;
    __IO uint32_t RESV                      : 1;
} stc_sdioc_intst_field_t;

typedef struct
{
    __IO uint32_t RESPENDMSK                : 1;
    __IO uint32_t ACSENDMSK                 : 1;
    __IO uint32_t BFFMSK                    : 1;
    __IO uint32_t BFEMSK                    : 1;
    __IO uint32_t SDCDRMMSK                 : 1;
    __IO uint32_t SDCDINMSK                 : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t SDDT3RMMSK                : 1;
    __IO uint32_t SDDT3INMSK                : 1;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CMDERRMSK                 : 1;
    __IO uint32_t CRCERRMSK                 : 1;
    __IO uint32_t ENDERRMSK                 : 1;
    __IO uint32_t DATTOMSK                  : 1;
    __IO uint32_t BFWERRMSK                 : 1;
    __IO uint32_t BFRERRMSK                 : 1;
    __IO uint32_t RESPTOMSK                 : 1;
    uint32_t RESERVED23                     : 2;
    __IO uint32_t ACSERRMSK                 : 1;
    uint32_t RESERVED26                     : 5;
    __IO uint32_t RESV                      : 1;
} stc_sdioc_intmsk_field_t;

typedef struct
{
    __IO uint32_t IOINTEN                   : 1;
    __IO uint32_t RDWAIT                    : 1;
    uint32_t RESERVED2                      :29;
    __IO uint32_t RESV                      : 1;
} stc_sdioc_iomode_field_t;

typedef struct
{
    __IO uint32_t IOINTST                   : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RESV                      : 1;
} stc_sdioc_iointst_field_t;

typedef struct
{
    __IO uint32_t IOINTSTMSK                : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RESV                      : 1;
} stc_sdioc_iomsk_field_t;

typedef struct
{
    __IO uint32_t DMAEN                     : 1;
    uint32_t RESERVED1                      :30;
    __IO uint32_t RESV                      : 1;
} stc_sdioc_dmaen_field_t;

typedef struct
{
    __IO uint32_t EIOE                      : 1;
    __IO uint32_t IIE                       : 1;
    __IO uint32_t EIE                       : 1;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t B8BIT                     : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t ENB                       : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
} stc_smi_cr_field_t;

typedef struct
{
    __IO uint8_t ESF                        : 1;
    __IO uint8_t ISF                        : 1;
    __IO uint8_t EIF                        : 1;
    __IO uint8_t IIF                        : 1;
    __IO uint8_t EF                         : 1;
} stc_smi_sr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 1;
    __IO uint8_t ISC                        : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t CEF                        : 1;
} stc_smi_scr_field_t;

typedef struct
{
    __IO uint16_t SPIMDS                    : 1;
    __IO uint16_t TXMDS                     : 1;
    uint16_t RESERVED2                      : 1;
    __IO uint16_t MSTR                      : 1;
    __IO uint16_t SPLPBK                    : 1;
    __IO uint16_t SPLPBK2                   : 1;
    __IO uint16_t SPE                       : 1;
    __IO uint16_t SCKASTPE                  : 1;
    __IO uint16_t EIE                       : 1;
    __IO uint16_t TXIE                      : 1;
    __IO uint16_t RXIE                      : 1;
    __IO uint16_t IDIE                      : 1;
    __IO uint16_t MODFE                     : 1;
    __IO uint16_t PATE                      : 1;
    __IO uint16_t PAOE                      : 1;
    __IO uint16_t PAE                       : 1;
} stc_spi_cr_field_t;

typedef struct
{
    __IO uint8_t MOIFE                      : 1;
    __IO uint8_t MOIFV                      : 1;
    __IO uint8_t SPOM                       : 1;
    __IO uint8_t SLSEL0                     : 1;
    __IO uint8_t SLSEL1                     : 1;
    __IO uint8_t SPTDDL                     : 3;
} stc_spi_ocr_field_t;

