RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint32_t FRN                       : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t SPLW                      : 1;
    __IO uint32_t SPBYT                     : 1;
    __IO uint32_t SPRDTD                    : 1;
    __IO uint32_t SPWRAL                    : 1;
    __IO uint32_t SS0PV                     : 1;
    __IO uint32_t SS1PV                     : 1;
    __IO uint32_t SS2PV                     : 1;
    __IO uint32_t SS3PV                     : 1;
    __IO uint32_t SS4PV                     : 1;
    __IO uint32_t SS5PV                     : 1;
    __IO uint32_t SS6PV                     : 1;
    __IO uint32_t SS7PV                     : 1;
    __IO uint32_t CMRSL                     : 3;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t SCKDL                     : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t SSDL                      : 3;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t NXTDL                     : 3;
} stc_spi_fcr_field_t;

typedef struct
{
    __IO uint16_t OVRERF                    : 1;
    __IO uint16_t IDLNF                     : 1;
    __IO uint16_t MODFERF                   : 1;
    __IO uint16_t PERF                      : 1;
    __IO uint16_t UDRERF                    : 1;
    __IO uint16_t TDEF                      : 1;
    uint16_t RESERVED6                      : 1;
    __IO uint16_t RDFF                      : 1;
    __IO uint16_t CMRSP                     : 3;
    uint16_t RESERVED11                     : 1;
    __IO uint16_t ERRCM                     : 3;
} stc_spi_sr_field_t;

typedef struct
{
    __IO uint16_t CPHA                      : 1;
    __IO uint16_t CPOL                      : 1;
    __IO uint16_t BRDIV                     : 2;
    __IO uint16_t SSA                       : 3;
    __IO uint16_t BURST                     : 1;
    __IO uint16_t SPB                       : 4;
    __IO uint16_t LSBF                      : 1;
    __IO uint16_t NXTDLE                    : 1;
    __IO uint16_t SSDLE                     : 1;
    __IO uint16_t SCKDLE                    : 1;
} stc_spi_cmr_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 8;
    __IO uint16_t BYSW                      : 1;
} stc_spi_dcr2_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 4;
    __IO uint16_t BUSSIZ                    : 1;
    uint16_t RESERVED5                      : 3;
    __IO uint16_t BUFNUM                    : 3;
    uint16_t RESERVED11                     : 1;
    __IO uint16_t CMDNUM                    : 4;
} stc_spi_pr_field_t;

typedef struct
{
    __IO uint32_t SRAMSYSRWT                : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t SRAMSYSWWT                : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t SRAMECCRWT                : 3;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t SRAMECCWWT                : 3;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t SRAMHSRWT                 : 3;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t SRAMHSWWT                 : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t SRAMBKRWT                 : 3;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t SRAMBKWWT                 : 3;
} stc_sramc_wtcr_field_t;

typedef struct
{
    __IO uint8_t WTPRC                      : 1;
    __IO uint8_t WTPRKW                     : 7;
} stc_sramc_wtpr_field_t;

typedef struct
{
    __IO uint32_t PYOAD                     : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t ECCOAD                    : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t ECCMOD                    : 2;
} stc_sramc_ckcr_field_t;

typedef struct
{
    __IO uint8_t CKPRC                      : 1;
    __IO uint8_t CKPRKW                     : 7;
} stc_sramc_ckpr_field_t;

typedef struct
{
    __IO uint8_t SRAMECC1ERR                : 1;
    __IO uint8_t SRAMECC2ERR                : 1;
    __IO uint8_t SRAMSYSPYERR               : 1;
    __IO uint8_t SRAMHSPYERR                : 1;
    __IO uint8_t SRAMBKPYERR                : 1;
} stc_sramc_cksr_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
    __IO uint32_t UDF                       : 1;
    __IO uint32_t REF                       : 1;
    uint32_t RESERVED18                     : 6;
    __IO uint32_t RESV                      : 1;
} stc_swdt_sr_field_t;

typedef struct
{
    uint16_t RESERVED0                      :14;
    __IO uint16_t EXBUSOE                   : 1;
    __IO uint16_t STOP                      : 1;
} stc_sysreg_pwrc3_field_t;

typedef struct
{
    __IO uint16_t ADCKSEL                   : 3;
    uint16_t RESERVED3                      : 5;
    __IO uint16_t CANCKSEL                  : 1;
} stc_sysreg_cmu_adcksel_field_t;

typedef struct
{
    __IO uint32_t PCLK0S                    : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t PCLK1S                    : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t PCLK2S                    : 3;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t PCLK3S                    : 3;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t PCLK4S                    : 3;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t EXCKS                     : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t HCLKS                     : 3;
} stc_sysreg_cmu_scfgr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 4;
    __IO uint8_t USBCKS                     : 4;
} stc_sysreg_cmu_ufsckcfgr_field_t;

typedef struct
{
    __IO uint8_t CKSW                       : 3;
} stc_sysreg_cmu_ckswr_field_t;

typedef struct
{
    __IO uint16_t MPLLM                     : 2;
    uint16_t RESERVED2                      : 2;
    __IO uint16_t PLLSRC                    : 1;
    __IO uint16_t MPLLP                     : 3;
    __IO uint16_t MPLLN                     : 6;
} stc_sysreg_cmu_pllcfgr_field_t;

typedef struct
{
    __IO uint8_t MPLLOFF                    : 1;
} stc_sysreg_cmu_pllcr_field_t;

typedef struct
{
    __IO uint16_t UPLLM                     : 2;
    uint16_t RESERVED2                      : 3;
    __IO uint16_t UPLLP                     : 3;
    __IO uint16_t UPLLN                     : 6;
} stc_sysreg_cmu_upllcfgr_field_t;

typedef struct
{
    __IO uint8_t UPLLOFF                    : 1;
} stc_sysreg_cmu_upllcr_field_t;

typedef struct
{
    __IO uint8_t XTALSTP                    : 1;
} stc_sysreg_cmu_xtalcr_field_t;

typedef struct
{
    __IO uint8_t HRCSTP                     : 1;
} stc_sysreg_cmu_hrccr_field_t;

typedef struct
{
    __IO uint8_t MRCSTP                     : 1;
} stc_sysreg_cmu_mrccr_field_t;

typedef struct
{
    __IO uint8_t HRCSTBF                    : 1;
    uint8_t RESERVED1                       : 2;
    __IO uint8_t XTALSTBF                   : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MPLLSTBF                   : 1;
    __IO uint8_t UPLLSTBF                   : 1;
} stc_sysreg_cmu_oscstbsr_field_t;

typedef struct
{
    __IO uint8_t MCOSEL                     : 4;
    __IO uint8_t MCODIV                     : 3;
    __IO uint8_t MCOEN                      : 1;
} stc_sysreg_cmu_mcocfgr_field_t;

typedef struct
{
    __IO uint8_t TPIUCKS                    : 4;
    uint8_t RESERVED4                       : 3;
    __IO uint8_t TPIUCKOE                   : 1;
} stc_sysreg_cmu_tpiuckcfgr_field_t;

typedef struct
{
    __IO uint8_t XTALSTDIE                  : 1;
    __IO uint8_t XTALSTDRE                  : 1;
    __IO uint8_t XTALSTDRIS                 : 1;
    uint8_t RESERVED3                       : 4;
    __IO uint8_t XTALSTDE                   : 1;
} stc_sysreg_cmu_xtalstdcr_field_t;

typedef struct
{
    __IO uint8_t XTALSTDF                   : 1;
} stc_sysreg_cmu_xtalstdsr_field_t;

typedef struct
{
    __IO uint8_t XTALSTB                    : 4;
} stc_sysreg_cmu_xtalstbcr_field_t;

typedef struct
{
    __IO uint16_t PORF                      : 1;
    __IO uint16_t PINRF                     : 1;
    __IO uint16_t VD0RF                     : 1;
    __IO uint16_t VD1RF                     : 1;
    __IO uint16_t VD2RF                     : 1;
    __IO uint16_t WDRF                      : 1;
    __IO uint16_t SWDRF                     : 1;
    __IO uint16_t PDRF                      : 1;
    __IO uint16_t SWRF                      : 1;
    __IO uint16_t MPUERF                    : 1;
    __IO uint16_t RAPERF                    : 1;
    __IO uint16_t RAECRF                    : 1;
    __IO uint16_t CKFERF                    : 1;
    __IO uint16_t XTALERF                   : 1;
    __IO uint16_t MULTIRF                   : 1;
    __IO uint16_t CLRF                      : 1;
} stc_sysreg_rstf0_field_t;

typedef struct
{
    __IO uint8_t VDU1NMIS                   : 1;
    __IO uint8_t VDU1EDGS                   : 2;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t VDU2NMIS                   : 1;
    __IO uint8_t VDU2EDGS                   : 2;
} stc_sysreg_vduicr_field_t;

typedef struct
{
    __IO uint8_t VDU1DETST                  : 1;
    __IO uint8_t VDU1DETFLG                 : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t VDU2DETST                  : 1;
    __IO uint8_t VDU2DETFLG                 : 1;
} stc_sysreg_vdudsr_field_t;

typedef struct
{
    __IO uint16_t FPRCB0                    : 1;
    __IO uint16_t FPRCB1                    : 1;
    __IO uint16_t FPRCB2                    : 1;
    __IO uint16_t FPRCB3                    : 1;
    __IO uint16_t FPRCB4                    : 1;
    __IO uint16_t FPRCB5                    : 1;
    __IO uint16_t FPRCB6                    : 1;
    __IO uint16_t FPRCB7                    : 1;
    __IO uint16_t FPRCWE                    : 8;
} stc_sysreg_fprc_field_t;

typedef struct
{
    __IO uint8_t PDNMD0                     : 1;
    __IO uint8_t PDNMD1                     : 1;
    uint8_t RESERVED2                       : 4;
    __IO uint8_t IORTN                      : 1;
    __IO uint8_t PWDN                       : 1;
} stc_sysreg_pwrc0_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 1;
    __IO uint8_t VDDSCM                     : 1;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t PWRCHGFLG                  : 1;
} stc_sysreg_pwrc1_field_t;

typedef struct
{
    __IO uint8_t RUNMODESEL                 : 4;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t STPMDS                     : 3;
} stc_sysreg_pwrc2_field_t;

typedef struct
{
    __IO uint8_t PTWKE0                     : 1;
    __IO uint8_t PTWKE1                     : 1;
    __IO uint8_t PTWKE2                     : 1;
    __IO uint8_t PTWKE3                     : 1;
    __IO uint8_t PTWKE4                     : 1;
    __IO uint8_t PTWKE5                     : 1;
    __IO uint8_t PTWKE6                     : 1;
    __IO uint8_t PTWKE7                     : 1;
} stc_sysreg_pdwke0_field_t;

typedef struct
{
    __IO uint8_t PTWKE8                     : 1;
    __IO uint8_t PTWKE9                     : 1;
    __IO uint8_t PTWKE10                    : 1;
    __IO uint8_t PTWKE11                    : 1;
    __IO uint8_t PTWKE12                    : 1;
    __IO uint8_t PTWKE13                    : 1;
    __IO uint8_t PTWKE14                    : 1;
    __IO uint8_t PTWKE15                    : 1;
} stc_sysreg_pdwke1_field_t;

typedef struct
{
    __IO uint8_t VD1WKE                     : 1;
    __IO uint8_t VD2WKE                     : 1;
    __IO uint8_t RTCPRDWKE                  : 1;
    __IO uint8_t RTCALMWKE                  : 1;
    __IO uint8_t NMIWKE                     : 1;
} stc_sysreg_pdwke2_field_t;

typedef struct
{
    __IO uint8_t PTWK0EG                    : 1;
    __IO uint8_t PTWK1EG                    : 1;
    __IO uint8_t PTWK2EG                    : 1;
    __IO uint8_t PTWK3EG                    : 1;
    __IO uint8_t PTWK4EG                    : 1;
    __IO uint8_t PTWK5EG                    : 1;
    __IO uint8_t PTWK6EG                    : 1;
    __IO uint8_t PTWK7EG                    : 1;
} stc_sysreg_pdwkes0_field_t;

typedef struct
{
    __IO uint8_t PTWK8EG                    : 1;
    __IO uint8_t PTWK9EG                    : 1;
    __IO uint8_t PTWK10EG                   : 1;
    __IO uint8_t PTWK11EG                   : 1;
    __IO uint8_t PTWK12EG                   : 1;
    __IO uint8_t PTWK13EG                   : 1;
    __IO uint8_t PTWK14EG                   : 1;
    __IO uint8_t PTWK15EG                   : 1;
} stc_sysreg_pdwkes1_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 4;
    __IO uint8_t NMIEG                      : 1;
} stc_sysreg_pdwkes2_field_t;

typedef struct
{
    __IO uint8_t PTWKFLG0                   : 1;
    __IO uint8_t PTWKFLG1                   : 1;
    __IO uint8_t PTWKFLG2                   : 1;
    __IO uint8_t PTWKFLG3                   : 1;
    __IO uint8_t PTWKFLG4                   : 1;
    __IO uint8_t PTWKFLG5                   : 1;
    __IO uint8_t PTWKFLG6                   : 1;
    __IO uint8_t PTWKFLG7                   : 1;
} stc_sysreg_pdwkflg0_field_t;

typedef struct
{
    __IO uint8_t PTWKFLG8                   : 1;
    __IO uint8_t PTWKFLG9                   : 1;
    __IO uint8_t PTWKFLG10                  : 1;
    __IO uint8_t PTWKFLG11                  : 1;
    __IO uint8_t PTWKFLG12                  : 1;
    __IO uint8_t PTWKFLG13                  : 1;
    __IO uint8_t PTWKFLG14                  : 1;
    __IO uint8_t PTWKFLG15                  : 1;
} stc_sysreg_pdwkflg1_field_t;

typedef struct
{
    __IO uint8_t VD1WKFLG                   : 1;
    __IO uint8_t VD2WKFLG                   : 1;
    __IO uint8_t RTCPRDWKFLG                : 1;
    __IO uint8_t RTCALMWKFLG                : 1;
    __IO uint8_t NMIWKFLG                   : 1;
} stc_sysreg_pdwkflg2_field_t;

typedef struct
{
    __IO uint8_t FRCUT                      : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t XTALDRV                    : 2;
    __IO uint8_t XTALMS                     : 1;
    __IO uint8_t SUPDRV                     : 1;
} stc_sysreg_cmu_xtalcfgr_field_t;

typedef struct
{
    __IO uint8_t EXVCCINEN                  : 1;
    __IO uint8_t EXREFINEN                  : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t VDU0EN                     : 1;
    __IO uint8_t VDU1EN                     : 1;
    __IO uint8_t VDU2EN                     : 1;
    __IO uint8_t VDU0CMPOE                  : 1;
} stc_sysreg_vducr0_field_t;

typedef struct
{
    __IO uint8_t VDU1IRE                    : 1;
    __IO uint8_t VDU1IRS                    : 1;
    __IO uint8_t VDU1CMPOE                  : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t VDU2IRE                    : 1;
    __IO uint8_t VDU2IRS                    : 1;
    __IO uint8_t VDU2CMPOE                  : 1;
} stc_sysreg_vducr1_field_t;

typedef struct
{
    __IO uint8_t VDU1NFDIS                  : 1;
    __IO uint8_t VDU1NFCKS                  : 2;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t VDU2NFDIS                  : 1;
    __IO uint8_t VDU2NFCKS                  : 2;
} stc_sysreg_vdufcr_field_t;

typedef struct
{
    __IO uint8_t VDU1LVL                    : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t VDU2LVL                    : 3;
} stc_sysreg_vdulcr_field_t;

typedef struct
{
    __IO uint8_t VDU0CMPST                  : 1;
    __IO uint8_t VDU1CMPST                  : 1;
    __IO uint8_t VDU2CMPST                  : 1;
} stc_sysreg_vducsr_field_t;

typedef struct
{
    __IO uint8_t VBATREFSEL                 : 1;
    __IO uint8_t VBATME                     : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t VBATMON                    : 1;
} stc_sysreg_batmc_field_t;

typedef struct
{
    __IO uint32_t CSTA                      : 1;
    __IO uint32_t CAPMDA                    : 1;
    __IO uint32_t INTENA                    : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t CKDIVA                    : 4;
    __IO uint32_t SYNSA                     : 1;
    __IO uint32_t SYNCLKA                   : 1;
    __IO uint32_t ASYNCLKA                  : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t HSTAA                     : 1;
    __IO uint32_t HSTPA                     : 1;
    __IO uint32_t HCLEA                     : 1;
    __IO uint32_t HICPA                     : 1;
    __IO uint32_t CSTB                      : 1;
    __IO uint32_t CAPMDB                    : 1;
    __IO uint32_t INTENB                    : 1;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t CKDIVB                    : 4;
    __IO uint32_t SYNSB                     : 1;
    __IO uint32_t SYNCLKB                   : 1;
    __IO uint32_t ASYNCLKB                  : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t HSTAB                     : 1;
    __IO uint32_t HSTPB                     : 1;
    __IO uint32_t HCLEB                     : 1;
    __IO uint32_t HICPB                     : 1;
} stc_tmr0_bconr_field_t;

typedef struct
{
    __IO uint32_t CMAF                      : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t CMBF                      : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
} stc_tmr0_stflr_field_t;

typedef struct
{
    __IO uint32_t CSTA                      : 1;
    uint32_t RESERVED1                      : 2;
    __IO uint32_t SYNSA                     : 1;
    __IO uint32_t CKDIVA                    : 4;
    __IO uint32_t SYNSCLKA                  : 2;
    __IO uint32_t ASYNSCLKA                 : 2;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t CSTB                      : 1;
    uint32_t RESERVED17                     : 2;
    __IO uint32_t SYNSB                     : 1;
    __IO uint32_t CKDIVB                    : 4;
    __IO uint32_t SYNSCLKB                  : 2;
    __IO uint32_t ASYNSCLKB                 : 2;
} stc_tmr2_bconr_field_t;

typedef struct
{
    __IO uint32_t INTENA                    : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t INTENB                    : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
} stc_tmr2_iconr_field_t;

typedef struct
{
    __IO uint32_t CAPMDA                    : 1;
    __IO uint32_t STACA                     : 1;
    __IO uint32_t STPCA                     : 1;
    __IO uint32_t STASTPSA                  : 1;
    __IO uint32_t CMPCA                     : 2;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t OUTENA                    : 1;
    uint32_t RESERVED9                      : 3;
    __IO uint32_t NOFIENA                   : 1;
    __IO uint32_t NOFICKA                   : 2;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t CAPMDB                    : 1;
    __IO uint32_t STACB                     : 1;
    __IO uint32_t STPCB                     : 1;
    __IO uint32_t STASTPSB                  : 1;
    __IO uint32_t CMPCB                     : 2;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t OUTENB                    : 1;
    uint32_t RESERVED25                     : 3;
    __IO uint32_t NOFIENB                   : 1;
    __IO uint32_t NOFICKB                   : 2;
} stc_tmr2_pconr_field_t;

typedef struct
{
    __IO uint32_t HSTAA0                    : 1;
    __IO uint32_t HSTAA1                    : 1;
    __IO uint32_t HSTAA2                    : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t HSTPA0                    : 1;
    __IO uint32_t HSTPA1                    : 1;
    __IO uint32_t HSTPA2                    : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t HCLEA0                    : 1;
    __IO uint32_t HCLEA1                    : 1;
    __IO uint32_t HCLEA2                    : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t HICPA0                    : 1;
    __IO uint32_t HICPA1                    : 1;
    __IO uint32_t HICPA2                    : 1;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t HSTAB0                    : 1;
    __IO uint32_t HSTAB1                    : 1;
    __IO uint32_t HSTAB2                    : 1;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t HSTPB0                    : 1;
    __IO uint32_t HSTPB1                    : 1;
    __IO uint32_t HSTPB2                    : 1;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t HCLEB0                    : 1;
    __IO uint32_t HCLEB1                    : 1;
    __IO uint32_t HCLEB2                    : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t HICPB0                    : 1;
    __IO uint32_t HICPB1                    : 1;
    __IO uint32_t HICPB2                    : 1;
} stc_tmr2_hconr_field_t;

typedef struct
{
    __IO uint32_t CMAF                      : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t CMBF                      : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
} stc_tmr2_stflr_field_t;

typedef struct
{
    __IO uint8_t OCEHU                      : 1;
    __IO uint8_t OCELU                      : 1;
    __IO uint8_t OCPHU                      : 1;
    __IO uint8_t OCPLU                      : 1;
    __IO uint8_t OCIEHU                     : 1;
    __IO uint8_t OCIELU                     : 1;
    __IO uint8_t OCFHU                      : 1;
    __IO uint8_t OCFLU                      : 1;
} stc_tmr4_ocsru_field_t;

typedef struct
{
    __IO uint16_t CHBUFENU                  : 2;
    __IO uint16_t CLBUFENU                  : 2;
    __IO uint16_t MHBUFENU                  : 2;
    __IO uint16_t MLBUFENU                  : 2;
    __IO uint16_t LMCHU                     : 1;
    __IO uint16_t LMCLU                     : 1;
    __IO uint16_t LMMHU                     : 1;
    __IO uint16_t LMMLU                     : 1;
    __IO uint16_t MCECHU                    : 1;
    __IO uint16_t MCECLU                    : 1;
} stc_tmr4_oceru_field_t;

typedef struct
{
    __IO uint8_t OCEHV                      : 1;
    __IO uint8_t OCELV                      : 1;
    __IO uint8_t OCPHV                      : 1;
    __IO uint8_t OCPLV                      : 1;
    __IO uint8_t OCIEHV                     : 1;
    __IO uint8_t OCIELV                     : 1;
    __IO uint8_t OCFHV                      : 1;
    __IO uint8_t OCFLV                      : 1;
} stc_tmr4_ocsrv_field_t;

typedef struct
{
    __IO uint16_t CHBUFENV                  : 2;
    __IO uint16_t CLBUFENV                  : 2;
    __IO uint16_t MHBUFENV                  : 2;
    __IO uint16_t MLBUFENV                  : 2;
    __IO uint16_t LMCHV                     : 1;
    __IO uint16_t LMCLV                     : 1;
    __IO uint16_t LMMHV                     : 1;
    __IO uint16_t LMMLV                     : 1;
    __IO uint16_t MCECHV                    : 1;
    __IO uint16_t MCECLV                    : 1;
} stc_tmr4_ocerv_field_t;

