RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint8_t OCEHW                      : 1;
    __IO uint8_t OCELW                      : 1;
    __IO uint8_t OCPHW                      : 1;
    __IO uint8_t OCPLW                      : 1;
    __IO uint8_t OCIEHW                     : 1;
    __IO uint8_t OCIELW                     : 1;
    __IO uint8_t OCFHW                      : 1;
    __IO uint8_t OCFLW                      : 1;
} stc_tmr4_ocsrw_field_t;

typedef struct
{
    __IO uint16_t CHBUFENW                  : 2;
    __IO uint16_t CLBUFENW                  : 2;
    __IO uint16_t MHBUFENW                  : 2;
    __IO uint16_t MLBUFENW                  : 2;
    __IO uint16_t LMCHW                     : 1;
    __IO uint16_t LMCLW                     : 1;
    __IO uint16_t LMMHW                     : 1;
    __IO uint16_t LMMLW                     : 1;
    __IO uint16_t MCECHW                    : 1;
    __IO uint16_t MCECLW                    : 1;
} stc_tmr4_ocerw_field_t;

typedef struct
{
    __IO uint16_t OCFDCHUH                  : 1;
    __IO uint16_t OCFPKHUH                  : 1;
    __IO uint16_t OCFUCHUH                  : 1;
    __IO uint16_t OCFZRHUH                  : 1;
    __IO uint16_t OPDCHUH                   : 2;
    __IO uint16_t OPPKHUH                   : 2;
    __IO uint16_t OPUCHUH                   : 2;
    __IO uint16_t OPZRHUH                   : 2;
    __IO uint16_t OPNPKHUH                  : 2;
    __IO uint16_t OPNZRHUH                  : 2;
} stc_tmr4_ocmruh_field_t;

typedef struct
{
    __IO uint32_t OCFDCLUL                  : 1;
    __IO uint32_t OCFPKLUL                  : 1;
    __IO uint32_t OCFUCLUL                  : 1;
    __IO uint32_t OCFZRLUL                  : 1;
    __IO uint32_t OPDCLUL                   : 2;
    __IO uint32_t OPPKLUL                   : 2;
    __IO uint32_t OPUCLUL                   : 2;
    __IO uint32_t OPZRLUL                   : 2;
    __IO uint32_t OPNPKLUL                  : 2;
    __IO uint32_t OPNZRLUL                  : 2;
    __IO uint32_t EOPNDCLUL                 : 2;
    __IO uint32_t EOPNUCLUL                 : 2;
    __IO uint32_t EOPDCLUL                  : 2;
    __IO uint32_t EOPPKLUL                  : 2;
    __IO uint32_t EOPUCLUL                  : 2;
    __IO uint32_t EOPZRLUL                  : 2;
    __IO uint32_t EOPNPKLUL                 : 2;
    __IO uint32_t EOPNZRLUL                 : 2;
} stc_tmr4_ocmrul_field_t;

typedef struct
{
    __IO uint16_t OCFDCHVH                  : 1;
    __IO uint16_t OCFPKHVH                  : 1;
    __IO uint16_t OCFUCHVH                  : 1;
    __IO uint16_t OCFZRHVH                  : 1;
    __IO uint16_t OPDCHVH                   : 2;
    __IO uint16_t OPPKHVH                   : 2;
    __IO uint16_t OPUCHVH                   : 2;
    __IO uint16_t OPZRHVH                   : 2;
    __IO uint16_t OPNPKHVH                  : 2;
    __IO uint16_t OPNZRHVH                  : 2;
} stc_tmr4_ocmrvh_field_t;

typedef struct
{
    __IO uint32_t OCFDCLVL                  : 1;
    __IO uint32_t OCFPKLVL                  : 1;
    __IO uint32_t OCFUCLVL                  : 1;
    __IO uint32_t OCFZRLVL                  : 1;
    __IO uint32_t OPDCLVL                   : 2;
    __IO uint32_t OPPKLVL                   : 2;
    __IO uint32_t OPUCLVL                   : 2;
    __IO uint32_t OPZRLVL                   : 2;
    __IO uint32_t OPNPKLVL                  : 2;
    __IO uint32_t OPNZRLVL                  : 2;
    __IO uint32_t EOPNDCLVL                 : 2;
    __IO uint32_t EOPNUCLVL                 : 2;
    __IO uint32_t EOPDCLVL                  : 2;
    __IO uint32_t EOPPKLVL                  : 2;
    __IO uint32_t EOPUCLVL                  : 2;
    __IO uint32_t EOPZRLVL                  : 2;
    __IO uint32_t EOPNPKLVL                 : 2;
    __IO uint32_t EOPNZRLVL                 : 2;
} stc_tmr4_ocmrvl_field_t;

typedef struct
{
    __IO uint16_t OCFDCHWH                  : 1;
    __IO uint16_t OCFPKHWH                  : 1;
    __IO uint16_t OCFUCHWH                  : 1;
    __IO uint16_t OCFZRHWH                  : 1;
    __IO uint16_t OPDCHWH                   : 2;
    __IO uint16_t OPPKHWH                   : 2;
    __IO uint16_t OPUCHWH                   : 2;
    __IO uint16_t OPZRHWH                   : 2;
    __IO uint16_t OPNPKHWH                  : 2;
    __IO uint16_t OPNZRHWH                  : 2;
} stc_tmr4_ocmrwh_field_t;

typedef struct
{
    __IO uint32_t OCFDCLWL                  : 1;
    __IO uint32_t OCFPKLWL                  : 1;
    __IO uint32_t OCFUCLWL                  : 1;
    __IO uint32_t OCFZRLWL                  : 1;
    __IO uint32_t OPDCLWL                   : 2;
    __IO uint32_t OPPKLWL                   : 2;
    __IO uint32_t OPUCLWL                   : 2;
    __IO uint32_t OPZRLWL                   : 2;
    __IO uint32_t OPNPKLWL                  : 2;
    __IO uint32_t OPNZRLWL                  : 2;
    __IO uint32_t EOPNDCLWL                 : 2;
    __IO uint32_t EOPNUCLWL                 : 2;
    __IO uint32_t EOPDCLWL                  : 2;
    __IO uint32_t EOPPKLWL                  : 2;
    __IO uint32_t EOPUCLWL                  : 2;
    __IO uint32_t EOPZRLWL                  : 2;
    __IO uint32_t EOPNPKLWL                 : 2;
    __IO uint32_t EOPNZRLWL                 : 2;
} stc_tmr4_ocmrwl_field_t;

typedef struct
{
    __IO uint16_t CKDIV                     : 4;
    __IO uint16_t CLEAR                     : 1;
    __IO uint16_t MODE                      : 1;
    __IO uint16_t STOP                      : 1;
    __IO uint16_t BUFEN                     : 1;
    __IO uint16_t IRQPEN                    : 1;
    __IO uint16_t IRQPF                     : 1;
    uint16_t RESERVED10                     : 3;
    __IO uint16_t IRQZEN                    : 1;
    __IO uint16_t TRQZF                     : 1;
    __IO uint16_t ECKEN                     : 1;
} stc_tmr4_ccsr_field_t;

typedef struct
{
    __IO uint16_t ZIM                       : 4;
    __IO uint16_t PIM                       : 4;
    __IO uint16_t ZIC                       : 4;
    __IO uint16_t PIC                       : 4;
} stc_tmr4_cvpr_field_t;

typedef struct
{
    __IO uint8_t DIVCKU                     : 4;
    __IO uint8_t PWMMDU                     : 2;
    __IO uint8_t LVLSU                      : 2;
} stc_tmr4_pocru_field_t;

typedef struct
{
    __IO uint8_t DIVCKV                     : 4;
    __IO uint8_t PWMMDV                     : 2;
    __IO uint8_t LVLSV                      : 2;
} stc_tmr4_pocrv_field_t;

typedef struct
{
    __IO uint8_t DIVCKW                     : 4;
    __IO uint8_t PWMMDW                     : 2;
    __IO uint8_t LVLSW                      : 2;
} stc_tmr4_pocrw_field_t;

typedef struct
{
    __IO uint16_t RTIDU                     : 1;
    __IO uint16_t RTIDV                     : 1;
    __IO uint16_t RTIDW                     : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t RTIFU                     : 1;
    __IO uint16_t RTICU                     : 1;
    __IO uint16_t RTEU                      : 1;
    __IO uint16_t RSTU                      : 1;
    __IO uint16_t RTIFV                     : 1;
    __IO uint16_t RTICV                     : 1;
    __IO uint16_t RTEV                      : 1;
    __IO uint16_t RSTV                      : 1;
    __IO uint16_t RTIFW                     : 1;
    __IO uint16_t RTICW                     : 1;
    __IO uint16_t RTEW                      : 1;
    __IO uint16_t RSTW                      : 1;
} stc_tmr4_rcsr_field_t;

typedef struct
{
    __IO uint16_t BUFENUH                   : 2;
    __IO uint16_t EVTOSUH                   : 3;
    __IO uint16_t LMCUH                     : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t EVTMSUH                   : 1;
    __IO uint16_t EVTDSUH                   : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t DENUH                     : 1;
    __IO uint16_t PENUH                     : 1;
    __IO uint16_t UENUH                     : 1;
    __IO uint16_t ZENUH                     : 1;
} stc_tmr4_scsruh_field_t;

typedef struct
{
    __IO uint8_t AMCUH                      : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCEUH                     : 1;
    __IO uint8_t MPCEUH                     : 1;
} stc_tmr4_scmruh_field_t;

typedef struct
{
    __IO uint16_t BUFENUL                   : 2;
    __IO uint16_t EVTOSUL                   : 3;
    __IO uint16_t LMCUL                     : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t EVTMSUL                   : 1;
    __IO uint16_t EVTDSUL                   : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t DENUL                     : 1;
    __IO uint16_t PENUL                     : 1;
    __IO uint16_t UENUL                     : 1;
    __IO uint16_t ZENUL                     : 1;
} stc_tmr4_scsrul_field_t;

typedef struct
{
    __IO uint8_t AMCUL                      : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCEUL                     : 1;
    __IO uint8_t MPCEUL                     : 1;
} stc_tmr4_scmrul_field_t;

typedef struct
{
    __IO uint16_t BUFENVH                   : 2;
    __IO uint16_t EVTOSVH                   : 3;
    __IO uint16_t LMCVH                     : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t EVTMSVH                   : 1;
    __IO uint16_t EVTDSVH                   : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t DENVH                     : 1;
    __IO uint16_t PENVH                     : 1;
    __IO uint16_t UENVH                     : 1;
    __IO uint16_t ZENVH                     : 1;
} stc_tmr4_scsrvh_field_t;

typedef struct
{
    __IO uint8_t AMCVH                      : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCEVH                     : 1;
    __IO uint8_t MPCEVH                     : 1;
} stc_tmr4_scmrvh_field_t;

typedef struct
{
    __IO uint16_t BUFENVL                   : 2;
    __IO uint16_t EVTOSVL                   : 3;
    __IO uint16_t LMCVL                     : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t EVTMSVL                   : 1;
    __IO uint16_t EVTDSVL                   : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t DENVL                     : 1;
    __IO uint16_t PENVL                     : 1;
    __IO uint16_t UENVL                     : 1;
    __IO uint16_t ZENVL                     : 1;
} stc_tmr4_scsrvl_field_t;

typedef struct
{
    __IO uint8_t AMCVL                      : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCEVL                     : 1;
    __IO uint8_t MPCEVL                     : 1;
} stc_tmr4_scmrvl_field_t;

typedef struct
{
    __IO uint16_t BUFENWH                   : 2;
    __IO uint16_t EVTOSWH                   : 3;
    __IO uint16_t LMCWH                     : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t EVTMSWH                   : 1;
    __IO uint16_t EVTDSWH                   : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t DENWH                     : 1;
    __IO uint16_t PENWH                     : 1;
    __IO uint16_t UENWH                     : 1;
    __IO uint16_t ZENWH                     : 1;
} stc_tmr4_scsrwh_field_t;

typedef struct
{
    __IO uint8_t AMCWH                      : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCEWH                     : 1;
    __IO uint8_t MPCEWH                     : 1;
} stc_tmr4_scmrwh_field_t;

typedef struct
{
    __IO uint16_t BUFENWL                   : 2;
    __IO uint16_t EVTOSWL                   : 3;
    __IO uint16_t LMCWL                     : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t EVTMSWL                   : 1;
    __IO uint16_t EVTDSWL                   : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t DENWL                     : 1;
    __IO uint16_t PENWL                     : 1;
    __IO uint16_t UENWL                     : 1;
    __IO uint16_t ZENWL                     : 1;
} stc_tmr4_scsrwl_field_t;

typedef struct
{
    __IO uint8_t AMCWL                      : 4;
    uint8_t RESERVED4                       : 2;
    __IO uint8_t MZCEWL                     : 1;
    __IO uint8_t MPCEWL                     : 1;
} stc_tmr4_scmrwl_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t HOLD                       : 1;
} stc_tmr4_ecsr_field_t;

typedef struct
{
    __IO uint8_t EMBVAL                     : 2;
} stc_tmr4_ecer_field_t;

typedef struct
{
    __IO uint32_t START                     : 1;
    __IO uint32_t MODE                      : 3;
    __IO uint32_t CKDIV                     : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t DIR                       : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t ZMSKREV                   : 1;
    __IO uint32_t ZMSKPOS                   : 1;
    __IO uint32_t ZMSKVAL                   : 2;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV                      : 1;
} stc_tmr6_gconr_field_t;

typedef struct
{
    __IO uint32_t INTENA                    : 1;
    __IO uint32_t INTENB                    : 1;
    __IO uint32_t INTENC                    : 1;
    __IO uint32_t INTEND                    : 1;
    __IO uint32_t INTENE                    : 1;
    __IO uint32_t INTENF                    : 1;
    __IO uint32_t INTENOVF                  : 1;
    __IO uint32_t INTENUDF                  : 1;
    __IO uint32_t INTENDTE                  : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t INTENSAU                  : 1;
    __IO uint32_t INTENSAD                  : 1;
    __IO uint32_t INTENSBU                  : 1;
    __IO uint32_t INTENSBD                  : 1;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV                      : 1;
} stc_tmr6_iconr_field_t;

typedef struct
{
    __IO uint32_t CAPMDA                    : 1;
    __IO uint32_t STACA                     : 1;
    __IO uint32_t STPCA                     : 1;
    __IO uint32_t STASTPSA                  : 1;
    __IO uint32_t CMPCA                     : 2;
    __IO uint32_t PERCA                     : 2;
    __IO uint32_t OUTENA                    : 1;
    __IO uint32_t EMBSELA                   : 2;
    __IO uint32_t EMBVALA                   : 2;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t CAPMDB                    : 1;
    __IO uint32_t STACB                     : 1;
    __IO uint32_t STPCB                     : 1;
    __IO uint32_t STASTPSB                  : 1;
    __IO uint32_t CMPCB                     : 2;
    __IO uint32_t PERCB                     : 2;
    __IO uint32_t OUTENB                    : 1;
    __IO uint32_t EMBSELB                   : 2;
    __IO uint32_t EMBVALB                   : 2;
} stc_tmr6_pconr_field_t;

typedef struct
{
    __IO uint32_t BENA                      : 1;
    __IO uint32_t BSEA                      : 1;
    __IO uint32_t BENB                      : 1;
    __IO uint32_t BSEB                      : 1;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t BENP                      : 1;
    __IO uint32_t BSEP                      : 1;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t BENSPA                    : 1;
    __IO uint32_t BSESPA                    : 1;
    uint32_t RESERVED18                     : 2;
    __IO uint32_t BTRSPA                    : 2;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t BENSPB                    : 1;
    __IO uint32_t BSESPB                    : 1;
    uint32_t RESERVED26                     : 2;
    __IO uint32_t BTRSPB                    : 2;
} stc_tmr6_bconr_field_t;

typedef struct
{
    __IO uint16_t DTCEN                     : 1;
    uint16_t RESERVED1                      : 3;
    __IO uint16_t DTBENU                    : 1;
    __IO uint16_t DTBEND                    : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t SEPA                      : 1;
} stc_tmr6_dconr_field_t;

typedef struct
{
    __IO uint32_t NOFIENGA                  : 1;
    __IO uint32_t NOFICKGA                  : 2;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t NOFIENGB                  : 1;
    __IO uint32_t NOFICKGB                  : 2;
    uint32_t RESERVED7                      : 9;
    __IO uint32_t NOFIENTA                  : 1;
    __IO uint32_t NOFICKTA                  : 2;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t NOFIENTB                  : 1;
    __IO uint32_t NOFICKTB                  : 2;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t NOFIENTC                  : 1;
    __IO uint32_t NOFICKTC                  : 2;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t NOFIENTD                  : 1;
    __IO uint32_t NOFICKTD                  : 2;
} stc_tmr6_fconr_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 8;
    __IO uint32_t SPPERIA                   : 1;
    __IO uint32_t SPPERIB                   : 1;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t PCNTE                     : 2;
    __IO uint32_t PCNTS                     : 3;
    uint32_t RESERVED21                     : 3;
    __IO uint32_t RESV                      : 1;
} stc_tmr6_vperr_field_t;

typedef struct
{
    __IO uint32_t CMAF                      : 1;
    __IO uint32_t CMBF                      : 1;
    __IO uint32_t CMCF                      : 1;
    __IO uint32_t CMDF                      : 1;
    __IO uint32_t CMEF                      : 1;
    __IO uint32_t CMFF                      : 1;
    __IO uint32_t OVFF                      : 1;
    __IO uint32_t UDFF                      : 1;
    __IO uint32_t DTEF                      : 1;
    __IO uint32_t CMSAUF                    : 1;
    __IO uint32_t CMSADF                    : 1;
    __IO uint32_t CMSBUF                    : 1;
    __IO uint32_t CMSBDF                    : 1;
    uint32_t RESERVED13                     : 8;
    __IO uint32_t VPERNUM                   : 3;
    uint32_t RESERVED24                     : 7;
    __IO uint32_t DIRF                      : 1;
} stc_tmr6_stflr_field_t;

typedef struct
{
    __IO uint32_t HSTA0                     : 1;
    __IO uint32_t HSTA1                     : 1;
    __IO uint32_t HSTA2                     : 1;
    __IO uint32_t HSTA3                     : 1;
    __IO uint32_t HSTA4                     : 1;
    __IO uint32_t HSTA5                     : 1;
    __IO uint32_t HSTA6                     : 1;
    __IO uint32_t HSTA7                     : 1;
    __IO uint32_t HSTA8                     : 1;
    __IO uint32_t HSTA9                     : 1;
    __IO uint32_t HSTA10                    : 1;
    __IO uint32_t HSTA11                    : 1;
    __IO uint32_t HSTA12                    : 1;
    __IO uint32_t HSTA13                    : 1;
    __IO uint32_t HSTA14                    : 1;
    __IO uint32_t HSTA15                    : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t STARTS                    : 1;
} stc_tmr6_hstar_field_t;

typedef struct
{
    __IO uint32_t HSTP0                     : 1;
    __IO uint32_t HSTP1                     : 1;
    __IO uint32_t HSTP2                     : 1;
    __IO uint32_t HSTP3                     : 1;
    __IO uint32_t HSTP4                     : 1;
    __IO uint32_t HSTP5                     : 1;
    __IO uint32_t HSTP6                     : 1;
    __IO uint32_t HSTP7                     : 1;
    __IO uint32_t HSTP8                     : 1;
    __IO uint32_t HSTP9                     : 1;
    __IO uint32_t HSTP10                    : 1;
    __IO uint32_t HSTP11                    : 1;
    __IO uint32_t HSTP12                    : 1;
    __IO uint32_t HSTP13                    : 1;
    __IO uint32_t HSTP14                    : 1;
    __IO uint32_t HSTP15                    : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t STOPS                     : 1;
} stc_tmr6_hstpr_field_t;

typedef struct
{
    __IO uint32_t HCLE0                     : 1;
    __IO uint32_t HCLE1                     : 1;
    __IO uint32_t HCLE2                     : 1;
    __IO uint32_t HCLE3                     : 1;
    __IO uint32_t HCLE4                     : 1;
    __IO uint32_t HCLE5                     : 1;
    __IO uint32_t HCLE6                     : 1;
    __IO uint32_t HCLE7                     : 1;
    __IO uint32_t HCLE8                     : 1;
    __IO uint32_t HCLE9                     : 1;
    __IO uint32_t HCLE10                    : 1;
    __IO uint32_t HCLE11                    : 1;
    __IO uint32_t HCLE12                    : 1;
    __IO uint32_t HCLE13                    : 1;
    __IO uint32_t HCLE14                    : 1;
    __IO uint32_t HCLE15                    : 1;
    uint32_t RESERVED16                     :15;
    __IO uint32_t CLEARS                    : 1;
} stc_tmr6_hclrr_field_t;

typedef struct
{
    __IO uint16_t HCPA0                     : 1;
    __IO uint16_t HCPA1                     : 1;
    __IO uint16_t HCPA2                     : 1;
    __IO uint16_t HCPA3                     : 1;
    __IO uint16_t HCPA4                     : 1;
    __IO uint16_t HCPA5                     : 1;
    __IO uint16_t HCPA6                     : 1;
    __IO uint16_t HCPA7                     : 1;
    __IO uint16_t HCPA8                     : 1;
    __IO uint16_t HCPA9                     : 1;
    __IO uint16_t HCPA10                    : 1;
    __IO uint16_t HCPA11                    : 1;
    __IO uint16_t HCPA12                    : 1;
    __IO uint16_t HCPA13                    : 1;
    __IO uint16_t HCPA14                    : 1;
    __IO uint16_t HCPA15                    : 1;
} stc_tmr6_hcpar_field_t;

typedef struct
{
    __IO uint16_t HCPB0                     : 1;
    __IO uint16_t HCPB1                     : 1;
    __IO uint16_t HCPB2                     : 1;
    __IO uint16_t HCPB3                     : 1;
    __IO uint16_t HCPB4                     : 1;
    __IO uint16_t HCPB5                     : 1;
    __IO uint16_t HCPB6                     : 1;
    __IO uint16_t HCPB7                     : 1;
    __IO uint16_t HCPB8                     : 1;
    __IO uint16_t HCPB9                     : 1;
    __IO uint16_t HCPB10                    : 1;
    __IO uint16_t HCPB11                    : 1;
    __IO uint16_t HCPB12                    : 1;
    __IO uint16_t HCPB13                    : 1;
    __IO uint16_t HCPB14                    : 1;
    __IO uint16_t HCPB15                    : 1;
} stc_tmr6_hcpbr_field_t;

