RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint32_t HCUP0                     : 1;
    __IO uint32_t HCUP1                     : 1;
    __IO uint32_t HCUP2                     : 1;
    __IO uint32_t HCUP3                     : 1;
    __IO uint32_t HCUP4                     : 1;
    __IO uint32_t HCUP5                     : 1;
    __IO uint32_t HCUP6                     : 1;
    __IO uint32_t HCUP7                     : 1;
    __IO uint32_t HCUP8                     : 1;
    __IO uint32_t HCUP9                     : 1;
    __IO uint32_t HCUP10                    : 1;
    __IO uint32_t HCUP11                    : 1;
    __IO uint32_t HCUP12                    : 1;
    __IO uint32_t HCUP13                    : 1;
    __IO uint32_t HCUP14                    : 1;
    __IO uint32_t HCUP15                    : 1;
    __IO uint32_t HCUP16                    : 1;
    __IO uint32_t HCUP17                    : 1;
    __IO uint32_t HCUP18                    : 1;
    __IO uint32_t HCUP19                    : 1;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV                      : 1;
} stc_tmr6_hcupr_field_t;

typedef struct
{
    __IO uint32_t HCDO0                     : 1;
    __IO uint32_t HCDO1                     : 1;
    __IO uint32_t HCDO2                     : 1;
    __IO uint32_t HCDO3                     : 1;
    __IO uint32_t HCDO4                     : 1;
    __IO uint32_t HCDO5                     : 1;
    __IO uint32_t HCDO6                     : 1;
    __IO uint32_t HCDO7                     : 1;
    __IO uint32_t HCDO8                     : 1;
    __IO uint32_t HCDO9                     : 1;
    __IO uint32_t HCDO10                    : 1;
    __IO uint32_t HCDO11                    : 1;
    __IO uint32_t HCDO12                    : 1;
    __IO uint32_t HCDO13                    : 1;
    __IO uint32_t HCDO14                    : 1;
    __IO uint32_t HCDO15                    : 1;
    __IO uint32_t HCDO16                    : 1;
    __IO uint32_t HCDO17                    : 1;
    __IO uint32_t HCDO18                    : 1;
    __IO uint32_t HCDO19                    : 1;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV                      : 1;
} stc_tmr6_hcdor_field_t;

typedef struct
{
    __IO uint32_t SSTA0                     : 1;
    __IO uint32_t SSTA1                     : 1;
    __IO uint32_t SSTA2                     : 1;
    __IO uint32_t SSTA3                     : 1;
    __IO uint32_t SSTA4                     : 1;
    __IO uint32_t SSTA5                     : 1;
    __IO uint32_t SSTA6                     : 1;
    __IO uint32_t SSTA7                     : 1;
    __IO uint32_t SSTA8                     : 1;
    __IO uint32_t SSTA9                     : 1;
    uint32_t RESERVED10                     :14;
    __IO uint32_t RESV                      : 1;
} stc_tmr6_sstar_field_t;

typedef struct
{
    __IO uint32_t SSTP0                     : 1;
    __IO uint32_t SSTP1                     : 1;
    __IO uint32_t SSTP2                     : 1;
    __IO uint32_t SSTP3                     : 1;
    __IO uint32_t SSTP4                     : 1;
    __IO uint32_t SSTP5                     : 1;
    __IO uint32_t SSTP6                     : 1;
    __IO uint32_t SSTP7                     : 1;
    __IO uint32_t SSTP8                     : 1;
    __IO uint32_t SSTP9                     : 1;
    uint32_t RESERVED10                     :14;
    __IO uint32_t RESV                      : 1;
} stc_tmr6_sstpr_field_t;

typedef struct
{
    __IO uint32_t SCLE0                     : 1;
    __IO uint32_t SCLE1                     : 1;
    __IO uint32_t SCLE2                     : 1;
    __IO uint32_t SCLE3                     : 1;
    __IO uint32_t SCLE4                     : 1;
    __IO uint32_t SCLE5                     : 1;
    __IO uint32_t SCLE6                     : 1;
    __IO uint32_t SCLE7                     : 1;
    __IO uint32_t SCLE8                     : 1;
    __IO uint32_t SCLE9                     : 1;
    uint32_t RESERVED10                     :14;
    __IO uint32_t RESV                      : 1;
} stc_tmr6_sclrr_field_t;

typedef struct
{
    __IO uint8_t EN                         : 1;
    __IO uint8_t RUN                        : 1;
} stc_trng_cr_field_t;

typedef struct
{
    __IO uint8_t LENGTH                     : 4;
    __IO uint8_t XOR                        : 3;
} stc_trng_fr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t STABLE                     : 1;
} stc_trng_sr_field_t;

typedef struct
{
    __IO uint8_t END                        : 1;
} stc_trng_ir_field_t;

typedef struct
{
    __IO uint32_t CKS                       : 2;
    __IO uint32_t MP                        : 1;
    __IO uint32_t STP                       : 1;
    __IO uint32_t P                         : 1;
    __IO uint32_t PE                        : 1;
    __IO uint32_t ML                        : 1;
    __IO uint32_t MS                        : 1;
    __IO uint32_t CL                        : 2;
    __IO uint32_t CTSE                      : 1;
    uint32_t RESERVED11                     :10;
    __IO uint32_t NFE                       : 1;
    uint32_t RESERVED22                     : 1;
    __IO uint32_t SBS                       : 1;
    __IO uint32_t SME                       : 1;
    __IO uint32_t T                         : 1;
    __IO uint32_t INV                       : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t GM                        : 1;
    __IO uint32_t CN                        : 3;
} stc_usart_mr_field_t;

typedef struct
{
    __IO uint8_t CKC                        : 2;
    __IO uint8_t TCIE                       : 1;
    __IO uint8_t SLME                       : 1;
    __IO uint8_t RE                         : 1;
    __IO uint8_t TE                         : 1;
    __IO uint8_t RIE                        : 1;
    __IO uint8_t TIE                        : 1;
} stc_usart_cr_field_t;

typedef struct
{
    __IO uint8_t MPB                        : 1;
    __IO uint8_t TCF                        : 1;
    __IO uint8_t PEF                        : 1;
    __IO uint8_t FEF                        : 1;
    __IO uint8_t OREF                       : 1;
    __IO uint8_t RXFF                       : 1;
} stc_usart_sr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 2;
    __IO uint8_t CPEF                       : 1;
    __IO uint8_t CFEF                       : 1;
    __IO uint8_t COREF                      : 1;
} stc_usart_clr_field_t;

typedef struct
{
    __IO uint16_t TDR                       : 9;
    __IO uint16_t MPID                      : 1;
} stc_usart_tdr_field_t;

typedef struct
{
    __IO uint16_t RDR                       : 9;
} stc_usart_rdr_field_t;

typedef struct
{
    __IO uint32_t SESREQSCS                 : 1;
    __IO uint32_t SESREQ                    : 1;
    __IO uint32_t VBVALIDOVEN               : 1;
    __IO uint32_t VBVALIDOVVAL              : 1;
    __IO uint32_t AVALIDOVEN                : 1;
    __IO uint32_t AVALIDOVVAL               : 1;
    __IO uint32_t BVALIDOVEN                : 1;
    __IO uint32_t BVALIDOVVAL               : 1;
    __IO uint32_t HSTNEGSCS                 : 1;
    __IO uint32_t HNPREQ                    : 1;
    __IO uint32_t HSTSETHNPEN               : 1;
    __IO uint32_t DEVHNPEN                  : 1;
    __IO uint32_t EHEN                      : 1;
    uint32_t RESERVED13                     : 2;
    __IO uint32_t DBNCEFLTRBYPASS           : 1;
    __IO uint32_t CONIDSTS                  : 1;
    __IO uint32_t DBNCTIME                  : 1;
    __IO uint32_t ASESVLD                   : 1;
    __IO uint32_t BSESVLD                   : 1;
    __IO uint32_t OTGVER                    : 1;
    __IO uint32_t CURMOD                    : 1;
    uint32_t RESERVED22                     : 2;
    __IO uint32_t RESV                      : 1;
} stc_usf_gotgctl_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t SESENDDET                 : 1;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t SESREQSUCSTSCHNG          : 1;
    __IO uint32_t HSTNEGSUCSTSCHNG          : 1;
    uint32_t RESERVED10                     : 7;
    __IO uint32_t HSTNEGDET                 : 1;
    __IO uint32_t ADEVTOUTCHG               : 1;
    __IO uint32_t DBNCEDONE                 : 1;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV                      : 1;
} stc_usf_gotgint_field_t;

typedef struct
{
    __IO uint32_t GLBLINTRMSK               : 1;
    __IO uint32_t HBSTLEN                   : 4;
    __IO uint32_t DMAEN                     : 1;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t NPTXFEMPLVL               : 1;
    __IO uint32_t PTXFEMPLVL                : 1;
    uint32_t RESERVED9                      :12;
    __IO uint32_t REMMEMSUPP                : 1;
    __IO uint32_t NOTIALLDMAWRIT            : 1;
    __IO uint32_t AHBSINGLE                 : 1;
    __IO uint32_t RESV                      : 1;
} stc_usf_gahbcfg_field_t;

typedef struct
{
    __IO uint32_t TOUTCAL                   : 3;
    __IO uint32_t PHYIF                     : 1;
    __IO uint32_t ULPI_UTMI_SEL             : 1;
    __IO uint32_t FSINTF                    : 1;
    __IO uint32_t PHYSEL                    : 1;
    __IO uint32_t DDRSEL                    : 1;
    __IO uint32_t SRPCAP                    : 1;
    __IO uint32_t HNPCAP                    : 1;
    __IO uint32_t USBTRDTIM                 : 4;
    uint32_t RESERVED14                     : 3;
    __IO uint32_t ULPIFSLS                  : 1;
    __IO uint32_t ULPIAUTORES               : 1;
    __IO uint32_t ULPICLKSUSM               : 1;
    __IO uint32_t ULPIEXTVBUSDRV            : 1;
    __IO uint32_t ULPIEXTVBUSINDICATOR      : 1;
    __IO uint32_t TERMSELDLPULSE            : 1;
    __IO uint32_t COMPLEMENT                : 1;
    __IO uint32_t INDICATOR                 : 1;
    __IO uint32_t ULPI                      : 1;
    __IO uint32_t IC_USBCAP                 : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t TXENDDELAY                : 1;
    __IO uint32_t FORCEHSTMODE              : 1;
    __IO uint32_t FORCEDEVMODE              : 1;
    __IO uint32_t CORRUPTTXPKT              : 1;
} stc_usf_gusbcfg_field_t;

typedef struct
{
    __IO uint32_t CSFTRST                   : 1;
    __IO uint32_t PIUFSSFTRST               : 1;
    __IO uint32_t FRMCNTRRST                : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t RXFFLSH                   : 1;
    __IO uint32_t TXFFLSH                   : 1;
    __IO uint32_t TXFNUM                    : 5;
    uint32_t RESERVED11                     :19;
    __IO uint32_t DMAREQ                    : 1;
    __IO uint32_t AHBIDLE                   : 1;
} stc_usf_grstctl_field_t;

typedef struct
{
    __IO uint32_t CURMOD                    : 1;
    __IO uint32_t MODEMIS                   : 1;
    __IO uint32_t OTGINT                    : 1;
    __IO uint32_t SOF                       : 1;
    __IO uint32_t RXFLVL                    : 1;
    __IO uint32_t NPTXFEMP                  : 1;
    __IO uint32_t GINNAKEFF                 : 1;
    __IO uint32_t GOUTNAKEFF                : 1;
    uint32_t RESERVED8                      : 2;
    __IO uint32_t ERLYSUSP                  : 1;
    __IO uint32_t USBSUSP                   : 1;
    __IO uint32_t USBRST                    : 1;
    __IO uint32_t ENUMDONE                  : 1;
    __IO uint32_t ISOOUTDROP                : 1;
    __IO uint32_t EOPF                      : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t EPMIS                     : 1;
    __IO uint32_t IEPINT                    : 1;
    __IO uint32_t OEPINT                    : 1;
    __IO uint32_t INCOMPISOIN               : 1;
    __IO uint32_t INCOMPLP                  : 1;
    __IO uint32_t FETSUSP                   : 1;
    __IO uint32_t RESETDET                  : 1;
    __IO uint32_t PRTINT                    : 1;
    __IO uint32_t HCHINT                    : 1;
    __IO uint32_t PTXFEMP                   : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t CONIDSTSCHNG              : 1;
    __IO uint32_t DISCONNINT                : 1;
    __IO uint32_t SESSREQINT                : 1;
    __IO uint32_t WKUPINT                   : 1;
} stc_usf_gintsts_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t MODEMISMSK                : 1;
    __IO uint32_t OTGINTMSK                 : 1;
    __IO uint32_t SOFMSK                    : 1;
    __IO uint32_t RXFLVLMSK                 : 1;
    __IO uint32_t NPTXFEMPMSK               : 1;
    __IO uint32_t GINNAKEFFMSK              : 1;
    __IO uint32_t GOUTNAKEFFMSK             : 1;
    uint32_t RESERVED8                      : 2;
    __IO uint32_t ERLYSUSPMSK               : 1;
    __IO uint32_t USBSUSPMSK                : 1;
    __IO uint32_t USBRSTMSK                 : 1;
    __IO uint32_t ENUMDONEMSK               : 1;
    __IO uint32_t ISOOUTDROPMSK             : 1;
    __IO uint32_t EOPFMSK                   : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t EPMISMSK                  : 1;
    __IO uint32_t IEPINTMSK                 : 1;
    __IO uint32_t OEPINTMSK                 : 1;
    __IO uint32_t INCOMPISOINMSK            : 1;
    __IO uint32_t INCOMPLPMSK               : 1;
    __IO uint32_t FETSUSPMSK                : 1;
    __IO uint32_t RESETDETMSK               : 1;
    __IO uint32_t PRTINTMSK                 : 1;
    __IO uint32_t HCHINTMSK                 : 1;
    __IO uint32_t PTXFEMPMSK                : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t CONIDSTSCHNGMSK           : 1;
    __IO uint32_t DISCONNINTMSK             : 1;
    __IO uint32_t SESSREQINTMSK             : 1;
    __IO uint32_t WKUPINTMSK                : 1;
} stc_usf_gintmsk_field_t;

typedef struct
{
    __IO uint32_t CHNUM                     : 4;
    __IO uint32_t BCNT                      :11;
    __IO uint32_t DPID                      : 2;
    __IO uint32_t PKTSTS                    : 4;
    uint32_t RESERVED21                     : 3;
    __IO uint32_t RESV                      : 1;
} stc_usf_grxstsr_field_t;

typedef struct
{
    __IO uint32_t CHNUM                     : 4;
    __IO uint32_t BCNT                      :11;
    __IO uint32_t DPID                      : 2;
    __IO uint32_t PKTSTS                    : 4;
    uint32_t RESERVED21                     : 3;
    __IO uint32_t RESV                      : 1;
} stc_usf_grxstsp_field_t;

typedef struct
{
    __IO uint16_t RXFDEP                    :11;
} stc_usf_grxfsiz_field_t;

typedef struct
{
    __IO uint32_t NPTXFSTADDR               :16;
    __IO uint32_t NPTXFDEP                  :16;
} stc_usf_gnptxfsiz_field_t;

typedef struct
{
    __IO uint32_t NPTXFSPCAVAIL             :16;
    __IO uint32_t NPTXQSPCAVAIL             : 8;
    __IO uint32_t NPTXQTOP                  : 7;
} stc_usf_gnptxsts_field_t;

typedef struct
{
    __IO uint32_t REGDATA                   : 8;
    __IO uint32_t VCTRL                     : 8;
    __IO uint32_t REGADDR                   : 6;
    __IO uint32_t REGWR                     : 1;
    uint32_t RESERVED23                     : 2;
    __IO uint32_t NEWREGREQ                 : 1;
    __IO uint32_t VSTSBSY                   : 1;
    __IO uint32_t VSTSDONE                  : 1;
} stc_usf_gpvndctl_field_t;

typedef struct
{
    __IO uint32_t GPI                       :16;
    __IO uint32_t GPO                       :16;
} stc_usf_ggpio_field_t;

typedef struct
{
    __IO uint32_t OTGMODE                   : 3;
    __IO uint32_t OTGARCH                   : 2;
    __IO uint32_t SINGPNT                   : 1;
    __IO uint32_t HSPHYTYPE                 : 2;
    __IO uint32_t FSPHYTYPE                 : 2;
    __IO uint32_t NUMDEVEPS                 : 4;
    __IO uint32_t NUMHSTCHNL                : 4;
    __IO uint32_t PERIOSUPPORT              : 1;
    __IO uint32_t DYNFIFOSIZING             : 1;
    __IO uint32_t MULTIPROCINTRPT           : 1;
    uint32_t RESERVED21                     : 1;
    __IO uint32_t NPTXQDEPTH                : 2;
    __IO uint32_t PTXQDEPTH                 : 2;
    __IO uint32_t TKNQDEPTH                 : 5;
} stc_usf_ghwcfg2_field_t;

typedef struct
{
    __IO uint32_t XFERSIZEWIDTH             : 4;
    __IO uint32_t PKTSIZEWIDTH              : 3;
    __IO uint32_t OTGEN                     : 1;
    __IO uint32_t I2CINTSEL                 : 1;
    __IO uint32_t VNDCTLSUPT                : 1;
    __IO uint32_t OPTFEATURE                : 1;
    __IO uint32_t RSTTYPE                   : 1;
    __IO uint32_t ADPSUPPORT                : 1;
    __IO uint32_t HSICMODE                  : 1;
    __IO uint32_t BCSUPPORT                 : 1;
    __IO uint32_t LPMMODE                   : 1;
    __IO uint32_t DFIFODEPTH                :16;
} stc_usf_ghwcfg3_field_t;

typedef struct
{
    __IO uint32_t NUMDEVPERIOEPS            : 4;
    __IO uint32_t PARTIALPWRDN              : 1;
    __IO uint32_t AHBFREQ                   : 1;
    __IO uint32_t HIBERNATION               : 1;
    __IO uint32_t EXTENDEDHIBERNATION       : 1;
    uint32_t RESERVED8                      : 6;
    __IO uint32_t PHYDATAWIDTH              : 2;
    __IO uint32_t NUMCTLEPS                 : 4;
    __IO uint32_t IDDGFLTR                  : 1;
    __IO uint32_t VBUSVALIDFLTR             : 1;
    __IO uint32_t AVALIDFLTR                : 1;
    __IO uint32_t BVALIDFLTR                : 1;
    __IO uint32_t SESSENDFLTR               : 1;
    __IO uint32_t DEDFIFOMODE               : 1;
    __IO uint32_t INEPS                     : 4;
    __IO uint32_t DESCDMAENABLED            : 1;
    __IO uint32_t DESCDMA                   : 1;
} stc_usf_ghwcfg4_field_t;

typedef struct
{
    __IO uint32_t GDFIFOCFG                 :16;
    __IO uint32_t EPINFOBASEADDR            :16;
} stc_usf_gdfifocfg_field_t;

typedef struct
{
    __IO uint32_t PTXFSTADDR                :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t PTXFSIZE                  :11;
} stc_usf_hptxfsiz_field_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR            :11;
    uint32_t RESERVED11                     : 5;
    __IO uint32_t INEPNTXFDEP               :10;
} stc_usf_dieptxf1_field_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR            :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t INEPNTXFDEP               :10;
} stc_usf_dieptxf2_field_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR            :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t INEPNTXFDEP               :10;
} stc_usf_dieptxf3_field_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR            :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t INEPNTXFDEP               :10;
} stc_usf_dieptxf4_field_t;

typedef struct
{
    __IO uint32_t INEPNTXFSTADDR            :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t INEPNTXFDEP               :10;
} stc_usf_dieptxf5_field_t;

typedef struct
{
    __IO uint32_t FSLSPCLKSEL               : 2;
    __IO uint32_t FSLSSUPP                  : 1;
    uint32_t RESERVED3                      : 4;
    __IO uint32_t ENA32KHZS                 : 1;
    __IO uint32_t RESVALID                  : 8;
    uint32_t RESERVED16                     :15;
    __IO uint32_t MODECHTIMEN               : 1;
} stc_usf_hcfg_field_t;

typedef struct
{
    __IO uint32_t FRINT                     :16;
    __IO uint32_t HFIRRLDCTRL               : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
} stc_usf_hfir_field_t;

typedef struct
{
    __IO uint32_t FRNUM                     :16;
    __IO uint32_t FRREM                     :16;
} stc_usf_hfnum_field_t;

typedef struct
{
    __IO uint32_t PTXFSPCAVAIL              :16;
    __IO uint32_t PTXQSPCAVAIL              : 8;
    __IO uint32_t PTXQTOP                   : 8;
} stc_usf_hptxsts_field_t;

typedef struct
{
    __IO uint32_t PRTCONNSTS                : 1;
    __IO uint32_t PRTCONNDET                : 1;
    __IO uint32_t PRTENA                    : 1;
    __IO uint32_t PRTENCHNG                 : 1;
    __IO uint32_t PRTOVRCURRACT             : 1;
    __IO uint32_t PRTOVRCURRCHNG            : 1;
    __IO uint32_t PRTRES                    : 1;
    __IO uint32_t PRTSUSP                   : 1;
    __IO uint32_t PRTRST                    : 1;
    uint32_t RESERVED9                      : 1;
    __IO uint32_t PRTLNSTS                  : 2;
    __IO uint32_t PRTPWR                    : 1;
    __IO uint32_t PRTTSTCTL                 : 4;
    __IO uint32_t PRTSPD                    : 2;
    uint32_t RESERVED19                     : 5;
    __IO uint32_t RESV                      : 1;
} stc_usf_hprt_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar0_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt0_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint0_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk0_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz0_field_t;

