RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar1_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt1_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint1_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk1_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz1_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar2_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt2_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint2_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk2_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz2_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar3_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt3_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint3_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk3_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz3_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar4_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt4_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint4_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk4_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz4_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar5_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt5_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint5_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk5_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz5_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar6_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt6_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint6_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk6_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz6_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar7_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt7_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint7_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk7_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz7_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar8_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt8_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint8_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk8_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz8_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar9_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt9_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint9_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk9_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz9_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar10_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt10_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint10_field_t;

