RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk10_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz10_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSPDDEV                   : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t EC                        : 2;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usf_hcchar11_field_t;

typedef struct
{
    __IO uint32_t PRTADDR                   : 7;
    __IO uint32_t HUBADDR                   : 7;
    __IO uint32_t XACTPOS                   : 2;
    __IO uint32_t COMPSPLT                  : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t SPLTENA                   : 1;
} stc_usf_hcsplt11_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t CHHLTD                    : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t STALL                     : 1;
    __IO uint16_t NAK                       : 1;
    __IO uint16_t ACK                       : 1;
    __IO uint16_t NYET                      : 1;
    __IO uint16_t XACTERR                   : 1;
    __IO uint16_t BBLERR                    : 1;
    __IO uint16_t FRMOVRUN                  : 1;
    __IO uint16_t DATATGLERR                : 1;
} stc_usf_hcint11_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t CHHLTDMSK                 : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t STALLMSK                  : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t ACKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
    __IO uint16_t XACTERRMSK                : 1;
    __IO uint16_t BBLERRMSK                 : 1;
    __IO uint16_t FRMOVRUNMSK               : 1;
    __IO uint16_t DATATGLERRMSK             : 1;
} stc_usf_hcintmsk11_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t PID                       : 2;
    __IO uint32_t DOPNG                     : 1;
} stc_usf_hctsiz11_field_t;

typedef struct
{
    __IO uint32_t DEVSPD                    : 2;
    __IO uint32_t NZSTSOUTHSHK              : 1;
    __IO uint32_t ENA32KHZSUSP              : 1;
    __IO uint32_t DEVADDR                   : 7;
    __IO uint32_t PERFRINT                  : 2;
    __IO uint32_t ENDEVOUTNAK               : 1;
    __IO uint32_t XCVRDLY                   : 1;
    __IO uint32_t ERRATICINTMSK             : 1;
    uint32_t RESERVED16                     : 8;
    __IO uint32_t PERSCHINTVL               : 2;
} stc_usf_dcfg_field_t;

typedef struct
{
    __IO uint32_t RMTWKUPSIG                : 1;
    __IO uint32_t SFTDISCON                 : 1;
    __IO uint32_t GNPINNAKSTS               : 1;
    __IO uint32_t GOUTNAKSTS                : 1;
    __IO uint32_t TSTCTL                    : 3;
    __IO uint32_t SGNPINNAK                 : 1;
    __IO uint32_t CGNPINNAK                 : 1;
    __IO uint32_t SGOUTNAK                  : 1;
    __IO uint32_t CGOUTNAK                  : 1;
    __IO uint32_t PWRONPRGDONE              : 1;
    uint32_t RESERVED12                     : 3;
    __IO uint32_t IGNRFRMNUM                : 1;
    __IO uint32_t NAKONBBLE                 : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
} stc_usf_dctl_field_t;

typedef struct
{
    __IO uint32_t SUSPSTS                   : 1;
    __IO uint32_t ENUMSPD                   : 2;
    __IO uint32_t ERRTICERR                 : 1;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t SOFFN                     :14;
    __IO uint32_t DEVLNSTS                  : 2;
    __IO uint32_t RESV                      : 1;
} stc_usf_dsts_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t EPDISBLDMSK               : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t TIMEOUTMSK                : 1;
    __IO uint16_t INTKNTXFEMPMSK            : 1;
    __IO uint16_t INTKNEPMISMSK             : 1;
    __IO uint16_t INEPNAKEFFMSK             : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t TXFIFOUNDRNMSK            : 1;
    uint16_t RESERVED9                      : 4;
    __IO uint16_t NAKMSK                    : 1;
} stc_usf_diepmsk_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPLMSK              : 1;
    __IO uint16_t EPDISBLDMSK               : 1;
    __IO uint16_t AHBERRMSK                 : 1;
    __IO uint16_t SETUPMSK                  : 1;
    __IO uint16_t OUTTKNEPDISMSK            : 1;
    __IO uint16_t STSPHSERCVDMSK            : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERRMSK              : 1;
    uint16_t RESERVED9                      : 3;
    __IO uint16_t BBLEERRMSK                : 1;
    __IO uint16_t NAKMSK                    : 1;
    __IO uint16_t NYETMSK                   : 1;
} stc_usf_doepmsk_field_t;

typedef struct
{
    __IO uint32_t INEPINT0                  : 1;
    __IO uint32_t INEPINT1                  : 1;
    __IO uint32_t INEPINT2                  : 1;
    __IO uint32_t INEPINT3                  : 1;
    __IO uint32_t INEPINT4                  : 1;
    __IO uint32_t INEPINT5                  : 1;
    __IO uint32_t INEPINT6                  : 1;
    __IO uint32_t INEPINT7                  : 1;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t OUTEPINT0                 : 1;
    __IO uint32_t OUTEPINT1                 : 1;
    __IO uint32_t OUTEPINT2                 : 1;
    __IO uint32_t OUTEPINT3                 : 1;
    __IO uint32_t OUTEPINT4                 : 1;
    __IO uint32_t OUTEPINT5                 : 1;
    __IO uint32_t OUTEPINT6                 : 1;
    __IO uint32_t OUTEPINT7                 : 1;
    __IO uint32_t RESV                      : 1;
} stc_usf_daint_field_t;

typedef struct
{
    __IO uint32_t INEPMSK0                  : 1;
    __IO uint32_t INEPMSK1                  : 1;
    __IO uint32_t INEPMSK2                  : 1;
    __IO uint32_t INEPMSK3                  : 1;
    __IO uint32_t INEPMSK4                  : 1;
    __IO uint32_t INEPMSK5                  : 1;
    __IO uint32_t INEPMSK6                  : 1;
    __IO uint32_t INEPMSK7                  : 1;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t OUTEPMSK0                 : 1;
    __IO uint32_t OUTEPMSK1                 : 1;
    __IO uint32_t OUTEPMSK2                 : 1;
    __IO uint32_t OUTEPMSK3                 : 1;
    __IO uint32_t OUTEPMSK4                 : 1;
    __IO uint32_t OUTEPMSK5                 : 1;
    __IO uint32_t OUTEPMSK6                 : 1;
    __IO uint32_t OUTEPMSK7                 : 1;
    __IO uint32_t RESV                      : 1;
} stc_usf_daintmsk_field_t;

typedef struct
{
    __IO uint16_t DVBUSPULSE                :12;
} stc_usf_dvbuspulse_field_t;

typedef struct
{
    __IO uint32_t NONISOTHREN               : 1;
    __IO uint32_t ISOTHREN                  : 1;
    __IO uint32_t TXTHRLEN                  : 9;
    __IO uint32_t AHBTHRRATIO               : 2;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t RXTHREN                   : 1;
    __IO uint32_t RXTHRLEN                  : 9;
    uint32_t RESERVED26                     : 1;
    __IO uint32_t ARBPRKEN                  : 1;
} stc_usf_dthrctl_field_t;

typedef struct
{
    __IO uint32_t MPS                       : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBACTEP                  : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    uint32_t RESERVED28                     : 2;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usf_diepctl0_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t TIMEOUT                   : 1;
    __IO uint16_t INTKNTXFEMP               : 1;
    __IO uint16_t INTKNEPMIS                : 1;
    __IO uint16_t INEPNAKEFF                : 1;
    __IO uint16_t TXFEMP                    : 1;
    __IO uint16_t TXFIFOUNDRN               : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
} stc_usf_diepint0_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  : 7;
    uint32_t RESERVED7                      :12;
    __IO uint32_t PKTCNT                    : 2;
    uint32_t RESERVED21                     : 3;
    __IO uint32_t RESV                      : 1;
} stc_usf_dieptsiz0_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usf_diepctl1_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t TIMEOUT                   : 1;
    __IO uint16_t INTKNTXFEMP               : 1;
    __IO uint16_t INTKNEPMIS                : 1;
    __IO uint16_t INEPNAKEFF                : 1;
    __IO uint16_t TXFEMP                    : 1;
    __IO uint16_t TXFIFOUNDRN               : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
} stc_usf_diepint1_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_usf_dieptsiz1_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usf_diepctl2_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t TIMEOUT                   : 1;
    __IO uint16_t INTKNTXFEMP               : 1;
    __IO uint16_t INTKNEPMIS                : 1;
    __IO uint16_t INEPNAKEFF                : 1;
    __IO uint16_t TXFEMP                    : 1;
    __IO uint16_t TXFIFOUNDRN               : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
} stc_usf_diepint2_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_usf_dieptsiz2_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usf_diepctl3_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t TIMEOUT                   : 1;
    __IO uint16_t INTKNTXFEMP               : 1;
    __IO uint16_t INTKNEPMIS                : 1;
    __IO uint16_t INEPNAKEFF                : 1;
    __IO uint16_t TXFEMP                    : 1;
    __IO uint16_t TXFIFOUNDRN               : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
} stc_usf_diepint3_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_usf_dieptsiz3_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usf_diepctl4_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t TIMEOUT                   : 1;
    __IO uint16_t INTKNTXFEMP               : 1;
    __IO uint16_t INTKNEPMIS                : 1;
    __IO uint16_t INEPNAKEFF                : 1;
    __IO uint16_t TXFEMP                    : 1;
    __IO uint16_t TXFIFOUNDRN               : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
} stc_usf_diepint4_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_usf_dieptsiz4_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usf_diepctl5_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t TIMEOUT                   : 1;
    __IO uint16_t INTKNTXFEMP               : 1;
    __IO uint16_t INTKNEPMIS                : 1;
    __IO uint16_t INEPNAKEFF                : 1;
    __IO uint16_t TXFEMP                    : 1;
    __IO uint16_t TXFIFOUNDRN               : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
} stc_usf_diepint5_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_usf_dieptsiz5_field_t;

typedef struct
{
    __IO uint32_t MPS                       : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBACTEP                  : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    uint32_t RESERVED28                     : 2;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usf_doepctl0_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t SETUP                     : 1;
    __IO uint16_t OUTTKNEPDIS               : 1;
    __IO uint16_t STSPHSERCVD               : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERR                 : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
    __IO uint16_t STUPPKTRCVD               : 1;
} stc_usf_doepint0_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  : 7;
    uint32_t RESERVED7                      :12;
    __IO uint32_t PKTCNT                    : 1;
    uint32_t RESERVED20                     : 4;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 4;
    __IO uint32_t SUPCNT                    : 2;
} stc_usf_doeptsiz0_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usf_doepctl1_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t SETUP                     : 1;
    __IO uint16_t OUTTKNEPDIS               : 1;
    __IO uint16_t STSPHSERCVD               : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERR                 : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
    __IO uint16_t STUPPKTRCVD               : 1;
} stc_usf_doepint1_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t RXDPID                    : 2;
} stc_usf_doeptsiz1_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usf_doepctl2_field_t;

