RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_diepctl4_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t TIMEOUT                   : 1;
    __IO uint16_t INTKNTXFEMP               : 1;
    __IO uint16_t INTKNEPMIS                : 1;
    __IO uint16_t INEPNAKEFF                : 1;
    __IO uint16_t TXFEMP                    : 1;
    __IO uint16_t TXFIFOUNDRN               : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
} stc_ush_diepint4_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_ush_dieptsiz4_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_diepctl5_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t TIMEOUT                   : 1;
    __IO uint16_t INTKNTXFEMP               : 1;
    __IO uint16_t INTKNEPMIS                : 1;
    __IO uint16_t INEPNAKEFF                : 1;
    __IO uint16_t TXFEMP                    : 1;
    __IO uint16_t TXFIFOUNDRN               : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
} stc_ush_diepint5_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_ush_dieptsiz5_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_diepctl6_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t TIMEOUT                   : 1;
    __IO uint16_t INTKNTXFEMP               : 1;
    __IO uint16_t INTKNEPMIS                : 1;
    __IO uint16_t INEPNAKEFF                : 1;
    __IO uint16_t TXFEMP                    : 1;
    __IO uint16_t TXFIFOUNDRN               : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
} stc_ush_diepint6_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_ush_dieptsiz6_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_diepctl7_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t TIMEOUT                   : 1;
    __IO uint16_t INTKNTXFEMP               : 1;
    __IO uint16_t INTKNEPMIS                : 1;
    __IO uint16_t INEPNAKEFF                : 1;
    __IO uint16_t TXFEMP                    : 1;
    __IO uint16_t TXFIFOUNDRN               : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
} stc_ush_diepint7_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t MC                        : 2;
} stc_ush_dieptsiz7_field_t;

typedef struct
{
    __IO uint32_t MPS                       : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBACTEP                  : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    uint32_t RESERVED28                     : 2;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_doepctl0_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t SETUP                     : 1;
    __IO uint16_t OUTTKNEPDIS               : 1;
    __IO uint16_t STSPHSERCVD               : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERR                 : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
    __IO uint16_t STUPPKTRCVD               : 1;
} stc_ush_doepint0_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  : 7;
    uint32_t RESERVED7                      :12;
    __IO uint32_t PKTCNT                    : 1;
    uint32_t RESERVED20                     : 9;
    __IO uint32_t SUPCNT                    : 2;
} stc_ush_doeptsiz0_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_doepctl1_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t SETUP                     : 1;
    __IO uint16_t OUTTKNEPDIS               : 1;
    __IO uint16_t STSPHSERCVD               : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERR                 : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
    __IO uint16_t STUPPKTRCVD               : 1;
} stc_ush_doepint1_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t RXDPID                    : 2;
} stc_ush_doeptsiz1_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_doepctl2_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t SETUP                     : 1;
    __IO uint16_t OUTTKNEPDIS               : 1;
    __IO uint16_t STSPHSERCVD               : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERR                 : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
    __IO uint16_t STUPPKTRCVD               : 1;
} stc_ush_doepint2_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t RXDPID                    : 2;
} stc_ush_doeptsiz2_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_doepctl3_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t SETUP                     : 1;
    __IO uint16_t OUTTKNEPDIS               : 1;
    __IO uint16_t STSPHSERCVD               : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERR                 : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
    __IO uint16_t STUPPKTRCVD               : 1;
} stc_ush_doepint3_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t RXDPID                    : 2;
} stc_ush_doeptsiz3_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_doepctl4_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t SETUP                     : 1;
    __IO uint16_t OUTTKNEPDIS               : 1;
    __IO uint16_t STSPHSERCVD               : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERR                 : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
    __IO uint16_t STUPPKTRCVD               : 1;
} stc_ush_doepint4_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t RXDPID                    : 2;
} stc_ush_doeptsiz4_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_doepctl5_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t SETUP                     : 1;
    __IO uint16_t OUTTKNEPDIS               : 1;
    __IO uint16_t STSPHSERCVD               : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERR                 : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
    __IO uint16_t STUPPKTRCVD               : 1;
} stc_ush_doepint5_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t RXDPID                    : 2;
} stc_ush_doeptsiz5_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_doepctl6_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t SETUP                     : 1;
    __IO uint16_t OUTTKNEPDIS               : 1;
    __IO uint16_t STSPHSERCVD               : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERR                 : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
    __IO uint16_t STUPPKTRCVD               : 1;
} stc_ush_doepint6_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t RXDPID                    : 2;
} stc_ush_doeptsiz6_field_t;

typedef struct
{
    __IO uint32_t MPS                       :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBACTEP                  : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYPE                    : 2;
    __IO uint32_t SNP                       : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SETD0PID                  : 1;
    __IO uint32_t SETD1PID                  : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_ush_doepctl7_field_t;

typedef struct
{
    __IO uint16_t XFERCOMPL                 : 1;
    __IO uint16_t EPDISBLD                  : 1;
    __IO uint16_t AHBERR                    : 1;
    __IO uint16_t SETUP                     : 1;
    __IO uint16_t OUTTKNEPDIS               : 1;
    __IO uint16_t STSPHSERCVD               : 1;
    __IO uint16_t BACK2BACKSETUP            : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t OUTPKTERR                 : 1;
    __IO uint16_t BNAINTR                   : 1;
    uint16_t RESERVED10                     : 1;
    __IO uint16_t PKTDRPSTS                 : 1;
    __IO uint16_t BBLEERR                   : 1;
    __IO uint16_t NAKINTRPT                 : 1;
    __IO uint16_t NYETINTRPT                : 1;
    __IO uint16_t STUPPKTRCVD               : 1;
} stc_ush_doepint7_field_t;

typedef struct
{
    __IO uint32_t XFERSIZE                  :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t RXDPID                    : 2;
} stc_ush_doeptsiz7_field_t;

typedef struct
{
    __IO uint16_t STOPPCLK                  : 1;
    __IO uint16_t GATEHCLK                  : 1;
    __IO uint16_t PWRCLMP                   : 1;
    __IO uint16_t RSTPDWNMODULE             : 1;
    uint16_t RESERVED4                      : 2;
    __IO uint16_t PHYSLEEP                  : 1;
    __IO uint16_t L1SUSPENDED               : 1;
    __IO uint16_t RESETAFTERSUSP            : 1;
} stc_ush_pcgcctl_field_t;

typedef struct
{
    __IO uint8_t XTAL32STP                  : 1;
} stc_vbat_cmu_xtal32cr_field_t;

typedef struct
{
    __IO uint8_t XTAL32DRV                  : 2;
    __IO uint8_t XTAL32SUPDRV               : 1;
} stc_vbat_cmu_xtal32cfgr_field_t;

typedef struct
{
    __IO uint8_t XTAL32NF                   : 2;
} stc_vbat_cmu_xtal32nfr_field_t;

typedef struct
{
    __IO uint8_t LRCSTP                     : 1;
} stc_vbat_cmu_lrccr_field_t;

typedef struct
{
    __IO uint8_t RTCLRCSTP                  : 1;
} stc_vbat_cmu_rtclrccr_field_t;

typedef struct
{
    __IO uint8_t RAMPWDN                    : 1;
    __IO uint8_t RAMVALID                   : 1;
    __IO uint8_t RAMPDFLG                   : 1;
} stc_vbat_bramc0_field_t;

typedef struct
{
    __IO uint32_t PERI                      : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t CKS                       : 4;
    __IO uint32_t WDPT                      : 4;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t SLPOFF                    : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t RESV                      : 1;
    uint32_t RESERVED25                     : 6;
    __IO uint32_t ITS                       : 1;
} stc_wdt_cr_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
    __IO uint32_t UDF                       : 1;
    __IO uint32_t REF                       : 1;
    uint32_t RESERVED18                     : 6;
    __IO uint32_t RESV                      : 1;
} stc_wdt_sr_field_t;


