RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    union
    {
        __IO uint8_t STR;
        stc_adc_str_field_t STR_f;
    };
    uint8_t RESERVED1[1];
    union
    {
        __IO uint16_t CR0;
        stc_adc_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint16_t CR1;
        stc_adc_cr1_field_t CR1_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint16_t TRGSR;
        stc_adc_trgsr_field_t TRGSR_f;
    };
    union
    {
        __IO uint8_t CHSELRA;
        stc_adc_chselra_field_t CHSELRA_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t CHSELRB;
        stc_adc_chselrb_field_t CHSELRB_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t AVCHSELR;
        stc_adc_avchselr_field_t AVCHSELR_f;
    };
    uint8_t RESERVED7[5];
    union
    {
        __IO uint16_t SHCR;
        stc_adc_shcr_field_t SHCR_f;
    };
    uint8_t RESERVED8[4];
    __IO uint8_t SSTR0;
    __IO uint8_t SSTR1;
    __IO uint8_t SSTR2;
    __IO uint8_t SSTR3;
    __IO uint8_t SSTR4;
    uint8_t RESERVED13[33];
    union
    {
        __IO uint16_t ISCR;
        stc_adc_iscr_field_t ISCR_f;
    };
    uint8_t RESERVED14[8];
    __IO uint16_t DR0;
    __IO uint16_t DR1;
    __IO uint16_t DR2;
    __IO uint16_t DR3;
    __IO uint16_t DR4;
    uint8_t RESERVED19[70];
    union
    {
        __IO uint16_t AWDCR;
        stc_adc_awdcr_field_t AWDCR_f;
    };
    uint8_t RESERVED20[2];
    __IO uint16_t AWDDR0;
    __IO uint16_t AWDDR1;
    union
    {
        __IO uint8_t AWDCNDSR;
        stc_adc_awdcndsr_field_t AWDCNDSR_f;
    };
    uint8_t RESERVED23[3];
    union
    {
        __IO uint8_t AWDCHSR;
        stc_adc_awdchsr_field_t AWDCHSR_f;
    };
    uint8_t RESERVED24[3];
    union
    {
        __IO uint8_t AWDSR;
        stc_adc_awdsr_field_t AWDSR_f;
    };
    uint8_t RESERVED25[15];
    union
    {
        __IO uint16_t PGACR;
        stc_adc_pgacr_field_t PGACR_f;
    };
    union
    {
        __IO uint16_t PGAGSR;
        stc_adc_pgagsr_field_t PGAGSR_f;
    };
}M4_ADC_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t STR;
        stc_adc2_str_field_t STR_f;
    };
    uint8_t RESERVED1[1];
    union
    {
        __IO uint16_t CR0;
        stc_adc2_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint16_t CR1;
        stc_adc2_cr1_field_t CR1_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint16_t TRGSR;
        stc_adc2_trgsr_field_t TRGSR_f;
    };
    union
    {
        __IO uint16_t CHSELRA;
        stc_adc2_chselra_field_t CHSELRA_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint16_t CHSELRB;
        stc_adc2_chselrb_field_t CHSELRB_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t AVCHSELR;
        stc_adc2_avchselr_field_t AVCHSELR_f;
    };
    uint8_t RESERVED7[10];
    __IO uint8_t SSTR0;
    __IO uint8_t SSTR1;
    __IO uint8_t SSTR2;
    __IO uint8_t SSTR3;
    __IO uint8_t SSTR4;
    __IO uint8_t SSTR5;
    __IO uint8_t SSTR6;
    __IO uint8_t SSTR7;
    __IO uint8_t SSTR8;
    __IO uint8_t SSTR9;
    __IO uint8_t SSTR10;
    __IO uint8_t SSTR11;
    uint8_t RESERVED19[26];
    union
    {
        __IO uint16_t ISCR;
        stc_adc2_iscr_field_t ISCR_f;
    };
    uint8_t RESERVED20[8];
    __IO uint16_t DR0;
    __IO uint16_t DR1;
    __IO uint16_t DR2;
    __IO uint16_t DR3;
    __IO uint16_t DR4;
    __IO uint16_t DR5;
    __IO uint16_t DR6;
    __IO uint16_t DR7;
    __IO uint16_t DR8;
    __IO uint16_t DR9;
    __IO uint16_t DR10;
    __IO uint16_t DR11;
    uint8_t RESERVED32[56];
    union
    {
        __IO uint16_t AWDCR;
        stc_adc2_awdcr_field_t AWDCR_f;
    };
    uint8_t RESERVED33[2];
    __IO uint16_t AWDDR0;
    __IO uint16_t AWDDR1;
    union
    {
        __IO uint16_t AWDCNDSR;
        stc_adc2_awdcndsr_field_t AWDCNDSR_f;
    };
    uint8_t RESERVED36[2];
    union
    {
        __IO uint16_t AWDCHSR;
        stc_adc2_awdchsr_field_t AWDCHSR_f;
    };
    uint8_t RESERVED37[2];
    union
    {
        __IO uint16_t AWDSR;
        stc_adc2_awdsr_field_t AWDSR_f;
    };
}M4_ADC2_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CR;
        stc_aes_cr_field_t CR_f;
    };
    uint8_t RESERVED1[14];
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t KR0;
    __IO uint32_t KR1;
    __IO uint32_t KR2;
    __IO uint32_t KR3;
    __IO uint32_t KR4;
    __IO uint32_t KR5;
    __IO uint32_t KR6;
    __IO uint32_t KR7;
    __IO uint32_t RR0;
    __IO uint32_t RR1;
}M4_AES_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t INTSFTTRG;
        stc_aos_intsfttrg_field_t INTSFTTRG_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint16_t ADC0_ITRGSELR0;
        stc_aos_adc0_itrgselr0_field_t ADC0_ITRGSELR0_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint16_t ADC0_ITRGSELR1;
        stc_aos_adc0_itrgselr1_field_t ADC0_ITRGSELR1_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t ADC1_ITRGSELR0;
        stc_aos_adc1_itrgselr0_field_t ADC1_ITRGSELR0_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t ADC1_ITRGSELR1;
        stc_aos_adc1_itrgselr1_field_t ADC1_ITRGSELR1_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint16_t ADC2_ITRGSELR0;
        stc_aos_adc2_itrgselr0_field_t ADC2_ITRGSELR0_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t ADC2_ITRGSELR1;
        stc_aos_adc2_itrgselr1_field_t ADC2_ITRGSELR1_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint16_t TMR0_HTSSR;
        stc_aos_tmr0_htssr_field_t TMR0_HTSSR_f;
    };
    uint8_t RESERVED8[2];
    union
    {
        __IO uint16_t TMR2_HTSSR;
        stc_aos_tmr2_htssr_field_t TMR2_HTSSR_f;
    };
    uint8_t RESERVED9[2];
    union
    {
        __IO uint16_t PEVNTTRGSR1;
        stc_aos_pevnttrgsr1_field_t PEVNTTRGSR1_f;
    };
    uint8_t RESERVED10[2];
    union
    {
        __IO uint16_t PEVNTTRGSR2;
        stc_aos_pevnttrgsr2_field_t PEVNTTRGSR2_f;
    };
    uint8_t RESERVED11[2];
    union
    {
        __IO uint16_t PEVNTTRGSR3;
        stc_aos_pevnttrgsr3_field_t PEVNTTRGSR3_f;
    };
    uint8_t RESERVED12[2];
    union
    {
        __IO uint16_t PEVNTTRGSR4;
        stc_aos_pevnttrgsr4_field_t PEVNTTRGSR4_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint16_t TMR6_HTSSR0;
        stc_aos_tmr6_htssr0_field_t TMR6_HTSSR0_f;
    };
    uint8_t RESERVED14[2];
    union
    {
        __IO uint16_t TMR6_HTSSR1;
        stc_aos_tmr6_htssr1_field_t TMR6_HTSSR1_f;
    };
    uint8_t RESERVED15[2];
    union
    {
        __IO uint16_t TMR6_HTSSR2;
        stc_aos_tmr6_htssr2_field_t TMR6_HTSSR2_f;
    };
    uint8_t RESERVED16[2];
    union
    {
        __IO uint16_t TMR6_HTSSR3;
        stc_aos_tmr6_htssr3_field_t TMR6_HTSSR3_f;
    };
    uint8_t RESERVED17[2];
    union
    {
        __IO uint16_t DCU0_TRGSEL;
        stc_aos_dcu0_trgsel_field_t DCU0_TRGSEL_f;
    };
    uint8_t RESERVED18[2];
    union
    {
        __IO uint16_t DCU1_TRGSEL;
        stc_aos_dcu1_trgsel_field_t DCU1_TRGSEL_f;
    };
    uint8_t RESERVED19[2];
    union
    {
        __IO uint16_t DCU2_TRGSEL;
        stc_aos_dcu2_trgsel_field_t DCU2_TRGSEL_f;
    };
    uint8_t RESERVED20[2];
    union
    {
        __IO uint16_t DCU3_TRGSEL;
        stc_aos_dcu3_trgsel_field_t DCU3_TRGSEL_f;
    };
    uint8_t RESERVED21[2];
    union
    {
        __IO uint16_t DMA_TRGSEL0;
        stc_aos_dma_trgsel0_field_t DMA_TRGSEL0_f;
    };
    uint8_t RESERVED22[2];
    union
    {
        __IO uint16_t DMA_TRGSEL1;
        stc_aos_dma_trgsel1_field_t DMA_TRGSEL1_f;
    };
    uint8_t RESERVED23[2];
    union
    {
        __IO uint16_t DMA_TRGSEL2;
        stc_aos_dma_trgsel2_field_t DMA_TRGSEL2_f;
    };
    uint8_t RESERVED24[2];
    union
    {
        __IO uint16_t DMA_TRGSEL3;
        stc_aos_dma_trgsel3_field_t DMA_TRGSEL3_f;
    };
    uint8_t RESERVED25[2];
    union
    {
        __IO uint16_t DMA_TRGSEL4;
        stc_aos_dma_trgsel4_field_t DMA_TRGSEL4_f;
    };
    uint8_t RESERVED26[2];
    union
    {
        __IO uint16_t DMA_TRGSEL5;
        stc_aos_dma_trgsel5_field_t DMA_TRGSEL5_f;
    };
    uint8_t RESERVED27[2];
    union
    {
        __IO uint32_t DMA_TRGSEL6;
        stc_aos_dma_trgsel6_field_t DMA_TRGSEL6_f;
    };
    union
    {
        __IO uint32_t DMA_TRGSEL7;
        stc_aos_dma_trgsel7_field_t DMA_TRGSEL7_f;
    };
    union
    {
        __IO uint32_t COMTRG1;
        stc_aos_comtrg1_field_t COMTRG1_f;
    };
    union
    {
        __IO uint32_t COMTRG2;
        stc_aos_comtrg2_field_t COMTRG2_f;
    };
    uint8_t RESERVED31[132];
    __IO uint16_t PEVNTDIRR1;
    uint8_t RESERVED32[2];
    __IO uint16_t PEVNTIDR1;
    uint8_t RESERVED33[2];
    __IO uint16_t PEVNTODR1;
    uint8_t RESERVED34[2];
    __IO uint16_t PEVNTORR1;
    uint8_t RESERVED35[2];
    __IO uint16_t PEVNTOSR1;
    uint8_t RESERVED36[2];
    __IO uint16_t PEVNTRISR1;
    uint8_t RESERVED37[2];
    __IO uint16_t PEVNTFAL1;
    uint8_t RESERVED38[2];
    __IO uint16_t PEVNTDIRR2;
    uint8_t RESERVED39[2];
    __IO uint16_t PEVNTIDR2;
    uint8_t RESERVED40[2];
    __IO uint16_t PEVNTODR2;
    uint8_t RESERVED41[2];
    __IO uint16_t PEVNTORR2;
    uint8_t RESERVED42[2];
    __IO uint16_t PEVNTOSR2;
    uint8_t RESERVED43[2];
    __IO uint16_t PEVNTRISR2;
    uint8_t RESERVED44[2];
    __IO uint16_t PEVNTFAL2;
    uint8_t RESERVED45[2];
    __IO uint16_t PEVNTDIRR3;
    uint8_t RESERVED46[2];
    __IO uint16_t PEVNTIDR3;
    uint8_t RESERVED47[2];
    __IO uint16_t PEVNTODR3;
    uint8_t RESERVED48[2];
    __IO uint16_t PEVNTORR3;
    uint8_t RESERVED49[2];
    __IO uint16_t PEVNTOSR3;
    uint8_t RESERVED50[2];
    __IO uint16_t PEVNTRISR3;
    uint8_t RESERVED51[2];
    __IO uint16_t PEVNTFAL3;
    uint8_t RESERVED52[2];
    __IO uint16_t PEVNTDIRR4;
    uint8_t RESERVED53[2];
    __IO uint16_t PEVNTIDR4;
    uint8_t RESERVED54[2];
    __IO uint16_t PEVNTODR4;
    uint8_t RESERVED55[2];
    __IO uint16_t PEVNTORR4;
    uint8_t RESERVED56[2];
    __IO uint16_t PEVNTOSR4;
    uint8_t RESERVED57[2];
    __IO uint16_t PEVNTRISR4;
    uint8_t RESERVED58[2];
    __IO uint16_t PEVNTFAL4;
    uint8_t RESERVED59[2];
    union
    {
        __IO uint32_t PEVNTNFCR;
        stc_aos_pevntnfcr_field_t PEVNTNFCR_f;
    };
}M4_AOS_TypeDef;

typedef struct
{
    __IO uint32_t RBUF_0;
    __IO uint32_t RBUF_1;
    __IO uint32_t RBUF_2;
    __IO uint32_t RBUF_3;
    uint8_t RESERVED4[64];
    __IO uint32_t TBUF_0;
    __IO uint32_t TBUF_1;
    __IO uint32_t TBUF_2;
    __IO uint32_t TBUF_3;
    uint8_t RESERVED8[64];
    union
    {
        __IO uint8_t CFG_STAT;
        stc_can_0_cfg_stat_field_t CFG_STAT_f;
    };
    union
    {
        __IO uint8_t TCMD;
        stc_can_0_tcmd_field_t TCMD_f;
    };
    union
    {
        __IO uint8_t TCTRL;
        stc_can_0_tctrl_field_t TCTRL_f;
    };
    union
    {
        __IO uint8_t RCTRL;
        stc_can_0_rctrl_field_t RCTRL_f;
    };
    union
    {
        __IO uint8_t RTIE;
        stc_can_0_rtie_field_t RTIE_f;
    };
    union
    {
        __IO uint8_t RTIF;
        stc_can_0_rtif_field_t RTIF_f;
    };
    union
    {
        __IO uint8_t ERRINT;
        stc_can_0_errint_field_t ERRINT_f;
    };
    union
    {
        __IO uint8_t LIMIT;
        stc_can_0_limit_field_t LIMIT_f;
    };
    union
    {
        __IO uint32_t S_SEG;
        stc_can_0_s_seg_field_t S_SEG_f;
    };
    uint8_t RESERVED17[4];
    union
    {
        __IO uint8_t EALCAP;
        stc_can_0_ealcap_field_t EALCAP_f;
    };
    union
    {
        __IO uint8_t TDC;
        stc_can_0_tdc_field_t TDC_f;
    };
    __IO uint8_t RECNT;
    __IO uint8_t TECNT;
    union
    {
        __IO uint8_t ACFCTRL;
        stc_can_0_acfctrl_field_t ACFCTRL_f;
    };
    uint8_t RESERVED22[1];
    union
    {
        __IO uint8_t ACF_EN_0;
        stc_can_0_acf_en_0_field_t ACF_EN_0_f;
    };
    uint8_t RESERVED23[1];
    union
    {
        __IO uint32_t ACF_0;
        stc_can_0_acf_0_field_t ACF_0_f;
    };
    __IO uint16_t VER;
    union
    {
        __IO uint8_t TBSLOT;
        stc_can_0_tbslot_field_t TBSLOT_f;
    };
    union
    {
        __IO uint8_t TTCFG;
        stc_can_0_ttcfg_field_t TTCFG_f;
    };
    __IO uint32_t REF_MSG;
    union
    {
        __IO uint16_t TRG_CFG;
        stc_can_0_trg_cfg_field_t TRG_CFG_f;
    };
    __IO uint16_t TT_TRIG;
    __IO uint16_t TT_WTRIG;
}M4_CAN_0_TypeDef;

typedef struct
{
    __IO uint32_t RBUF_0;
    __IO uint32_t RBUF_1;
    __IO uint32_t RBUF_2;
    __IO uint32_t RBUF_3;
    uint8_t RESERVED4[64];
    __IO uint32_t TBUF_0;
    __IO uint32_t TBUF_1;
    __IO uint32_t TBUF_2;
    __IO uint32_t TBUF_3;
    uint8_t RESERVED8[64];
    union
    {
        __IO uint8_t CFG_STAT;
        stc_can_1_cfg_stat_field_t CFG_STAT_f;
    };
    union
    {
        __IO uint8_t TCMD;
        stc_can_1_tcmd_field_t TCMD_f;
    };
    union
    {
        __IO uint8_t TCTRL;
        stc_can_1_tctrl_field_t TCTRL_f;
    };
    union
    {
        __IO uint8_t RCTRL;
        stc_can_1_rctrl_field_t RCTRL_f;
    };
    union
    {
        __IO uint8_t RTIE;
        stc_can_1_rtie_field_t RTIE_f;
    };
    union
    {
        __IO uint8_t RTIF;
        stc_can_1_rtif_field_t RTIF_f;
    };
    union
    {
        __IO uint8_t ERRINT;
        stc_can_1_errint_field_t ERRINT_f;
    };
    union
    {
        __IO uint8_t LIMIT;
        stc_can_1_limit_field_t LIMIT_f;
    };
    union
    {
        __IO uint32_t S_SEG;
        stc_can_1_s_seg_field_t S_SEG_f;
    };
    uint8_t RESERVED17[4];
    union
    {
        __IO uint8_t EALCAP;
        stc_can_1_ealcap_field_t EALCAP_f;
    };
    union
    {
        __IO uint8_t TDC;
        stc_can_1_tdc_field_t TDC_f;
    };
    __IO uint8_t RECNT;
    __IO uint8_t TECNT;
    union
    {
        __IO uint8_t ACFCTRL;
        stc_can_1_acfctrl_field_t ACFCTRL_f;
    };
    uint8_t RESERVED22[1];
    union
    {
        __IO uint8_t ACF_EN_0;
        stc_can_1_acf_en_0_field_t ACF_EN_0_f;
    };
    uint8_t RESERVED23[1];
    union
    {
        __IO uint32_t ACF_0;
        stc_can_1_acf_0_field_t ACF_0_f;
    };
    __IO uint16_t VER;
    union
    {
        __IO uint8_t TBSLOT;
        stc_can_1_tbslot_field_t TBSLOT_f;
    };
    union
    {
        __IO uint8_t TTCFG;
        stc_can_1_ttcfg_field_t TTCFG_f;
    };
    __IO uint32_t REF_MSG;
    union
    {
        __IO uint16_t TRG_CFG;
        stc_can_1_trg_cfg_field_t TRG_CFG_f;
    };
    __IO uint16_t TT_TRIG;
    __IO uint16_t TT_WTRIG;
}M4_CAN_1_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t CMPCTL0;
        stc_cmp_cmpctl0_field_t CMPCTL0_f;
    };
    union
    {
        __IO uint16_t CMPVLTSEL0;
        stc_cmp_cmpvltsel0_field_t CMPVLTSEL0_f;
    };
    union
    {
        __IO uint8_t CMPMON0;
        stc_cmp_cmpmon0_field_t CMPMON0_f;
    };
    uint8_t RESERVED3[11];
    union
    {
        __IO uint16_t CMPCTL1;
        stc_cmp_cmpctl1_field_t CMPCTL1_f;
    };
    union
    {
        __IO uint16_t CMPVLTSEL1;
        stc_cmp_cmpvltsel1_field_t CMPVLTSEL1_f;
    };
    union
    {
        __IO uint8_t CMPMON1;
        stc_cmp_cmpmon1_field_t CMPMON1_f;
    };
    uint8_t RESERVED6[11];
    union
    {
        __IO uint16_t CMPCTL2;
        stc_cmp_cmpctl2_field_t CMPCTL2_f;
    };
    union
    {
        __IO uint16_t CMPVLTSEL2;
        stc_cmp_cmpvltsel2_field_t CMPVLTSEL2_f;
    };
    union
    {
        __IO uint8_t CMPMON2;
        stc_cmp_cmpmon2_field_t CMPMON2_f;
    };
    uint8_t RESERVED9[11];
    union
    {
        __IO uint16_t CMPCTL3;
        stc_cmp_cmpctl3_field_t CMPCTL3_f;
    };
    union
    {
        __IO uint16_t CMPVLTSEL3;
        stc_cmp_cmpvltsel3_field_t CMPVLTSEL3_f;
    };
    union
    {
        __IO uint8_t CMPMON3;
        stc_cmp_cmpmon3_field_t CMPMON3_f;
    };
}M4_CMP_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t CR;
        stc_crc_cr_field_t CR_f;
    };
    uint8_t RESERVED1[3];
    __IO uint32_t RESLT;
    uint8_t RESERVED2[4];
    union
    {
        __IO uint8_t FLG;
        stc_crc_flg_field_t FLG_f;
    };
    uint8_t RESERVED3[115];
    __IO uint32_t DAT0;
    __IO uint32_t DAT1;
    __IO uint32_t DAT2;
    __IO uint32_t DAT3;
    __IO uint32_t DAT4;
    __IO uint32_t DAT5;
    __IO uint32_t DAT6;
    __IO uint32_t DAT7;
    __IO uint32_t DAT8;
    __IO uint32_t DAT9;
    __IO uint32_t DAT10;
    __IO uint32_t DAT11;
    __IO uint32_t DAT12;
    __IO uint32_t DAT13;
    __IO uint32_t DAT14;
    __IO uint32_t DAT15;
    __IO uint32_t DAT16;
    __IO uint32_t DAT17;
    __IO uint32_t DAT18;
    __IO uint32_t DAT19;
    __IO uint32_t DAT20;
    __IO uint32_t DAT21;
    __IO uint32_t DAT22;
    __IO uint32_t DAT23;
    __IO uint32_t DAT24;
    __IO uint32_t DAT25;
    __IO uint32_t DAT26;
    __IO uint32_t DAT27;
    __IO uint32_t DAT28;
    __IO uint32_t DAT29;
    __IO uint32_t DAT30;
    __IO uint32_t DAT31;
}M4_CRC_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t DADR0;
        stc_dac_dadr0_field_t DADR0_f;
    };
    union
    {
        __IO uint16_t DADR1;
        stc_dac_dadr1_field_t DADR1_f;
    };
    union
    {
        __IO uint16_t DACR;
        stc_dac_dacr_field_t DACR_f;
    };
    union
    {
        __IO uint16_t DAADPCR;
        stc_dac_daadpcr_field_t DAADPCR_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t DADIVCR;
        stc_dac_dadivcr_field_t DADIVCR_f;
    };
    union
    {
        __IO uint16_t DIVPR11AB;
        stc_dac_divpr11ab_field_t DIVPR11AB_f;
    };
    union
    {
        __IO uint16_t DIVPR11C;
        stc_dac_divpr11c_field_t DIVPR11C_f;
    };
    union
    {
        __IO uint16_t DIVPR10AB;
        stc_dac_divpr10ab_field_t DIVPR10AB_f;
    };
    union
    {
        __IO uint16_t DIVPR98;
        stc_dac_divpr98_field_t DIVPR98_f;
    };
    union
    {
        __IO uint16_t DIVPR76;
        stc_dac_divpr76_field_t DIVPR76_f;
    };
    union
    {
        __IO uint16_t DIVPR54;
        stc_dac_divpr54_field_t DIVPR54_f;
    };
    union
    {
        __IO uint16_t DIVPR32;
        stc_dac_divpr32_field_t DIVPR32_f;
    };
    union
    {
        __IO uint16_t DIVPR10;
        stc_dac_divpr10_field_t DIVPR10_f;
    };
    uint8_t RESERVED13[1];
    union
    {
        __IO uint8_t DAODIS;
        stc_dac_daodis_field_t DAODIS_f;
    };
}M4_DAC_TypeDef;

typedef struct
{
    __IO uint32_t AUTHID0;
    __IO uint32_t AUTHID1;
    __IO uint32_t AUTHID2;
    __IO uint32_t RESV0;
    union
    {
        __IO uint16_t MCUSTAT;
        stc_dbgc_mcustat_field_t MCUSTAT_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint16_t MCUCTL;
        stc_dbgc_mcuctl_field_t MCUCTL_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint8_t FMCCTL;
        stc_dbgc_fmcctl_field_t FMCCTL_f;
    };
    uint8_t RESERVED7[3];
    union
    {
        __IO uint8_t MCUDBGSTAT;
        stc_dbgc_mcudbgstat_field_t MCUDBGSTAT_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint32_t MCUSTPCTL;
        stc_dbgc_mcustpctl_field_t MCUSTPCTL_f;
    };
    union
    {
        __IO uint8_t MCUTRACECTL;
        stc_dbgc_mcutracectl_field_t MCUTRACECTL_f;
    };
}M4_DBGC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CTL;
        stc_dcu0_ctl_field_t CTL_f;
    };
    union
    {
        __IO uint8_t FLAG;
        stc_dcu0_flag_field_t FLAG_f;
    };
    uint8_t RESERVED2[3];
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;
    __IO uint32_t DATA2;
    union
    {
        __IO uint8_t FLAGCLR;
        stc_dcu0_flagclr_field_t FLAGCLR_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint16_t INTSEL;
        stc_dcu0_intsel_field_t INTSEL_f;
    };
}M4_DCU0_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CTL;
        stc_dcu1_ctl_field_t CTL_f;
    };
    union
    {
        __IO uint8_t FLAG;
        stc_dcu1_flag_field_t FLAG_f;
    };
    uint8_t RESERVED2[3];
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;
    __IO uint32_t DATA2;
    union
    {
        __IO uint8_t FLAGCLR;
        stc_dcu1_flagclr_field_t FLAGCLR_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint16_t INTSEL;
        stc_dcu1_intsel_field_t INTSEL_f;
    };
}M4_DCU1_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CTL;
        stc_dcu2_ctl_field_t CTL_f;
    };
    union
    {
        __IO uint8_t FLAG;
        stc_dcu2_flag_field_t FLAG_f;
    };
    uint8_t RESERVED2[3];
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;
    __IO uint32_t DATA2;
    union
    {
        __IO uint8_t FLAGCLR;
        stc_dcu2_flagclr_field_t FLAGCLR_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint16_t INTSEL;
        stc_dcu2_intsel_field_t INTSEL_f;
    };
}M4_DCU2_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CTL;
        stc_dcu3_ctl_field_t CTL_f;
    };
    union
    {
        __IO uint8_t FLAG;
        stc_dcu3_flag_field_t FLAG_f;
    };
    uint8_t RESERVED2[3];
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;
    __IO uint32_t DATA2;
    union
    {
        __IO uint8_t FLAGCLR;
        stc_dcu3_flagclr_field_t FLAGCLR_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint16_t INTSEL;
        stc_dcu3_intsel_field_t INTSEL_f;
    };
}M4_DCU3_TypeDef;

