RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    union
    {
        __IO uint32_t EN;
        stc_dmac_en_field_t EN_f;
    };
    union
    {
        __IO uint32_t INTSTAT0;
        stc_dmac_intstat0_field_t INTSTAT0_f;
    };
    union
    {
        __IO uint32_t INTSTAT1;
        stc_dmac_intstat1_field_t INTSTAT1_f;
    };
    union
    {
        __IO uint32_t INTMASK0;
        stc_dmac_intmask0_field_t INTMASK0_f;
    };
    union
    {
        __IO uint32_t INTMASK1;
        stc_dmac_intmask1_field_t INTMASK1_f;
    };
    union
    {
        __IO uint32_t INTCLR0;
        stc_dmac_intclr0_field_t INTCLR0_f;
    };
    union
    {
        __IO uint32_t INTCLR1;
        stc_dmac_intclr1_field_t INTCLR1_f;
    };
    __IO uint32_t CHEN;
    uint8_t RESERVED8[32];
    __IO uint32_t SAR0;
    __IO uint32_t DAR0;
    union
    {
        __IO uint32_t DTCTL0;
        stc_dmac_dtctl0_field_t DTCTL0_f;
    };
    union
    {
        __IO uint32_t RPT0;
        stc_dmac_rpt0_field_t RPT0_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL0;
        stc_dmac_snseqctl0_field_t SNSEQCTL0_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL0;
        stc_dmac_dnseqctl0_field_t DNSEQCTL0_f;
    };
    union
    {
        __IO uint32_t LLP0;
        stc_dmac_llp0_field_t LLP0_f;
    };
    union
    {
        __IO uint32_t CH0CTL;
        stc_dmac_ch0ctl_field_t CH0CTL_f;
    };
    uint8_t RESERVED16[32];
    __IO uint32_t SAR1;
    __IO uint32_t DAR1;
    union
    {
        __IO uint32_t DTCTL1;
        stc_dmac_dtctl1_field_t DTCTL1_f;
    };
    union
    {
        __IO uint32_t RPT1;
        stc_dmac_rpt1_field_t RPT1_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL1;
        stc_dmac_snseqctl1_field_t SNSEQCTL1_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL1;
        stc_dmac_dnseqctl1_field_t DNSEQCTL1_f;
    };
    union
    {
        __IO uint32_t LLP1;
        stc_dmac_llp1_field_t LLP1_f;
    };
    union
    {
        __IO uint32_t CH1CTL;
        stc_dmac_ch1ctl_field_t CH1CTL_f;
    };
    uint8_t RESERVED24[32];
    __IO uint32_t SAR2;
    __IO uint32_t DAR2;
    union
    {
        __IO uint32_t DTCTL2;
        stc_dmac_dtctl2_field_t DTCTL2_f;
    };
    union
    {
        __IO uint32_t RPT2;
        stc_dmac_rpt2_field_t RPT2_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL2;
        stc_dmac_snseqctl2_field_t SNSEQCTL2_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL2;
        stc_dmac_dnseqctl2_field_t DNSEQCTL2_f;
    };
    union
    {
        __IO uint32_t LLP2;
        stc_dmac_llp2_field_t LLP2_f;
    };
    union
    {
        __IO uint32_t CH2CTL;
        stc_dmac_ch2ctl_field_t CH2CTL_f;
    };
    uint8_t RESERVED32[32];
    __IO uint32_t SAR3;
    __IO uint32_t DAR3;
    union
    {
        __IO uint32_t DTCTL3;
        stc_dmac_dtctl3_field_t DTCTL3_f;
    };
    union
    {
        __IO uint32_t RPT3;
        stc_dmac_rpt3_field_t RPT3_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL3;
        stc_dmac_snseqctl3_field_t SNSEQCTL3_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL3;
        stc_dmac_dnseqctl3_field_t DNSEQCTL3_f;
    };
    union
    {
        __IO uint32_t LLP3;
        stc_dmac_llp3_field_t LLP3_f;
    };
    union
    {
        __IO uint32_t CH3CTL;
        stc_dmac_ch3ctl_field_t CH3CTL_f;
    };
    uint8_t RESERVED40[32];
    __IO uint32_t SAR4;
    __IO uint32_t DAR4;
    union
    {
        __IO uint32_t DTCTL4;
        stc_dmac_dtctl4_field_t DTCTL4_f;
    };
    union
    {
        __IO uint32_t RPT4;
        stc_dmac_rpt4_field_t RPT4_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL4;
        stc_dmac_snseqctl4_field_t SNSEQCTL4_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL4;
        stc_dmac_dnseqctl4_field_t DNSEQCTL4_f;
    };
    union
    {
        __IO uint32_t LLP4;
        stc_dmac_llp4_field_t LLP4_f;
    };
    union
    {
        __IO uint32_t CH4CTL;
        stc_dmac_ch4ctl_field_t CH4CTL_f;
    };
    uint8_t RESERVED48[32];
    __IO uint32_t SAR5;
    __IO uint32_t DAR5;
    union
    {
        __IO uint32_t DTCTL5;
        stc_dmac_dtctl5_field_t DTCTL5_f;
    };
    union
    {
        __IO uint32_t RPT5;
        stc_dmac_rpt5_field_t RPT5_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL5;
        stc_dmac_snseqctl5_field_t SNSEQCTL5_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL5;
        stc_dmac_dnseqctl5_field_t DNSEQCTL5_f;
    };
    union
    {
        __IO uint32_t LLP5;
        stc_dmac_llp5_field_t LLP5_f;
    };
    union
    {
        __IO uint32_t CH5CTL;
        stc_dmac_ch5ctl_field_t CH5CTL_f;
    };
    uint8_t RESERVED56[32];
    __IO uint32_t SAR6;
    __IO uint32_t DAR6;
    union
    {
        __IO uint32_t DTCTL6;
        stc_dmac_dtctl6_field_t DTCTL6_f;
    };
    union
    {
        __IO uint32_t RPT6;
        stc_dmac_rpt6_field_t RPT6_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL6;
        stc_dmac_snseqctl6_field_t SNSEQCTL6_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL6;
        stc_dmac_dnseqctl6_field_t DNSEQCTL6_f;
    };
    union
    {
        __IO uint32_t LLP6;
        stc_dmac_llp6_field_t LLP6_f;
    };
    union
    {
        __IO uint32_t CH6CTL;
        stc_dmac_ch6ctl_field_t CH6CTL_f;
    };
    uint8_t RESERVED64[32];
    __IO uint32_t SAR7;
    __IO uint32_t DAR7;
    union
    {
        __IO uint32_t DTCTL7;
        stc_dmac_dtctl7_field_t DTCTL7_f;
    };
    union
    {
        __IO uint32_t RPT7;
        stc_dmac_rpt7_field_t RPT7_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL7;
        stc_dmac_snseqctl7_field_t SNSEQCTL7_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL7;
        stc_dmac_dnseqctl7_field_t DNSEQCTL7_f;
    };
    union
    {
        __IO uint32_t LLP7;
        stc_dmac_llp7_field_t LLP7_f;
    };
    union
    {
        __IO uint32_t CH7CTL;
        stc_dmac_ch7ctl_field_t CH7CTL_f;
    };
}M4_DMAC_TypeDef;

typedef struct
{
    __IO uint16_t FAPRT;
    uint8_t RESERVED1[2];
    union
    {
        __IO uint8_t FSTP;
        stc_efm_fstp_field_t FSTP_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint32_t FRMC;
        stc_efm_frmc_field_t FRMC_f;
    };
    union
    {
        __IO uint8_t FWMC;
        stc_efm_fwmc_field_t FWMC_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint16_t FSR;
        stc_efm_fsr_field_t FSR_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint8_t FSCLR;
        stc_efm_fsclr_field_t FSCLR_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t FITE;
        stc_efm_fite_field_t FITE_f;
    };
    uint8_t RESERVED7[3];
    union
    {
        __IO uint8_t FSWP;
        stc_efm_fswp_field_t FSWP_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint32_t FPMTSW;
        stc_efm_fpmtsw_field_t FPMTSW_f;
    };
    union
    {
        __IO uint32_t FPMTEW;
        stc_efm_fpmtew_field_t FPMTEW_f;
    };
    uint8_t RESERVED10[40];
    __IO uint32_t UQID1;
    __IO uint32_t UQID2;
    __IO uint32_t UQID3;
    uint8_t RESERVED13[164];
    __IO uint16_t REMPRT;
    uint8_t RESERVED14[2];
    union
    {
        __IO uint32_t REMCR0;
        stc_efm_remcr0_field_t REMCR0_f;
    };
    union
    {
        __IO uint32_t REMCR1;
        stc_efm_remcr1_field_t REMCR1_f;
    };
}M4_EFM_TypeDef;

typedef struct
{
    __IO uint16_t DFAPRT;
    uint8_t RESERVED1[2];
    union
    {
        __IO uint8_t DFSTP;
        stc_efmd_dfstp_field_t DFSTP_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint16_t DFRMC;
        stc_efmd_dfrmc_field_t DFRMC_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint8_t DFWMC;
        stc_efmd_dfwmc_field_t DFWMC_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint16_t DFSR;
        stc_efmd_dfsr_field_t DFSR_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint8_t DFSCLR;
        stc_efmd_dfsclr_field_t DFSCLR_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t DFITE;
        stc_efmd_dfite_field_t DFITE_f;
    };
}M4_EFMD_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CTL0;
        stc_emb_ctl0_field_t CTL0_f;
    };
    union
    {
        __IO uint32_t PWMLV0;
        stc_emb_pwmlv0_field_t PWMLV0_f;
    };
    union
    {
        __IO uint32_t SOE0;
        stc_emb_soe0_field_t SOE0_f;
    };
    union
    {
        __IO uint32_t STAT0;
        stc_emb_stat0_field_t STAT0_f;
    };
    union
    {
        __IO uint32_t STATCLR0;
        stc_emb_statclr0_field_t STATCLR0_f;
    };
    union
    {
        __IO uint32_t INTEN0;
        stc_emb_inten0_field_t INTEN0_f;
    };
    uint8_t RESERVED6[8];
    union
    {
        __IO uint32_t STATCLR1;
        stc_emb_statclr1_field_t STATCLR1_f;
    };
    union
    {
        __IO uint32_t PWMLV1;
        stc_emb_pwmlv1_field_t PWMLV1_f;
    };
    union
    {
        __IO uint32_t SOE1;
        stc_emb_soe1_field_t SOE1_f;
    };
    union
    {
        __IO uint32_t STAT1;
        stc_emb_stat1_field_t STAT1_f;
    };
    uint8_t RESERVED10[4];
    union
    {
        __IO uint32_t INTEN1;
        stc_emb_inten1_field_t INTEN1_f;
    };
    uint8_t RESERVED11[8];
    union
    {
        __IO uint32_t CTL2;
        stc_emb_ctl2_field_t CTL2_f;
    };
    union
    {
        __IO uint32_t PWMLV2;
        stc_emb_pwmlv2_field_t PWMLV2_f;
    };
    union
    {
        __IO uint32_t SOE2;
        stc_emb_soe2_field_t SOE2_f;
    };
    union
    {
        __IO uint32_t STAT2;
        stc_emb_stat2_field_t STAT2_f;
    };
    union
    {
        __IO uint32_t STATCLR2;
        stc_emb_statclr2_field_t STATCLR2_f;
    };
    union
    {
        __IO uint32_t INTEN2;
        stc_emb_inten2_field_t INTEN2_f;
    };
    uint8_t RESERVED17[8];
    union
    {
        __IO uint32_t CTL3;
        stc_emb_ctl3_field_t CTL3_f;
    };
    union
    {
        __IO uint32_t PWMLV3;
        stc_emb_pwmlv3_field_t PWMLV3_f;
    };
    union
    {
        __IO uint32_t SOE3;
        stc_emb_soe3_field_t SOE3_f;
    };
    union
    {
        __IO uint32_t STAT3;
        stc_emb_stat3_field_t STAT3_f;
    };
    union
    {
        __IO uint32_t STATCLR3;
        stc_emb_statclr3_field_t STATCLR3_f;
    };
    union
    {
        __IO uint32_t INTEN3;
        stc_emb_inten3_field_t INTEN3_f;
    };
    uint8_t RESERVED23[8];
    union
    {
        __IO uint32_t CTL4;
        stc_emb_ctl4_field_t CTL4_f;
    };
    union
    {
        __IO uint32_t PWMLV4;
        stc_emb_pwmlv4_field_t PWMLV4_f;
    };
    union
    {
        __IO uint32_t SOE4;
        stc_emb_soe4_field_t SOE4_f;
    };
    union
    {
        __IO uint32_t STAT4;
        stc_emb_stat4_field_t STAT4_f;
    };
    union
    {
        __IO uint32_t STATCLR4;
        stc_emb_statclr4_field_t STATCLR4_f;
    };
    union
    {
        __IO uint32_t INTEN4;
        stc_emb_inten4_field_t INTEN4_f;
    };
    uint8_t RESERVED29[8];
    union
    {
        __IO uint32_t CTL5;
        stc_emb_ctl5_field_t CTL5_f;
    };
    union
    {
        __IO uint32_t PWMLV5;
        stc_emb_pwmlv5_field_t PWMLV5_f;
    };
    union
    {
        __IO uint32_t SOE5;
        stc_emb_soe5_field_t SOE5_f;
    };
    union
    {
        __IO uint32_t STAT5;
        stc_emb_stat5_field_t STAT5_f;
    };
    union
    {
        __IO uint32_t STATCLR5;
        stc_emb_statclr5_field_t STATCLR5_f;
    };
    union
    {
        __IO uint32_t INTEN5;
        stc_emb_inten5_field_t INTEN5_f;
    };
}M4_EMB_TypeDef;

typedef struct
{
    uint8_t RESERVED0[21520];
    union
    {
        __IO uint8_t MAC_IFCONFR;
        stc_eth_mac_ifconfr_field_t MAC_IFCONFR_f;
    };
    uint8_t RESERVED1[44015];
    union
    {
        __IO uint32_t MAC_CONFIGR;
        stc_eth_mac_configr_field_t MAC_CONFIGR_f;
    };
    union
    {
        __IO uint32_t MAC_FLTCTLR;
        stc_eth_mac_fltctlr_field_t MAC_FLTCTLR_f;
    };
    __IO uint32_t MAC_HASHTHR;
    __IO uint32_t MAC_HASHTLR;
    union
    {
        __IO uint16_t MAC_SMIADDR;
        stc_eth_mac_smiaddr_field_t MAC_SMIADDR_f;
    };
    uint8_t RESERVED6[2];
    __IO uint16_t MAC_SMIDATR;
    uint8_t RESERVED7[2];
    union
    {
        __IO uint32_t MAC_FLOCTLR;
        stc_eth_mac_floctlr_field_t MAC_FLOCTLR_f;
    };
    union
    {
        __IO uint32_t MAC_VTAFLTR;
        stc_eth_mac_vtafltr_field_t MAC_VTAFLTR_f;
    };
    uint8_t RESERVED9[4];
    union
    {
        __IO uint32_t MAC_MACSTSR;
        stc_eth_mac_macstsr_field_t MAC_MACSTSR_f;
    };
    __IO uint32_t MAC_RTWKFFR;
    union
    {
        __IO uint32_t MAC_PMTCTLR;
        stc_eth_mac_pmtctlr_field_t MAC_PMTCTLR_f;
    };
    uint8_t RESERVED12[8];
    union
    {
        __IO uint16_t MAC_INTSTSR;
        stc_eth_mac_intstsr_field_t MAC_INTSTSR_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint16_t MAC_INTMSKR;
        stc_eth_mac_intmskr_field_t MAC_INTMSKR_f;
    };
    uint8_t RESERVED14[2];
    union
    {
        __IO uint32_t MAC_MACADHR0;
        stc_eth_mac_macadhr0_field_t MAC_MACADHR0_f;
    };
    __IO uint32_t MAC_MACADLR0;
    union
    {
        __IO uint32_t MAC_MACADHR1;
        stc_eth_mac_macadhr1_field_t MAC_MACADHR1_f;
    };
    __IO uint32_t MAC_MACADLR1;
    union
    {
        __IO uint32_t MAC_MACADHR2;
        stc_eth_mac_macadhr2_field_t MAC_MACADHR2_f;
    };
    __IO uint32_t MAC_MACADLR2;
    union
    {
        __IO uint32_t MAC_MACADHR3;
        stc_eth_mac_macadhr3_field_t MAC_MACADHR3_f;
    };
    __IO uint32_t MAC_MACADLR3;
    union
    {
        __IO uint32_t MAC_MACADHR4;
        stc_eth_mac_macadhr4_field_t MAC_MACADHR4_f;
    };
    __IO uint32_t MAC_MACADLR4;
    uint8_t RESERVED24[152];
    union
    {
        __IO uint8_t MMC_MMCCTLR;
        stc_eth_mmc_mmcctlr_field_t MMC_MMCCTLR_f;
    };
    uint8_t RESERVED25[3];
    union
    {
        __IO uint32_t MMC_REVSTSR;
        stc_eth_mmc_revstsr_field_t MMC_REVSTSR_f;
    };
    union
    {
        __IO uint32_t MMC_TRSSTSR;
        stc_eth_mmc_trsstsr_field_t MMC_TRSSTSR_f;
    };
    union
    {
        __IO uint32_t MMC_RITCTLR;
        stc_eth_mmc_ritctlr_field_t MMC_RITCTLR_f;
    };
    union
    {
        __IO uint32_t MMC_TITCTLR;
        stc_eth_mmc_titctlr_field_t MMC_TITCTLR_f;
    };
    uint8_t RESERVED29[8];
    __IO uint16_t MMC_TXBRGFR;
    uint8_t RESERVED30[2];
    __IO uint16_t MMC_TXMUGFR;
    uint8_t RESERVED31[50];
    __IO uint16_t MMC_TXDEEFR;
    uint8_t RESERVED32[2];
    __IO uint16_t MMC_TXLCEFR;
    uint8_t RESERVED33[2];
    __IO uint16_t MMC_TXECEFR;
    uint8_t RESERVED34[2];
    __IO uint16_t MMC_TXCAEFR;
    uint8_t RESERVED35[6];
    __IO uint16_t MMC_TXUNGFR;
    uint8_t RESERVED36[2];
    __IO uint16_t MMC_TXEDEFR;
    uint8_t RESERVED37[30];
    __IO uint16_t MMC_RXBRGFR;
    uint8_t RESERVED38[2];
    __IO uint16_t MMC_RXMUGFR;
    uint8_t RESERVED39[2];
    __IO uint16_t MMC_RXCREFR;
    uint8_t RESERVED40[2];
    __IO uint16_t MMC_RXALEFR;
    uint8_t RESERVED41[2];
    __IO uint16_t MMC_RXRUEFR;
    uint8_t RESERVED42[38];
    __IO uint16_t MMC_RXUNGFR;
    uint8_t RESERVED43[2];
    __IO uint16_t MMC_RXLEEFR;
    uint8_t RESERVED44[2];
    __IO uint16_t MMC_RXOREFR;
    uint8_t RESERVED45[562];
    union
    {
        __IO uint32_t MAC_L34CTLR;
        stc_eth_mac_l34ctlr_field_t MAC_L34CTLR_f;
    };
    union
    {
        __IO uint32_t MAC_L4PORTR;
        stc_eth_mac_l4portr_field_t MAC_L4PORTR_f;
    };
    uint8_t RESERVED47[8];
    __IO uint32_t MAC_L3ADDRR0;
    __IO uint32_t MAC_L3ADDRR1;
    __IO uint32_t MAC_L3ADDRR2;
    __IO uint32_t MAC_L3ADDRR3;
    uint8_t RESERVED51[356];
    union
    {
        __IO uint32_t MAC_VTACTLR;
        stc_eth_mac_vtactlr_field_t MAC_VTACTLR_f;
    };
    __IO uint16_t MAC_VLAHTBR;
    uint8_t RESERVED53[374];
    union
    {
        __IO uint32_t PTP_TSPCTLR;
        stc_eth_ptp_tspctlr_field_t PTP_TSPCTLR_f;
    };
    __IO uint8_t PTP_TSPNSAR;
    uint8_t RESERVED55[3];
    __IO uint32_t PTP_TMSSECR;
    __IO uint32_t PTP_TMSNSER;
    __IO uint32_t PTP_TMUSECR;
    __IO uint32_t PTP_TMUNSER;
    __IO uint32_t PTP_TSPADDR;
    __IO uint32_t PTP_TMTSECR0;
    __IO uint32_t PTP_TMTNSER0;
    uint8_t RESERVED62[4];
    union
    {
        __IO uint8_t PTP_TSPSTSR;
        stc_eth_ptp_tspstsr_field_t PTP_TSPSTSR_f;
    };
    uint8_t RESERVED63[3];
    union
    {
        __IO uint16_t PTP_PPSCTLR;
        stc_eth_ptp_ppsctlr_field_t PTP_PPSCTLR_f;
    };
    uint8_t RESERVED64[82];
    __IO uint32_t PTP_TMTSECR1;
    __IO uint32_t PTP_TMTNSER1;
    uint8_t RESERVED66[2168];
    union
    {
        __IO uint32_t DMA_BUSMODR;
        stc_eth_dma_busmodr_field_t DMA_BUSMODR_f;
    };
    __IO uint32_t DMA_TXPOLLR;
    __IO uint32_t DMA_RXPOLLR;
    __IO uint32_t DMA_RXDLADR;
    __IO uint32_t DMA_TXDLADR;
    union
    {
        __IO uint32_t DMA_DMASTSR;
        stc_eth_dma_dmastsr_field_t DMA_DMASTSR_f;
    };
    union
    {
        __IO uint32_t DMA_OPRMODR;
        stc_eth_dma_oprmodr_field_t DMA_OPRMODR_f;
    };
    union
    {
        __IO uint32_t DMA_INTENAR;
        stc_eth_dma_intenar_field_t DMA_INTENAR_f;
    };
    union
    {
        __IO uint32_t DMA_RFRCNTR;
        stc_eth_dma_rfrcntr_field_t DMA_RFRCNTR_f;
    };
    __IO uint8_t DMA_REVWDTR;
    uint8_t RESERVED76[35];
    __IO uint32_t DMA_CHTXDER;
    __IO uint32_t DMA_CHRXDER;
    __IO uint32_t DMA_CHTXBFR;
    __IO uint32_t DMA_CHRXBFR;
}M4_ETH_TypeDef;

