RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    uint8_t RESERVED0[21536];
    union
    {
        __IO uint8_t EXMC_EXCR0;
        stc_exmc_exmc_excr0_field_t EXMC_EXCR0_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint32_t EXMC_EXCR1;
        stc_exmc_exmc_excr1_field_t EXMC_EXCR1_f;
    };
    uint8_t RESERVED2[1207610328];
    union
    {
        __IO uint8_t DMC_STSR;
        stc_exmc_dmc_stsr_field_t DMC_STSR_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint8_t DMC_STCR;
        stc_exmc_dmc_stcr_field_t DMC_STCR_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint32_t DMC_CMDR;
        stc_exmc_dmc_cmdr_field_t DMC_CMDR_f;
    };
    union
    {
        __IO uint32_t DMC_BACR;
        stc_exmc_dmc_bacr_field_t DMC_BACR_f;
    };
    union
    {
        __IO uint16_t DMC_RFCR;
        stc_exmc_dmc_rfcr_field_t DMC_RFCR_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint8_t DMC_TMCR_T_CASL;
        stc_exmc_dmc_tmcr_t_casl_field_t DMC_TMCR_T_CASL_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint8_t DMC_TMCR_T_DQSS;
        stc_exmc_dmc_tmcr_t_dqss_field_t DMC_TMCR_T_DQSS_f;
    };
    uint8_t RESERVED9[3];
    union
    {
        __IO uint8_t DMC_TMCR_T_MRD;
        stc_exmc_dmc_tmcr_t_mrd_field_t DMC_TMCR_T_MRD_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t DMC_TMCR_T_RAS;
        stc_exmc_dmc_tmcr_t_ras_field_t DMC_TMCR_T_RAS_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t DMC_TMCR_T_RC;
        stc_exmc_dmc_tmcr_t_rc_field_t DMC_TMCR_T_RC_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t DMC_TMCR_T_RCD;
        stc_exmc_dmc_tmcr_t_rcd_field_t DMC_TMCR_T_RCD_f;
    };
    uint8_t RESERVED13[3];
    union
    {
        __IO uint8_t DMC_TMCR_T_RFC;
        stc_exmc_dmc_tmcr_t_rfc_field_t DMC_TMCR_T_RFC_f;
    };
    uint8_t RESERVED14[3];
    union
    {
        __IO uint8_t DMC_TMCR_T_RP;
        stc_exmc_dmc_tmcr_t_rp_field_t DMC_TMCR_T_RP_f;
    };
    uint8_t RESERVED15[3];
    union
    {
        __IO uint8_t DMC_TMCR_T_RRD;
        stc_exmc_dmc_tmcr_t_rrd_field_t DMC_TMCR_T_RRD_f;
    };
    uint8_t RESERVED16[3];
    union
    {
        __IO uint8_t DMC_TMCR_T_WR;
        stc_exmc_dmc_tmcr_t_wr_field_t DMC_TMCR_T_WR_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t DMC_TMCR_T_WTR;
        stc_exmc_dmc_tmcr_t_wtr_field_t DMC_TMCR_T_WTR_f;
    };
    uint8_t RESERVED18[3];
    __IO uint8_t DMC_TMCR_T_XP;
    uint8_t RESERVED19[3];
    __IO uint8_t DMC_TMCR_T_XSR;
    uint8_t RESERVED20[3];
    __IO uint8_t DMC_TMCR_T_ESR;
    uint8_t RESERVED21[439];
    union
    {
        __IO uint32_t DMC_CPCR0;
        stc_exmc_dmc_cpcr0_field_t DMC_CPCR0_f;
    };
    union
    {
        __IO uint32_t DMC_CPCR1;
        stc_exmc_dmc_cpcr1_field_t DMC_CPCR1_f;
    };
    union
    {
        __IO uint32_t DMC_CPCR2;
        stc_exmc_dmc_cpcr2_field_t DMC_CPCR2_f;
    };
    union
    {
        __IO uint32_t DMC_CPCR3;
        stc_exmc_dmc_cpcr3_field_t DMC_CPCR3_f;
    };
    uint8_t RESERVED25[240];
    __IO uint8_t EXMC_EXSR1;
    uint8_t RESERVED26[3327];
    union
    {
        __IO uint8_t SMC_STSR;
        stc_exmc_smc_stsr_field_t SMC_STSR_f;
    };
    uint8_t RESERVED27[7];
    union
    {
        __IO uint8_t SMC_STCR0;
        stc_exmc_smc_stcr0_field_t SMC_STCR0_f;
    };
    uint8_t RESERVED28[3];
    union
    {
        __IO uint8_t SMC_STCR1;
        stc_exmc_smc_stcr1_field_t SMC_STCR1_f;
    };
    uint8_t RESERVED29[3];
    union
    {
        __IO uint32_t SMC_CMDR;
        stc_exmc_smc_cmdr_field_t SMC_CMDR_f;
    };
    union
    {
        __IO uint32_t SMC_TMCR;
        stc_exmc_smc_tmcr_field_t SMC_TMCR_f;
    };
    union
    {
        __IO uint16_t SMC_BACR;
        stc_exmc_smc_bacr_field_t SMC_BACR_f;
    };
    uint8_t RESERVED32[6];
    union
    {
        __IO uint8_t SMC_RFCR;
        stc_exmc_smc_rfcr_field_t SMC_RFCR_f;
    };
    uint8_t RESERVED33[223];
    union
    {
        __IO uint32_t SMC_TMSR0;
        stc_exmc_smc_tmsr0_field_t SMC_TMSR0_f;
    };
    union
    {
        __IO uint32_t SMC_BASR0;
        stc_exmc_smc_basr0_field_t SMC_BASR0_f;
    };
    uint8_t RESERVED35[24];
    union
    {
        __IO uint32_t SMC_TMSR1;
        stc_exmc_smc_tmsr1_field_t SMC_TMSR1_f;
    };
    union
    {
        __IO uint32_t SMC_BASR1;
        stc_exmc_smc_basr1_field_t SMC_BASR1_f;
    };
    uint8_t RESERVED37[24];
    union
    {
        __IO uint32_t SMC_TMSR2;
        stc_exmc_smc_tmsr2_field_t SMC_TMSR2_f;
    };
    union
    {
        __IO uint32_t SMC_BASR2;
        stc_exmc_smc_basr2_field_t SMC_BASR2_f;
    };
    uint8_t RESERVED39[24];
    union
    {
        __IO uint32_t SMC_TMSR3;
        stc_exmc_smc_tmsr3_field_t SMC_TMSR3_f;
    };
    union
    {
        __IO uint32_t SMC_BASR3;
        stc_exmc_smc_basr3_field_t SMC_BASR3_f;
    };
    uint8_t RESERVED41[152];
    union
    {
        __IO uint8_t EXMC_EXSR0;
        stc_exmc_exmc_exsr0_field_t EXMC_EXSR0_f;
    };
    uint8_t RESERVED42[1043967];
    __IO uint32_t NFC_DATR_BASE;
    uint8_t RESERVED43[32764];
    union
    {
        __IO uint32_t NFC_CMDR;
        stc_exmc_nfc_cmdr_field_t NFC_CMDR_f;
    };
    __IO uint32_t NFC_IDXR0;
    uint8_t RESERVED45[40];
    union
    {
        __IO uint32_t NFC_IENR;
        stc_exmc_nfc_ienr_field_t NFC_IENR_f;
    };
    union
    {
        __IO uint32_t NFC_ISTR;
        stc_exmc_nfc_istr_field_t NFC_ISTR_f;
    };
    union
    {
        __IO uint32_t NFC_IRSR;
        stc_exmc_nfc_irsr_field_t NFC_IRSR_f;
    };
    uint8_t RESERVED48[12];
    union
    {
        __IO uint32_t NFC_IDXR1;
        stc_exmc_nfc_idxr1_field_t NFC_IDXR1_f;
    };
    union
    {
        __IO uint32_t NFC_TMCR0;
        stc_exmc_nfc_tmcr0_field_t NFC_TMCR0_f;
    };
    union
    {
        __IO uint32_t NFC_TMCR1;
        stc_exmc_nfc_tmcr1_field_t NFC_TMCR1_f;
    };
    union
    {
        __IO uint32_t NFC_BACR;
        stc_exmc_nfc_bacr_field_t NFC_BACR_f;
    };
    uint8_t RESERVED52[4];
    union
    {
        __IO uint32_t NFC_TMCR2;
        stc_exmc_nfc_tmcr2_field_t NFC_TMCR2_f;
    };
    union
    {
        __IO uint32_t NFC_ECCR0;
        stc_exmc_nfc_eccr0_field_t NFC_ECCR0_f;
    };
    union
    {
        __IO uint32_t NFC_ECCR1;
        stc_exmc_nfc_eccr1_field_t NFC_ECCR1_f;
    };
    union
    {
        __IO uint32_t NFC_ECCR2;
        stc_exmc_nfc_eccr2_field_t NFC_ECCR2_f;
    };
    union
    {
        __IO uint32_t NFC_ECCR3;
        stc_exmc_nfc_eccr3_field_t NFC_ECCR3_f;
    };
    union
    {
        __IO uint32_t NFC_ECCR4;
        stc_exmc_nfc_eccr4_field_t NFC_ECCR4_f;
    };
    union
    {
        __IO uint32_t NFC_ECCR5;
        stc_exmc_nfc_eccr5_field_t NFC_ECCR5_f;
    };
    union
    {
        __IO uint32_t NFC_ECCR6;
        stc_exmc_nfc_eccr6_field_t NFC_ECCR6_f;
    };
    union
    {
        __IO uint32_t ECC_STAT;
        stc_exmc_ecc_stat_field_t ECC_STAT_f;
    };
    union
    {
        __IO uint32_t ECC_SYND0_0;
        stc_exmc_ecc_synd0_0_field_t ECC_SYND0_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND0_1;
        stc_exmc_ecc_synd0_1_field_t ECC_SYND0_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND0_2;
        stc_exmc_ecc_synd0_2_field_t ECC_SYND0_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND0_3;
        stc_exmc_ecc_synd0_3_field_t ECC_SYND0_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND1_0;
        stc_exmc_ecc_synd1_0_field_t ECC_SYND1_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND1_1;
        stc_exmc_ecc_synd1_1_field_t ECC_SYND1_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND1_2;
        stc_exmc_ecc_synd1_2_field_t ECC_SYND1_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND1_3;
        stc_exmc_ecc_synd1_3_field_t ECC_SYND1_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND2_0;
        stc_exmc_ecc_synd2_0_field_t ECC_SYND2_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND2_1;
        stc_exmc_ecc_synd2_1_field_t ECC_SYND2_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND2_2;
        stc_exmc_ecc_synd2_2_field_t ECC_SYND2_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND2_3;
        stc_exmc_ecc_synd2_3_field_t ECC_SYND2_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND3_0;
        stc_exmc_ecc_synd3_0_field_t ECC_SYND3_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND3_1;
        stc_exmc_ecc_synd3_1_field_t ECC_SYND3_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND3_2;
        stc_exmc_ecc_synd3_2_field_t ECC_SYND3_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND3_3;
        stc_exmc_ecc_synd3_3_field_t ECC_SYND3_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND4_0;
        stc_exmc_ecc_synd4_0_field_t ECC_SYND4_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND4_1;
        stc_exmc_ecc_synd4_1_field_t ECC_SYND4_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND4_2;
        stc_exmc_ecc_synd4_2_field_t ECC_SYND4_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND4_3;
        stc_exmc_ecc_synd4_3_field_t ECC_SYND4_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND5_0;
        stc_exmc_ecc_synd5_0_field_t ECC_SYND5_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND5_1;
        stc_exmc_ecc_synd5_1_field_t ECC_SYND5_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND5_2;
        stc_exmc_ecc_synd5_2_field_t ECC_SYND5_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND5_3;
        stc_exmc_ecc_synd5_3_field_t ECC_SYND5_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND6_0;
        stc_exmc_ecc_synd6_0_field_t ECC_SYND6_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND6_1;
        stc_exmc_ecc_synd6_1_field_t ECC_SYND6_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND6_2;
        stc_exmc_ecc_synd6_2_field_t ECC_SYND6_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND6_3;
        stc_exmc_ecc_synd6_3_field_t ECC_SYND6_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND7_0;
        stc_exmc_ecc_synd7_0_field_t ECC_SYND7_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND7_1;
        stc_exmc_ecc_synd7_1_field_t ECC_SYND7_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND7_2;
        stc_exmc_ecc_synd7_2_field_t ECC_SYND7_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND7_3;
        stc_exmc_ecc_synd7_3_field_t ECC_SYND7_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND8_0;
        stc_exmc_ecc_synd8_0_field_t ECC_SYND8_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND8_1;
        stc_exmc_ecc_synd8_1_field_t ECC_SYND8_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND8_2;
        stc_exmc_ecc_synd8_2_field_t ECC_SYND8_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND8_3;
        stc_exmc_ecc_synd8_3_field_t ECC_SYND8_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND9_0;
        stc_exmc_ecc_synd9_0_field_t ECC_SYND9_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND9_1;
        stc_exmc_ecc_synd9_1_field_t ECC_SYND9_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND9_2;
        stc_exmc_ecc_synd9_2_field_t ECC_SYND9_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND9_3;
        stc_exmc_ecc_synd9_3_field_t ECC_SYND9_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND10_0;
        stc_exmc_ecc_synd10_0_field_t ECC_SYND10_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND10_1;
        stc_exmc_ecc_synd10_1_field_t ECC_SYND10_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND10_2;
        stc_exmc_ecc_synd10_2_field_t ECC_SYND10_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND10_3;
        stc_exmc_ecc_synd10_3_field_t ECC_SYND10_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND11_0;
        stc_exmc_ecc_synd11_0_field_t ECC_SYND11_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND11_1;
        stc_exmc_ecc_synd11_1_field_t ECC_SYND11_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND11_2;
        stc_exmc_ecc_synd11_2_field_t ECC_SYND11_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND11_3;
        stc_exmc_ecc_synd11_3_field_t ECC_SYND11_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND12_0;
        stc_exmc_ecc_synd12_0_field_t ECC_SYND12_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND12_1;
        stc_exmc_ecc_synd12_1_field_t ECC_SYND12_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND12_2;
        stc_exmc_ecc_synd12_2_field_t ECC_SYND12_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND12_3;
        stc_exmc_ecc_synd12_3_field_t ECC_SYND12_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND13_0;
        stc_exmc_ecc_synd13_0_field_t ECC_SYND13_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND13_1;
        stc_exmc_ecc_synd13_1_field_t ECC_SYND13_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND13_2;
        stc_exmc_ecc_synd13_2_field_t ECC_SYND13_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND13_3;
        stc_exmc_ecc_synd13_3_field_t ECC_SYND13_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND14_0;
        stc_exmc_ecc_synd14_0_field_t ECC_SYND14_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND14_1;
        stc_exmc_ecc_synd14_1_field_t ECC_SYND14_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND14_2;
        stc_exmc_ecc_synd14_2_field_t ECC_SYND14_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND14_3;
        stc_exmc_ecc_synd14_3_field_t ECC_SYND14_3_f;
    };
    union
    {
        __IO uint32_t ECC_SYND15_0;
        stc_exmc_ecc_synd15_0_field_t ECC_SYND15_0_f;
    };
    union
    {
        __IO uint32_t ECC_SYND15_1;
        stc_exmc_ecc_synd15_1_field_t ECC_SYND15_1_f;
    };
    union
    {
        __IO uint32_t ECC_SYND15_2;
        stc_exmc_ecc_synd15_2_field_t ECC_SYND15_2_f;
    };
    union
    {
        __IO uint32_t ECC_SYND15_3;
        stc_exmc_ecc_synd15_3_field_t ECC_SYND15_3_f;
    };
}M4_EXMC_TypeDef;

typedef struct
{
    __IO uint16_t LVR;
    uint8_t RESERVED1[2];
    __IO uint16_t UVR;
    uint8_t RESERVED2[2];
    __IO uint16_t CNTR;
    uint8_t RESERVED3[2];
    union
    {
        __IO uint32_t STR;
        stc_fcm_str_field_t STR_f;
    };
    union
    {
        __IO uint8_t MCCR;
        stc_fcm_mccr_field_t MCCR_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint16_t RCCR;
        stc_fcm_rccr_field_t RCCR_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint8_t RIER;
        stc_fcm_rier_field_t RIER_f;
    };
    uint8_t RESERVED7[3];
    union
    {
        __IO uint8_t SR;
        stc_fcm_sr_field_t SR_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint8_t CLR;
        stc_fcm_clr_field_t CLR_f;
    };
}M4_FCM_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t CR;
        stc_hash_cr_field_t CR_f;
    };
    uint8_t RESERVED1[15];
    __IO uint32_t HR7;
    __IO uint32_t HR6;
    __IO uint32_t HR5;
    __IO uint32_t HR4;
    __IO uint32_t HR3;
    __IO uint32_t HR2;
    __IO uint32_t HR1;
    __IO uint32_t HR0;
    uint8_t RESERVED9[16];
    __IO uint32_t DR15;
    __IO uint32_t DR14;
    __IO uint32_t DR13;
    __IO uint32_t DR12;
    __IO uint32_t DR11;
    __IO uint32_t DR10;
    __IO uint32_t DR9;
    __IO uint32_t DR8;
    __IO uint32_t DR7;
    __IO uint32_t DR6;
    __IO uint32_t DR5;
    __IO uint32_t DR4;
    __IO uint32_t DR3;
    __IO uint32_t DR2;
    __IO uint32_t DR1;
    __IO uint32_t DR0;
}M4_HASH_TypeDef;

typedef struct
{
    union
    {
        __IO uint16_t I2CCR1;
        stc_i2c_i2ccr1_field_t I2CCR1_f;
    };
    uint8_t RESERVED1[2];
    union
    {
        __IO uint32_t I2CCR2;
        stc_i2c_i2ccr2_field_t I2CCR2_f;
    };
    union
    {
        __IO uint32_t I2CCR3;
        stc_i2c_i2ccr3_field_t I2CCR3_f;
    };
    union
    {
        __IO uint8_t I2CSR0;
        stc_i2c_i2csr0_field_t I2CSR0_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint16_t I2CSLR0;
        stc_i2c_i2cslr0_field_t I2CSLR0_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint16_t I2CSLR1;
        stc_i2c_i2cslr1_field_t I2CSLR1_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t I2CSLR2;
        stc_i2c_i2cslr2_field_t I2CSLR2_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint16_t I2CBR;
        stc_i2c_i2cbr_field_t I2CBR_f;
    };
    uint8_t RESERVED8[2];
    __IO uint8_t I2CDTR;
    uint8_t RESERVED9[3];
    __IO uint8_t I2CDRR;
    uint8_t RESERVED10[19];
    union
    {
        __IO uint8_t I2CSR1;
        stc_i2c_i2csr1_field_t I2CSR1_f;
    };
}M4_I2C_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t ICG0;
        stc_icg_icg0_field_t ICG0_f;
    };
    union
    {
        __IO uint32_t ICG1;
        stc_icg_icg1_field_t ICG1_f;
    };
    union
    {
        __IO uint32_t ICG2;
        stc_icg_icg2_field_t ICG2_f;
    };
    union
    {
        __IO uint32_t ICG3;
        stc_icg_icg3_field_t ICG3_f;
    };
    __IO uint32_t ICG4;
    __IO uint32_t ICG5;
    __IO uint32_t ICG6;
    __IO uint32_t ICG7;
    __IO uint32_t ICG8;
    __IO uint32_t ICG9;
    __IO uint32_t ICGA;
    __IO uint32_t ICGB;
    __IO uint32_t ICGC;
    __IO uint32_t ICGD;
    __IO uint32_t ICGE;
    __IO uint32_t ICGF;
}M4_ICG_TypeDef;

