RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    union
    {
        __IO uint8_t NMICR;
        stc_intc_nmicr_field_t NMICR_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint16_t NMIMR;
        stc_intc_nmimr_field_t NMIMR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint16_t NMIPR;
        stc_intc_nmipr_field_t NMIPR_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t NMICPR;
        stc_intc_nmicpr_field_t NMICPR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint8_t EIRQCR0;
        stc_intc_eirqcr0_field_t EIRQCR0_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t EIRQCR1;
        stc_intc_eirqcr1_field_t EIRQCR1_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t EIRQCR2;
        stc_intc_eirqcr2_field_t EIRQCR2_f;
    };
    uint8_t RESERVED7[3];
    union
    {
        __IO uint8_t EIRQCR3;
        stc_intc_eirqcr3_field_t EIRQCR3_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint8_t EIRQCR4;
        stc_intc_eirqcr4_field_t EIRQCR4_f;
    };
    uint8_t RESERVED9[3];
    union
    {
        __IO uint8_t EIRQCR5;
        stc_intc_eirqcr5_field_t EIRQCR5_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t EIRQCR6;
        stc_intc_eirqcr6_field_t EIRQCR6_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t EIRQCR7;
        stc_intc_eirqcr7_field_t EIRQCR7_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t EIRQCR8;
        stc_intc_eirqcr8_field_t EIRQCR8_f;
    };
    uint8_t RESERVED13[3];
    union
    {
        __IO uint8_t EIRQCR9;
        stc_intc_eirqcr9_field_t EIRQCR9_f;
    };
    uint8_t RESERVED14[3];
    union
    {
        __IO uint8_t EIRQCR10;
        stc_intc_eirqcr10_field_t EIRQCR10_f;
    };
    uint8_t RESERVED15[3];
    union
    {
        __IO uint8_t EIRQCR11;
        stc_intc_eirqcr11_field_t EIRQCR11_f;
    };
    uint8_t RESERVED16[3];
    union
    {
        __IO uint8_t EIRQCR12;
        stc_intc_eirqcr12_field_t EIRQCR12_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t EIRQCR13;
        stc_intc_eirqcr13_field_t EIRQCR13_f;
    };
    uint8_t RESERVED18[3];
    union
    {
        __IO uint8_t EIRQCR14;
        stc_intc_eirqcr14_field_t EIRQCR14_f;
    };
    uint8_t RESERVED19[3];
    union
    {
        __IO uint8_t EIRQCR15;
        stc_intc_eirqcr15_field_t EIRQCR15_f;
    };
    uint8_t RESERVED20[3];
    union
    {
        __IO uint32_t WUPEN;
        stc_intc_wupen_field_t WUPEN_f;
    };
    __IO uint32_t INTC_RESV0;
    __IO uint32_t INTC_RESV1;
    union
    {
        __IO uint16_t INTSEL0;
        stc_intc_intsel0_field_t INTSEL0_f;
    };
    uint8_t RESERVED24[2];
    union
    {
        __IO uint16_t INTSEL1;
        stc_intc_intsel1_field_t INTSEL1_f;
    };
    uint8_t RESERVED25[2];
    union
    {
        __IO uint16_t INTSEL2;
        stc_intc_intsel2_field_t INTSEL2_f;
    };
    uint8_t RESERVED26[2];
    union
    {
        __IO uint16_t INTSEL3;
        stc_intc_intsel3_field_t INTSEL3_f;
    };
    uint8_t RESERVED27[2];
    union
    {
        __IO uint16_t INTSEL4;
        stc_intc_intsel4_field_t INTSEL4_f;
    };
    uint8_t RESERVED28[2];
    union
    {
        __IO uint16_t INTSEL5;
        stc_intc_intsel5_field_t INTSEL5_f;
    };
    uint8_t RESERVED29[2];
    union
    {
        __IO uint16_t INTSEL6;
        stc_intc_intsel6_field_t INTSEL6_f;
    };
    uint8_t RESERVED30[2];
    union
    {
        __IO uint16_t INTSEL7;
        stc_intc_intsel7_field_t INTSEL7_f;
    };
    uint8_t RESERVED31[2];
    union
    {
        __IO uint16_t INTSEL8;
        stc_intc_intsel8_field_t INTSEL8_f;
    };
    uint8_t RESERVED32[2];
    union
    {
        __IO uint16_t INTSEL9;
        stc_intc_intsel9_field_t INTSEL9_f;
    };
    uint8_t RESERVED33[2];
    union
    {
        __IO uint16_t INTSEL10;
        stc_intc_intsel10_field_t INTSEL10_f;
    };
    uint8_t RESERVED34[2];
    union
    {
        __IO uint16_t INTSEL11;
        stc_intc_intsel11_field_t INTSEL11_f;
    };
    uint8_t RESERVED35[2];
    union
    {
        __IO uint16_t INTSEL12;
        stc_intc_intsel12_field_t INTSEL12_f;
    };
    uint8_t RESERVED36[2];
    union
    {
        __IO uint16_t INTSEL13;
        stc_intc_intsel13_field_t INTSEL13_f;
    };
    uint8_t RESERVED37[2];
    union
    {
        __IO uint16_t INTSEL14;
        stc_intc_intsel14_field_t INTSEL14_f;
    };
    uint8_t RESERVED38[2];
    union
    {
        __IO uint16_t INTSEL15;
        stc_intc_intsel15_field_t INTSEL15_f;
    };
    uint8_t RESERVED39[2];
    union
    {
        __IO uint16_t INTSEL16;
        stc_intc_intsel16_field_t INTSEL16_f;
    };
    uint8_t RESERVED40[2];
    union
    {
        __IO uint16_t INTSEL17;
        stc_intc_intsel17_field_t INTSEL17_f;
    };
    uint8_t RESERVED41[2];
    union
    {
        __IO uint16_t INTSEL18;
        stc_intc_intsel18_field_t INTSEL18_f;
    };
    uint8_t RESERVED42[2];
    union
    {
        __IO uint16_t INTSEL19;
        stc_intc_intsel19_field_t INTSEL19_f;
    };
    uint8_t RESERVED43[2];
    union
    {
        __IO uint16_t INTSEL20;
        stc_intc_intsel20_field_t INTSEL20_f;
    };
    uint8_t RESERVED44[2];
    union
    {
        __IO uint16_t INTSEL21;
        stc_intc_intsel21_field_t INTSEL21_f;
    };
    uint8_t RESERVED45[2];
    union
    {
        __IO uint16_t INTSEL22;
        stc_intc_intsel22_field_t INTSEL22_f;
    };
    uint8_t RESERVED46[2];
    union
    {
        __IO uint16_t INTSEL23;
        stc_intc_intsel23_field_t INTSEL23_f;
    };
    uint8_t RESERVED47[2];
    union
    {
        __IO uint16_t INTSEL24;
        stc_intc_intsel24_field_t INTSEL24_f;
    };
    uint8_t RESERVED48[2];
    union
    {
        __IO uint16_t INTSEL25;
        stc_intc_intsel25_field_t INTSEL25_f;
    };
    uint8_t RESERVED49[2];
    union
    {
        __IO uint16_t INTSEL26;
        stc_intc_intsel26_field_t INTSEL26_f;
    };
    uint8_t RESERVED50[2];
    union
    {
        __IO uint16_t INTSEL27;
        stc_intc_intsel27_field_t INTSEL27_f;
    };
    uint8_t RESERVED51[2];
    union
    {
        __IO uint16_t INTSEL28;
        stc_intc_intsel28_field_t INTSEL28_f;
    };
    uint8_t RESERVED52[2];
    union
    {
        __IO uint16_t INTSEL29;
        stc_intc_intsel29_field_t INTSEL29_f;
    };
    uint8_t RESERVED53[2];
    union
    {
        __IO uint16_t INTSEL30;
        stc_intc_intsel30_field_t INTSEL30_f;
    };
    uint8_t RESERVED54[2];
    union
    {
        __IO uint16_t INTSEL31;
        stc_intc_intsel31_field_t INTSEL31_f;
    };
    uint8_t RESERVED55[2];
    union
    {
        __IO uint16_t INTSEL32;
        stc_intc_intsel32_field_t INTSEL32_f;
    };
    uint8_t RESERVED56[2];
    union
    {
        __IO uint16_t INTSEL33;
        stc_intc_intsel33_field_t INTSEL33_f;
    };
    uint8_t RESERVED57[2];
    union
    {
        __IO uint16_t INTSEL34;
        stc_intc_intsel34_field_t INTSEL34_f;
    };
    uint8_t RESERVED58[2];
    union
    {
        __IO uint16_t INTSEL35;
        stc_intc_intsel35_field_t INTSEL35_f;
    };
    uint8_t RESERVED59[2];
    union
    {
        __IO uint16_t INTSEL36;
        stc_intc_intsel36_field_t INTSEL36_f;
    };
    uint8_t RESERVED60[2];
    union
    {
        __IO uint16_t INTSEL37;
        stc_intc_intsel37_field_t INTSEL37_f;
    };
    uint8_t RESERVED61[2];
    union
    {
        __IO uint16_t INTSEL38;
        stc_intc_intsel38_field_t INTSEL38_f;
    };
    uint8_t RESERVED62[2];
    union
    {
        __IO uint16_t INTSEL39;
        stc_intc_intsel39_field_t INTSEL39_f;
    };
    uint8_t RESERVED63[2];
    union
    {
        __IO uint16_t INTSEL40;
        stc_intc_intsel40_field_t INTSEL40_f;
    };
    uint8_t RESERVED64[2];
    union
    {
        __IO uint16_t INTSEL41;
        stc_intc_intsel41_field_t INTSEL41_f;
    };
    uint8_t RESERVED65[2];
    union
    {
        __IO uint16_t INTSEL42;
        stc_intc_intsel42_field_t INTSEL42_f;
    };
    uint8_t RESERVED66[2];
    union
    {
        __IO uint16_t INTSEL43;
        stc_intc_intsel43_field_t INTSEL43_f;
    };
    uint8_t RESERVED67[2];
    union
    {
        __IO uint16_t INTSEL44;
        stc_intc_intsel44_field_t INTSEL44_f;
    };
    uint8_t RESERVED68[2];
    union
    {
        __IO uint16_t INTSEL45;
        stc_intc_intsel45_field_t INTSEL45_f;
    };
    uint8_t RESERVED69[2];
    union
    {
        __IO uint16_t INTSEL46;
        stc_intc_intsel46_field_t INTSEL46_f;
    };
    uint8_t RESERVED70[2];
    union
    {
        __IO uint16_t INTSEL47;
        stc_intc_intsel47_field_t INTSEL47_f;
    };
    uint8_t RESERVED71[2];
    union
    {
        __IO uint16_t INTSEL48;
        stc_intc_intsel48_field_t INTSEL48_f;
    };
    uint8_t RESERVED72[2];
    union
    {
        __IO uint16_t INTSEL49;
        stc_intc_intsel49_field_t INTSEL49_f;
    };
    uint8_t RESERVED73[2];
    union
    {
        __IO uint16_t INTSEL50;
        stc_intc_intsel50_field_t INTSEL50_f;
    };
    uint8_t RESERVED74[2];
    union
    {
        __IO uint16_t INTSEL51;
        stc_intc_intsel51_field_t INTSEL51_f;
    };
    uint8_t RESERVED75[2];
    union
    {
        __IO uint16_t INTSEL52;
        stc_intc_intsel52_field_t INTSEL52_f;
    };
    uint8_t RESERVED76[2];
    union
    {
        __IO uint16_t INTSEL53;
        stc_intc_intsel53_field_t INTSEL53_f;
    };
    uint8_t RESERVED77[2];
    union
    {
        __IO uint16_t INTSEL54;
        stc_intc_intsel54_field_t INTSEL54_f;
    };
    uint8_t RESERVED78[2];
    union
    {
        __IO uint16_t INTSEL55;
        stc_intc_intsel55_field_t INTSEL55_f;
    };
    uint8_t RESERVED79[2];
    union
    {
        __IO uint16_t INTSEL56;
        stc_intc_intsel56_field_t INTSEL56_f;
    };
    uint8_t RESERVED80[2];
    union
    {
        __IO uint16_t INTSEL57;
        stc_intc_intsel57_field_t INTSEL57_f;
    };
    uint8_t RESERVED81[2];
    union
    {
        __IO uint16_t INTSEL58;
        stc_intc_intsel58_field_t INTSEL58_f;
    };
    uint8_t RESERVED82[2];
    union
    {
        __IO uint16_t INTSEL59;
        stc_intc_intsel59_field_t INTSEL59_f;
    };
    uint8_t RESERVED83[2];
    union
    {
        __IO uint16_t INTSEL60;
        stc_intc_intsel60_field_t INTSEL60_f;
    };
    uint8_t RESERVED84[2];
    union
    {
        __IO uint16_t INTSEL61;
        stc_intc_intsel61_field_t INTSEL61_f;
    };
    uint8_t RESERVED85[2];
    union
    {
        __IO uint16_t INTSEL62;
        stc_intc_intsel62_field_t INTSEL62_f;
    };
    uint8_t RESERVED86[2];
    union
    {
        __IO uint16_t INTSEL63;
        stc_intc_intsel63_field_t INTSEL63_f;
    };
    uint8_t RESERVED87[2];
    union
    {
        __IO uint16_t INTSEL64;
        stc_intc_intsel64_field_t INTSEL64_f;
    };
    uint8_t RESERVED88[2];
    union
    {
        __IO uint16_t INTSEL65;
        stc_intc_intsel65_field_t INTSEL65_f;
    };
    uint8_t RESERVED89[2];
    union
    {
        __IO uint16_t INTSEL66;
        stc_intc_intsel66_field_t INTSEL66_f;
    };
    uint8_t RESERVED90[2];
    union
    {
        __IO uint16_t INTSEL67;
        stc_intc_intsel67_field_t INTSEL67_f;
    };
    uint8_t RESERVED91[2];
    union
    {
        __IO uint16_t INTSEL68;
        stc_intc_intsel68_field_t INTSEL68_f;
    };
    uint8_t RESERVED92[2];
    union
    {
        __IO uint16_t INTSEL69;
        stc_intc_intsel69_field_t INTSEL69_f;
    };
    uint8_t RESERVED93[2];
    union
    {
        __IO uint16_t INTSEL70;
        stc_intc_intsel70_field_t INTSEL70_f;
    };
    uint8_t RESERVED94[2];
    union
    {
        __IO uint16_t INTSEL71;
        stc_intc_intsel71_field_t INTSEL71_f;
    };
    uint8_t RESERVED95[2];
    union
    {
        __IO uint16_t INTSEL72;
        stc_intc_intsel72_field_t INTSEL72_f;
    };
    uint8_t RESERVED96[2];
    union
    {
        __IO uint16_t INTSEL73;
        stc_intc_intsel73_field_t INTSEL73_f;
    };
    uint8_t RESERVED97[2];
    union
    {
        __IO uint16_t INTSEL74;
        stc_intc_intsel74_field_t INTSEL74_f;
    };
    uint8_t RESERVED98[2];
    union
    {
        __IO uint16_t INTSEL75;
        stc_intc_intsel75_field_t INTSEL75_f;
    };
    uint8_t RESERVED99[2];
    union
    {
        __IO uint16_t INTSEL76;
        stc_intc_intsel76_field_t INTSEL76_f;
    };
    uint8_t RESERVED100[2];
    union
    {
        __IO uint16_t INTSEL77;
        stc_intc_intsel77_field_t INTSEL77_f;
    };
    uint8_t RESERVED101[2];
    union
    {
        __IO uint16_t INTSEL78;
        stc_intc_intsel78_field_t INTSEL78_f;
    };
    uint8_t RESERVED102[2];
    union
    {
        __IO uint16_t INTSEL79;
        stc_intc_intsel79_field_t INTSEL79_f;
    };
    uint8_t RESERVED103[2];
    union
    {
        __IO uint16_t INTSEL80;
        stc_intc_intsel80_field_t INTSEL80_f;
    };
    uint8_t RESERVED104[2];
    union
    {
        __IO uint16_t INTSEL81;
        stc_intc_intsel81_field_t INTSEL81_f;
    };
    uint8_t RESERVED105[2];
    union
    {
        __IO uint16_t INTSEL82;
        stc_intc_intsel82_field_t INTSEL82_f;
    };
    uint8_t RESERVED106[2];
    union
    {
        __IO uint16_t INTSEL83;
        stc_intc_intsel83_field_t INTSEL83_f;
    };
    uint8_t RESERVED107[2];
    union
    {
        __IO uint16_t INTSEL84;
        stc_intc_intsel84_field_t INTSEL84_f;
    };
    uint8_t RESERVED108[2];
    union
    {
        __IO uint16_t INTSEL85;
        stc_intc_intsel85_field_t INTSEL85_f;
    };
    uint8_t RESERVED109[2];
    union
    {
        __IO uint16_t INTSEL86;
        stc_intc_intsel86_field_t INTSEL86_f;
    };
    uint8_t RESERVED110[2];
    union
    {
        __IO uint16_t INTSEL87;
        stc_intc_intsel87_field_t INTSEL87_f;
    };
    uint8_t RESERVED111[2];
    union
    {
        __IO uint16_t INTSEL88;
        stc_intc_intsel88_field_t INTSEL88_f;
    };
    uint8_t RESERVED112[2];
    union
    {
        __IO uint16_t INTSEL89;
        stc_intc_intsel89_field_t INTSEL89_f;
    };
    uint8_t RESERVED113[2];
    union
    {
        __IO uint16_t INTSEL90;
        stc_intc_intsel90_field_t INTSEL90_f;
    };
    uint8_t RESERVED114[2];
    union
    {
        __IO uint16_t INTSEL91;
        stc_intc_intsel91_field_t INTSEL91_f;
    };
    uint8_t RESERVED115[2];
    union
    {
        __IO uint16_t INTSEL92;
        stc_intc_intsel92_field_t INTSEL92_f;
    };
    uint8_t RESERVED116[2];
    union
    {
        __IO uint16_t INTSEL93;
        stc_intc_intsel93_field_t INTSEL93_f;
    };
    uint8_t RESERVED117[2];
    union
    {
        __IO uint16_t INTSEL94;
        stc_intc_intsel94_field_t INTSEL94_f;
    };
    uint8_t RESERVED118[2];
    union
    {
        __IO uint16_t INTSEL95;
        stc_intc_intsel95_field_t INTSEL95_f;
    };
    uint8_t RESERVED119[2];
    union
    {
        __IO uint16_t INTSEL96;
        stc_intc_intsel96_field_t INTSEL96_f;
    };
    uint8_t RESERVED120[2];
    union
    {
        __IO uint16_t INTSEL97;
        stc_intc_intsel97_field_t INTSEL97_f;
    };
    uint8_t RESERVED121[2];
    union
    {
        __IO uint16_t INTSEL98;
        stc_intc_intsel98_field_t INTSEL98_f;
    };
    uint8_t RESERVED122[2];
    union
    {
        __IO uint16_t INTSEL99;
        stc_intc_intsel99_field_t INTSEL99_f;
    };
    uint8_t RESERVED123[2];
    union
    {
        __IO uint16_t INTSEL100;
        stc_intc_intsel100_field_t INTSEL100_f;
    };
    uint8_t RESERVED124[2];
    union
    {
        __IO uint16_t INTSEL101;
        stc_intc_intsel101_field_t INTSEL101_f;
    };
    uint8_t RESERVED125[2];
    union
    {
        __IO uint16_t INTSEL102;
        stc_intc_intsel102_field_t INTSEL102_f;
    };
    uint8_t RESERVED126[2];
    union
    {
        __IO uint16_t INTSEL103;
        stc_intc_intsel103_field_t INTSEL103_f;
    };
    uint8_t RESERVED127[2];
    union
    {
        __IO uint16_t INTSEL104;
        stc_intc_intsel104_field_t INTSEL104_f;
    };
    uint8_t RESERVED128[2];
    union
    {
        __IO uint16_t INTSEL105;
        stc_intc_intsel105_field_t INTSEL105_f;
    };
    uint8_t RESERVED129[2];
    union
    {
        __IO uint16_t INTSEL106;
        stc_intc_intsel106_field_t INTSEL106_f;
    };
    uint8_t RESERVED130[2];
    union
    {
        __IO uint16_t INTSEL107;
        stc_intc_intsel107_field_t INTSEL107_f;
    };
    uint8_t RESERVED131[2];
    union
    {
        __IO uint16_t INTSEL108;
        stc_intc_intsel108_field_t INTSEL108_f;
    };
    uint8_t RESERVED132[2];
    union
    {
        __IO uint16_t INTSEL109;
        stc_intc_intsel109_field_t INTSEL109_f;
    };
    uint8_t RESERVED133[2];
    union
    {
        __IO uint16_t INTSEL110;
        stc_intc_intsel110_field_t INTSEL110_f;
    };
    uint8_t RESERVED134[2];
    union
    {
        __IO uint16_t INTSEL111;
        stc_intc_intsel111_field_t INTSEL111_f;
    };
    uint8_t RESERVED135[2];
    union
    {
        __IO uint16_t INTSEL112;
        stc_intc_intsel112_field_t INTSEL112_f;
    };
    uint8_t RESERVED136[2];
    union
    {
        __IO uint16_t INTSEL113;
        stc_intc_intsel113_field_t INTSEL113_f;
    };
    uint8_t RESERVED137[2];
    union
    {
        __IO uint16_t INTSEL114;
        stc_intc_intsel114_field_t INTSEL114_f;
    };
    uint8_t RESERVED138[2];
    union
    {
        __IO uint16_t INTSEL115;
        stc_intc_intsel115_field_t INTSEL115_f;
    };
    uint8_t RESERVED139[2];
    union
    {
        __IO uint16_t INTSEL116;
        stc_intc_intsel116_field_t INTSEL116_f;
    };
    uint8_t RESERVED140[2];
    union
    {
        __IO uint16_t INTSEL117;
        stc_intc_intsel117_field_t INTSEL117_f;
    };
    uint8_t RESERVED141[2];
    union
    {
        __IO uint16_t INTSEL118;
        stc_intc_intsel118_field_t INTSEL118_f;
    };
    uint8_t RESERVED142[2];
    union
    {
        __IO uint16_t INTSEL119;
        stc_intc_intsel119_field_t INTSEL119_f;
    };
    uint8_t RESERVED143[2];
    union
    {
        __IO uint16_t INTSEL120;
        stc_intc_intsel120_field_t INTSEL120_f;
    };
    uint8_t RESERVED144[2];
    union
    {
        __IO uint16_t INTSEL121;
        stc_intc_intsel121_field_t INTSEL121_f;
    };
    uint8_t RESERVED145[2];
    union
    {
        __IO uint16_t INTSEL122;
        stc_intc_intsel122_field_t INTSEL122_f;
    };
    uint8_t RESERVED146[2];
    union
    {
        __IO uint16_t INTSEL123;
        stc_intc_intsel123_field_t INTSEL123_f;
    };
    uint8_t RESERVED147[2];
    union
    {
        __IO uint16_t INTSEL124;
        stc_intc_intsel124_field_t INTSEL124_f;
    };
    uint8_t RESERVED148[2];
    union
    {
        __IO uint16_t INTSEL125;
        stc_intc_intsel125_field_t INTSEL125_f;
    };
    uint8_t RESERVED149[2];
    union
    {
        __IO uint16_t INTSEL126;
        stc_intc_intsel126_field_t INTSEL126_f;
    };
    uint8_t RESERVED150[2];
    union
    {
        __IO uint16_t INTSEL127;
        stc_intc_intsel127_field_t INTSEL127_f;
    };
}M4_INTC_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t SMR;
        stc_msc_i2c_smr_field_t SMR_f;
    };
    union
    {
        __IO uint8_t SCR;
        stc_msc_i2c_scr_field_t SCR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t BS;
        stc_msc_i2c_bs_field_t BS_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_i2c_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    __IO uint8_t TXDR_RXDR;
    uint8_t RESERVED5[3];
    union
    {
        __IO uint16_t BRS;
        stc_msc_i2c_brs_field_t BRS_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t SAMSK;
        stc_msc_i2c_samsk_field_t SAMSK_f;
    };
    uint8_t RESERVED7[11];
    union
    {
        __IO uint8_t EBCR;
        stc_msc_i2c_ebcr_field_t EBCR_f;
    };
}M4_MSC_I2C_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t SMR;
        stc_msc_sci_smr_field_t SMR_f;
    };
    union
    {
        __IO uint8_t SCR;
        stc_msc_sci_scr_field_t SCR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t ECR;
        stc_msc_sci_ecr_field_t ECR_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_sci_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    __IO uint16_t TXDR_RXDR;
    uint8_t RESERVED5[2];
    union
    {
        __IO uint16_t BRS;
        stc_msc_sci_brs_field_t BRS_f;
    };
    uint8_t RESERVED6[66];
    union
    {
        __IO uint8_t COMP0;
        stc_msc_sci_comp0_field_t COMP0_f;
    };
    union
    {
        __IO uint8_t COMP1;
        stc_msc_sci_comp1_field_t COMP1_f;
    };
}M4_MSC_SCI_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t SMR;
        stc_msc_spi_smr_field_t SMR_f;
    };
    union
    {
        __IO uint8_t SCR;
        stc_msc_spi_scr_field_t SCR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t ECR;
        stc_msc_spi_ecr_field_t ECR_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_spi_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    __IO uint16_t TXDR_RXDR;
    uint8_t RESERVED5[2];
    union
    {
        __IO uint16_t BRS;
        stc_msc_spi_brs_field_t BRS_f;
    };
    uint8_t RESERVED6[14];
    __IO uint8_t CSTMG0;
    __IO uint8_t CSTMG1;
    uint8_t RESERVED8[2];
    __IO uint16_t CSTMG23;
    uint8_t RESERVED9[2];
    union
    {
        __IO uint16_t EACR;
        stc_msc_spi_eacr_field_t EACR_f;
    };
    uint8_t RESERVED10[2];
    __IO uint16_t TMR;
    uint8_t RESERVED11[2];
    __IO uint16_t TMC;
    uint8_t RESERVED12[2];
    union
    {
        __IO uint16_t CSCR;
        stc_msc_spi_cscr_field_t CSCR_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint8_t CSFR1;
        stc_msc_spi_csfr1_field_t CSFR1_f;
    };
    union
    {
        __IO uint8_t CSFR2;
        stc_msc_spi_csfr2_field_t CSFR2_f;
    };
    uint8_t RESERVED15[6];
    __IO uint8_t TBYTE0;
    __IO uint8_t TBYTE1;
    uint8_t RESERVED17[2];
    __IO uint8_t TBYTE2;
    __IO uint8_t TBYTE3;
}M4_MSC_SPI_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t FCG0;
        stc_mstp_fcg0_field_t FCG0_f;
    };
    union
    {
        __IO uint32_t FCG1;
        stc_mstp_fcg1_field_t FCG1_f;
    };
    union
    {
        __IO uint32_t FCG2;
        stc_mstp_fcg2_field_t FCG2_f;
    };
    union
    {
        __IO uint16_t FCG3;
        stc_mstp_fcg3_field_t FCG3_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint32_t FCG0PC;
        stc_mstp_fcg0pc_field_t FCG0PC_f;
    };
    union
    {
        __IO uint16_t PRAMLPC;
        stc_mstp_pramlpc_field_t PRAMLPC_f;
    };
}M4_MSTP_TypeDef;

