RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    union
    {
        __IO uint16_t PIDR0;
        stc_port_pidr0_field_t PIDR0_f;
    };
    uint8_t RESERVED1[2];
    union
    {
        __IO uint16_t PODR0;
        stc_port_podr0_field_t PODR0_f;
    };
    union
    {
        __IO uint16_t POER0;
        stc_port_poer0_field_t POER0_f;
    };
    union
    {
        __IO uint16_t POSR0;
        stc_port_posr0_field_t POSR0_f;
    };
    union
    {
        __IO uint16_t PORR0;
        stc_port_porr0_field_t PORR0_f;
    };
    union
    {
        __IO uint16_t POTR0;
        stc_port_potr0_field_t POTR0_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t PIDR1;
        stc_port_pidr1_field_t PIDR1_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint16_t PODR1;
        stc_port_podr1_field_t PODR1_f;
    };
    union
    {
        __IO uint16_t POER1;
        stc_port_poer1_field_t POER1_f;
    };
    union
    {
        __IO uint16_t POSR1;
        stc_port_posr1_field_t POSR1_f;
    };
    union
    {
        __IO uint16_t PORR1;
        stc_port_porr1_field_t PORR1_f;
    };
    union
    {
        __IO uint16_t POTR1;
        stc_port_potr1_field_t POTR1_f;
    };
    uint8_t RESERVED12[2];
    union
    {
        __IO uint16_t PIDR2;
        stc_port_pidr2_field_t PIDR2_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint16_t PODR2;
        stc_port_podr2_field_t PODR2_f;
    };
    union
    {
        __IO uint16_t POER2;
        stc_port_poer2_field_t POER2_f;
    };
    union
    {
        __IO uint16_t POSR2;
        stc_port_posr2_field_t POSR2_f;
    };
    union
    {
        __IO uint16_t PORR2;
        stc_port_porr2_field_t PORR2_f;
    };
    union
    {
        __IO uint16_t POTR2;
        stc_port_potr2_field_t POTR2_f;
    };
    uint8_t RESERVED18[2];
    union
    {
        __IO uint16_t PIDR3;
        stc_port_pidr3_field_t PIDR3_f;
    };
    uint8_t RESERVED19[2];
    union
    {
        __IO uint16_t PODR3;
        stc_port_podr3_field_t PODR3_f;
    };
    union
    {
        __IO uint16_t POER3;
        stc_port_poer3_field_t POER3_f;
    };
    union
    {
        __IO uint16_t POSR3;
        stc_port_posr3_field_t POSR3_f;
    };
    union
    {
        __IO uint16_t PORR3;
        stc_port_porr3_field_t PORR3_f;
    };
    union
    {
        __IO uint16_t POTR3;
        stc_port_potr3_field_t POTR3_f;
    };
    uint8_t RESERVED24[2];
    union
    {
        __IO uint16_t PIDR4;
        stc_port_pidr4_field_t PIDR4_f;
    };
    uint8_t RESERVED25[2];
    union
    {
        __IO uint16_t PODR4;
        stc_port_podr4_field_t PODR4_f;
    };
    union
    {
        __IO uint16_t POER4;
        stc_port_poer4_field_t POER4_f;
    };
    union
    {
        __IO uint16_t POSR4;
        stc_port_posr4_field_t POSR4_f;
    };
    union
    {
        __IO uint16_t PORR4;
        stc_port_porr4_field_t PORR4_f;
    };
    union
    {
        __IO uint16_t POTR4;
        stc_port_potr4_field_t POTR4_f;
    };
    uint8_t RESERVED30[2];
    union
    {
        __IO uint16_t PIDR5;
        stc_port_pidr5_field_t PIDR5_f;
    };
    uint8_t RESERVED31[2];
    union
    {
        __IO uint16_t PODR5;
        stc_port_podr5_field_t PODR5_f;
    };
    union
    {
        __IO uint16_t POER5;
        stc_port_poer5_field_t POER5_f;
    };
    union
    {
        __IO uint16_t POSR5;
        stc_port_posr5_field_t POSR5_f;
    };
    union
    {
        __IO uint16_t PORR5;
        stc_port_porr5_field_t PORR5_f;
    };
    union
    {
        __IO uint16_t POTR5;
        stc_port_potr5_field_t POTR5_f;
    };
    uint8_t RESERVED36[2];
    union
    {
        __IO uint16_t PIDR6;
        stc_port_pidr6_field_t PIDR6_f;
    };
    uint8_t RESERVED37[2];
    union
    {
        __IO uint16_t PODR6;
        stc_port_podr6_field_t PODR6_f;
    };
    union
    {
        __IO uint16_t POER6;
        stc_port_poer6_field_t POER6_f;
    };
    union
    {
        __IO uint16_t POSR6;
        stc_port_posr6_field_t POSR6_f;
    };
    union
    {
        __IO uint16_t PORR6;
        stc_port_porr6_field_t PORR6_f;
    };
    union
    {
        __IO uint16_t POTR6;
        stc_port_potr6_field_t POTR6_f;
    };
    uint8_t RESERVED42[2];
    union
    {
        __IO uint8_t PIDR7;
        stc_port_pidr7_field_t PIDR7_f;
    };
    uint8_t RESERVED43[3];
    union
    {
        __IO uint8_t PODR7;
        stc_port_podr7_field_t PODR7_f;
    };
    uint8_t RESERVED44[1];
    union
    {
        __IO uint8_t POER7;
        stc_port_poer7_field_t POER7_f;
    };
    uint8_t RESERVED45[1];
    union
    {
        __IO uint8_t POSR7;
        stc_port_posr7_field_t POSR7_f;
    };
    uint8_t RESERVED46[1];
    union
    {
        __IO uint8_t PORR7;
        stc_port_porr7_field_t PORR7_f;
    };
    uint8_t RESERVED47[1];
    union
    {
        __IO uint8_t POTR7;
        stc_port_potr7_field_t POTR7_f;
    };
    uint8_t RESERVED48[891];
    union
    {
        __IO uint16_t PCCR;
        stc_port_pccr_field_t PCCR_f;
    };
    uint8_t RESERVED49[2];
    union
    {
        __IO uint16_t PWPR;
        stc_port_pwpr_field_t PWPR_f;
    };
    uint8_t RESERVED50[2];
    union
    {
        __IO uint16_t PCR000;
        stc_port_pcr000_field_t PCR000_f;
    };
    union
    {
        __IO uint16_t PFSR000;
        stc_port_pfsr000_field_t PFSR000_f;
    };
    union
    {
        __IO uint16_t PCR001;
        stc_port_pcr001_field_t PCR001_f;
    };
    union
    {
        __IO uint16_t PFSR001;
        stc_port_pfsr001_field_t PFSR001_f;
    };
    union
    {
        __IO uint16_t PCR002;
        stc_port_pcr002_field_t PCR002_f;
    };
    union
    {
        __IO uint16_t PFSR002;
        stc_port_pfsr002_field_t PFSR002_f;
    };
    union
    {
        __IO uint16_t PCR003;
        stc_port_pcr003_field_t PCR003_f;
    };
    union
    {
        __IO uint16_t PFSR003;
        stc_port_pfsr003_field_t PFSR003_f;
    };
    union
    {
        __IO uint16_t PCR004;
        stc_port_pcr004_field_t PCR004_f;
    };
    union
    {
        __IO uint16_t PFSR004;
        stc_port_pfsr004_field_t PFSR004_f;
    };
    union
    {
        __IO uint16_t PCR005;
        stc_port_pcr005_field_t PCR005_f;
    };
    union
    {
        __IO uint16_t PFSR005;
        stc_port_pfsr005_field_t PFSR005_f;
    };
    union
    {
        __IO uint16_t PCR006;
        stc_port_pcr006_field_t PCR006_f;
    };
    union
    {
        __IO uint16_t PFSR006;
        stc_port_pfsr006_field_t PFSR006_f;
    };
    union
    {
        __IO uint16_t PCR007;
        stc_port_pcr007_field_t PCR007_f;
    };
    union
    {
        __IO uint16_t PFSR007;
        stc_port_pfsr007_field_t PFSR007_f;
    };
    union
    {
        __IO uint16_t PCR008;
        stc_port_pcr008_field_t PCR008_f;
    };
    union
    {
        __IO uint16_t PFSR008;
        stc_port_pfsr008_field_t PFSR008_f;
    };
    union
    {
        __IO uint16_t PCR009;
        stc_port_pcr009_field_t PCR009_f;
    };
    union
    {
        __IO uint16_t PFSR009;
        stc_port_pfsr009_field_t PFSR009_f;
    };
    union
    {
        __IO uint16_t PCR010;
        stc_port_pcr010_field_t PCR010_f;
    };
    union
    {
        __IO uint16_t PFSR010;
        stc_port_pfsr010_field_t PFSR010_f;
    };
    union
    {
        __IO uint16_t PCR011;
        stc_port_pcr011_field_t PCR011_f;
    };
    union
    {
        __IO uint16_t PFSR011;
        stc_port_pfsr011_field_t PFSR011_f;
    };
    union
    {
        __IO uint16_t PCR012;
        stc_port_pcr012_field_t PCR012_f;
    };
    union
    {
        __IO uint16_t PFSR012;
        stc_port_pfsr012_field_t PFSR012_f;
    };
    union
    {
        __IO uint16_t PCR013;
        stc_port_pcr013_field_t PCR013_f;
    };
    union
    {
        __IO uint16_t PFSR013;
        stc_port_pfsr013_field_t PFSR013_f;
    };
    union
    {
        __IO uint16_t PCR014;
        stc_port_pcr014_field_t PCR014_f;
    };
    union
    {
        __IO uint16_t PFSR014;
        stc_port_pfsr014_field_t PFSR014_f;
    };
    union
    {
        __IO uint16_t PCR015;
        stc_port_pcr015_field_t PCR015_f;
    };
    union
    {
        __IO uint16_t PFSR015;
        stc_port_pfsr015_field_t PFSR015_f;
    };
    union
    {
        __IO uint16_t PCR100;
        stc_port_pcr100_field_t PCR100_f;
    };
    union
    {
        __IO uint16_t PFSR100;
        stc_port_pfsr100_field_t PFSR100_f;
    };
    union
    {
        __IO uint16_t PCR101;
        stc_port_pcr101_field_t PCR101_f;
    };
    union
    {
        __IO uint16_t PFSR101;
        stc_port_pfsr101_field_t PFSR101_f;
    };
    union
    {
        __IO uint16_t PCR102;
        stc_port_pcr102_field_t PCR102_f;
    };
    union
    {
        __IO uint16_t PFSR102;
        stc_port_pfsr102_field_t PFSR102_f;
    };
    union
    {
        __IO uint16_t PCR103;
        stc_port_pcr103_field_t PCR103_f;
    };
    union
    {
        __IO uint16_t PFSR103;
        stc_port_pfsr103_field_t PFSR103_f;
    };
    union
    {
        __IO uint16_t PCR104;
        stc_port_pcr104_field_t PCR104_f;
    };
    union
    {
        __IO uint16_t PFSR104;
        stc_port_pfsr104_field_t PFSR104_f;
    };
    union
    {
        __IO uint16_t PCR105;
        stc_port_pcr105_field_t PCR105_f;
    };
    union
    {
        __IO uint16_t PFSR105;
        stc_port_pfsr105_field_t PFSR105_f;
    };
    union
    {
        __IO uint16_t PCR106;
        stc_port_pcr106_field_t PCR106_f;
    };
    union
    {
        __IO uint16_t PFSR106;
        stc_port_pfsr106_field_t PFSR106_f;
    };
    union
    {
        __IO uint16_t PCR107;
        stc_port_pcr107_field_t PCR107_f;
    };
    union
    {
        __IO uint16_t PFSR107;
        stc_port_pfsr107_field_t PFSR107_f;
    };
    union
    {
        __IO uint16_t PCR108;
        stc_port_pcr108_field_t PCR108_f;
    };
    union
    {
        __IO uint16_t PFSR108;
        stc_port_pfsr108_field_t PFSR108_f;
    };
    union
    {
        __IO uint16_t PCR109;
        stc_port_pcr109_field_t PCR109_f;
    };
    union
    {
        __IO uint16_t PFSR109;
        stc_port_pfsr109_field_t PFSR109_f;
    };
    union
    {
        __IO uint16_t PCR110;
        stc_port_pcr110_field_t PCR110_f;
    };
    union
    {
        __IO uint16_t PFSR110;
        stc_port_pfsr110_field_t PFSR110_f;
    };
    union
    {
        __IO uint16_t PCR111;
        stc_port_pcr111_field_t PCR111_f;
    };
    union
    {
        __IO uint16_t PFSR111;
        stc_port_pfsr111_field_t PFSR111_f;
    };
    union
    {
        __IO uint16_t PCR112;
        stc_port_pcr112_field_t PCR112_f;
    };
    union
    {
        __IO uint16_t PFSR112;
        stc_port_pfsr112_field_t PFSR112_f;
    };
    union
    {
        __IO uint16_t PCR113;
        stc_port_pcr113_field_t PCR113_f;
    };
    union
    {
        __IO uint16_t PFSR113;
        stc_port_pfsr113_field_t PFSR113_f;
    };
    union
    {
        __IO uint16_t PCR114;
        stc_port_pcr114_field_t PCR114_f;
    };
    union
    {
        __IO uint16_t PFSR114;
        stc_port_pfsr114_field_t PFSR114_f;
    };
    union
    {
        __IO uint16_t PCR115;
        stc_port_pcr115_field_t PCR115_f;
    };
    union
    {
        __IO uint16_t PFSR115;
        stc_port_pfsr115_field_t PFSR115_f;
    };
    union
    {
        __IO uint16_t PCR200;
        stc_port_pcr200_field_t PCR200_f;
    };
    union
    {
        __IO uint16_t PFSR200;
        stc_port_pfsr200_field_t PFSR200_f;
    };
    union
    {
        __IO uint16_t PCR201;
        stc_port_pcr201_field_t PCR201_f;
    };
    union
    {
        __IO uint16_t PFSR201;
        stc_port_pfsr201_field_t PFSR201_f;
    };
    union
    {
        __IO uint16_t PCR202;
        stc_port_pcr202_field_t PCR202_f;
    };
    union
    {
        __IO uint16_t PFSR202;
        stc_port_pfsr202_field_t PFSR202_f;
    };
    union
    {
        __IO uint16_t PCR203;
        stc_port_pcr203_field_t PCR203_f;
    };
    union
    {
        __IO uint16_t PFSR203;
        stc_port_pfsr203_field_t PFSR203_f;
    };
    union
    {
        __IO uint16_t PCR204;
        stc_port_pcr204_field_t PCR204_f;
    };
    union
    {
        __IO uint16_t PFSR204;
        stc_port_pfsr204_field_t PFSR204_f;
    };
    union
    {
        __IO uint16_t PCR205;
        stc_port_pcr205_field_t PCR205_f;
    };
    union
    {
        __IO uint16_t PFSR205;
        stc_port_pfsr205_field_t PFSR205_f;
    };
    union
    {
        __IO uint16_t PCR206;
        stc_port_pcr206_field_t PCR206_f;
    };
    union
    {
        __IO uint16_t PFSR206;
        stc_port_pfsr206_field_t PFSR206_f;
    };
    union
    {
        __IO uint16_t PCR207;
        stc_port_pcr207_field_t PCR207_f;
    };
    union
    {
        __IO uint16_t PFSR207;
        stc_port_pfsr207_field_t PFSR207_f;
    };
    union
    {
        __IO uint16_t PCR208;
        stc_port_pcr208_field_t PCR208_f;
    };
    union
    {
        __IO uint16_t PFSR208;
        stc_port_pfsr208_field_t PFSR208_f;
    };
    union
    {
        __IO uint16_t PCR209;
        stc_port_pcr209_field_t PCR209_f;
    };
    union
    {
        __IO uint16_t PFSR209;
        stc_port_pfsr209_field_t PFSR209_f;
    };
    union
    {
        __IO uint16_t PCR210;
        stc_port_pcr210_field_t PCR210_f;
    };
    union
    {
        __IO uint16_t PFSR210;
        stc_port_pfsr210_field_t PFSR210_f;
    };
    union
    {
        __IO uint16_t PCR211;
        stc_port_pcr211_field_t PCR211_f;
    };
    union
    {
        __IO uint16_t PFSR211;
        stc_port_pfsr211_field_t PFSR211_f;
    };
    union
    {
        __IO uint16_t PCR212;
        stc_port_pcr212_field_t PCR212_f;
    };
    union
    {
        __IO uint16_t PFSR212;
        stc_port_pfsr212_field_t PFSR212_f;
    };
    union
    {
        __IO uint16_t PCR213;
        stc_port_pcr213_field_t PCR213_f;
    };
    union
    {
        __IO uint16_t PFSR213;
        stc_port_pfsr213_field_t PFSR213_f;
    };
    union
    {
        __IO uint16_t PCR214;
        stc_port_pcr214_field_t PCR214_f;
    };
    union
    {
        __IO uint16_t PFSR214;
        stc_port_pfsr214_field_t PFSR214_f;
    };
    union
    {
        __IO uint16_t PCR215;
        stc_port_pcr215_field_t PCR215_f;
    };
    union
    {
        __IO uint16_t PFSR215;
        stc_port_pfsr215_field_t PFSR215_f;
    };
    union
    {
        __IO uint16_t PCR300;
        stc_port_pcr300_field_t PCR300_f;
    };
    union
    {
        __IO uint16_t PFSR300;
        stc_port_pfsr300_field_t PFSR300_f;
    };
    union
    {
        __IO uint16_t PCR301;
        stc_port_pcr301_field_t PCR301_f;
    };
    union
    {
        __IO uint16_t PFSR301;
        stc_port_pfsr301_field_t PFSR301_f;
    };
    union
    {
        __IO uint16_t PCR302;
        stc_port_pcr302_field_t PCR302_f;
    };
    union
    {
        __IO uint16_t PFSR302;
        stc_port_pfsr302_field_t PFSR302_f;
    };
    union
    {
        __IO uint16_t PCR303;
        stc_port_pcr303_field_t PCR303_f;
    };
    union
    {
        __IO uint16_t PFSR303;
        stc_port_pfsr303_field_t PFSR303_f;
    };
    union
    {
        __IO uint16_t PCR304;
        stc_port_pcr304_field_t PCR304_f;
    };
    union
    {
        __IO uint16_t PFSR304;
        stc_port_pfsr304_field_t PFSR304_f;
    };
    union
    {
        __IO uint16_t PCR305;
        stc_port_pcr305_field_t PCR305_f;
    };
    union
    {
        __IO uint16_t PFSR305;
        stc_port_pfsr305_field_t PFSR305_f;
    };
    union
    {
        __IO uint16_t PCR306;
        stc_port_pcr306_field_t PCR306_f;
    };
    union
    {
        __IO uint16_t PFSR306;
        stc_port_pfsr306_field_t PFSR306_f;
    };
    union
    {
        __IO uint16_t PCR307;
        stc_port_pcr307_field_t PCR307_f;
    };
    union
    {
        __IO uint16_t PFSR307;
        stc_port_pfsr307_field_t PFSR307_f;
    };
    union
    {
        __IO uint16_t PCR308;
        stc_port_pcr308_field_t PCR308_f;
    };
    union
    {
        __IO uint16_t PFSR308;
        stc_port_pfsr308_field_t PFSR308_f;
    };
    union
    {
        __IO uint16_t PCR309;
        stc_port_pcr309_field_t PCR309_f;
    };
    union
    {
        __IO uint16_t PFSR309;
        stc_port_pfsr309_field_t PFSR309_f;
    };
    union
    {
        __IO uint16_t PCR310;
        stc_port_pcr310_field_t PCR310_f;
    };
    union
    {
        __IO uint16_t PFSR310;
        stc_port_pfsr310_field_t PFSR310_f;
    };
    union
    {
        __IO uint16_t PCR311;
        stc_port_pcr311_field_t PCR311_f;
    };
    union
    {
        __IO uint16_t PFSR311;
        stc_port_pfsr311_field_t PFSR311_f;
    };
    union
    {
        __IO uint16_t PCR312;
        stc_port_pcr312_field_t PCR312_f;
    };
    union
    {
        __IO uint16_t PFSR312;
        stc_port_pfsr312_field_t PFSR312_f;
    };
    union
    {
        __IO uint16_t PCR313;
        stc_port_pcr313_field_t PCR313_f;
    };
    union
    {
        __IO uint16_t PFSR313;
        stc_port_pfsr313_field_t PFSR313_f;
    };
    union
    {
        __IO uint16_t PCR314;
        stc_port_pcr314_field_t PCR314_f;
    };
    union
    {
        __IO uint16_t PFSR314;
        stc_port_pfsr314_field_t PFSR314_f;
    };
    union
    {
        __IO uint16_t PCR315;
        stc_port_pcr315_field_t PCR315_f;
    };
    union
    {
        __IO uint16_t PFSR315;
        stc_port_pfsr315_field_t PFSR315_f;
    };
    union
    {
        __IO uint16_t PCR400;
        stc_port_pcr400_field_t PCR400_f;
    };
    union
    {
        __IO uint16_t PFSR400;
        stc_port_pfsr400_field_t PFSR400_f;
    };
    union
    {
        __IO uint16_t PCR401;
        stc_port_pcr401_field_t PCR401_f;
    };
    union
    {
        __IO uint16_t PFSR401;
        stc_port_pfsr401_field_t PFSR401_f;
    };
    union
    {
        __IO uint16_t PCR402;
        stc_port_pcr402_field_t PCR402_f;
    };
    union
    {
        __IO uint16_t PFSR402;
        stc_port_pfsr402_field_t PFSR402_f;
    };
    union
    {
        __IO uint16_t PCR403;
        stc_port_pcr403_field_t PCR403_f;
    };
    union
    {
        __IO uint16_t PFSR403;
        stc_port_pfsr403_field_t PFSR403_f;
    };
    union
    {
        __IO uint16_t PCR404;
        stc_port_pcr404_field_t PCR404_f;
    };
    union
    {
        __IO uint16_t PFSR404;
        stc_port_pfsr404_field_t PFSR404_f;
    };
    union
    {
        __IO uint16_t PCR405;
        stc_port_pcr405_field_t PCR405_f;
    };
    union
    {
        __IO uint16_t PFSR405;
        stc_port_pfsr405_field_t PFSR405_f;
    };
    union
    {
        __IO uint16_t PCR406;
        stc_port_pcr406_field_t PCR406_f;
    };
    union
    {
        __IO uint16_t PFSR406;
        stc_port_pfsr406_field_t PFSR406_f;
    };
    union
    {
        __IO uint16_t PCR407;
        stc_port_pcr407_field_t PCR407_f;
    };
    union
    {
        __IO uint16_t PFSR407;
        stc_port_pfsr407_field_t PFSR407_f;
    };
    union
    {
        __IO uint16_t PCR408;
        stc_port_pcr408_field_t PCR408_f;
    };
    union
    {
        __IO uint16_t PFSR408;
        stc_port_pfsr408_field_t PFSR408_f;
    };
    union
    {
        __IO uint16_t PCR409;
        stc_port_pcr409_field_t PCR409_f;
    };
    union
    {
        __IO uint16_t PFSR409;
        stc_port_pfsr409_field_t PFSR409_f;
    };
    union
    {
        __IO uint16_t PCR410;
        stc_port_pcr410_field_t PCR410_f;
    };
    union
    {
        __IO uint16_t PFSR410;
        stc_port_pfsr410_field_t PFSR410_f;
    };
    union
    {
        __IO uint16_t PCR411;
        stc_port_pcr411_field_t PCR411_f;
    };
    union
    {
        __IO uint16_t PFSR411;
        stc_port_pfsr411_field_t PFSR411_f;
    };
    union
    {
        __IO uint16_t PCR412;
        stc_port_pcr412_field_t PCR412_f;
    };
    union
    {
        __IO uint16_t PFSR412;
        stc_port_pfsr412_field_t PFSR412_f;
    };
    union
    {
        __IO uint16_t PCR413;
        stc_port_pcr413_field_t PCR413_f;
    };
    union
    {
        __IO uint16_t PFSR413;
        stc_port_pfsr413_field_t PFSR413_f;
    };
    union
    {
        __IO uint16_t PCR414;
        stc_port_pcr414_field_t PCR414_f;
    };
    union
    {
        __IO uint16_t PFSR414;
        stc_port_pfsr414_field_t PFSR414_f;
    };
    union
    {
        __IO uint16_t PCR415;
        stc_port_pcr415_field_t PCR415_f;
    };
    union
    {
        __IO uint16_t PFSR415;
        stc_port_pfsr415_field_t PFSR415_f;
    };
    union
    {
        __IO uint16_t PCR500;
        stc_port_pcr500_field_t PCR500_f;
    };
    union
    {
        __IO uint16_t PFSR500;
        stc_port_pfsr500_field_t PFSR500_f;
    };
    union
    {
        __IO uint16_t PCR501;
        stc_port_pcr501_field_t PCR501_f;
    };
    union
    {
        __IO uint16_t PFSR501;
        stc_port_pfsr501_field_t PFSR501_f;
    };
    union
    {
        __IO uint16_t PCR502;
        stc_port_pcr502_field_t PCR502_f;
    };
    union
    {
        __IO uint16_t PFSR502;
        stc_port_pfsr502_field_t PFSR502_f;
    };
    union
    {
        __IO uint16_t PCR503;
        stc_port_pcr503_field_t PCR503_f;
    };
    union
    {
        __IO uint16_t PFSR503;
        stc_port_pfsr503_field_t PFSR503_f;
    };
    union
    {
        __IO uint16_t PCR504;
        stc_port_pcr504_field_t PCR504_f;
    };
    union
    {
        __IO uint16_t PFSR504;
        stc_port_pfsr504_field_t PFSR504_f;
    };
    union
    {
        __IO uint16_t PCR505;
        stc_port_pcr505_field_t PCR505_f;
    };
    union
    {
        __IO uint16_t PFSR505;
        stc_port_pfsr505_field_t PFSR505_f;
    };
    union
    {
        __IO uint16_t PCR506;
        stc_port_pcr506_field_t PCR506_f;
    };
    union
    {
        __IO uint16_t PFSR506;
        stc_port_pfsr506_field_t PFSR506_f;
    };
    union
    {
        __IO uint16_t PCR507;
        stc_port_pcr507_field_t PCR507_f;
    };
    union
    {
        __IO uint16_t PFSR507;
        stc_port_pfsr507_field_t PFSR507_f;
    };
    union
    {
        __IO uint16_t PCR508;
        stc_port_pcr508_field_t PCR508_f;
    };
    union
    {
        __IO uint16_t PFSR508;
        stc_port_pfsr508_field_t PFSR508_f;
    };
    union
    {
        __IO uint16_t PCR509;
        stc_port_pcr509_field_t PCR509_f;
    };
    union
    {
        __IO uint16_t PFSR509;
        stc_port_pfsr509_field_t PFSR509_f;
    };
    union
    {
        __IO uint16_t PCR510;
        stc_port_pcr510_field_t PCR510_f;
    };
    union
    {
        __IO uint16_t PFSR510;
        stc_port_pfsr510_field_t PFSR510_f;
    };
    union
    {
        __IO uint16_t PCR511;
        stc_port_pcr511_field_t PCR511_f;
    };
    union
    {
        __IO uint16_t PFSR511;
        stc_port_pfsr511_field_t PFSR511_f;
    };
    union
    {
        __IO uint16_t PCR512;
        stc_port_pcr512_field_t PCR512_f;
    };
    union
    {
        __IO uint16_t PFSR512;
        stc_port_pfsr512_field_t PFSR512_f;
    };
    union
    {
        __IO uint16_t PCR513;
        stc_port_pcr513_field_t PCR513_f;
    };
    union
    {
        __IO uint16_t PFSR513;
        stc_port_pfsr513_field_t PFSR513_f;
    };
    union
    {
        __IO uint16_t PCR514;
        stc_port_pcr514_field_t PCR514_f;
    };
    union
    {
        __IO uint16_t PFSR514;
        stc_port_pfsr514_field_t PFSR514_f;
    };
    union
    {
        __IO uint16_t PCR515;
        stc_port_pcr515_field_t PCR515_f;
    };
    union
    {
        __IO uint16_t PFSR515;
        stc_port_pfsr515_field_t PFSR515_f;
    };
    union
    {
        __IO uint16_t PCR600;
        stc_port_pcr600_field_t PCR600_f;
    };
    union
    {
        __IO uint16_t PFSR600;
        stc_port_pfsr600_field_t PFSR600_f;
    };
    union
    {
        __IO uint16_t PCR601;
