RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
        stc_port_pcr601_field_t PCR601_f;
    };
    union
    {
        __IO uint16_t PFSR601;
        stc_port_pfsr601_field_t PFSR601_f;
    };
    union
    {
        __IO uint16_t PCR602;
        stc_port_pcr602_field_t PCR602_f;
    };
    union
    {
        __IO uint16_t PFSR602;
        stc_port_pfsr602_field_t PFSR602_f;
    };
    union
    {
        __IO uint16_t PCR603;
        stc_port_pcr603_field_t PCR603_f;
    };
    union
    {
        __IO uint16_t PFSR603;
        stc_port_pfsr603_field_t PFSR603_f;
    };
    union
    {
        __IO uint16_t PCR604;
        stc_port_pcr604_field_t PCR604_f;
    };
    union
    {
        __IO uint16_t PFSR604;
        stc_port_pfsr604_field_t PFSR604_f;
    };
    union
    {
        __IO uint16_t PCR605;
        stc_port_pcr605_field_t PCR605_f;
    };
    union
    {
        __IO uint16_t PFSR605;
        stc_port_pfsr605_field_t PFSR605_f;
    };
    union
    {
        __IO uint16_t PCR606;
        stc_port_pcr606_field_t PCR606_f;
    };
    union
    {
        __IO uint16_t PFSR606;
        stc_port_pfsr606_field_t PFSR606_f;
    };
    union
    {
        __IO uint16_t PCR607;
        stc_port_pcr607_field_t PCR607_f;
    };
    union
    {
        __IO uint16_t PFSR607;
        stc_port_pfsr607_field_t PFSR607_f;
    };
    union
    {
        __IO uint16_t PCR608;
        stc_port_pcr608_field_t PCR608_f;
    };
    union
    {
        __IO uint16_t PFSR608;
        stc_port_pfsr608_field_t PFSR608_f;
    };
    union
    {
        __IO uint16_t PCR609;
        stc_port_pcr609_field_t PCR609_f;
    };
    union
    {
        __IO uint16_t PFSR609;
        stc_port_pfsr609_field_t PFSR609_f;
    };
    union
    {
        __IO uint16_t PCR610;
        stc_port_pcr610_field_t PCR610_f;
    };
    union
    {
        __IO uint16_t PFSR610;
        stc_port_pfsr610_field_t PFSR610_f;
    };
    union
    {
        __IO uint16_t PCR611;
        stc_port_pcr611_field_t PCR611_f;
    };
    union
    {
        __IO uint16_t PFSR611;
        stc_port_pfsr611_field_t PFSR611_f;
    };
    union
    {
        __IO uint16_t PCR612;
        stc_port_pcr612_field_t PCR612_f;
    };
    union
    {
        __IO uint16_t PFSR612;
        stc_port_pfsr612_field_t PFSR612_f;
    };
    union
    {
        __IO uint16_t PCR613;
        stc_port_pcr613_field_t PCR613_f;
    };
    union
    {
        __IO uint16_t PFSR613;
        stc_port_pfsr613_field_t PFSR613_f;
    };
    union
    {
        __IO uint16_t PCR614;
        stc_port_pcr614_field_t PCR614_f;
    };
    union
    {
        __IO uint16_t PFSR614;
        stc_port_pfsr614_field_t PFSR614_f;
    };
    union
    {
        __IO uint16_t PCR615;
        stc_port_pcr615_field_t PCR615_f;
    };
    union
    {
        __IO uint16_t PFSR615;
        stc_port_pfsr615_field_t PFSR615_f;
    };
    union
    {
        __IO uint16_t PCR700;
        stc_port_pcr700_field_t PCR700_f;
    };
    union
    {
        __IO uint16_t PFSR700;
        stc_port_pfsr700_field_t PFSR700_f;
    };
    union
    {
        __IO uint16_t PCR701;
        stc_port_pcr701_field_t PCR701_f;
    };
    union
    {
        __IO uint16_t PFSR701;
        stc_port_pfsr701_field_t PFSR701_f;
    };
    union
    {
        __IO uint16_t PCR702;
        stc_port_pcr702_field_t PCR702_f;
    };
    union
    {
        __IO uint16_t PFSR702;
        stc_port_pfsr702_field_t PFSR702_f;
    };
    union
    {
        __IO uint16_t PCR703;
        stc_port_pcr703_field_t PCR703_f;
    };
    union
    {
        __IO uint16_t PFSR703;
        stc_port_pfsr703_field_t PFSR703_f;
    };
    union
    {
        __IO uint16_t PCR704;
        stc_port_pcr704_field_t PCR704_f;
    };
    union
    {
        __IO uint16_t PFSR704;
        stc_port_pfsr704_field_t PFSR704_f;
    };
}M4_PORT_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t QSCR;
        stc_qspi_qscr_field_t QSCR_f;
    };
    union
    {
        __IO uint8_t QSCSCR;
        stc_qspi_qscscr_field_t QSCSCR_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint16_t QSFCR;
        stc_qspi_qsfcr_field_t QSFCR_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t QSSR;
        stc_qspi_qssr_field_t QSSR_f;
    };
    uint8_t RESERVED4[2];
    __IO uint8_t QSDCOM;
    uint8_t RESERVED5[3];
    __IO uint8_t QSCCMD;
    uint8_t RESERVED6[3];
    __IO uint8_t QSXCMD;
    uint8_t RESERVED7[3];
    union
    {
        __IO uint8_t QSDTC;
        stc_qspi_qsdtc_field_t QSDTC_f;
    };
    uint8_t RESERVED8[2023];
    union
    {
        __IO uint32_t QSEXAR;
        stc_qspi_qsexar_field_t QSEXAR_f;
    };
}M4_QSPI_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t CR0;
        stc_rtc_cr0_field_t CR0_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t CR1;
        stc_rtc_cr1_field_t CR1_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t CR2;
        stc_rtc_cr2_field_t CR2_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint8_t CR3;
        stc_rtc_cr3_field_t CR3_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t SEC;
        stc_rtc_sec_field_t SEC_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t MIN;
        stc_rtc_min_field_t MIN_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t HOUR;
        stc_rtc_hour_field_t HOUR_f;
    };
    uint8_t RESERVED7[3];
    union
    {
        __IO uint8_t WEEK;
        stc_rtc_week_field_t WEEK_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint8_t DAY;
        stc_rtc_day_field_t DAY_f;
    };
    uint8_t RESERVED9[3];
    union
    {
        __IO uint8_t MON;
        stc_rtc_mon_field_t MON_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t YEAR;
        stc_rtc_year_field_t YEAR_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t ALMMIN;
        stc_rtc_almmin_field_t ALMMIN_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t ALMHOUR;
        stc_rtc_almhour_field_t ALMHOUR_f;
    };
    uint8_t RESERVED13[3];
    union
    {
        __IO uint8_t ALMWEEK;
        stc_rtc_almweek_field_t ALMWEEK_f;
    };
    uint8_t RESERVED14[3];
    union
    {
        __IO uint8_t ERRCRA;
        stc_rtc_errcra_field_t ERRCRA_f;
    };
    uint8_t RESERVED15[3];
    __IO uint8_t ERRCRB;
    uint8_t RESERVED16[3];
    union
    {
        __IO uint8_t TPCR0;
        stc_rtc_tpcr0_field_t TPCR0_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t TPCR1;
        stc_rtc_tpcr1_field_t TPCR1_f;
    };
    uint8_t RESERVED18[3];
    union
    {
        __IO uint8_t TPSR;
        stc_rtc_tpsr_field_t TPSR_f;
    };
    uint8_t RESERVED19[3];
    union
    {
        __IO uint8_t SECTP;
        stc_rtc_sectp_field_t SECTP_f;
    };
    uint8_t RESERVED20[3];
    union
    {
        __IO uint8_t MINTP;
        stc_rtc_mintp_field_t MINTP_f;
    };
    uint8_t RESERVED21[3];
    union
    {
        __IO uint8_t HOURTP;
        stc_rtc_hourtp_field_t HOURTP_f;
    };
    uint8_t RESERVED22[3];
    union
    {
        __IO uint8_t DAYTP;
        stc_rtc_daytp_field_t DAYTP_f;
    };
    uint8_t RESERVED23[3];
    union
    {
        __IO uint8_t MONTP;
        stc_rtc_montp_field_t MONTP_f;
    };
}M4_RTC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CTL;
        stc_sdioc_ctl_field_t CTL_f;
    };
    union
    {
        __IO uint32_t CMD;
        stc_sdioc_cmd_field_t CMD_f;
    };
    __IO uint32_t ARG;
    __IO uint32_t RESP0;
    __IO uint32_t RESP1;
    __IO uint32_t RESP2;
    union
    {
        __IO uint32_t RESP3;
        stc_sdioc_resp3_field_t RESP3_f;
    };
    union
    {
        __IO uint32_t TEC;
        stc_sdioc_tec_field_t TEC_f;
    };
    __IO uint32_t BLKCNT;
    union
    {
        __IO uint32_t BLKLEN;
        stc_sdioc_blklen_field_t BLKLEN_f;
    };
    union
    {
        __IO uint32_t INTST;
        stc_sdioc_intst_field_t INTST_f;
    };
    union
    {
        __IO uint32_t INTMSK;
        stc_sdioc_intmsk_field_t INTMSK_f;
    };
    uint8_t RESERVED12[4];
    __IO uint32_t BUFFER;
    union
    {
        __IO uint32_t IOMODE;
        stc_sdioc_iomode_field_t IOMODE_f;
    };
    union
    {
        __IO uint32_t IOINTST;
        stc_sdioc_iointst_field_t IOINTST_f;
    };
    union
    {
        __IO uint32_t IOMSK;
        stc_sdioc_iomsk_field_t IOMSK_f;
    };
    uint8_t RESERVED16[8];
    union
    {
        __IO uint32_t DMAEN;
        stc_sdioc_dmaen_field_t DMAEN_f;
    };
}M4_SDIOC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_smi_cr_field_t CR_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_smi_sr_field_t SR_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t SCR;
        stc_smi_scr_field_t SCR_f;
    };
}M4_SMI_TypeDef;

typedef struct
{
    __IO uint32_t DR;
    union
    {
        __IO uint16_t CR;
        stc_spi_cr_field_t CR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t OCR;
        stc_spi_ocr_field_t OCR_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint32_t FCR;
        stc_spi_fcr_field_t FCR_f;
    };
    __IO uint8_t BRR;
    uint8_t RESERVED5[3];
    union
    {
        __IO uint16_t SR;
        stc_spi_sr_field_t SR_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t CMR0;
        stc_spi_cmr_field_t CMR0_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint16_t CMR1;
        stc_spi_cmr_field_t CMR1_f;
    };
    uint8_t RESERVED8[2];
    union
    {
        __IO uint16_t CMR2;
        stc_spi_cmr_field_t CMR2_f;
    };
    uint8_t RESERVED9[2];
    union
    {
        __IO uint16_t CMR3;
        stc_spi_cmr_field_t CMR3_f;
    };
    uint8_t RESERVED10[18];
    union
    {
        __IO uint16_t DCR2;
        stc_spi_dcr2_field_t DCR2_f;
    };
    uint8_t RESERVED11[2];
    union
    {
        __IO uint16_t PR;
        stc_spi_pr_field_t PR_f;
    };
}M4_SPI_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t WTCR;
        stc_sramc_wtcr_field_t WTCR_f;
    };
    union
    {
        __IO uint8_t WTPR;
        stc_sramc_wtpr_field_t WTPR_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint32_t CKCR;
        stc_sramc_ckcr_field_t CKCR_f;
    };
    union
    {
        __IO uint8_t CKPR;
        stc_sramc_ckpr_field_t CKPR_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t CKSR;
        stc_sramc_cksr_field_t CKSR_f;
    };
}M4_SRAMC_TypeDef;

typedef struct
{
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t SR;
        stc_swdt_sr_field_t SR_f;
    };
    __IO uint16_t RR;
}M4_SWDT_TypeDef;

typedef struct
{
    uint8_t RESERVED0[12];
    union
    {
        __IO uint16_t PWRC3;
        stc_sysreg_pwrc3_field_t PWRC3_f;
    };
    uint8_t RESERVED1[2];
    union
    {
        __IO uint16_t CMU_ADCKSEL;
        stc_sysreg_cmu_adcksel_field_t CMU_ADCKSEL_f;
    };
    uint8_t RESERVED2[14];
    union
    {
        __IO uint32_t CMU_SCFGR;
        stc_sysreg_cmu_scfgr_field_t CMU_SCFGR_f;
    };
    union
    {
        __IO uint8_t CMU_UFSCKCFGR;
        stc_sysreg_cmu_ufsckcfgr_field_t CMU_UFSCKCFGR_f;
    };
    uint8_t RESERVED4[1];
    union
    {
        __IO uint8_t CMU_CKSWR;
        stc_sysreg_cmu_ckswr_field_t CMU_CKSWR_f;
    };
    uint8_t RESERVED5[1];
    union
    {
        __IO uint16_t CMU_PLLCFGR;
        stc_sysreg_cmu_pllcfgr_field_t CMU_PLLCFGR_f;
    };
    union
    {
        __IO uint8_t CMU_PLLCR;
        stc_sysreg_cmu_pllcr_field_t CMU_PLLCR_f;
    };
    uint8_t RESERVED7[1];
    union
    {
        __IO uint16_t CMU_UPLLCFGR;
        stc_sysreg_cmu_upllcfgr_field_t CMU_UPLLCFGR_f;
    };
    union
    {
        __IO uint8_t CMU_UPLLCR;
        stc_sysreg_cmu_upllcr_field_t CMU_UPLLCR_f;
    };
    uint8_t RESERVED9[3];
    union
    {
        __IO uint8_t CMU_XTALCR;
        stc_sysreg_cmu_xtalcr_field_t CMU_XTALCR_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t CMU_HRCCR;
        stc_sysreg_cmu_hrccr_field_t CMU_HRCCR_f;
    };
    uint8_t RESERVED11[1];
    union
    {
        __IO uint8_t CMU_MRCCR;
        stc_sysreg_cmu_mrccr_field_t CMU_MRCCR_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t CMU_OSCSTBSR;
        stc_sysreg_cmu_oscstbsr_field_t CMU_OSCSTBSR_f;
    };
    uint8_t RESERVED13[1];
    union
    {
        __IO uint8_t CMU_MCOCFGR;
        stc_sysreg_cmu_mcocfgr_field_t CMU_MCOCFGR_f;
    };
    union
    {
        __IO uint8_t CMU_TPIUCKCFGR;
        stc_sysreg_cmu_tpiuckcfgr_field_t CMU_TPIUCKCFGR_f;
    };
    union
    {
        __IO uint8_t CMU_XTALSTDCR;
        stc_sysreg_cmu_xtalstdcr_field_t CMU_XTALSTDCR_f;
    };
    union
    {
        __IO uint8_t CMU_XTALSTDSR;
        stc_sysreg_cmu_xtalstdsr_field_t CMU_XTALSTDSR_f;
    };
    uint8_t RESERVED17[31];
    __IO uint8_t CMU_MRCTRM;
    __IO uint8_t CMU_HRCTRM;
    uint8_t RESERVED19[63];
    union
    {
        __IO uint8_t CMU_XTALSTBCR;
        stc_sysreg_cmu_xtalstbcr_field_t CMU_XTALSTBCR_f;
    };
    uint8_t RESERVED20[29];
    union
    {
        __IO uint16_t RSTF0;
        stc_sysreg_rstf0_field_t RSTF0_f;
    };
    uint8_t RESERVED21[30];
    union
    {
        __IO uint8_t VDUICR;
        stc_sysreg_vduicr_field_t VDUICR_f;
    };
    union
    {
        __IO uint8_t VDUDSR;
        stc_sysreg_vdudsr_field_t VDUDSR_f;
    };
    uint8_t RESERVED23[796];
    union
    {
        __IO uint16_t FPRC;
        stc_sysreg_fprc_field_t FPRC_f;
    };
    union
    {
        __IO uint8_t PWRC0;
        stc_sysreg_pwrc0_field_t PWRC0_f;
    };
    union
    {
        __IO uint8_t PWRC1;
        stc_sysreg_pwrc1_field_t PWRC1_f;
    };
    union
    {
        __IO uint8_t PWRC2;
        stc_sysreg_pwrc2_field_t PWRC2_f;
    };
    uint8_t RESERVED27[1];
    union
    {
        __IO uint8_t PDWKE0;
        stc_sysreg_pdwke0_field_t PDWKE0_f;
    };
    union
    {
        __IO uint8_t PDWKE1;
        stc_sysreg_pdwke1_field_t PDWKE1_f;
    };
    union
    {
        __IO uint8_t PDWKE2;
        stc_sysreg_pdwke2_field_t PDWKE2_f;
    };
    uint8_t RESERVED30[1];
    union
    {
        __IO uint8_t PDWKES0;
        stc_sysreg_pdwkes0_field_t PDWKES0_f;
    };
    union
    {
        __IO uint8_t PDWKES1;
        stc_sysreg_pdwkes1_field_t PDWKES1_f;
    };
    union
    {
        __IO uint8_t PDWKES2;
        stc_sysreg_pdwkes2_field_t PDWKES2_f;
    };
    union
    {
        __IO uint8_t PDWKFLG0;
        stc_sysreg_pdwkflg0_field_t PDWKFLG0_f;
    };
    union
    {
        __IO uint8_t PDWKFLG1;
        stc_sysreg_pdwkflg1_field_t PDWKFLG1_f;
    };
    union
    {
        __IO uint8_t PDWKFLG2;
        stc_sysreg_pdwkflg2_field_t PDWKFLG2_f;
    };
    uint8_t RESERVED36[2];
    union
    {
        __IO uint8_t CMU_XTALCFGR;
        stc_sysreg_cmu_xtalcfgr_field_t CMU_XTALCFGR_f;
    };
    uint8_t RESERVED37[1];
    union
    {
        __IO uint8_t VDUCR0;
        stc_sysreg_vducr0_field_t VDUCR0_f;
    };
    union
    {
        __IO uint8_t VDUCR1;
        stc_sysreg_vducr1_field_t VDUCR1_f;
    };
    union
    {
        __IO uint8_t VDUFCR;
        stc_sysreg_vdufcr_field_t VDUFCR_f;
    };
    union
    {
        __IO uint8_t VDULCR;
        stc_sysreg_vdulcr_field_t VDULCR_f;
    };
    union
    {
        __IO uint8_t VDUCSR;
        stc_sysreg_vducsr_field_t VDUCSR_f;
    };
    union
    {
        __IO uint8_t BATMC;
        stc_sysreg_batmc_field_t BATMC_f;
    };
}M4_SYSREG_TypeDef;

typedef struct
{
    __IO uint16_t CNTAR;
    uint8_t RESERVED1[2];
    __IO uint16_t CNTBR;
    uint8_t RESERVED2[2];
    __IO uint16_t CMPAR;
    uint8_t RESERVED3[2];
    __IO uint16_t CMPBR;
    uint8_t RESERVED4[2];
    union
    {
        __IO uint32_t BCONR;
        stc_tmr0_bconr_field_t BCONR_f;
    };
    union
    {
        __IO uint32_t STFLR;
        stc_tmr0_stflr_field_t STFLR_f;
    };
}M4_TMR0_TypeDef;

typedef struct
{
    __IO uint16_t CNTAR;
    uint8_t RESERVED1[2];
    __IO uint16_t CNTBR;
    uint8_t RESERVED2[2];
    __IO uint16_t CMPAR;
    uint8_t RESERVED3[2];
    __IO uint16_t CMPBR;
    uint8_t RESERVED4[2];
    union
    {
        __IO uint32_t BCONR;
        stc_tmr2_bconr_field_t BCONR_f;
    };
    union
    {
        __IO uint32_t ICONR;
        stc_tmr2_iconr_field_t ICONR_f;
    };
    union
    {
        __IO uint32_t PCONR;
        stc_tmr2_pconr_field_t PCONR_f;
    };
    union
    {
        __IO uint32_t HCONR;
        stc_tmr2_hconr_field_t HCONR_f;
    };
    union
    {
        __IO uint32_t STFLR;
        stc_tmr2_stflr_field_t STFLR_f;
    };
}M4_TMR2_TypeDef;

typedef struct
{
    uint8_t RESERVED0[2];
    __IO uint16_t OCCRUH;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCRUL;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCRVH;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCRVL;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCRWH;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCRWL;
    union
    {
        __IO uint8_t OCSRU;
        stc_tmr4_ocsru_field_t OCSRU_f;
    };
    uint8_t RESERVED7[1];
    union
    {
        __IO uint16_t OCERU;
        stc_tmr4_oceru_field_t OCERU_f;
    };
    union
    {
        __IO uint8_t OCSRV;
        stc_tmr4_ocsrv_field_t OCSRV_f;
    };
    uint8_t RESERVED9[1];
    union
    {
        __IO uint16_t OCERV;
        stc_tmr4_ocerv_field_t OCERV_f;
    };
    union
    {
        __IO uint8_t OCSRW;
        stc_tmr4_ocsrw_field_t OCSRW_f;
    };
    uint8_t RESERVED11[1];
    union
    {
        __IO uint16_t OCERW;
        stc_tmr4_ocerw_field_t OCERW_f;
    };
    union
    {
        __IO uint16_t OCMRUH;
        stc_tmr4_ocmruh_field_t OCMRUH_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint32_t OCMRUL;
        stc_tmr4_ocmrul_field_t OCMRUL_f;
    };
    union
    {
        __IO uint16_t OCMRVH;
        stc_tmr4_ocmrvh_field_t OCMRVH_f;
    };
    uint8_t RESERVED15[2];
    union
    {
        __IO uint32_t OCMRVL;
        stc_tmr4_ocmrvl_field_t OCMRVL_f;
    };
    union
    {
        __IO uint16_t OCMRWH;
        stc_tmr4_ocmrwh_field_t OCMRWH_f;
    };
    uint8_t RESERVED17[2];
    union
    {
        __IO uint32_t OCMRWL;
        stc_tmr4_ocmrwl_field_t OCMRWL_f;
    };
    uint8_t RESERVED18[6];
    __IO uint16_t CPSR;
    uint8_t RESERVED19[2];
    __IO uint16_t CNTR;
    union
    {
        __IO uint16_t CCSR;
        stc_tmr4_ccsr_field_t CCSR_f;
    };
    union
    {
        __IO uint16_t CVPR;
        stc_tmr4_cvpr_field_t CVPR_f;
    };
    uint8_t RESERVED22[54];
    __IO uint16_t PFSRU;
    __IO uint16_t PDARU;
    __IO uint16_t PDBRU;
    uint8_t RESERVED25[2];
    __IO uint16_t PFSRV;
    __IO uint16_t PDARV;
    __IO uint16_t PDBRV;
    uint8_t RESERVED28[2];
    __IO uint16_t PFSRW;
    __IO uint16_t PDARW;
    __IO uint16_t PDBRW;
    union
    {
        __IO uint8_t POCRU;
        stc_tmr4_pocru_field_t POCRU_f;
    };
    uint8_t RESERVED32[3];
    union
    {
        __IO uint8_t POCRV;
        stc_tmr4_pocrv_field_t POCRV_f;
    };
    uint8_t RESERVED33[3];
    union
    {
        __IO uint8_t POCRW;
        stc_tmr4_pocrw_field_t POCRW_f;
    };
    uint8_t RESERVED34[3];
    union
    {
        __IO uint16_t RCSR;
        stc_tmr4_rcsr_field_t RCSR_f;
    };
    uint8_t RESERVED35[10];
    __IO uint16_t SCCRUH;
    uint8_t RESERVED36[2];
    __IO uint16_t SCCRUL;
    uint8_t RESERVED37[2];
    __IO uint16_t SCCRVH;
    uint8_t RESERVED38[2];
    __IO uint16_t SCCRVL;
    uint8_t RESERVED39[2];
    __IO uint16_t SCCRWH;
    uint8_t RESERVED40[2];
    __IO uint16_t SCCRWL;
    uint8_t RESERVED41[2];
    union
    {
        __IO uint16_t SCSRUH;
        stc_tmr4_scsruh_field_t SCSRUH_f;
    };
    union
    {
        __IO uint8_t SCMRUH;
        stc_tmr4_scmruh_field_t SCMRUH_f;
    };
    uint8_t RESERVED43[1];
    union
    {
        __IO uint16_t SCSRUL;
        stc_tmr4_scsrul_field_t SCSRUL_f;
    };
    union
    {
        __IO uint8_t SCMRUL;
        stc_tmr4_scmrul_field_t SCMRUL_f;
    };
    uint8_t RESERVED45[1];
    union
    {
        __IO uint16_t SCSRVH;
        stc_tmr4_scsrvh_field_t SCSRVH_f;
    };
    union
    {
        __IO uint8_t SCMRVH;
        stc_tmr4_scmrvh_field_t SCMRVH_f;
    };
    uint8_t RESERVED47[1];
    union
    {
        __IO uint16_t SCSRVL;
        stc_tmr4_scsrvl_field_t SCSRVL_f;
    };
    union
    {
        __IO uint8_t SCMRVL;
        stc_tmr4_scmrvl_field_t SCMRVL_f;
    };
    uint8_t RESERVED49[1];
    union
    {
        __IO uint16_t SCSRWH;
        stc_tmr4_scsrwh_field_t SCSRWH_f;
    };
    union
    {
        __IO uint8_t SCMRWH;
        stc_tmr4_scmrwh_field_t SCMRWH_f;
    };
    uint8_t RESERVED51[1];
    union
    {
        __IO uint16_t SCSRWL;
        stc_tmr4_scsrwl_field_t SCSRWL_f;
    };
    union
    {
        __IO uint8_t SCMRWL;
        stc_tmr4_scmrwl_field_t SCMRWL_f;
    };
    uint8_t RESERVED53[17];
    union
    {
        __IO uint8_t ECSR;
        stc_tmr4_ecsr_field_t ECSR_f;
    };
    uint8_t RESERVED54[199487];
    union
    {
        __IO uint8_t ECER;
        stc_tmr4_ecer_field_t ECER_f;
    };
}M4_TMR4_TypeDef;

typedef struct
{
    __IO uint32_t CNTER;
    __IO uint32_t PERAR;
    __IO uint32_t PERBR;
    __IO uint32_t PERCR;
    __IO uint32_t GCMAR;
    __IO uint32_t GCMBR;
    __IO uint32_t GCMCR;
    __IO uint32_t GCMDR;
    __IO uint32_t GCMER;
    __IO uint32_t GCMFR;
    __IO uint32_t SCMAR;
    __IO uint32_t SCMBR;
    __IO uint32_t SCMCR;
    __IO uint32_t SCMDR;
    __IO uint32_t SCMER;
    __IO uint32_t SCMFR;
    __IO uint32_t DTUAR;
    __IO uint32_t DTDAR;
    __IO uint32_t DTUBR;
    __IO uint32_t DTDBR;
    union
    {
        __IO uint32_t GCONR;
        stc_tmr6_gconr_field_t GCONR_f;
    };
    union
    {
        __IO uint32_t ICONR;
        stc_tmr6_iconr_field_t ICONR_f;
    };
    union
    {
        __IO uint32_t PCONR;
        stc_tmr6_pconr_field_t PCONR_f;
    };
    union
    {
        __IO uint32_t BCONR;
        stc_tmr6_bconr_field_t BCONR_f;
    };
    union
    {
        __IO uint16_t DCONR;
        stc_tmr6_dconr_field_t DCONR_f;
    };
    uint8_t RESERVED25[6];
    union
    {
        __IO uint32_t FCONR;
        stc_tmr6_fconr_field_t FCONR_f;
    };
    union
    {
        __IO uint32_t VPERR;
        stc_tmr6_vperr_field_t VPERR_f;
    };
    union
    {
        __IO uint32_t STFLR;
        stc_tmr6_stflr_field_t STFLR_f;
    };
    union
    {
        __IO uint32_t HSTAR;
        stc_tmr6_hstar_field_t HSTAR_f;
    };
    union
    {
        __IO uint32_t HSTPR;
        stc_tmr6_hstpr_field_t HSTPR_f;
    };
    union
    {
        __IO uint32_t HCLRR;
        stc_tmr6_hclrr_field_t HCLRR_f;
    };
    union
    {
        __IO uint16_t HCPAR;
        stc_tmr6_hcpar_field_t HCPAR_f;
    };
    uint8_t RESERVED32[2];
    union
    {
        __IO uint16_t HCPBR;
        stc_tmr6_hcpbr_field_t HCPBR_f;
    };
    uint8_t RESERVED33[2];
    union
    {
        __IO uint32_t HCUPR;
        stc_tmr6_hcupr_field_t HCUPR_f;
    };
    union
    {
        __IO uint32_t HCDOR;
        stc_tmr6_hcdor_field_t HCDOR_f;
    };
    uint8_t RESERVED35[868];
    union
    {
        __IO uint32_t SSTAR;
        stc_tmr6_sstar_field_t SSTAR_f;
    };
    union
    {
        __IO uint32_t SSTPR;
        stc_tmr6_sstpr_field_t SSTPR_f;
    };
    union
    {
        __IO uint32_t SCLRR;
        stc_tmr6_sclrr_field_t SCLRR_f;
    };
}M4_TMR6_TypeDef;

