RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    union
    {
        __IO uint8_t CR;
        stc_trng_cr_field_t CR_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t FR;
        stc_trng_fr_field_t FR_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t SR;
        stc_trng_sr_field_t SR_f;
    };
    uint8_t RESERVED3[31];
    union
    {
        __IO uint8_t IR;
        stc_trng_ir_field_t IR_f;
    };
    uint8_t RESERVED4[87];
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
}M4_TRNG_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t MR;
        stc_usart_mr_field_t MR_f;
    };
    union
    {
        __IO uint8_t CR;
        stc_usart_cr_field_t CR_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t SR;
        stc_usart_sr_field_t SR_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint8_t CLR;
        stc_usart_clr_field_t CLR_f;
    };
    uint8_t RESERVED4[3];
    __IO uint8_t BRR;
    uint8_t RESERVED5[3];
    union
    {
        __IO uint16_t TDR;
        stc_usart_tdr_field_t TDR_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t RDR;
        stc_usart_rdr_field_t RDR_f;
    };
}M4_USART_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t GOTGCTL;
        stc_usf_gotgctl_field_t GOTGCTL_f;
    };
    union
    {
        __IO uint32_t GOTGINT;
        stc_usf_gotgint_field_t GOTGINT_f;
    };
    union
    {
        __IO uint32_t GAHBCFG;
        stc_usf_gahbcfg_field_t GAHBCFG_f;
    };
    union
    {
        __IO uint32_t GUSBCFG;
        stc_usf_gusbcfg_field_t GUSBCFG_f;
    };
    union
    {
        __IO uint32_t GRSTCTL;
        stc_usf_grstctl_field_t GRSTCTL_f;
    };
    union
    {
        __IO uint32_t GINTSTS;
        stc_usf_gintsts_field_t GINTSTS_f;
    };
    union
    {
        __IO uint32_t GINTMSK;
        stc_usf_gintmsk_field_t GINTMSK_f;
    };
    union
    {
        __IO uint32_t GRXSTSR;
        stc_usf_grxstsr_field_t GRXSTSR_f;
    };
    union
    {
        __IO uint32_t GRXSTSP;
        stc_usf_grxstsp_field_t GRXSTSP_f;
    };
    union
    {
        __IO uint16_t GRXFSIZ;
        stc_usf_grxfsiz_field_t GRXFSIZ_f;
    };
    uint8_t RESERVED10[2];
    union
    {
        __IO uint32_t GNPTXFSIZ;
        stc_usf_gnptxfsiz_field_t GNPTXFSIZ_f;
    };
    union
    {
        __IO uint32_t GNPTXSTS;
        stc_usf_gnptxsts_field_t GNPTXSTS_f;
    };
    uint8_t RESERVED12[4];
    union
    {
        __IO uint32_t GPVNDCTL;
        stc_usf_gpvndctl_field_t GPVNDCTL_f;
    };
    union
    {
        __IO uint32_t GGPIO;
        stc_usf_ggpio_field_t GGPIO_f;
    };
    __IO uint32_t GUID;
    __IO uint32_t GSNPSID;
    __IO uint32_t GHWCFG1;
    union
    {
        __IO uint32_t GHWCFG2;
        stc_usf_ghwcfg2_field_t GHWCFG2_f;
    };
    union
    {
        __IO uint32_t GHWCFG3;
        stc_usf_ghwcfg3_field_t GHWCFG3_f;
    };
    union
    {
        __IO uint32_t GHWCFG4;
        stc_usf_ghwcfg4_field_t GHWCFG4_f;
    };
    uint8_t RESERVED20[8];
    union
    {
        __IO uint32_t GDFIFOCFG;
        stc_usf_gdfifocfg_field_t GDFIFOCFG_f;
    };
    uint8_t RESERVED21[160];
    union
    {
        __IO uint32_t HPTXFSIZ;
        stc_usf_hptxfsiz_field_t HPTXFSIZ_f;
    };
    union
    {
        __IO uint32_t DIEPTXF1;
        stc_usf_dieptxf1_field_t DIEPTXF1_f;
    };
    union
    {
        __IO uint32_t DIEPTXF2;
        stc_usf_dieptxf2_field_t DIEPTXF2_f;
    };
    union
    {
        __IO uint32_t DIEPTXF3;
        stc_usf_dieptxf3_field_t DIEPTXF3_f;
    };
    union
    {
        __IO uint32_t DIEPTXF4;
        stc_usf_dieptxf4_field_t DIEPTXF4_f;
    };
    union
    {
        __IO uint32_t DIEPTXF5;
        stc_usf_dieptxf5_field_t DIEPTXF5_f;
    };
    uint8_t RESERVED27[744];
    union
    {
        __IO uint32_t HCFG;
        stc_usf_hcfg_field_t HCFG_f;
    };
    union
    {
        __IO uint32_t HFIR;
        stc_usf_hfir_field_t HFIR_f;
    };
    union
    {
        __IO uint32_t HFNUM;
        stc_usf_hfnum_field_t HFNUM_f;
    };
    uint8_t RESERVED30[4];
    union
    {
        __IO uint32_t HPTXSTS;
        stc_usf_hptxsts_field_t HPTXSTS_f;
    };
    __IO uint16_t HAINT;
    uint8_t RESERVED32[2];
    __IO uint16_t HAINTMSK;
    uint8_t RESERVED33[38];
    union
    {
        __IO uint32_t HPRT;
        stc_usf_hprt_field_t HPRT_f;
    };
    uint8_t RESERVED34[188];
    union
    {
        __IO uint32_t HCCHAR0;
        stc_usf_hcchar0_field_t HCCHAR0_f;
    };
    union
    {
        __IO uint32_t HCSPLT0;
        stc_usf_hcsplt0_field_t HCSPLT0_f;
    };
    union
    {
        __IO uint16_t HCINT0;
        stc_usf_hcint0_field_t HCINT0_f;
    };
    uint8_t RESERVED37[2];
    union
    {
        __IO uint16_t HCINTMSK0;
        stc_usf_hcintmsk0_field_t HCINTMSK0_f;
    };
    uint8_t RESERVED38[2];
    union
    {
        __IO uint32_t HCTSIZ0;
        stc_usf_hctsiz0_field_t HCTSIZ0_f;
    };
    __IO uint32_t HCDMA0;
    uint8_t RESERVED40[8];
    union
    {
        __IO uint32_t HCCHAR1;
        stc_usf_hcchar1_field_t HCCHAR1_f;
    };
    union
    {
        __IO uint32_t HCSPLT1;
        stc_usf_hcsplt1_field_t HCSPLT1_f;
    };
    union
    {
        __IO uint16_t HCINT1;
        stc_usf_hcint1_field_t HCINT1_f;
    };
    uint8_t RESERVED43[2];
    union
    {
        __IO uint16_t HCINTMSK1;
        stc_usf_hcintmsk1_field_t HCINTMSK1_f;
    };
    uint8_t RESERVED44[2];
    union
    {
        __IO uint32_t HCTSIZ1;
        stc_usf_hctsiz1_field_t HCTSIZ1_f;
    };
    __IO uint32_t HCDMA1;
    uint8_t RESERVED46[8];
    union
    {
        __IO uint32_t HCCHAR2;
        stc_usf_hcchar2_field_t HCCHAR2_f;
    };
    union
    {
        __IO uint32_t HCSPLT2;
        stc_usf_hcsplt2_field_t HCSPLT2_f;
    };
    union
    {
        __IO uint16_t HCINT2;
        stc_usf_hcint2_field_t HCINT2_f;
    };
    uint8_t RESERVED49[2];
    union
    {
        __IO uint16_t HCINTMSK2;
        stc_usf_hcintmsk2_field_t HCINTMSK2_f;
    };
    uint8_t RESERVED50[2];
    union
    {
        __IO uint32_t HCTSIZ2;
        stc_usf_hctsiz2_field_t HCTSIZ2_f;
    };
    __IO uint32_t HCDMA2;
    uint8_t RESERVED52[8];
    union
    {
        __IO uint32_t HCCHAR3;
        stc_usf_hcchar3_field_t HCCHAR3_f;
    };
    union
    {
        __IO uint32_t HCSPLT3;
        stc_usf_hcsplt3_field_t HCSPLT3_f;
    };
    union
    {
        __IO uint16_t HCINT3;
        stc_usf_hcint3_field_t HCINT3_f;
    };
    uint8_t RESERVED55[2];
    union
    {
        __IO uint16_t HCINTMSK3;
        stc_usf_hcintmsk3_field_t HCINTMSK3_f;
    };
    uint8_t RESERVED56[2];
    union
    {
        __IO uint32_t HCTSIZ3;
        stc_usf_hctsiz3_field_t HCTSIZ3_f;
    };
    __IO uint32_t HCDMA3;
    uint8_t RESERVED58[8];
    union
    {
        __IO uint32_t HCCHAR4;
        stc_usf_hcchar4_field_t HCCHAR4_f;
    };
    union
    {
        __IO uint32_t HCSPLT4;
        stc_usf_hcsplt4_field_t HCSPLT4_f;
    };
    union
    {
        __IO uint16_t HCINT4;
        stc_usf_hcint4_field_t HCINT4_f;
    };
    uint8_t RESERVED61[2];
    union
    {
        __IO uint16_t HCINTMSK4;
        stc_usf_hcintmsk4_field_t HCINTMSK4_f;
    };
    uint8_t RESERVED62[2];
    union
    {
        __IO uint32_t HCTSIZ4;
        stc_usf_hctsiz4_field_t HCTSIZ4_f;
    };
    __IO uint32_t HCDMA4;
    uint8_t RESERVED64[8];
    union
    {
        __IO uint32_t HCCHAR5;
        stc_usf_hcchar5_field_t HCCHAR5_f;
    };
    union
    {
        __IO uint32_t HCSPLT5;
        stc_usf_hcsplt5_field_t HCSPLT5_f;
    };
    union
    {
        __IO uint16_t HCINT5;
        stc_usf_hcint5_field_t HCINT5_f;
    };
    uint8_t RESERVED67[2];
    union
    {
        __IO uint16_t HCINTMSK5;
        stc_usf_hcintmsk5_field_t HCINTMSK5_f;
    };
    uint8_t RESERVED68[2];
    union
    {
        __IO uint32_t HCTSIZ5;
        stc_usf_hctsiz5_field_t HCTSIZ5_f;
    };
    __IO uint32_t HCDMA5;
    uint8_t RESERVED70[8];
    union
    {
        __IO uint32_t HCCHAR6;
        stc_usf_hcchar6_field_t HCCHAR6_f;
    };
    union
    {
        __IO uint32_t HCSPLT6;
        stc_usf_hcsplt6_field_t HCSPLT6_f;
    };
    union
    {
        __IO uint16_t HCINT6;
        stc_usf_hcint6_field_t HCINT6_f;
    };
    uint8_t RESERVED73[2];
    union
    {
        __IO uint16_t HCINTMSK6;
        stc_usf_hcintmsk6_field_t HCINTMSK6_f;
    };
    uint8_t RESERVED74[2];
    union
    {
        __IO uint32_t HCTSIZ6;
        stc_usf_hctsiz6_field_t HCTSIZ6_f;
    };
    __IO uint32_t HCDMA6;
    uint8_t RESERVED76[8];
    union
    {
        __IO uint32_t HCCHAR7;
        stc_usf_hcchar7_field_t HCCHAR7_f;
    };
    union
    {
        __IO uint32_t HCSPLT7;
        stc_usf_hcsplt7_field_t HCSPLT7_f;
    };
    union
    {
        __IO uint16_t HCINT7;
        stc_usf_hcint7_field_t HCINT7_f;
    };
    uint8_t RESERVED79[2];
    union
    {
        __IO uint16_t HCINTMSK7;
        stc_usf_hcintmsk7_field_t HCINTMSK7_f;
    };
    uint8_t RESERVED80[2];
    union
    {
        __IO uint32_t HCTSIZ7;
        stc_usf_hctsiz7_field_t HCTSIZ7_f;
    };
    __IO uint32_t HCDMA7;
    uint8_t RESERVED82[8];
    union
    {
        __IO uint32_t HCCHAR8;
        stc_usf_hcchar8_field_t HCCHAR8_f;
    };
    union
    {
        __IO uint32_t HCSPLT8;
        stc_usf_hcsplt8_field_t HCSPLT8_f;
    };
    union
    {
        __IO uint16_t HCINT8;
        stc_usf_hcint8_field_t HCINT8_f;
    };
    uint8_t RESERVED85[2];
    union
    {
        __IO uint16_t HCINTMSK8;
        stc_usf_hcintmsk8_field_t HCINTMSK8_f;
    };
    uint8_t RESERVED86[2];
    union
    {
        __IO uint32_t HCTSIZ8;
        stc_usf_hctsiz8_field_t HCTSIZ8_f;
    };
    __IO uint32_t HCDMA8;
    uint8_t RESERVED88[8];
    union
    {
        __IO uint32_t HCCHAR9;
        stc_usf_hcchar9_field_t HCCHAR9_f;
    };
    union
    {
        __IO uint32_t HCSPLT9;
        stc_usf_hcsplt9_field_t HCSPLT9_f;
    };
    union
    {
        __IO uint16_t HCINT9;
        stc_usf_hcint9_field_t HCINT9_f;
    };
    uint8_t RESERVED91[2];
    union
    {
        __IO uint16_t HCINTMSK9;
        stc_usf_hcintmsk9_field_t HCINTMSK9_f;
    };
    uint8_t RESERVED92[2];
    union
    {
        __IO uint32_t HCTSIZ9;
        stc_usf_hctsiz9_field_t HCTSIZ9_f;
    };
    __IO uint32_t HCDMA9;
    uint8_t RESERVED94[8];
    union
    {
        __IO uint32_t HCCHAR10;
        stc_usf_hcchar10_field_t HCCHAR10_f;
    };
    union
    {
        __IO uint32_t HCSPLT10;
        stc_usf_hcsplt10_field_t HCSPLT10_f;
    };
    union
    {
        __IO uint16_t HCINT10;
        stc_usf_hcint10_field_t HCINT10_f;
    };
    uint8_t RESERVED97[2];
    union
    {
        __IO uint16_t HCINTMSK10;
        stc_usf_hcintmsk10_field_t HCINTMSK10_f;
    };
    uint8_t RESERVED98[2];
    union
    {
        __IO uint32_t HCTSIZ10;
        stc_usf_hctsiz10_field_t HCTSIZ10_f;
    };
    __IO uint32_t HCDMA10;
    uint8_t RESERVED100[8];
    union
    {
        __IO uint32_t HCCHAR11;
        stc_usf_hcchar11_field_t HCCHAR11_f;
    };
    union
    {
        __IO uint32_t HCSPLT11;
        stc_usf_hcsplt11_field_t HCSPLT11_f;
    };
    union
    {
        __IO uint16_t HCINT11;
        stc_usf_hcint11_field_t HCINT11_f;
    };
    uint8_t RESERVED103[2];
    union
    {
        __IO uint16_t HCINTMSK11;
        stc_usf_hcintmsk11_field_t HCINTMSK11_f;
    };
    uint8_t RESERVED104[2];
    union
    {
        __IO uint32_t HCTSIZ11;
        stc_usf_hctsiz11_field_t HCTSIZ11_f;
    };
    __IO uint32_t HCDMA11;
    uint8_t RESERVED106[392];
    union
    {
        __IO uint32_t DCFG;
        stc_usf_dcfg_field_t DCFG_f;
    };
    union
    {
        __IO uint32_t DCTL;
        stc_usf_dctl_field_t DCTL_f;
    };
    union
    {
        __IO uint32_t DSTS;
        stc_usf_dsts_field_t DSTS_f;
    };
    uint8_t RESERVED109[4];
    union
    {
        __IO uint16_t DIEPMSK;
        stc_usf_diepmsk_field_t DIEPMSK_f;
    };
    uint8_t RESERVED110[2];
    union
    {
        __IO uint16_t DOEPMSK;
        stc_usf_doepmsk_field_t DOEPMSK_f;
    };
    uint8_t RESERVED111[2];
    union
    {
        __IO uint32_t DAINT;
        stc_usf_daint_field_t DAINT_f;
    };
    union
    {
        __IO uint32_t DAINTMSK;
        stc_usf_daintmsk_field_t DAINTMSK_f;
    };
    uint8_t RESERVED113[8];
    __IO uint16_t DVBUSDIS;
    uint8_t RESERVED114[2];
    union
    {
        __IO uint16_t DVBUSPULSE;
        stc_usf_dvbuspulse_field_t DVBUSPULSE_f;
    };
    uint8_t RESERVED115[2];
    union
    {
        __IO uint32_t DTHRCTL;
        stc_usf_dthrctl_field_t DTHRCTL_f;
    };
    __IO uint16_t DIEPEMPMSK;
    uint8_t RESERVED117[202];
    union
    {
        __IO uint32_t DIEPCTL0;
        stc_usf_diepctl0_field_t DIEPCTL0_f;
    };
    uint8_t RESERVED118[4];
    union
    {
        __IO uint16_t DIEPINT0;
        stc_usf_diepint0_field_t DIEPINT0_f;
    };
    uint8_t RESERVED119[6];
    union
    {
        __IO uint32_t DIEPTSIZ0;
        stc_usf_dieptsiz0_field_t DIEPTSIZ0_f;
    };
    __IO uint32_t DIEPDMA0;
    __IO uint16_t DTXFSTS0;
    uint8_t RESERVED122[6];
    union
    {
        __IO uint32_t DIEPCTL1;
        stc_usf_diepctl1_field_t DIEPCTL1_f;
    };
    uint8_t RESERVED123[4];
    union
    {
        __IO uint16_t DIEPINT1;
        stc_usf_diepint1_field_t DIEPINT1_f;
    };
    uint8_t RESERVED124[6];
    union
    {
        __IO uint32_t DIEPTSIZ1;
        stc_usf_dieptsiz1_field_t DIEPTSIZ1_f;
    };
    __IO uint32_t DIEPDMA1;
    __IO uint16_t DTXFSTS1;
    uint8_t RESERVED127[6];
    union
    {
        __IO uint32_t DIEPCTL2;
        stc_usf_diepctl2_field_t DIEPCTL2_f;
    };
    uint8_t RESERVED128[4];
    union
    {
        __IO uint16_t DIEPINT2;
        stc_usf_diepint2_field_t DIEPINT2_f;
    };
    uint8_t RESERVED129[6];
    union
    {
        __IO uint32_t DIEPTSIZ2;
        stc_usf_dieptsiz2_field_t DIEPTSIZ2_f;
    };
    __IO uint32_t DIEPDMA2;
    __IO uint16_t DTXFSTS2;
    uint8_t RESERVED132[6];
    union
    {
        __IO uint32_t DIEPCTL3;
        stc_usf_diepctl3_field_t DIEPCTL3_f;
    };
    uint8_t RESERVED133[4];
    union
    {
        __IO uint16_t DIEPINT3;
        stc_usf_diepint3_field_t DIEPINT3_f;
    };
    uint8_t RESERVED134[6];
    union
    {
        __IO uint32_t DIEPTSIZ3;
        stc_usf_dieptsiz3_field_t DIEPTSIZ3_f;
    };
    __IO uint32_t DIEPDMA3;
    __IO uint16_t DTXFSTS3;
    uint8_t RESERVED137[6];
    union
    {
        __IO uint32_t DIEPCTL4;
        stc_usf_diepctl4_field_t DIEPCTL4_f;
    };
    uint8_t RESERVED138[4];
    union
    {
        __IO uint16_t DIEPINT4;
        stc_usf_diepint4_field_t DIEPINT4_f;
    };
    uint8_t RESERVED139[6];
    union
    {
        __IO uint32_t DIEPTSIZ4;
        stc_usf_dieptsiz4_field_t DIEPTSIZ4_f;
    };
    __IO uint32_t DIEPDMA4;
    __IO uint16_t DTXFSTS4;
    uint8_t RESERVED142[6];
    union
    {
        __IO uint32_t DIEPCTL5;
        stc_usf_diepctl5_field_t DIEPCTL5_f;
    };
    uint8_t RESERVED143[4];
    union
    {
        __IO uint16_t DIEPINT5;
        stc_usf_diepint5_field_t DIEPINT5_f;
    };
    uint8_t RESERVED144[6];
    union
    {
        __IO uint32_t DIEPTSIZ5;
        stc_usf_dieptsiz5_field_t DIEPTSIZ5_f;
    };
    __IO uint32_t DIEPDMA5;
    __IO uint16_t DTXFSTS5;
    uint8_t RESERVED147[326];
    union
    {
        __IO uint32_t DOEPCTL0;
        stc_usf_doepctl0_field_t DOEPCTL0_f;
    };
    uint8_t RESERVED148[4];
    union
    {
        __IO uint16_t DOEPINT0;
        stc_usf_doepint0_field_t DOEPINT0_f;
    };
    uint8_t RESERVED149[6];
    union
    {
        __IO uint32_t DOEPTSIZ0;
        stc_usf_doeptsiz0_field_t DOEPTSIZ0_f;
    };
    __IO uint32_t DOEPDMA0;
    uint8_t RESERVED151[8];
    union
    {
        __IO uint32_t DOEPCTL1;
        stc_usf_doepctl1_field_t DOEPCTL1_f;
    };
    uint8_t RESERVED152[4];
    union
    {
        __IO uint16_t DOEPINT1;
        stc_usf_doepint1_field_t DOEPINT1_f;
    };
    uint8_t RESERVED153[6];
    union
    {
        __IO uint32_t DOEPTSIZ1;
        stc_usf_doeptsiz1_field_t DOEPTSIZ1_f;
    };
    __IO uint32_t DOEPDMA1;
    uint8_t RESERVED155[8];
    union
    {
        __IO uint32_t DOEPCTL2;
        stc_usf_doepctl2_field_t DOEPCTL2_f;
    };
    uint8_t RESERVED156[4];
    union
    {
        __IO uint16_t DOEPINT2;
        stc_usf_doepint2_field_t DOEPINT2_f;
    };
    uint8_t RESERVED157[6];
    union
    {
        __IO uint32_t DOEPTSIZ2;
        stc_usf_doeptsiz2_field_t DOEPTSIZ2_f;
    };
    __IO uint32_t DOEPDMA2;
    uint8_t RESERVED159[8];
    union
    {
        __IO uint32_t DOEPCTL3;
        stc_usf_doepctl3_field_t DOEPCTL3_f;
    };
    uint8_t RESERVED160[4];
    union
    {
        __IO uint16_t DOEPINT3;
        stc_usf_doepint3_field_t DOEPINT3_f;
    };
    uint8_t RESERVED161[6];
    union
    {
        __IO uint32_t DOEPTSIZ3;
        stc_usf_doeptsiz3_field_t DOEPTSIZ3_f;
    };
    __IO uint32_t DOEPDMA3;
    uint8_t RESERVED163[8];
    union
    {
        __IO uint32_t DOEPCTL4;
        stc_usf_doepctl4_field_t DOEPCTL4_f;
    };
    uint8_t RESERVED164[4];
    union
    {
        __IO uint16_t DOEPINT4;
        stc_usf_doepint4_field_t DOEPINT4_f;
    };
    uint8_t RESERVED165[6];
    union
    {
        __IO uint32_t DOEPTSIZ4;
        stc_usf_doeptsiz4_field_t DOEPTSIZ4_f;
    };
    __IO uint32_t DOEPDMA4;
    uint8_t RESERVED167[8];
    union
    {
        __IO uint32_t DOEPCTL5;
        stc_usf_doepctl5_field_t DOEPCTL5_f;
    };
    uint8_t RESERVED168[4];
    union
    {
        __IO uint16_t DOEPINT5;
        stc_usf_doepint5_field_t DOEPINT5_f;
    };
    uint8_t RESERVED169[6];
    union
    {
        __IO uint32_t DOEPTSIZ5;
        stc_usf_doeptsiz5_field_t DOEPTSIZ5_f;
    };
    __IO uint32_t DOEPDMA5;
    uint8_t RESERVED171[584];
    union
    {
        __IO uint16_t PCGCCTL;
        stc_usf_pcgcctl_field_t PCGCCTL_f;
    };
}M4_USF_TypeDef;

