RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    union
    {
        __IO uint32_t GOTGCTL;
        stc_ush_gotgctl_field_t GOTGCTL_f;
    };
    union
    {
        __IO uint32_t GOTGINT;
        stc_ush_gotgint_field_t GOTGINT_f;
    };
    union
    {
        __IO uint32_t GAHBCFG;
        stc_ush_gahbcfg_field_t GAHBCFG_f;
    };
    union
    {
        __IO uint32_t GUSBCFG;
        stc_ush_gusbcfg_field_t GUSBCFG_f;
    };
    union
    {
        __IO uint32_t GRSTCTL;
        stc_ush_grstctl_field_t GRSTCTL_f;
    };
    union
    {
        __IO uint32_t GINTSTS;
        stc_ush_gintsts_field_t GINTSTS_f;
    };
    union
    {
        __IO uint32_t GINTMSK;
        stc_ush_gintmsk_field_t GINTMSK_f;
    };
    union
    {
        __IO uint32_t GRXSTSR;
        stc_ush_grxstsr_field_t GRXSTSR_f;
    };
    union
    {
        __IO uint32_t GRXSTSP;
        stc_ush_grxstsp_field_t GRXSTSP_f;
    };
    union
    {
        __IO uint16_t GRXFSIZ;
        stc_ush_grxfsiz_field_t GRXFSIZ_f;
    };
    uint8_t RESERVED10[2];
    union
    {
        __IO uint32_t GNPTXFSIZ;
        stc_ush_gnptxfsiz_field_t GNPTXFSIZ_f;
    };
    union
    {
        __IO uint32_t GNPTXSTS;
        stc_ush_gnptxsts_field_t GNPTXSTS_f;
    };
    uint8_t RESERVED12[4];
    union
    {
        __IO uint32_t GPVNDCTL;
        stc_ush_gpvndctl_field_t GPVNDCTL_f;
    };
    union
    {
        __IO uint32_t GGPIO;
        stc_ush_ggpio_field_t GGPIO_f;
    };
    __IO uint32_t GUID;
    __IO uint32_t GSNPSID;
    __IO uint32_t GHWCFG1;
    union
    {
        __IO uint32_t GHWCFG2;
        stc_ush_ghwcfg2_field_t GHWCFG2_f;
    };
    union
    {
        __IO uint32_t GHWCFG3;
        stc_ush_ghwcfg3_field_t GHWCFG3_f;
    };
    union
    {
        __IO uint32_t GHWCFG4;
        stc_ush_ghwcfg4_field_t GHWCFG4_f;
    };
    uint8_t RESERVED20[8];
    union
    {
        __IO uint32_t GDFIFOCFG;
        stc_ush_gdfifocfg_field_t GDFIFOCFG_f;
    };
    uint8_t RESERVED21[160];
    union
    {
        __IO uint32_t HPTXFSIZ;
        stc_ush_hptxfsiz_field_t HPTXFSIZ_f;
    };
    union
    {
        __IO uint32_t DIEPTXF1;
        stc_ush_dieptxf1_field_t DIEPTXF1_f;
    };
    union
    {
        __IO uint32_t DIEPTXF2;
        stc_ush_dieptxf2_field_t DIEPTXF2_f;
    };
    union
    {
        __IO uint32_t DIEPTXF3;
        stc_ush_dieptxf3_field_t DIEPTXF3_f;
    };
    union
    {
        __IO uint32_t DIEPTXF4;
        stc_ush_dieptxf4_field_t DIEPTXF4_f;
    };
    union
    {
        __IO uint32_t DIEPTXF5;
        stc_ush_dieptxf5_field_t DIEPTXF5_f;
    };
    union
    {
        __IO uint32_t DIEPTXF6;
        stc_ush_dieptxf6_field_t DIEPTXF6_f;
    };
    union
    {
        __IO uint32_t DIEPTXF7;
        stc_ush_dieptxf7_field_t DIEPTXF7_f;
    };
    uint8_t RESERVED29[736];
    union
    {
        __IO uint32_t HCFG;
        stc_ush_hcfg_field_t HCFG_f;
    };
    union
    {
        __IO uint32_t HFIR;
        stc_ush_hfir_field_t HFIR_f;
    };
    union
    {
        __IO uint32_t HFNUM;
        stc_ush_hfnum_field_t HFNUM_f;
    };
    uint8_t RESERVED32[4];
    union
    {
        __IO uint32_t HPTXSTS;
        stc_ush_hptxsts_field_t HPTXSTS_f;
    };
    __IO uint16_t HAINT;
    uint8_t RESERVED34[2];
    __IO uint16_t HAINTMSK;
    uint8_t RESERVED35[38];
    union
    {
        __IO uint32_t HPRT;
        stc_ush_hprt_field_t HPRT_f;
    };
    uint8_t RESERVED36[188];
    union
    {
        __IO uint32_t HCCHAR0;
        stc_ush_hcchar0_field_t HCCHAR0_f;
    };
    union
    {
        __IO uint32_t HCSPLT0;
        stc_ush_hcsplt0_field_t HCSPLT0_f;
    };
    union
    {
        __IO uint16_t HCINT0;
        stc_ush_hcint0_field_t HCINT0_f;
    };
    uint8_t RESERVED39[2];
    union
    {
        __IO uint16_t HCINTMSK0;
        stc_ush_hcintmsk0_field_t HCINTMSK0_f;
    };
    uint8_t RESERVED40[2];
    union
    {
        __IO uint32_t HCTSIZ0;
        stc_ush_hctsiz0_field_t HCTSIZ0_f;
    };
    __IO uint32_t HCDMA0;
    uint8_t RESERVED42[8];
    union
    {
        __IO uint32_t HCCHAR1;
        stc_ush_hcchar1_field_t HCCHAR1_f;
    };
    union
    {
        __IO uint32_t HCSPLT1;
        stc_ush_hcsplt1_field_t HCSPLT1_f;
    };
    union
    {
        __IO uint16_t HCINT1;
        stc_ush_hcint1_field_t HCINT1_f;
    };
    uint8_t RESERVED45[2];
    union
    {
        __IO uint16_t HCINTMSK1;
        stc_ush_hcintmsk1_field_t HCINTMSK1_f;
    };
    uint8_t RESERVED46[2];
    union
    {
        __IO uint32_t HCTSIZ1;
        stc_ush_hctsiz1_field_t HCTSIZ1_f;
    };
    __IO uint32_t HCDMA1;
    uint8_t RESERVED48[8];
    union
    {
        __IO uint32_t HCCHAR2;
        stc_ush_hcchar2_field_t HCCHAR2_f;
    };
    union
    {
        __IO uint32_t HCSPLT2;
        stc_ush_hcsplt2_field_t HCSPLT2_f;
    };
    union
    {
        __IO uint16_t HCINT2;
        stc_ush_hcint2_field_t HCINT2_f;
    };
    uint8_t RESERVED51[2];
    union
    {
        __IO uint16_t HCINTMSK2;
        stc_ush_hcintmsk2_field_t HCINTMSK2_f;
    };
    uint8_t RESERVED52[2];
    union
    {
        __IO uint32_t HCTSIZ2;
        stc_ush_hctsiz2_field_t HCTSIZ2_f;
    };
    __IO uint32_t HCDMA2;
    uint8_t RESERVED54[8];
    union
    {
        __IO uint32_t HCCHAR3;
        stc_ush_hcchar3_field_t HCCHAR3_f;
    };
    union
    {
        __IO uint32_t HCSPLT3;
        stc_ush_hcsplt3_field_t HCSPLT3_f;
    };
    union
    {
        __IO uint16_t HCINT3;
        stc_ush_hcint3_field_t HCINT3_f;
    };
    uint8_t RESERVED57[2];
    union
    {
        __IO uint16_t HCINTMSK3;
        stc_ush_hcintmsk3_field_t HCINTMSK3_f;
    };
    uint8_t RESERVED58[2];
    union
    {
        __IO uint32_t HCTSIZ3;
        stc_ush_hctsiz3_field_t HCTSIZ3_f;
    };
    __IO uint32_t HCDMA3;
    uint8_t RESERVED60[8];
    union
    {
        __IO uint32_t HCCHAR4;
        stc_ush_hcchar4_field_t HCCHAR4_f;
    };
    union
    {
        __IO uint32_t HCSPLT4;
        stc_ush_hcsplt4_field_t HCSPLT4_f;
    };
    union
    {
        __IO uint16_t HCINT4;
        stc_ush_hcint4_field_t HCINT4_f;
    };
    uint8_t RESERVED63[2];
    union
    {
        __IO uint16_t HCINTMSK4;
        stc_ush_hcintmsk4_field_t HCINTMSK4_f;
    };
    uint8_t RESERVED64[2];
    union
    {
        __IO uint32_t HCTSIZ4;
        stc_ush_hctsiz4_field_t HCTSIZ4_f;
    };
    __IO uint32_t HCDMA4;
    uint8_t RESERVED66[8];
    union
    {
        __IO uint32_t HCCHAR5;
        stc_ush_hcchar5_field_t HCCHAR5_f;
    };
    union
    {
        __IO uint32_t HCSPLT5;
        stc_ush_hcsplt5_field_t HCSPLT5_f;
    };
    union
    {
        __IO uint16_t HCINT5;
        stc_ush_hcint5_field_t HCINT5_f;
    };
    uint8_t RESERVED69[2];
    union
    {
        __IO uint16_t HCINTMSK5;
        stc_ush_hcintmsk5_field_t HCINTMSK5_f;
    };
    uint8_t RESERVED70[2];
    union
    {
        __IO uint32_t HCTSIZ5;
        stc_ush_hctsiz5_field_t HCTSIZ5_f;
    };
    __IO uint32_t HCDMA5;
    uint8_t RESERVED72[8];
    union
    {
        __IO uint32_t HCCHAR6;
        stc_ush_hcchar6_field_t HCCHAR6_f;
    };
    union
    {
        __IO uint32_t HCSPLT6;
        stc_ush_hcsplt6_field_t HCSPLT6_f;
    };
    union
    {
        __IO uint16_t HCINT6;
        stc_ush_hcint6_field_t HCINT6_f;
    };
    uint8_t RESERVED75[2];
    union
    {
        __IO uint16_t HCINTMSK6;
        stc_ush_hcintmsk6_field_t HCINTMSK6_f;
    };
    uint8_t RESERVED76[2];
    union
    {
        __IO uint32_t HCTSIZ6;
        stc_ush_hctsiz6_field_t HCTSIZ6_f;
    };
    __IO uint32_t HCDMA6;
    uint8_t RESERVED78[8];
    union
    {
        __IO uint32_t HCCHAR7;
        stc_ush_hcchar7_field_t HCCHAR7_f;
    };
    union
    {
        __IO uint32_t HCSPLT7;
        stc_ush_hcsplt7_field_t HCSPLT7_f;
    };
    union
    {
        __IO uint16_t HCINT7;
        stc_ush_hcint7_field_t HCINT7_f;
    };
    uint8_t RESERVED81[2];
    union
    {
        __IO uint16_t HCINTMSK7;
        stc_ush_hcintmsk7_field_t HCINTMSK7_f;
    };
    uint8_t RESERVED82[2];
    union
    {
        __IO uint32_t HCTSIZ7;
        stc_ush_hctsiz7_field_t HCTSIZ7_f;
    };
    __IO uint32_t HCDMA7;
    uint8_t RESERVED84[8];
    union
    {
        __IO uint32_t HCCHAR8;
        stc_ush_hcchar8_field_t HCCHAR8_f;
    };
    union
    {
        __IO uint32_t HCSPLT8;
        stc_ush_hcsplt8_field_t HCSPLT8_f;
    };
    union
    {
        __IO uint16_t HCINT8;
        stc_ush_hcint8_field_t HCINT8_f;
    };
    uint8_t RESERVED87[2];
    union
    {
        __IO uint16_t HCINTMSK8;
        stc_ush_hcintmsk8_field_t HCINTMSK8_f;
    };
    uint8_t RESERVED88[2];
    union
    {
        __IO uint32_t HCTSIZ8;
        stc_ush_hctsiz8_field_t HCTSIZ8_f;
    };
    __IO uint32_t HCDMA8;
    uint8_t RESERVED90[8];
    union
    {
        __IO uint32_t HCCHAR9;
        stc_ush_hcchar9_field_t HCCHAR9_f;
    };
    union
    {
        __IO uint32_t HCSPLT9;
        stc_ush_hcsplt9_field_t HCSPLT9_f;
    };
    union
    {
        __IO uint16_t HCINT9;
        stc_ush_hcint9_field_t HCINT9_f;
    };
    uint8_t RESERVED93[2];
    union
    {
        __IO uint16_t HCINTMSK9;
        stc_ush_hcintmsk9_field_t HCINTMSK9_f;
    };
    uint8_t RESERVED94[2];
    union
    {
        __IO uint32_t HCTSIZ9;
        stc_ush_hctsiz9_field_t HCTSIZ9_f;
    };
    __IO uint32_t HCDMA9;
    uint8_t RESERVED96[8];
    union
    {
        __IO uint32_t HCCHAR10;
        stc_ush_hcchar10_field_t HCCHAR10_f;
    };
    union
    {
        __IO uint32_t HCSPLT10;
        stc_ush_hcsplt10_field_t HCSPLT10_f;
    };
    union
    {
        __IO uint16_t HCINT10;
        stc_ush_hcint10_field_t HCINT10_f;
    };
    uint8_t RESERVED99[2];
    union
    {
        __IO uint16_t HCINTMSK10;
        stc_ush_hcintmsk10_field_t HCINTMSK10_f;
    };
    uint8_t RESERVED100[2];
    union
    {
        __IO uint32_t HCTSIZ10;
        stc_ush_hctsiz10_field_t HCTSIZ10_f;
    };
    __IO uint32_t HCDMA10;
    uint8_t RESERVED102[8];
    union
    {
        __IO uint32_t HCCHAR11;
        stc_ush_hcchar11_field_t HCCHAR11_f;
    };
    union
    {
        __IO uint32_t HCSPLT11;
        stc_ush_hcsplt11_field_t HCSPLT11_f;
    };
    union
    {
        __IO uint16_t HCINT11;
        stc_ush_hcint11_field_t HCINT11_f;
    };
    uint8_t RESERVED105[2];
    union
    {
        __IO uint16_t HCINTMSK11;
        stc_ush_hcintmsk11_field_t HCINTMSK11_f;
    };
    uint8_t RESERVED106[2];
    union
    {
        __IO uint32_t HCTSIZ11;
        stc_ush_hctsiz11_field_t HCTSIZ11_f;
    };
    __IO uint32_t HCDMA11;
    uint8_t RESERVED108[8];
    union
    {
        __IO uint32_t HCCHAR12;
        stc_ush_hcchar12_field_t HCCHAR12_f;
    };
    union
    {
        __IO uint32_t HCSPLT12;
        stc_ush_hcsplt12_field_t HCSPLT12_f;
    };
    union
    {
        __IO uint16_t HCINT12;
        stc_ush_hcint12_field_t HCINT12_f;
    };
    uint8_t RESERVED111[2];
    union
    {
        __IO uint16_t HCINTMSK12;
        stc_ush_hcintmsk12_field_t HCINTMSK12_f;
    };
    uint8_t RESERVED112[2];
    union
    {
        __IO uint32_t HCTSIZ12;
        stc_ush_hctsiz12_field_t HCTSIZ12_f;
    };
    __IO uint32_t HCDMA12;
    uint8_t RESERVED114[8];
    union
    {
        __IO uint32_t HCCHAR13;
        stc_ush_hcchar13_field_t HCCHAR13_f;
    };
    union
    {
        __IO uint32_t HCSPLT13;
        stc_ush_hcsplt13_field_t HCSPLT13_f;
    };
    union
    {
        __IO uint16_t HCINT13;
        stc_ush_hcint13_field_t HCINT13_f;
    };
    uint8_t RESERVED117[2];
    union
    {
        __IO uint16_t HCINTMSK13;
        stc_ush_hcintmsk13_field_t HCINTMSK13_f;
    };
    uint8_t RESERVED118[2];
    union
    {
        __IO uint32_t HCTSIZ13;
        stc_ush_hctsiz13_field_t HCTSIZ13_f;
    };
    __IO uint32_t HCDMA13;
    uint8_t RESERVED120[8];
    union
    {
        __IO uint32_t HCCHAR14;
        stc_ush_hcchar14_field_t HCCHAR14_f;
    };
    union
    {
        __IO uint32_t HCSPLT14;
        stc_ush_hcsplt14_field_t HCSPLT14_f;
    };
    union
    {
        __IO uint16_t HCINT14;
        stc_ush_hcint14_field_t HCINT14_f;
    };
    uint8_t RESERVED123[2];
    union
    {
        __IO uint16_t HCINTMSK14;
        stc_ush_hcintmsk14_field_t HCINTMSK14_f;
    };
    uint8_t RESERVED124[2];
    union
    {
        __IO uint32_t HCTSIZ14;
        stc_ush_hctsiz14_field_t HCTSIZ14_f;
    };
    __IO uint32_t HCDMA14;
    uint8_t RESERVED126[8];
    union
    {
        __IO uint32_t HCCHAR15;
        stc_ush_hcchar15_field_t HCCHAR15_f;
    };
    union
    {
        __IO uint32_t HCSPLT15;
        stc_ush_hcsplt15_field_t HCSPLT15_f;
    };
    union
    {
        __IO uint16_t HCINT15;
        stc_ush_hcint15_field_t HCINT15_f;
    };
    uint8_t RESERVED129[2];
    union
    {
        __IO uint16_t HCINTMSK15;
        stc_ush_hcintmsk15_field_t HCINTMSK15_f;
    };
    uint8_t RESERVED130[2];
    union
    {
        __IO uint32_t HCTSIZ15;
        stc_ush_hctsiz15_field_t HCTSIZ15_f;
    };
    __IO uint32_t HCDMA15;
    uint8_t RESERVED132[264];
    union
    {
        __IO uint32_t DCFG;
        stc_ush_dcfg_field_t DCFG_f;
    };
    union
    {
        __IO uint32_t DCTL;
        stc_ush_dctl_field_t DCTL_f;
    };
    union
    {
        __IO uint32_t DSTS;
        stc_ush_dsts_field_t DSTS_f;
    };
    uint8_t RESERVED135[4];
    union
    {
        __IO uint16_t DIEPMSK;
        stc_ush_diepmsk_field_t DIEPMSK_f;
    };
    uint8_t RESERVED136[2];
    union
    {
        __IO uint16_t DOEPMSK;
        stc_ush_doepmsk_field_t DOEPMSK_f;
    };
    uint8_t RESERVED137[2];
    union
    {
        __IO uint32_t DAINT;
        stc_ush_daint_field_t DAINT_f;
    };
    union
    {
        __IO uint32_t DAINTMSK;
        stc_ush_daintmsk_field_t DAINTMSK_f;
    };
    uint8_t RESERVED139[8];
    __IO uint16_t DVBUSDIS;
    uint8_t RESERVED140[2];
    union
    {
        __IO uint16_t DVBUSPULSE;
        stc_ush_dvbuspulse_field_t DVBUSPULSE_f;
    };
    uint8_t RESERVED141[2];
    union
    {
        __IO uint32_t DTHRCTL;
        stc_ush_dthrctl_field_t DTHRCTL_f;
    };
    __IO uint16_t DIEPEMPMSK;
    uint8_t RESERVED143[202];
    union
    {
        __IO uint32_t DIEPCTL0;
        stc_ush_diepctl0_field_t DIEPCTL0_f;
    };
    uint8_t RESERVED144[4];
    union
    {
        __IO uint16_t DIEPINT0;
        stc_ush_diepint0_field_t DIEPINT0_f;
    };
    uint8_t RESERVED145[6];
    union
    {
        __IO uint32_t DIEPTSIZ0;
        stc_ush_dieptsiz0_field_t DIEPTSIZ0_f;
    };
    __IO uint32_t DIEPDMA0;
    __IO uint16_t DTXFSTS0;
    uint8_t RESERVED148[6];
    union
    {
        __IO uint32_t DIEPCTL1;
        stc_ush_diepctl1_field_t DIEPCTL1_f;
    };
    uint8_t RESERVED149[4];
    union
    {
        __IO uint16_t DIEPINT1;
        stc_ush_diepint1_field_t DIEPINT1_f;
    };
    uint8_t RESERVED150[6];
    union
    {
        __IO uint32_t DIEPTSIZ1;
        stc_ush_dieptsiz1_field_t DIEPTSIZ1_f;
    };
    __IO uint32_t DIEPDMA1;
    __IO uint16_t DTXFSTS1;
    uint8_t RESERVED153[6];
    union
    {
        __IO uint32_t DIEPCTL2;
        stc_ush_diepctl2_field_t DIEPCTL2_f;
    };
    uint8_t RESERVED154[4];
    union
    {
        __IO uint16_t DIEPINT2;
        stc_ush_diepint2_field_t DIEPINT2_f;
    };
    uint8_t RESERVED155[6];
    union
    {
        __IO uint32_t DIEPTSIZ2;
        stc_ush_dieptsiz2_field_t DIEPTSIZ2_f;
    };
    __IO uint32_t DIEPDMA2;
    __IO uint16_t DTXFSTS2;
    uint8_t RESERVED158[6];
    union
    {
        __IO uint32_t DIEPCTL3;
        stc_ush_diepctl3_field_t DIEPCTL3_f;
    };
    uint8_t RESERVED159[4];
    union
    {
        __IO uint16_t DIEPINT3;
        stc_ush_diepint3_field_t DIEPINT3_f;
    };
    uint8_t RESERVED160[6];
    union
    {
        __IO uint32_t DIEPTSIZ3;
        stc_ush_dieptsiz3_field_t DIEPTSIZ3_f;
    };
    __IO uint32_t DIEPDMA3;
    __IO uint16_t DTXFSTS3;
    uint8_t RESERVED163[6];
    union
    {
        __IO uint32_t DIEPCTL4;
        stc_ush_diepctl4_field_t DIEPCTL4_f;
    };
    uint8_t RESERVED164[4];
    union
    {
        __IO uint16_t DIEPINT4;
        stc_ush_diepint4_field_t DIEPINT4_f;
    };
    uint8_t RESERVED165[6];
    union
    {
        __IO uint32_t DIEPTSIZ4;
        stc_ush_dieptsiz4_field_t DIEPTSIZ4_f;
    };
    __IO uint32_t DIEPDMA4;
    __IO uint16_t DTXFSTS4;
    uint8_t RESERVED168[6];
    union
    {
        __IO uint32_t DIEPCTL5;
        stc_ush_diepctl5_field_t DIEPCTL5_f;
    };
    uint8_t RESERVED169[4];
    union
    {
        __IO uint16_t DIEPINT5;
        stc_ush_diepint5_field_t DIEPINT5_f;
    };
    uint8_t RESERVED170[6];
    union
    {
        __IO uint32_t DIEPTSIZ5;
        stc_ush_dieptsiz5_field_t DIEPTSIZ5_f;
    };
    __IO uint32_t DIEPDMA5;
    __IO uint16_t DTXFSTS5;
    uint8_t RESERVED173[6];
    union
    {
        __IO uint32_t DIEPCTL6;
        stc_ush_diepctl6_field_t DIEPCTL6_f;
    };
    uint8_t RESERVED174[4];
    union
    {
        __IO uint16_t DIEPINT6;
        stc_ush_diepint6_field_t DIEPINT6_f;
    };
    uint8_t RESERVED175[6];
    union
    {
        __IO uint32_t DIEPTSIZ6;
        stc_ush_dieptsiz6_field_t DIEPTSIZ6_f;
    };
    __IO uint32_t DIEPDMA6;
    __IO uint16_t DTXFSTS6;
    uint8_t RESERVED178[6];
    union
    {
        __IO uint32_t DIEPCTL7;
        stc_ush_diepctl7_field_t DIEPCTL7_f;
    };
    uint8_t RESERVED179[4];
    union
    {
        __IO uint16_t DIEPINT7;
        stc_ush_diepint7_field_t DIEPINT7_f;
    };
    uint8_t RESERVED180[6];
    union
    {
        __IO uint32_t DIEPTSIZ7;
        stc_ush_dieptsiz7_field_t DIEPTSIZ7_f;
    };
    __IO uint32_t DIEPDMA7;
    __IO uint16_t DTXFSTS7;
    uint8_t RESERVED183[262];
    union
    {
        __IO uint32_t DOEPCTL0;
        stc_ush_doepctl0_field_t DOEPCTL0_f;
    };
    uint8_t RESERVED184[4];
    union
    {
        __IO uint16_t DOEPINT0;
        stc_ush_doepint0_field_t DOEPINT0_f;
    };
    uint8_t RESERVED185[6];
    union
    {
        __IO uint32_t DOEPTSIZ0;
        stc_ush_doeptsiz0_field_t DOEPTSIZ0_f;
    };
    __IO uint32_t DOEPDMA0;
    uint8_t RESERVED187[8];
    union
    {
        __IO uint32_t DOEPCTL1;
        stc_ush_doepctl1_field_t DOEPCTL1_f;
    };
    uint8_t RESERVED188[4];
    union
    {
        __IO uint16_t DOEPINT1;
        stc_ush_doepint1_field_t DOEPINT1_f;
    };
    uint8_t RESERVED189[6];
    union
    {
        __IO uint32_t DOEPTSIZ1;
        stc_ush_doeptsiz1_field_t DOEPTSIZ1_f;
    };
    __IO uint32_t DOEPDMA1;
    uint8_t RESERVED191[8];
    union
    {
        __IO uint32_t DOEPCTL2;
        stc_ush_doepctl2_field_t DOEPCTL2_f;
    };
    uint8_t RESERVED192[4];
    union
    {
        __IO uint16_t DOEPINT2;
        stc_ush_doepint2_field_t DOEPINT2_f;
    };
    uint8_t RESERVED193[6];
    union
    {
        __IO uint32_t DOEPTSIZ2;
        stc_ush_doeptsiz2_field_t DOEPTSIZ2_f;
    };
    __IO uint32_t DOEPDMA2;
    uint8_t RESERVED195[8];
    union
    {
        __IO uint32_t DOEPCTL3;
        stc_ush_doepctl3_field_t DOEPCTL3_f;
    };
    uint8_t RESERVED196[4];
    union
    {
        __IO uint16_t DOEPINT3;
        stc_ush_doepint3_field_t DOEPINT3_f;
    };
    uint8_t RESERVED197[6];
    union
    {
        __IO uint32_t DOEPTSIZ3;
        stc_ush_doeptsiz3_field_t DOEPTSIZ3_f;
    };
    __IO uint32_t DOEPDMA3;
    uint8_t RESERVED199[8];
    union
    {
        __IO uint32_t DOEPCTL4;
        stc_ush_doepctl4_field_t DOEPCTL4_f;
    };
    uint8_t RESERVED200[4];
    union
    {
        __IO uint16_t DOEPINT4;
        stc_ush_doepint4_field_t DOEPINT4_f;
    };
    uint8_t RESERVED201[6];
    union
    {
        __IO uint32_t DOEPTSIZ4;
        stc_ush_doeptsiz4_field_t DOEPTSIZ4_f;
    };
    __IO uint32_t DOEPDMA4;
    uint8_t RESERVED203[8];
    union
    {
        __IO uint32_t DOEPCTL5;
        stc_ush_doepctl5_field_t DOEPCTL5_f;
    };
    uint8_t RESERVED204[4];
    union
    {
        __IO uint16_t DOEPINT5;
        stc_ush_doepint5_field_t DOEPINT5_f;
    };
    uint8_t RESERVED205[6];
    union
    {
        __IO uint32_t DOEPTSIZ5;
        stc_ush_doeptsiz5_field_t DOEPTSIZ5_f;
    };
    __IO uint32_t DOEPDMA5;
    uint8_t RESERVED207[8];
    union
    {
        __IO uint32_t DOEPCTL6;
        stc_ush_doepctl6_field_t DOEPCTL6_f;
    };
    uint8_t RESERVED208[4];
    union
    {
        __IO uint16_t DOEPINT6;
        stc_ush_doepint6_field_t DOEPINT6_f;
    };
    uint8_t RESERVED209[6];
    union
    {
        __IO uint32_t DOEPTSIZ6;
        stc_ush_doeptsiz6_field_t DOEPTSIZ6_f;
    };
    __IO uint32_t DOEPDMA6;
    uint8_t RESERVED211[8];
    union
    {
        __IO uint32_t DOEPCTL7;
        stc_ush_doepctl7_field_t DOEPCTL7_f;
    };
    uint8_t RESERVED212[4];
    union
    {
        __IO uint16_t DOEPINT7;
        stc_ush_doepint7_field_t DOEPINT7_f;
    };
    uint8_t RESERVED213[6];
    union
    {
        __IO uint32_t DOEPTSIZ7;
        stc_ush_doeptsiz7_field_t DOEPTSIZ7_f;
    };
    __IO uint32_t DOEPDMA7;
    uint8_t RESERVED215[520];
    union
    {
        __IO uint16_t PCGCCTL;
        stc_ush_pcgcctl_field_t PCGCCTL_f;
    };
}M4_USH_TypeDef;

