RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
typedef struct
{
    union
    {
        __IO uint8_t CMU_XTAL32CR;
        stc_vbat_cmu_xtal32cr_field_t CMU_XTAL32CR_f;
    };
    union
    {
        __IO uint8_t CMU_XTAL32CFGR;
        stc_vbat_cmu_xtal32cfgr_field_t CMU_XTAL32CFGR_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t CMU_XTAL32NFR;
        stc_vbat_cmu_xtal32nfr_field_t CMU_XTAL32NFR_f;
    };
    __IO uint8_t VBATRSTR;
    uint8_t RESERVED4[9];
    union
    {
        __IO uint8_t CMU_LRCCR;
        stc_vbat_cmu_lrccr_field_t CMU_LRCCR_f;
    };
    union
    {
        __IO uint8_t CMU_RTCLRCCR;
        stc_vbat_cmu_rtclrccr_field_t CMU_RTCLRCCR_f;
    };
    __IO uint8_t CMU_LRCTRM;
    __IO uint8_t CMU_RTCLRCTRM;
    uint8_t RESERVED8[38];
    union
    {
        __IO uint8_t BRAMC0;
        stc_vbat_bramc0_field_t BRAMC0_f;
    };
    uint8_t RESERVED9[69];
    __IO uint8_t VBTBKR0;
    __IO uint8_t VBTBKR1;
    __IO uint8_t VBTBKR2;
    __IO uint8_t VBTBKR3;
    __IO uint8_t VBTBKR4;
    __IO uint8_t VBTBKR5;
    __IO uint8_t VBTBKR6;
    __IO uint8_t VBTBKR7;
    __IO uint8_t VBTBKR8;
    __IO uint8_t VBTBKR9;
    __IO uint8_t VBTBKR10;
    __IO uint8_t VBTBKR11;
    __IO uint8_t VBTBKR12;
    __IO uint8_t VBTBKR13;
    __IO uint8_t VBTBKR14;
    __IO uint8_t VBTBKR15;
    __IO uint8_t VBTBKR16;
    __IO uint8_t VBTBKR17;
    __IO uint8_t VBTBKR18;
    __IO uint8_t VBTBKR19;
    __IO uint8_t VBTBKR20;
    __IO uint8_t VBTBKR21;
    __IO uint8_t VBTBKR22;
    __IO uint8_t VBTBKR23;
    __IO uint8_t VBTBKR24;
    __IO uint8_t VBTBKR25;
    __IO uint8_t VBTBKR26;
    __IO uint8_t VBTBKR27;
    __IO uint8_t VBTBKR28;
    __IO uint8_t VBTBKR29;
    __IO uint8_t VBTBKR30;
    __IO uint8_t VBTBKR31;
    __IO uint8_t VBTBKR32;
    __IO uint8_t VBTBKR33;
    __IO uint8_t VBTBKR34;
    __IO uint8_t VBTBKR35;
    __IO uint8_t VBTBKR36;
    __IO uint8_t VBTBKR37;
    __IO uint8_t VBTBKR38;
    __IO uint8_t VBTBKR39;
    __IO uint8_t VBTBKR40;
    __IO uint8_t VBTBKR41;
    __IO uint8_t VBTBKR42;
    __IO uint8_t VBTBKR43;
    __IO uint8_t VBTBKR44;
    __IO uint8_t VBTBKR45;
    __IO uint8_t VBTBKR46;
    __IO uint8_t VBTBKR47;
    __IO uint8_t VBTBKR48;
    __IO uint8_t VBTBKR49;
    __IO uint8_t VBTBKR50;
    __IO uint8_t VBTBKR51;
    __IO uint8_t VBTBKR52;
    __IO uint8_t VBTBKR53;
    __IO uint8_t VBTBKR54;
    __IO uint8_t VBTBKR55;
    __IO uint8_t VBTBKR56;
    __IO uint8_t VBTBKR57;
    __IO uint8_t VBTBKR58;
    __IO uint8_t VBTBKR59;
    __IO uint8_t VBTBKR60;
    __IO uint8_t VBTBKR61;
    __IO uint8_t VBTBKR62;
    __IO uint8_t VBTBKR63;
    __IO uint8_t VBTBKR64;
    __IO uint8_t VBTBKR65;
    __IO uint8_t VBTBKR66;
    __IO uint8_t VBTBKR67;
    __IO uint8_t VBTBKR68;
    __IO uint8_t VBTBKR69;
    __IO uint8_t VBTBKR70;
    __IO uint8_t VBTBKR71;
    __IO uint8_t VBTBKR72;
    __IO uint8_t VBTBKR73;
    __IO uint8_t VBTBKR74;
    __IO uint8_t VBTBKR75;
    __IO uint8_t VBTBKR76;
    __IO uint8_t VBTBKR77;
    __IO uint8_t VBTBKR78;
    __IO uint8_t VBTBKR79;
    __IO uint8_t VBTBKR80;
    __IO uint8_t VBTBKR81;
    __IO uint8_t VBTBKR82;
    __IO uint8_t VBTBKR83;
    __IO uint8_t VBTBKR84;
    __IO uint8_t VBTBKR85;
    __IO uint8_t VBTBKR86;
    __IO uint8_t VBTBKR87;
    __IO uint8_t VBTBKR88;
    __IO uint8_t VBTBKR89;
    __IO uint8_t VBTBKR90;
    __IO uint8_t VBTBKR91;
    __IO uint8_t VBTBKR92;
    __IO uint8_t VBTBKR93;
    __IO uint8_t VBTBKR94;
    __IO uint8_t VBTBKR95;
    __IO uint8_t VBTBKR96;
    __IO uint8_t VBTBKR97;
    __IO uint8_t VBTBKR98;
    __IO uint8_t VBTBKR99;
    __IO uint8_t VBTBKR100;
    __IO uint8_t VBTBKR101;
    __IO uint8_t VBTBKR102;
    __IO uint8_t VBTBKR103;
    __IO uint8_t VBTBKR104;
    __IO uint8_t VBTBKR105;
    __IO uint8_t VBTBKR106;
    __IO uint8_t VBTBKR107;
    __IO uint8_t VBTBKR108;
    __IO uint8_t VBTBKR109;
    __IO uint8_t VBTBKR110;
    __IO uint8_t VBTBKR111;
    __IO uint8_t VBTBKR112;
    __IO uint8_t VBTBKR113;
    __IO uint8_t VBTBKR114;
    __IO uint8_t VBTBKR115;
    __IO uint8_t VBTBKR116;
    __IO uint8_t VBTBKR117;
    __IO uint8_t VBTBKR118;
    __IO uint8_t VBTBKR119;
    __IO uint8_t VBTBKR120;
    __IO uint8_t VBTBKR121;
    __IO uint8_t VBTBKR122;
    __IO uint8_t VBTBKR123;
    __IO uint8_t VBTBKR124;
    __IO uint8_t VBTBKR125;
    __IO uint8_t VBTBKR126;
    __IO uint8_t VBTBKR127;
}M4_VBAT_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_wdt_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t SR;
        stc_wdt_sr_field_t SR_f;
    };
    __IO uint16_t RR;
}M4_WDT_TypeDef;



#define M4_ADC0                                ((M4_ADC_TypeDef *)0x40040000UL)
#define M4_ADC1                                ((M4_ADC_TypeDef *)0x40040400UL)
#define M4_ADC2                                ((M4_ADC2_TypeDef *)0x40040800UL)
#define M4_AES                                 ((M4_AES_TypeDef *)0x40008000UL)
#define M4_AOS                                 ((M4_AOS_TypeDef *)0x40010800UL)
#define M4_CAN_0                               ((M4_CAN_0_TypeDef *)0x40016000UL)
#define M4_CAN_1                               ((M4_CAN_1_TypeDef *)0x40021400UL)
#define M4_CMP                                 ((M4_CMP_TypeDef *)0x4004A000UL)
#define M4_CRC                                 ((M4_CRC_TypeDef *)0x40008800UL)
#define M4_DAC                                 ((M4_DAC_TypeDef *)0x40041000UL)
#define M4_DBGC                                ((M4_DBGC_TypeDef *)0xE0042000UL)
#define M4_DCU0                                ((M4_DCU0_TypeDef *)0x40052000UL)
#define M4_DCU1                                ((M4_DCU1_TypeDef *)0x40052400UL)
#define M4_DCU2                                ((M4_DCU2_TypeDef *)0x40052800UL)
#define M4_DCU3                                ((M4_DCU3_TypeDef *)0x40052C00UL)
#define M4_DMAC                                ((M4_DMAC_TypeDef *)0x40053000UL)
#define M4_EFM                                 ((M4_EFM_TypeDef *)0x40010400UL)
#define M4_EFMD                                ((M4_EFMD_TypeDef *)0x40010000UL)
#define M4_EMB                                 ((M4_EMB_TypeDef *)0x4001BC00UL)
#define M4_ETH                                 ((M4_ETH_TypeDef *)0x40050000UL)
#define M4_EXMC                                ((M4_EXMC_TypeDef *)0x40050000UL)
#define M4_FCM                                 ((M4_FCM_TypeDef *)0x40048400UL)
#define M4_HASH                                ((M4_HASH_TypeDef *)0x40008400UL)
#define M4_I2C                                 ((M4_I2C_TypeDef *)0x4004B400UL)
#define M4_ICG                                 ((M4_ICG_TypeDef *)0x00000400UL)
#define M4_INTC                                ((M4_INTC_TypeDef *)0x40051000UL)
#define M4_MSC0_I2C                            ((M4_MSC_I2C_TypeDef *)0x40021000UL)
#define M4_MSC1_I2C                            ((M4_MSC_I2C_TypeDef *)0x40021100UL)
#define M4_MSC2_I2C                            ((M4_MSC_I2C_TypeDef *)0x40021200UL)
#define M4_MSC0_SCI                            ((M4_MSC_SCI_TypeDef *)0x40021000UL)
#define M4_MSC1_SCI                            ((M4_MSC_SCI_TypeDef *)0x40021100UL)
#define M4_MSC2_SCI                            ((M4_MSC_SCI_TypeDef *)0x40021200UL)
#define M4_MSC0_SPI                            ((M4_MSC_SPI_TypeDef *)0x40021000UL)
#define M4_MSC1_SPI                            ((M4_MSC_SPI_TypeDef *)0x40021100UL)
#define M4_MSC2_SPI                            ((M4_MSC_SPI_TypeDef *)0x40021200UL)
#define M4_MSTP                                ((M4_MSTP_TypeDef *)0x40048000UL)
#define M4_PORT                                ((M4_PORT_TypeDef *)0x40053800UL)
#define M4_QSPI                                ((M4_QSPI_TypeDef *)0x98000000UL)
#define M4_RTC                                 ((M4_RTC_TypeDef *)0x4004BA00UL)
#define M4_SDIOC                               ((M4_SDIOC_TypeDef *)0x40010C00UL)
#define M4_SMI                                 ((M4_SMI_TypeDef *)0x40055000UL)
#define M4_SPI                                 ((M4_SPI_TypeDef *)0x4001C000UL)
#define M4_SRAMC                               ((M4_SRAMC_TypeDef *)0x40050800UL)
#define M4_SWDT                                ((M4_SWDT_TypeDef *)0x40049400UL)
#define M4_SYSREG                              ((M4_SYSREG_TypeDef *)0x40054000UL)
#define M4_TMR00                               ((M4_TMR0_TypeDef *)0x40024000UL)
#define M4_TMR01                               ((M4_TMR0_TypeDef *)0x40024400UL)
#define M4_TMR20                               ((M4_TMR2_TypeDef *)0x40015000UL)
#define M4_TMR21                               ((M4_TMR2_TypeDef *)0x40015400UL)
#define M4_TMR22                               ((M4_TMR2_TypeDef *)0x40015800UL)
#define M4_TMR23                               ((M4_TMR2_TypeDef *)0x40015C00UL)
#define M4_TMR40                               ((M4_TMR4_TypeDef *)0x40024800UL)
#define M4_TMR41                               ((M4_TMR4_TypeDef *)0x40024C00UL)
#define M4_TMR60                               ((M4_TMR6_TypeDef *)0x40018000UL)
#define M4_TMR61                               ((M4_TMR6_TypeDef *)0x40018400UL)
#define M4_TMR62                               ((M4_TMR6_TypeDef *)0x40018800UL)
#define M4_TMR63                               ((M4_TMR6_TypeDef *)0x40018C00UL)
#define M4_TMR64                               ((M4_TMR6_TypeDef *)0x40019000UL)
#define M4_TMR65                               ((M4_TMR6_TypeDef *)0x40019400UL)
#define M4_TMR66                               ((M4_TMR6_TypeDef *)0x40019800UL)
#define M4_TMR67                               ((M4_TMR6_TypeDef *)0x40019C00UL)
#define M4_TMR68                               ((M4_TMR6_TypeDef *)0x4001A000UL)
#define M4_TMR69                               ((M4_TMR6_TypeDef *)0x4001A400UL)
#define M4_TRNG                                ((M4_TRNG_TypeDef *)0x40008800UL)
#define M4_USART0                              ((M4_USART_TypeDef *)0x4001F400UL)
#define M4_USART1                              ((M4_USART_TypeDef *)0x4001F800UL)
#define M4_USART2                              ((M4_USART_TypeDef *)0x4001FC00UL)
#define M4_USART3                              ((M4_USART_TypeDef *)0x40020000UL)
#define M4_USART4                              ((M4_USART_TypeDef *)0x40020400UL)
#define M4_USART5                              ((M4_USART_TypeDef *)0x40020800UL)
#define M4_USART6                              ((M4_USART_TypeDef *)0x40020C00UL)
#define M4_USF                                 ((M4_USF_TypeDef *)0x400C0000UL)
#define M4_USH                                 ((M4_USH_TypeDef *)0x40080000UL)
#define M4_VBAT                                ((M4_VBAT_TypeDef *)0x4004B800UL)
#define M4_WDT                                 ((M4_WDT_TypeDef *)0x40049000UL)


