RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_ADC0_STR_STRT                               *((volatile unsigned int*)(0x42800000UL))
#define bM4_ADC0_CR0_MS0                                *((volatile unsigned int*)(0x42800040UL))
#define bM4_ADC0_CR0_MS1                                *((volatile unsigned int*)(0x42800044UL))
#define bM4_ADC0_CR0_ACCSEL0                            *((volatile unsigned int*)(0x42800050UL))
#define bM4_ADC0_CR0_ACCSEL1                            *((volatile unsigned int*)(0x42800054UL))
#define bM4_ADC0_CR0_CLREN                              *((volatile unsigned int*)(0x42800058UL))
#define bM4_ADC0_CR0_DFMT                               *((volatile unsigned int*)(0x4280005CUL))
#define bM4_ADC0_CR0_AVCNT0                             *((volatile unsigned int*)(0x42800060UL))
#define bM4_ADC0_CR0_AVCNT1                             *((volatile unsigned int*)(0x42800064UL))
#define bM4_ADC0_CR0_AVCNT2                             *((volatile unsigned int*)(0x42800068UL))
#define bM4_ADC0_CR0_ADAVEN                             *((volatile unsigned int*)(0x4280007CUL))
#define bM4_ADC0_CR1_SEQPR                              *((volatile unsigned int*)(0x428000A0UL))
#define bM4_ADC0_CR1_SEQBRSEN                           *((volatile unsigned int*)(0x428000A4UL))
#define bM4_ADC0_CR1_RSTCHSEL                           *((volatile unsigned int*)(0x428000A8UL))
#define bM4_ADC0_TRGSR_TRGSELA0                         *((volatile unsigned int*)(0x42800140UL))
#define bM4_ADC0_TRGSR_TRGSELA1                         *((volatile unsigned int*)(0x42800144UL))
#define bM4_ADC0_TRGSR_TRGSELA2                         *((volatile unsigned int*)(0x42800148UL))
#define bM4_ADC0_TRGSR_TRGSELB0                         *((volatile unsigned int*)(0x42800150UL))
#define bM4_ADC0_TRGSR_TRGSELB1                         *((volatile unsigned int*)(0x42800154UL))
#define bM4_ADC0_TRGSR_TRGSELB2                         *((volatile unsigned int*)(0x42800158UL))
#define bM4_ADC0_TRGSR_TRGSEL                           *((volatile unsigned int*)(0x42800160UL))
#define bM4_ADC0_TRGSR_TRGEN                            *((volatile unsigned int*)(0x42800170UL))
#define bM4_ADC0_CHSELRA_CHSELA0                        *((volatile unsigned int*)(0x42800180UL))
#define bM4_ADC0_CHSELRA_CHSELA1                        *((volatile unsigned int*)(0x42800184UL))
#define bM4_ADC0_CHSELRA_CHSELA2                        *((volatile unsigned int*)(0x42800188UL))
#define bM4_ADC0_CHSELRA_CHSELA3                        *((volatile unsigned int*)(0x4280018CUL))
#define bM4_ADC0_CHSELRA_CHSELA4                        *((volatile unsigned int*)(0x42800190UL))
#define bM4_ADC0_CHSELRB_CHSELB0                        *((volatile unsigned int*)(0x42800200UL))
#define bM4_ADC0_CHSELRB_CHSELB1                        *((volatile unsigned int*)(0x42800204UL))
#define bM4_ADC0_CHSELRB_CHSELB2                        *((volatile unsigned int*)(0x42800208UL))
#define bM4_ADC0_CHSELRB_CHSELB3                        *((volatile unsigned int*)(0x4280020CUL))
#define bM4_ADC0_CHSELRB_CHSELB4                        *((volatile unsigned int*)(0x42800210UL))
#define bM4_ADC0_AVCHSELR_AVCHSEL0                      *((volatile unsigned int*)(0x42800280UL))
#define bM4_ADC0_AVCHSELR_AVCHSEL1                      *((volatile unsigned int*)(0x42800284UL))
#define bM4_ADC0_AVCHSELR_AVCHSEL2                      *((volatile unsigned int*)(0x42800288UL))
#define bM4_ADC0_AVCHSELR_AVCHSEL3                      *((volatile unsigned int*)(0x4280028CUL))
#define bM4_ADC0_AVCHSELR_AVCHSEL4                      *((volatile unsigned int*)(0x42800290UL))
#define bM4_ADC0_SHCR_SHT0                              *((volatile unsigned int*)(0x42800340UL))
#define bM4_ADC0_SHCR_SHT1                              *((volatile unsigned int*)(0x42800344UL))
#define bM4_ADC0_SHCR_SHT2                              *((volatile unsigned int*)(0x42800348UL))
#define bM4_ADC0_SHCR_SHT3                              *((volatile unsigned int*)(0x4280034CUL))
#define bM4_ADC0_SHCR_SHT4                              *((volatile unsigned int*)(0x42800350UL))
#define bM4_ADC0_SHCR_SHT5                              *((volatile unsigned int*)(0x42800354UL))
#define bM4_ADC0_SHCR_SHT6                              *((volatile unsigned int*)(0x42800358UL))
#define bM4_ADC0_SHCR_SHT7                              *((volatile unsigned int*)(0x4280035CUL))
#define bM4_ADC0_SHCR_SHSEL0                            *((volatile unsigned int*)(0x42800360UL))
#define bM4_ADC0_SHCR_SHSEL1                            *((volatile unsigned int*)(0x42800364UL))
#define bM4_ADC0_SHCR_SHSEL2                            *((volatile unsigned int*)(0x42800368UL))
#define bM4_ADC0_ISCR_EOCAIEN                           *((volatile unsigned int*)(0x428008C0UL))
#define bM4_ADC0_ISCR_EOCBIEN                           *((volatile unsigned int*)(0x428008C4UL))
#define bM4_ADC0_ISCR_EOCAF                             *((volatile unsigned int*)(0x428008E0UL))
#define bM4_ADC0_ISCR_EOCBF                             *((volatile unsigned int*)(0x428008E4UL))
#define bM4_ADC0_AWDCR_AWDEN                            *((volatile unsigned int*)(0x42801400UL))
#define bM4_ADC0_AWDCR_AWDMD                            *((volatile unsigned int*)(0x4280141CUL))
#define bM4_ADC0_AWDCR_AWDIEN                           *((volatile unsigned int*)(0x42801420UL))
#define bM4_ADC0_AWDCNDSR_AWDCND0                       *((volatile unsigned int*)(0x42801500UL))
#define bM4_ADC0_AWDCNDSR_AWDCND1                       *((volatile unsigned int*)(0x42801504UL))
#define bM4_ADC0_AWDCNDSR_AWDCND2                       *((volatile unsigned int*)(0x42801508UL))
#define bM4_ADC0_AWDCNDSR_AWDCND3                       *((volatile unsigned int*)(0x4280150CUL))
#define bM4_ADC0_AWDCNDSR_AWDCND4                       *((volatile unsigned int*)(0x42801510UL))
#define bM4_ADC0_AWDCHSR_AWDCH0                         *((volatile unsigned int*)(0x42801580UL))
#define bM4_ADC0_AWDCHSR_AWDCH1                         *((volatile unsigned int*)(0x42801584UL))
#define bM4_ADC0_AWDCHSR_AWDCH2                         *((volatile unsigned int*)(0x42801588UL))
#define bM4_ADC0_AWDCHSR_AWDCH3                         *((volatile unsigned int*)(0x4280158CUL))
#define bM4_ADC0_AWDCHSR_AWDCH4                         *((volatile unsigned int*)(0x42801590UL))
#define bM4_ADC0_AWDSR_AWDF0                            *((volatile unsigned int*)(0x42801600UL))
#define bM4_ADC0_AWDSR_AWDF1                            *((volatile unsigned int*)(0x42801604UL))
#define bM4_ADC0_AWDSR_AWDF2                            *((volatile unsigned int*)(0x42801608UL))
#define bM4_ADC0_AWDSR_AWDF3                            *((volatile unsigned int*)(0x4280160CUL))
#define bM4_ADC0_AWDSR_AWDF4                            *((volatile unsigned int*)(0x42801610UL))
#define bM4_ADC0_PGACR_CH0CTL0                          *((volatile unsigned int*)(0x42801800UL))
#define bM4_ADC0_PGACR_CH0CTL1                          *((volatile unsigned int*)(0x42801804UL))
#define bM4_ADC0_PGACR_CH0CTL2                          *((volatile unsigned int*)(0x42801808UL))
#define bM4_ADC0_PGACR_CH0CTL3                          *((volatile unsigned int*)(0x4280180CUL))
#define bM4_ADC0_PGACR_CH1CTL0                          *((volatile unsigned int*)(0x42801810UL))
#define bM4_ADC0_PGACR_CH1CTL1                          *((volatile unsigned int*)(0x42801814UL))
#define bM4_ADC0_PGACR_CH1CTL2                          *((volatile unsigned int*)(0x42801818UL))
#define bM4_ADC0_PGACR_CH1CTL3                          *((volatile unsigned int*)(0x4280181CUL))
#define bM4_ADC0_PGACR_CH2CTL0                          *((volatile unsigned int*)(0x42801820UL))
#define bM4_ADC0_PGACR_CH2CTL1                          *((volatile unsigned int*)(0x42801824UL))
#define bM4_ADC0_PGACR_CH2CTL2                          *((volatile unsigned int*)(0x42801828UL))
#define bM4_ADC0_PGACR_CH2CTL3                          *((volatile unsigned int*)(0x4280182CUL))
#define bM4_ADC0_PGAGSR_CH0GAIN0                        *((volatile unsigned int*)(0x42801840UL))
#define bM4_ADC0_PGAGSR_CH0GAIN1                        *((volatile unsigned int*)(0x42801844UL))
#define bM4_ADC0_PGAGSR_CH0GAIN2                        *((volatile unsigned int*)(0x42801848UL))
#define bM4_ADC0_PGAGSR_CH0GAIN3                        *((volatile unsigned int*)(0x4280184CUL))
#define bM4_ADC0_PGAGSR_CH1GAIN0                        *((volatile unsigned int*)(0x42801850UL))
#define bM4_ADC0_PGAGSR_CH1GAIN1                        *((volatile unsigned int*)(0x42801854UL))
#define bM4_ADC0_PGAGSR_CH1GAIN2                        *((volatile unsigned int*)(0x42801858UL))
#define bM4_ADC0_PGAGSR_CH1GAIN3                        *((volatile unsigned int*)(0x4280185CUL))
#define bM4_ADC0_PGAGSR_CH2GAIN0                        *((volatile unsigned int*)(0x42801860UL))
#define bM4_ADC0_PGAGSR_CH2GAIN1                        *((volatile unsigned int*)(0x42801864UL))
#define bM4_ADC0_PGAGSR_CH2GAIN2                        *((volatile unsigned int*)(0x42801868UL))
#define bM4_ADC0_PGAGSR_CH2GAIN3                        *((volatile unsigned int*)(0x4280186CUL))
#define bM4_ADC1_STR_STRT                               *((volatile unsigned int*)(0x42808000UL))
#define bM4_ADC1_CR0_MS0                                *((volatile unsigned int*)(0x42808040UL))
#define bM4_ADC1_CR0_MS1                                *((volatile unsigned int*)(0x42808044UL))
#define bM4_ADC1_CR0_ACCSEL0                            *((volatile unsigned int*)(0x42808050UL))
#define bM4_ADC1_CR0_ACCSEL1                            *((volatile unsigned int*)(0x42808054UL))
#define bM4_ADC1_CR0_CLREN                              *((volatile unsigned int*)(0x42808058UL))
#define bM4_ADC1_CR0_DFMT                               *((volatile unsigned int*)(0x4280805CUL))
#define bM4_ADC1_CR0_AVCNT0                             *((volatile unsigned int*)(0x42808060UL))
#define bM4_ADC1_CR0_AVCNT1                             *((volatile unsigned int*)(0x42808064UL))
#define bM4_ADC1_CR0_AVCNT2                             *((volatile unsigned int*)(0x42808068UL))
#define bM4_ADC1_CR0_ADAVEN                             *((volatile unsigned int*)(0x4280807CUL))
#define bM4_ADC1_CR1_SEQPR                              *((volatile unsigned int*)(0x428080A0UL))
#define bM4_ADC1_CR1_SEQBRSEN                           *((volatile unsigned int*)(0x428080A4UL))
#define bM4_ADC1_CR1_RSTCHSEL                           *((volatile unsigned int*)(0x428080A8UL))
#define bM4_ADC1_TRGSR_TRGSELA0                         *((volatile unsigned int*)(0x42808140UL))
#define bM4_ADC1_TRGSR_TRGSELA1                         *((volatile unsigned int*)(0x42808144UL))
#define bM4_ADC1_TRGSR_TRGSELA2                         *((volatile unsigned int*)(0x42808148UL))
#define bM4_ADC1_TRGSR_TRGSELB0                         *((volatile unsigned int*)(0x42808150UL))
#define bM4_ADC1_TRGSR_TRGSELB1                         *((volatile unsigned int*)(0x42808154UL))
#define bM4_ADC1_TRGSR_TRGSELB2                         *((volatile unsigned int*)(0x42808158UL))
#define bM4_ADC1_TRGSR_TRGSEL                           *((volatile unsigned int*)(0x42808160UL))
#define bM4_ADC1_TRGSR_TRGEN                            *((volatile unsigned int*)(0x42808170UL))
#define bM4_ADC1_CHSELRA_CHSELA0                        *((volatile unsigned int*)(0x42808180UL))
#define bM4_ADC1_CHSELRA_CHSELA1                        *((volatile unsigned int*)(0x42808184UL))
#define bM4_ADC1_CHSELRA_CHSELA2                        *((volatile unsigned int*)(0x42808188UL))
#define bM4_ADC1_CHSELRA_CHSELA3                        *((volatile unsigned int*)(0x4280818CUL))
#define bM4_ADC1_CHSELRA_CHSELA4                        *((volatile unsigned int*)(0x42808190UL))
#define bM4_ADC1_CHSELRB_CHSELB0                        *((volatile unsigned int*)(0x42808200UL))
#define bM4_ADC1_CHSELRB_CHSELB1                        *((volatile unsigned int*)(0x42808204UL))
#define bM4_ADC1_CHSELRB_CHSELB2                        *((volatile unsigned int*)(0x42808208UL))
#define bM4_ADC1_CHSELRB_CHSELB3                        *((volatile unsigned int*)(0x4280820CUL))
#define bM4_ADC1_CHSELRB_CHSELB4                        *((volatile unsigned int*)(0x42808210UL))
#define bM4_ADC1_AVCHSELR_AVCHSEL0                      *((volatile unsigned int*)(0x42808280UL))
#define bM4_ADC1_AVCHSELR_AVCHSEL1                      *((volatile unsigned int*)(0x42808284UL))
#define bM4_ADC1_AVCHSELR_AVCHSEL2                      *((volatile unsigned int*)(0x42808288UL))
#define bM4_ADC1_AVCHSELR_AVCHSEL3                      *((volatile unsigned int*)(0x4280828CUL))
#define bM4_ADC1_AVCHSELR_AVCHSEL4                      *((volatile unsigned int*)(0x42808290UL))
#define bM4_ADC1_SHCR_SHT0                              *((volatile unsigned int*)(0x42808340UL))
#define bM4_ADC1_SHCR_SHT1                              *((volatile unsigned int*)(0x42808344UL))
#define bM4_ADC1_SHCR_SHT2                              *((volatile unsigned int*)(0x42808348UL))
#define bM4_ADC1_SHCR_SHT3                              *((volatile unsigned int*)(0x4280834CUL))
#define bM4_ADC1_SHCR_SHT4                              *((volatile unsigned int*)(0x42808350UL))
#define bM4_ADC1_SHCR_SHT5                              *((volatile unsigned int*)(0x42808354UL))
#define bM4_ADC1_SHCR_SHT6                              *((volatile unsigned int*)(0x42808358UL))
#define bM4_ADC1_SHCR_SHT7                              *((volatile unsigned int*)(0x4280835CUL))
#define bM4_ADC1_SHCR_SHSEL0                            *((volatile unsigned int*)(0x42808360UL))
#define bM4_ADC1_SHCR_SHSEL1                            *((volatile unsigned int*)(0x42808364UL))
#define bM4_ADC1_SHCR_SHSEL2                            *((volatile unsigned int*)(0x42808368UL))
#define bM4_ADC1_ISCR_EOCAIEN                           *((volatile unsigned int*)(0x428088C0UL))
#define bM4_ADC1_ISCR_EOCBIEN                           *((volatile unsigned int*)(0x428088C4UL))
#define bM4_ADC1_ISCR_EOCAF                             *((volatile unsigned int*)(0x428088E0UL))
#define bM4_ADC1_ISCR_EOCBF                             *((volatile unsigned int*)(0x428088E4UL))
#define bM4_ADC1_AWDCR_AWDEN                            *((volatile unsigned int*)(0x42809400UL))
#define bM4_ADC1_AWDCR_AWDMD                            *((volatile unsigned int*)(0x4280941CUL))
#define bM4_ADC1_AWDCR_AWDIEN                           *((volatile unsigned int*)(0x42809420UL))
#define bM4_ADC1_AWDCNDSR_AWDCND0                       *((volatile unsigned int*)(0x42809500UL))
#define bM4_ADC1_AWDCNDSR_AWDCND1                       *((volatile unsigned int*)(0x42809504UL))
#define bM4_ADC1_AWDCNDSR_AWDCND2                       *((volatile unsigned int*)(0x42809508UL))
#define bM4_ADC1_AWDCNDSR_AWDCND3                       *((volatile unsigned int*)(0x4280950CUL))
#define bM4_ADC1_AWDCNDSR_AWDCND4                       *((volatile unsigned int*)(0x42809510UL))
#define bM4_ADC1_AWDCHSR_AWDCH0                         *((volatile unsigned int*)(0x42809580UL))
#define bM4_ADC1_AWDCHSR_AWDCH1                         *((volatile unsigned int*)(0x42809584UL))
#define bM4_ADC1_AWDCHSR_AWDCH2                         *((volatile unsigned int*)(0x42809588UL))
#define bM4_ADC1_AWDCHSR_AWDCH3                         *((volatile unsigned int*)(0x4280958CUL))
#define bM4_ADC1_AWDCHSR_AWDCH4                         *((volatile unsigned int*)(0x42809590UL))
#define bM4_ADC1_AWDSR_AWDF0                            *((volatile unsigned int*)(0x42809600UL))
#define bM4_ADC1_AWDSR_AWDF1                            *((volatile unsigned int*)(0x42809604UL))
#define bM4_ADC1_AWDSR_AWDF2                            *((volatile unsigned int*)(0x42809608UL))
#define bM4_ADC1_AWDSR_AWDF3                            *((volatile unsigned int*)(0x4280960CUL))
#define bM4_ADC1_AWDSR_AWDF4                            *((volatile unsigned int*)(0x42809610UL))
#define bM4_ADC1_PGACR_CH0CTL0                          *((volatile unsigned int*)(0x42809800UL))
#define bM4_ADC1_PGACR_CH0CTL1                          *((volatile unsigned int*)(0x42809804UL))
#define bM4_ADC1_PGACR_CH0CTL2                          *((volatile unsigned int*)(0x42809808UL))
#define bM4_ADC1_PGACR_CH0CTL3                          *((volatile unsigned int*)(0x4280980CUL))
#define bM4_ADC1_PGACR_CH1CTL0                          *((volatile unsigned int*)(0x42809810UL))
#define bM4_ADC1_PGACR_CH1CTL1                          *((volatile unsigned int*)(0x42809814UL))
#define bM4_ADC1_PGACR_CH1CTL2                          *((volatile unsigned int*)(0x42809818UL))
#define bM4_ADC1_PGACR_CH1CTL3                          *((volatile unsigned int*)(0x4280981CUL))
#define bM4_ADC1_PGACR_CH2CTL0                          *((volatile unsigned int*)(0x42809820UL))
#define bM4_ADC1_PGACR_CH2CTL1                          *((volatile unsigned int*)(0x42809824UL))
#define bM4_ADC1_PGACR_CH2CTL2                          *((volatile unsigned int*)(0x42809828UL))
#define bM4_ADC1_PGACR_CH2CTL3                          *((volatile unsigned int*)(0x4280982CUL))
#define bM4_ADC1_PGAGSR_CH0GAIN0                        *((volatile unsigned int*)(0x42809840UL))
#define bM4_ADC1_PGAGSR_CH0GAIN1                        *((volatile unsigned int*)(0x42809844UL))
#define bM4_ADC1_PGAGSR_CH0GAIN2                        *((volatile unsigned int*)(0x42809848UL))
#define bM4_ADC1_PGAGSR_CH0GAIN3                        *((volatile unsigned int*)(0x4280984CUL))
#define bM4_ADC1_PGAGSR_CH1GAIN0                        *((volatile unsigned int*)(0x42809850UL))
#define bM4_ADC1_PGAGSR_CH1GAIN1                        *((volatile unsigned int*)(0x42809854UL))
#define bM4_ADC1_PGAGSR_CH1GAIN2                        *((volatile unsigned int*)(0x42809858UL))
#define bM4_ADC1_PGAGSR_CH1GAIN3                        *((volatile unsigned int*)(0x4280985CUL))
#define bM4_ADC1_PGAGSR_CH2GAIN0                        *((volatile unsigned int*)(0x42809860UL))
#define bM4_ADC1_PGAGSR_CH2GAIN1                        *((volatile unsigned int*)(0x42809864UL))
#define bM4_ADC1_PGAGSR_CH2GAIN2                        *((volatile unsigned int*)(0x42809868UL))
#define bM4_ADC1_PGAGSR_CH2GAIN3                        *((volatile unsigned int*)(0x4280986CUL))
#define bM4_ADC2_STR_STRT                               *((volatile unsigned int*)(0x42810000UL))
#define bM4_ADC2_CR0_MS0                                *((volatile unsigned int*)(0x42810040UL))
#define bM4_ADC2_CR0_MS1                                *((volatile unsigned int*)(0x42810044UL))
#define bM4_ADC2_CR0_ACCSEL0                            *((volatile unsigned int*)(0x42810050UL))
#define bM4_ADC2_CR0_ACCSEL1                            *((volatile unsigned int*)(0x42810054UL))
#define bM4_ADC2_CR0_CLREN                              *((volatile unsigned int*)(0x42810058UL))
#define bM4_ADC2_CR0_DFMT                               *((volatile unsigned int*)(0x4281005CUL))
#define bM4_ADC2_CR0_AVCNT0                             *((volatile unsigned int*)(0x42810060UL))
#define bM4_ADC2_CR0_AVCNT1                             *((volatile unsigned int*)(0x42810064UL))
#define bM4_ADC2_CR0_AVCNT2                             *((volatile unsigned int*)(0x42810068UL))
#define bM4_ADC2_CR0_ADAVEN                             *((volatile unsigned int*)(0x4281007CUL))
#define bM4_ADC2_CR1_SEQPR                              *((volatile unsigned int*)(0x428100A0UL))
#define bM4_ADC2_CR1_SEQBRSEN                           *((volatile unsigned int*)(0x428100A4UL))
#define bM4_ADC2_CR1_RSTCHSEL                           *((volatile unsigned int*)(0x428100A8UL))
#define bM4_ADC2_TRGSR_TRGSELA0                         *((volatile unsigned int*)(0x42810140UL))
#define bM4_ADC2_TRGSR_TRGSELA1                         *((volatile unsigned int*)(0x42810144UL))
#define bM4_ADC2_TRGSR_TRGSELA2                         *((volatile unsigned int*)(0x42810148UL))
#define bM4_ADC2_TRGSR_TRGSELB0                         *((volatile unsigned int*)(0x42810150UL))
#define bM4_ADC2_TRGSR_TRGSELB1                         *((volatile unsigned int*)(0x42810154UL))
#define bM4_ADC2_TRGSR_TRGSELB2                         *((volatile unsigned int*)(0x42810158UL))
#define bM4_ADC2_TRGSR_TRGSEL                           *((volatile unsigned int*)(0x42810160UL))
#define bM4_ADC2_TRGSR_TRGEN                            *((volatile unsigned int*)(0x42810170UL))
#define bM4_ADC2_CHSELRA_CHSELA0                        *((volatile unsigned int*)(0x42810180UL))
#define bM4_ADC2_CHSELRA_CHSELA1                        *((volatile unsigned int*)(0x42810184UL))
#define bM4_ADC2_CHSELRA_CHSELA2                        *((volatile unsigned int*)(0x42810188UL))
#define bM4_ADC2_CHSELRA_CHSELA3                        *((volatile unsigned int*)(0x4281018CUL))
#define bM4_ADC2_CHSELRA_CHSELA4                        *((volatile unsigned int*)(0x42810190UL))
#define bM4_ADC2_CHSELRA_CHSELA5                        *((volatile unsigned int*)(0x42810194UL))
#define bM4_ADC2_CHSELRA_CHSELA6                        *((volatile unsigned int*)(0x42810198UL))
#define bM4_ADC2_CHSELRA_CHSELA7                        *((volatile unsigned int*)(0x4281019CUL))
#define bM4_ADC2_CHSELRA_CHSELA8                        *((volatile unsigned int*)(0x428101A0UL))
#define bM4_ADC2_CHSELRA_CHSELA9                        *((volatile unsigned int*)(0x428101A4UL))
#define bM4_ADC2_CHSELRA_CHSELA10                       *((volatile unsigned int*)(0x428101A8UL))
#define bM4_ADC2_CHSELRA_CHSELA11                       *((volatile unsigned int*)(0x428101ACUL))
#define bM4_ADC2_CHSELRB_CHSELB0                        *((volatile unsigned int*)(0x42810200UL))
#define bM4_ADC2_CHSELRB_CHSELB1                        *((volatile unsigned int*)(0x42810204UL))
#define bM4_ADC2_CHSELRB_CHSELB2                        *((volatile unsigned int*)(0x42810208UL))
#define bM4_ADC2_CHSELRB_CHSELB3                        *((volatile unsigned int*)(0x4281020CUL))
#define bM4_ADC2_CHSELRB_CHSELB4                        *((volatile unsigned int*)(0x42810210UL))
#define bM4_ADC2_CHSELRB_CHSELB5                        *((volatile unsigned int*)(0x42810214UL))
#define bM4_ADC2_CHSELRB_CHSELB6                        *((volatile unsigned int*)(0x42810218UL))
#define bM4_ADC2_CHSELRB_CHSELB7                        *((volatile unsigned int*)(0x4281021CUL))
#define bM4_ADC2_CHSELRB_CHSELB8                        *((volatile unsigned int*)(0x42810220UL))
#define bM4_ADC2_CHSELRB_CHSELB9                        *((volatile unsigned int*)(0x42810224UL))
#define bM4_ADC2_CHSELRB_CHSELB10                       *((volatile unsigned int*)(0x42810228UL))
#define bM4_ADC2_CHSELRB_CHSELB11                       *((volatile unsigned int*)(0x4281022CUL))
#define bM4_ADC2_AVCHSELR_AVCHSEL0                      *((volatile unsigned int*)(0x42810280UL))
#define bM4_ADC2_AVCHSELR_AVCHSEL1                      *((volatile unsigned int*)(0x42810284UL))
#define bM4_ADC2_AVCHSELR_AVCHSEL2                      *((volatile unsigned int*)(0x42810288UL))
#define bM4_ADC2_AVCHSELR_AVCHSEL3                      *((volatile unsigned int*)(0x4281028CUL))
#define bM4_ADC2_AVCHSELR_AVCHSEL4                      *((volatile unsigned int*)(0x42810290UL))
#define bM4_ADC2_AVCHSELR_AVCHSEL5                      *((volatile unsigned int*)(0x42810294UL))
#define bM4_ADC2_AVCHSELR_AVCHSEL6                      *((volatile unsigned int*)(0x42810298UL))
#define bM4_ADC2_AVCHSELR_AVCHSEL7                      *((volatile unsigned int*)(0x4281029CUL))
#define bM4_ADC2_AVCHSELR_AVCHSEL8                      *((volatile unsigned int*)(0x428102A0UL))
#define bM4_ADC2_AVCHSELR_AVCHSEL9                      *((volatile unsigned int*)(0x428102A4UL))
