RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_ADC2_AVCHSELR_AVCHSEL10                     *((volatile unsigned int*)(0x428102A8UL))
#define bM4_ADC2_AVCHSELR_AVCHSEL11                     *((volatile unsigned int*)(0x428102ACUL))
#define bM4_ADC2_ISCR_EOCAIEN                           *((volatile unsigned int*)(0x428108C0UL))
#define bM4_ADC2_ISCR_EOCBIEN                           *((volatile unsigned int*)(0x428108C4UL))
#define bM4_ADC2_ISCR_EOCAF                             *((volatile unsigned int*)(0x428108E0UL))
#define bM4_ADC2_ISCR_EOCBF                             *((volatile unsigned int*)(0x428108E4UL))
#define bM4_ADC2_AWDCR_AWDEN                            *((volatile unsigned int*)(0x42811400UL))
#define bM4_ADC2_AWDCR_AWDMD                            *((volatile unsigned int*)(0x4281141CUL))
#define bM4_ADC2_AWDCR_AWDIEN                           *((volatile unsigned int*)(0x42811420UL))
#define bM4_ADC2_AWDCNDSR_AWDCND0                       *((volatile unsigned int*)(0x42811500UL))
#define bM4_ADC2_AWDCNDSR_AWDCND1                       *((volatile unsigned int*)(0x42811504UL))
#define bM4_ADC2_AWDCNDSR_AWDCND2                       *((volatile unsigned int*)(0x42811508UL))
#define bM4_ADC2_AWDCNDSR_AWDCND3                       *((volatile unsigned int*)(0x4281150CUL))
#define bM4_ADC2_AWDCNDSR_AWDCND4                       *((volatile unsigned int*)(0x42811510UL))
#define bM4_ADC2_AWDCNDSR_AWDCND5                       *((volatile unsigned int*)(0x42811514UL))
#define bM4_ADC2_AWDCNDSR_AWDCND6                       *((volatile unsigned int*)(0x42811518UL))
#define bM4_ADC2_AWDCNDSR_AWDCND7                       *((volatile unsigned int*)(0x4281151CUL))
#define bM4_ADC2_AWDCNDSR_AWDCND8                       *((volatile unsigned int*)(0x42811520UL))
#define bM4_ADC2_AWDCNDSR_AWDCND9                       *((volatile unsigned int*)(0x42811524UL))
#define bM4_ADC2_AWDCNDSR_AWDCND10                      *((volatile unsigned int*)(0x42811528UL))
#define bM4_ADC2_AWDCNDSR_AWDCND11                      *((volatile unsigned int*)(0x4281152CUL))
#define bM4_ADC2_AWDCHSR_AWDCH0                         *((volatile unsigned int*)(0x42811580UL))
#define bM4_ADC2_AWDCHSR_AWDCH1                         *((volatile unsigned int*)(0x42811584UL))
#define bM4_ADC2_AWDCHSR_AWDCH2                         *((volatile unsigned int*)(0x42811588UL))
#define bM4_ADC2_AWDCHSR_AWDCH3                         *((volatile unsigned int*)(0x4281158CUL))
#define bM4_ADC2_AWDCHSR_AWDCH4                         *((volatile unsigned int*)(0x42811590UL))
#define bM4_ADC2_AWDCHSR_AWDCH5                         *((volatile unsigned int*)(0x42811594UL))
#define bM4_ADC2_AWDCHSR_AWDCH6                         *((volatile unsigned int*)(0x42811598UL))
#define bM4_ADC2_AWDCHSR_AWDCH7                         *((volatile unsigned int*)(0x4281159CUL))
#define bM4_ADC2_AWDCHSR_AWDCH8                         *((volatile unsigned int*)(0x428115A0UL))
#define bM4_ADC2_AWDCHSR_AWDCH9                         *((volatile unsigned int*)(0x428115A4UL))
#define bM4_ADC2_AWDCHSR_AWDCH10                        *((volatile unsigned int*)(0x428115A8UL))
#define bM4_ADC2_AWDCHSR_AWDCH11                        *((volatile unsigned int*)(0x428115ACUL))
#define bM4_ADC2_AWDSR_AWDF0                            *((volatile unsigned int*)(0x42811600UL))
#define bM4_ADC2_AWDSR_AWDF1                            *((volatile unsigned int*)(0x42811604UL))
#define bM4_ADC2_AWDSR_AWDF2                            *((volatile unsigned int*)(0x42811608UL))
#define bM4_ADC2_AWDSR_AWDF3                            *((volatile unsigned int*)(0x4281160CUL))
#define bM4_ADC2_AWDSR_AWDF4                            *((volatile unsigned int*)(0x42811610UL))
#define bM4_ADC2_AWDSR_AWDF5                            *((volatile unsigned int*)(0x42811614UL))
#define bM4_ADC2_AWDSR_AWDF6                            *((volatile unsigned int*)(0x42811618UL))
#define bM4_ADC2_AWDSR_AWDF7                            *((volatile unsigned int*)(0x4281161CUL))
#define bM4_ADC2_AWDSR_AWDF8                            *((volatile unsigned int*)(0x42811620UL))
#define bM4_ADC2_AWDSR_AWDF9                            *((volatile unsigned int*)(0x42811624UL))
#define bM4_ADC2_AWDSR_AWDF10                           *((volatile unsigned int*)(0x42811628UL))
#define bM4_ADC2_AWDSR_AWDF11                           *((volatile unsigned int*)(0x4281162CUL))
#define bM4_AES_CR_START                                *((volatile unsigned int*)(0x42100000UL))
#define bM4_AES_CR_FUNC0                                *((volatile unsigned int*)(0x42100004UL))
#define bM4_AES_CR_FUNC1                                *((volatile unsigned int*)(0x42100008UL))
#define bM4_AES_CR_KEY_SEL0                             *((volatile unsigned int*)(0x4210000CUL))
#define bM4_AES_CR_KEY_SEL1                             *((volatile unsigned int*)(0x42100010UL))
#define bM4_AES_CR_DFAST                                *((volatile unsigned int*)(0x42100020UL))
#define bM4_AES_CR_DMY_SEL0                             *((volatile unsigned int*)(0x4210002CUL))
#define bM4_AES_CR_DMY_SEL1                             *((volatile unsigned int*)(0x42100030UL))
#define bM4_AOS_INTSFTTRG_STRG                          *((volatile unsigned int*)(0x42210000UL))
#define bM4_AOS_ADC0_ITRGSELR0_TRGSEL0                  *((volatile unsigned int*)(0x42210080UL))
#define bM4_AOS_ADC0_ITRGSELR0_TRGSEL1                  *((volatile unsigned int*)(0x42210084UL))
#define bM4_AOS_ADC0_ITRGSELR0_TRGSEL2                  *((volatile unsigned int*)(0x42210088UL))
#define bM4_AOS_ADC0_ITRGSELR0_TRGSEL3                  *((volatile unsigned int*)(0x4221008CUL))
#define bM4_AOS_ADC0_ITRGSELR0_TRGSEL4                  *((volatile unsigned int*)(0x42210090UL))
#define bM4_AOS_ADC0_ITRGSELR0_TRGSEL5                  *((volatile unsigned int*)(0x42210094UL))
#define bM4_AOS_ADC0_ITRGSELR0_TRGSEL6                  *((volatile unsigned int*)(0x42210098UL))
#define bM4_AOS_ADC0_ITRGSELR0_TRGSEL7                  *((volatile unsigned int*)(0x4221009CUL))
#define bM4_AOS_ADC0_ITRGSELR0_TRGSEL8                  *((volatile unsigned int*)(0x422100A0UL))
#define bM4_AOS_ADC0_ITRGSELR1_TRGSEL0                  *((volatile unsigned int*)(0x42210100UL))
#define bM4_AOS_ADC0_ITRGSELR1_TRGSEL1                  *((volatile unsigned int*)(0x42210104UL))
#define bM4_AOS_ADC0_ITRGSELR1_TRGSEL2                  *((volatile unsigned int*)(0x42210108UL))
#define bM4_AOS_ADC0_ITRGSELR1_TRGSEL3                  *((volatile unsigned int*)(0x4221010CUL))
#define bM4_AOS_ADC0_ITRGSELR1_TRGSEL4                  *((volatile unsigned int*)(0x42210110UL))
#define bM4_AOS_ADC0_ITRGSELR1_TRGSEL5                  *((volatile unsigned int*)(0x42210114UL))
#define bM4_AOS_ADC0_ITRGSELR1_TRGSEL6                  *((volatile unsigned int*)(0x42210118UL))
#define bM4_AOS_ADC0_ITRGSELR1_TRGSEL7                  *((volatile unsigned int*)(0x4221011CUL))
#define bM4_AOS_ADC0_ITRGSELR1_TRGSEL8                  *((volatile unsigned int*)(0x42210120UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL0                  *((volatile unsigned int*)(0x42210180UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL1                  *((volatile unsigned int*)(0x42210184UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL2                  *((volatile unsigned int*)(0x42210188UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL3                  *((volatile unsigned int*)(0x4221018CUL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL4                  *((volatile unsigned int*)(0x42210190UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL5                  *((volatile unsigned int*)(0x42210194UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL6                  *((volatile unsigned int*)(0x42210198UL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL7                  *((volatile unsigned int*)(0x4221019CUL))
#define bM4_AOS_ADC1_ITRGSELR0_TRGSEL8                  *((volatile unsigned int*)(0x422101A0UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL0                  *((volatile unsigned int*)(0x42210200UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL1                  *((volatile unsigned int*)(0x42210204UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL2                  *((volatile unsigned int*)(0x42210208UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL3                  *((volatile unsigned int*)(0x4221020CUL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL4                  *((volatile unsigned int*)(0x42210210UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL5                  *((volatile unsigned int*)(0x42210214UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL6                  *((volatile unsigned int*)(0x42210218UL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL7                  *((volatile unsigned int*)(0x4221021CUL))
#define bM4_AOS_ADC1_ITRGSELR1_TRGSEL8                  *((volatile unsigned int*)(0x42210220UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL0                  *((volatile unsigned int*)(0x42210280UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL1                  *((volatile unsigned int*)(0x42210284UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL2                  *((volatile unsigned int*)(0x42210288UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL3                  *((volatile unsigned int*)(0x4221028CUL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL4                  *((volatile unsigned int*)(0x42210290UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL5                  *((volatile unsigned int*)(0x42210294UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL6                  *((volatile unsigned int*)(0x42210298UL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL7                  *((volatile unsigned int*)(0x4221029CUL))
#define bM4_AOS_ADC2_ITRGSELR0_TRGSEL8                  *((volatile unsigned int*)(0x422102A0UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL0                  *((volatile unsigned int*)(0x42210300UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL1                  *((volatile unsigned int*)(0x42210304UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL2                  *((volatile unsigned int*)(0x42210308UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL3                  *((volatile unsigned int*)(0x4221030CUL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL4                  *((volatile unsigned int*)(0x42210310UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL5                  *((volatile unsigned int*)(0x42210314UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL6                  *((volatile unsigned int*)(0x42210318UL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL7                  *((volatile unsigned int*)(0x4221031CUL))
#define bM4_AOS_ADC2_ITRGSELR1_TRGSEL8                  *((volatile unsigned int*)(0x42210320UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL0                      *((volatile unsigned int*)(0x42210380UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL1                      *((volatile unsigned int*)(0x42210384UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL2                      *((volatile unsigned int*)(0x42210388UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL3                      *((volatile unsigned int*)(0x4221038CUL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL4                      *((volatile unsigned int*)(0x42210390UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL5                      *((volatile unsigned int*)(0x42210394UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL6                      *((volatile unsigned int*)(0x42210398UL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL7                      *((volatile unsigned int*)(0x4221039CUL))
#define bM4_AOS_TMR0_HTSSR_TRGSEL8                      *((volatile unsigned int*)(0x422103A0UL))
#define bM4_AOS_TMR2_HTSSR_TRGSEL0                      *((volatile unsigned int*)(0x42210400UL))
#define bM4_AOS_TMR2_HTSSR_TRGSEL1                      *((volatile unsigned int*)(0x42210404UL))
#define bM4_AOS_TMR2_HTSSR_TRGSEL2                      *((volatile unsigned int*)(0x42210408UL))
#define bM4_AOS_TMR2_HTSSR_TRGSEL3                      *((volatile unsigned int*)(0x4221040CUL))
#define bM4_AOS_TMR2_HTSSR_TRGSEL4                      *((volatile unsigned int*)(0x42210410UL))
#define bM4_AOS_TMR2_HTSSR_TRGSEL5                      *((volatile unsigned int*)(0x42210414UL))
#define bM4_AOS_TMR2_HTSSR_TRGSEL6                      *((volatile unsigned int*)(0x42210418UL))
#define bM4_AOS_TMR2_HTSSR_TRGSEL7                      *((volatile unsigned int*)(0x4221041CUL))
#define bM4_AOS_TMR2_HTSSR_TRGSEL8                      *((volatile unsigned int*)(0x42210420UL))
#define bM4_AOS_PEVNTTRGSR1_TRGSEL0                     *((volatile unsigned int*)(0x42210480UL))
#define bM4_AOS_PEVNTTRGSR1_TRGSEL1                     *((volatile unsigned int*)(0x42210484UL))
#define bM4_AOS_PEVNTTRGSR1_TRGSEL2                     *((volatile unsigned int*)(0x42210488UL))
#define bM4_AOS_PEVNTTRGSR1_TRGSEL3                     *((volatile unsigned int*)(0x4221048CUL))
#define bM4_AOS_PEVNTTRGSR1_TRGSEL4                     *((volatile unsigned int*)(0x42210490UL))
#define bM4_AOS_PEVNTTRGSR1_TRGSEL5                     *((volatile unsigned int*)(0x42210494UL))
#define bM4_AOS_PEVNTTRGSR1_TRGSEL6                     *((volatile unsigned int*)(0x42210498UL))
#define bM4_AOS_PEVNTTRGSR1_TRGSEL7                     *((volatile unsigned int*)(0x4221049CUL))
#define bM4_AOS_PEVNTTRGSR1_TRGSEL8                     *((volatile unsigned int*)(0x422104A0UL))
#define bM4_AOS_PEVNTTRGSR2_TRGSEL0                     *((volatile unsigned int*)(0x42210500UL))
#define bM4_AOS_PEVNTTRGSR2_TRGSEL1                     *((volatile unsigned int*)(0x42210504UL))
#define bM4_AOS_PEVNTTRGSR2_TRGSEL2                     *((volatile unsigned int*)(0x42210508UL))
#define bM4_AOS_PEVNTTRGSR2_TRGSEL3                     *((volatile unsigned int*)(0x4221050CUL))
#define bM4_AOS_PEVNTTRGSR2_TRGSEL4                     *((volatile unsigned int*)(0x42210510UL))
#define bM4_AOS_PEVNTTRGSR2_TRGSEL5                     *((volatile unsigned int*)(0x42210514UL))
#define bM4_AOS_PEVNTTRGSR2_TRGSEL6                     *((volatile unsigned int*)(0x42210518UL))
#define bM4_AOS_PEVNTTRGSR2_TRGSEL7                     *((volatile unsigned int*)(0x4221051CUL))
#define bM4_AOS_PEVNTTRGSR2_TRGSEL8                     *((volatile unsigned int*)(0x42210520UL))
#define bM4_AOS_PEVNTTRGSR3_TRGSEL0                     *((volatile unsigned int*)(0x42210580UL))
#define bM4_AOS_PEVNTTRGSR3_TRGSEL1                     *((volatile unsigned int*)(0x42210584UL))
#define bM4_AOS_PEVNTTRGSR3_TRGSEL2                     *((volatile unsigned int*)(0x42210588UL))
#define bM4_AOS_PEVNTTRGSR3_TRGSEL3                     *((volatile unsigned int*)(0x4221058CUL))
#define bM4_AOS_PEVNTTRGSR3_TRGSEL4                     *((volatile unsigned int*)(0x42210590UL))
#define bM4_AOS_PEVNTTRGSR3_TRGSEL5                     *((volatile unsigned int*)(0x42210594UL))
#define bM4_AOS_PEVNTTRGSR3_TRGSEL6                     *((volatile unsigned int*)(0x42210598UL))
#define bM4_AOS_PEVNTTRGSR3_TRGSEL7                     *((volatile unsigned int*)(0x4221059CUL))
#define bM4_AOS_PEVNTTRGSR3_TRGSEL8                     *((volatile unsigned int*)(0x422105A0UL))
#define bM4_AOS_PEVNTTRGSR4_TRGSEL0                     *((volatile unsigned int*)(0x42210600UL))
#define bM4_AOS_PEVNTTRGSR4_TRGSEL1                     *((volatile unsigned int*)(0x42210604UL))
#define bM4_AOS_PEVNTTRGSR4_TRGSEL2                     *((volatile unsigned int*)(0x42210608UL))
#define bM4_AOS_PEVNTTRGSR4_TRGSEL3                     *((volatile unsigned int*)(0x4221060CUL))
#define bM4_AOS_PEVNTTRGSR4_TRGSEL4                     *((volatile unsigned int*)(0x42210610UL))
#define bM4_AOS_PEVNTTRGSR4_TRGSEL5                     *((volatile unsigned int*)(0x42210614UL))
#define bM4_AOS_PEVNTTRGSR4_TRGSEL6                     *((volatile unsigned int*)(0x42210618UL))
#define bM4_AOS_PEVNTTRGSR4_TRGSEL7                     *((volatile unsigned int*)(0x4221061CUL))
#define bM4_AOS_PEVNTTRGSR4_TRGSEL8                     *((volatile unsigned int*)(0x42210620UL))
#define bM4_AOS_TMR6_HTSSR0_TRGSEL0                     *((volatile unsigned int*)(0x42210680UL))
#define bM4_AOS_TMR6_HTSSR0_TRGSEL1                     *((volatile unsigned int*)(0x42210684UL))
#define bM4_AOS_TMR6_HTSSR0_TRGSEL2                     *((volatile unsigned int*)(0x42210688UL))
#define bM4_AOS_TMR6_HTSSR0_TRGSEL3                     *((volatile unsigned int*)(0x4221068CUL))
#define bM4_AOS_TMR6_HTSSR0_TRGSEL4                     *((volatile unsigned int*)(0x42210690UL))
#define bM4_AOS_TMR6_HTSSR0_TRGSEL5                     *((volatile unsigned int*)(0x42210694UL))
#define bM4_AOS_TMR6_HTSSR0_TRGSEL6                     *((volatile unsigned int*)(0x42210698UL))
#define bM4_AOS_TMR6_HTSSR0_TRGSEL7                     *((volatile unsigned int*)(0x4221069CUL))
#define bM4_AOS_TMR6_HTSSR0_TRGSEL8                     *((volatile unsigned int*)(0x422106A0UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL0                     *((volatile unsigned int*)(0x42210700UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL1                     *((volatile unsigned int*)(0x42210704UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL2                     *((volatile unsigned int*)(0x42210708UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL3                     *((volatile unsigned int*)(0x4221070CUL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL4                     *((volatile unsigned int*)(0x42210710UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL5                     *((volatile unsigned int*)(0x42210714UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL6                     *((volatile unsigned int*)(0x42210718UL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL7                     *((volatile unsigned int*)(0x4221071CUL))
#define bM4_AOS_TMR6_HTSSR1_TRGSEL8                     *((volatile unsigned int*)(0x42210720UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL0                     *((volatile unsigned int*)(0x42210780UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL1                     *((volatile unsigned int*)(0x42210784UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL2                     *((volatile unsigned int*)(0x42210788UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL3                     *((volatile unsigned int*)(0x4221078CUL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL4                     *((volatile unsigned int*)(0x42210790UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL5                     *((volatile unsigned int*)(0x42210794UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL6                     *((volatile unsigned int*)(0x42210798UL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL7                     *((volatile unsigned int*)(0x4221079CUL))
#define bM4_AOS_TMR6_HTSSR2_TRGSEL8                     *((volatile unsigned int*)(0x422107A0UL))
#define bM4_AOS_TMR6_HTSSR3_TRGSEL0                     *((volatile unsigned int*)(0x42210800UL))
#define bM4_AOS_TMR6_HTSSR3_TRGSEL1                     *((volatile unsigned int*)(0x42210804UL))
#define bM4_AOS_TMR6_HTSSR3_TRGSEL2                     *((volatile unsigned int*)(0x42210808UL))
#define bM4_AOS_TMR6_HTSSR3_TRGSEL3                     *((volatile unsigned int*)(0x4221080CUL))
#define bM4_AOS_TMR6_HTSSR3_TRGSEL4                     *((volatile unsigned int*)(0x42210810UL))
#define bM4_AOS_TMR6_HTSSR3_TRGSEL5                     *((volatile unsigned int*)(0x42210814UL))
#define bM4_AOS_TMR6_HTSSR3_TRGSEL6                     *((volatile unsigned int*)(0x42210818UL))
#define bM4_AOS_TMR6_HTSSR3_TRGSEL7                     *((volatile unsigned int*)(0x4221081CUL))
#define bM4_AOS_TMR6_HTSSR3_TRGSEL8                     *((volatile unsigned int*)(0x42210820UL))
#define bM4_AOS_DCU0_TRGSEL_TRGSEL0                     *((volatile unsigned int*)(0x42210880UL))
#define bM4_AOS_DCU0_TRGSEL_TRGSEL1                     *((volatile unsigned int*)(0x42210884UL))
#define bM4_AOS_DCU0_TRGSEL_TRGSEL2                     *((volatile unsigned int*)(0x42210888UL))
#define bM4_AOS_DCU0_TRGSEL_TRGSEL3                     *((volatile unsigned int*)(0x4221088CUL))
#define bM4_AOS_DCU0_TRGSEL_TRGSEL4                     *((volatile unsigned int*)(0x42210890UL))
#define bM4_AOS_DCU0_TRGSEL_TRGSEL5                     *((volatile unsigned int*)(0x42210894UL))
#define bM4_AOS_DCU0_TRGSEL_TRGSEL6                     *((volatile unsigned int*)(0x42210898UL))
#define bM4_AOS_DCU0_TRGSEL_TRGSEL7                     *((volatile unsigned int*)(0x4221089CUL))
#define bM4_AOS_DCU0_TRGSEL_TRGSEL8                     *((volatile unsigned int*)(0x422108A0UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL0                     *((volatile unsigned int*)(0x42210900UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL1                     *((volatile unsigned int*)(0x42210904UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL2                     *((volatile unsigned int*)(0x42210908UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL3                     *((volatile unsigned int*)(0x4221090CUL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL4                     *((volatile unsigned int*)(0x42210910UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL5                     *((volatile unsigned int*)(0x42210914UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL6                     *((volatile unsigned int*)(0x42210918UL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL7                     *((volatile unsigned int*)(0x4221091CUL))
#define bM4_AOS_DCU1_TRGSEL_TRGSEL8                     *((volatile unsigned int*)(0x42210920UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL0                     *((volatile unsigned int*)(0x42210980UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL1                     *((volatile unsigned int*)(0x42210984UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL2                     *((volatile unsigned int*)(0x42210988UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL3                     *((volatile unsigned int*)(0x4221098CUL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL4                     *((volatile unsigned int*)(0x42210990UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL5                     *((volatile unsigned int*)(0x42210994UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL6                     *((volatile unsigned int*)(0x42210998UL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL7                     *((volatile unsigned int*)(0x4221099CUL))
#define bM4_AOS_DCU2_TRGSEL_TRGSEL8                     *((volatile unsigned int*)(0x422109A0UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL0                     *((volatile unsigned int*)(0x42210A00UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL1                     *((volatile unsigned int*)(0x42210A04UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL2                     *((volatile unsigned int*)(0x42210A08UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL3                     *((volatile unsigned int*)(0x42210A0CUL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL4                     *((volatile unsigned int*)(0x42210A10UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL5                     *((volatile unsigned int*)(0x42210A14UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL6                     *((volatile unsigned int*)(0x42210A18UL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL7                     *((volatile unsigned int*)(0x42210A1CUL))
#define bM4_AOS_DCU3_TRGSEL_TRGSEL8                     *((volatile unsigned int*)(0x42210A20UL))
#define bM4_AOS_DMA_TRGSEL0_TRGSEL0                     *((volatile unsigned int*)(0x42210A80UL))
#define bM4_AOS_DMA_TRGSEL0_TRGSEL1                     *((volatile unsigned int*)(0x42210A84UL))
#define bM4_AOS_DMA_TRGSEL0_TRGSEL2                     *((volatile unsigned int*)(0x42210A88UL))
#define bM4_AOS_DMA_TRGSEL0_TRGSEL3                     *((volatile unsigned int*)(0x42210A8CUL))
#define bM4_AOS_DMA_TRGSEL0_TRGSEL4                     *((volatile unsigned int*)(0x42210A90UL))
#define bM4_AOS_DMA_TRGSEL0_TRGSEL5                     *((volatile unsigned int*)(0x42210A94UL))
#define bM4_AOS_DMA_TRGSEL0_TRGSEL6                     *((volatile unsigned int*)(0x42210A98UL))
#define bM4_AOS_DMA_TRGSEL0_TRGSEL7                     *((volatile unsigned int*)(0x42210A9CUL))
#define bM4_AOS_DMA_TRGSEL0_TRGSEL8                     *((volatile unsigned int*)(0x42210AA0UL))
#define bM4_AOS_DMA_TRGSEL1_TRGSEL0                     *((volatile unsigned int*)(0x42210B00UL))
