RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_AOS_DMA_TRGSEL1_TRGSEL1                     *((volatile unsigned int*)(0x42210B04UL))
#define bM4_AOS_DMA_TRGSEL1_TRGSEL2                     *((volatile unsigned int*)(0x42210B08UL))
#define bM4_AOS_DMA_TRGSEL1_TRGSEL3                     *((volatile unsigned int*)(0x42210B0CUL))
#define bM4_AOS_DMA_TRGSEL1_TRGSEL4                     *((volatile unsigned int*)(0x42210B10UL))
#define bM4_AOS_DMA_TRGSEL1_TRGSEL5                     *((volatile unsigned int*)(0x42210B14UL))
#define bM4_AOS_DMA_TRGSEL1_TRGSEL6                     *((volatile unsigned int*)(0x42210B18UL))
#define bM4_AOS_DMA_TRGSEL1_TRGSEL7                     *((volatile unsigned int*)(0x42210B1CUL))
#define bM4_AOS_DMA_TRGSEL1_TRGSEL8                     *((volatile unsigned int*)(0x42210B20UL))
#define bM4_AOS_DMA_TRGSEL2_TRGSEL0                     *((volatile unsigned int*)(0x42210B80UL))
#define bM4_AOS_DMA_TRGSEL2_TRGSEL1                     *((volatile unsigned int*)(0x42210B84UL))
#define bM4_AOS_DMA_TRGSEL2_TRGSEL2                     *((volatile unsigned int*)(0x42210B88UL))
#define bM4_AOS_DMA_TRGSEL2_TRGSEL3                     *((volatile unsigned int*)(0x42210B8CUL))
#define bM4_AOS_DMA_TRGSEL2_TRGSEL4                     *((volatile unsigned int*)(0x42210B90UL))
#define bM4_AOS_DMA_TRGSEL2_TRGSEL5                     *((volatile unsigned int*)(0x42210B94UL))
#define bM4_AOS_DMA_TRGSEL2_TRGSEL6                     *((volatile unsigned int*)(0x42210B98UL))
#define bM4_AOS_DMA_TRGSEL2_TRGSEL7                     *((volatile unsigned int*)(0x42210B9CUL))
#define bM4_AOS_DMA_TRGSEL2_TRGSEL8                     *((volatile unsigned int*)(0x42210BA0UL))
#define bM4_AOS_DMA_TRGSEL3_TRGSEL0                     *((volatile unsigned int*)(0x42210C00UL))
#define bM4_AOS_DMA_TRGSEL3_TRGSEL1                     *((volatile unsigned int*)(0x42210C04UL))
#define bM4_AOS_DMA_TRGSEL3_TRGSEL2                     *((volatile unsigned int*)(0x42210C08UL))
#define bM4_AOS_DMA_TRGSEL3_TRGSEL3                     *((volatile unsigned int*)(0x42210C0CUL))
#define bM4_AOS_DMA_TRGSEL3_TRGSEL4                     *((volatile unsigned int*)(0x42210C10UL))
#define bM4_AOS_DMA_TRGSEL3_TRGSEL5                     *((volatile unsigned int*)(0x42210C14UL))
#define bM4_AOS_DMA_TRGSEL3_TRGSEL6                     *((volatile unsigned int*)(0x42210C18UL))
#define bM4_AOS_DMA_TRGSEL3_TRGSEL7                     *((volatile unsigned int*)(0x42210C1CUL))
#define bM4_AOS_DMA_TRGSEL3_TRGSEL8                     *((volatile unsigned int*)(0x42210C20UL))
#define bM4_AOS_DMA_TRGSEL4_TRGSEL0                     *((volatile unsigned int*)(0x42210C80UL))
#define bM4_AOS_DMA_TRGSEL4_TRGSEL1                     *((volatile unsigned int*)(0x42210C84UL))
#define bM4_AOS_DMA_TRGSEL4_TRGSEL2                     *((volatile unsigned int*)(0x42210C88UL))
#define bM4_AOS_DMA_TRGSEL4_TRGSEL3                     *((volatile unsigned int*)(0x42210C8CUL))
#define bM4_AOS_DMA_TRGSEL4_TRGSEL4                     *((volatile unsigned int*)(0x42210C90UL))
#define bM4_AOS_DMA_TRGSEL4_TRGSEL5                     *((volatile unsigned int*)(0x42210C94UL))
#define bM4_AOS_DMA_TRGSEL4_TRGSEL6                     *((volatile unsigned int*)(0x42210C98UL))
#define bM4_AOS_DMA_TRGSEL4_TRGSEL7                     *((volatile unsigned int*)(0x42210C9CUL))
#define bM4_AOS_DMA_TRGSEL4_TRGSEL8                     *((volatile unsigned int*)(0x42210CA0UL))
#define bM4_AOS_DMA_TRGSEL5_TRGSEL0                     *((volatile unsigned int*)(0x42210D00UL))
#define bM4_AOS_DMA_TRGSEL5_TRGSEL1                     *((volatile unsigned int*)(0x42210D04UL))
#define bM4_AOS_DMA_TRGSEL5_TRGSEL2                     *((volatile unsigned int*)(0x42210D08UL))
#define bM4_AOS_DMA_TRGSEL5_TRGSEL3                     *((volatile unsigned int*)(0x42210D0CUL))
#define bM4_AOS_DMA_TRGSEL5_TRGSEL4                     *((volatile unsigned int*)(0x42210D10UL))
#define bM4_AOS_DMA_TRGSEL5_TRGSEL5                     *((volatile unsigned int*)(0x42210D14UL))
#define bM4_AOS_DMA_TRGSEL5_TRGSEL6                     *((volatile unsigned int*)(0x42210D18UL))
#define bM4_AOS_DMA_TRGSEL5_TRGSEL7                     *((volatile unsigned int*)(0x42210D1CUL))
#define bM4_AOS_DMA_TRGSEL5_TRGSEL8                     *((volatile unsigned int*)(0x42210D20UL))
#define bM4_AOS_DMA_TRGSEL6_TRGSEL0                     *((volatile unsigned int*)(0x42210D80UL))
#define bM4_AOS_DMA_TRGSEL6_TRGSEL1                     *((volatile unsigned int*)(0x42210D84UL))
#define bM4_AOS_DMA_TRGSEL6_TRGSEL2                     *((volatile unsigned int*)(0x42210D88UL))
#define bM4_AOS_DMA_TRGSEL6_TRGSEL3                     *((volatile unsigned int*)(0x42210D8CUL))
#define bM4_AOS_DMA_TRGSEL6_TRGSEL4                     *((volatile unsigned int*)(0x42210D90UL))
#define bM4_AOS_DMA_TRGSEL6_TRGSEL5                     *((volatile unsigned int*)(0x42210D94UL))
#define bM4_AOS_DMA_TRGSEL6_TRGSEL6                     *((volatile unsigned int*)(0x42210D98UL))
#define bM4_AOS_DMA_TRGSEL6_TRGSEL7                     *((volatile unsigned int*)(0x42210D9CUL))
#define bM4_AOS_DMA_TRGSEL6_TRGSEL8                     *((volatile unsigned int*)(0x42210DA0UL))
#define bM4_AOS_DMA_TRGSEL6_COMTRG_EN0                  *((volatile unsigned int*)(0x42210DF8UL))
#define bM4_AOS_DMA_TRGSEL6_COMTRG_EN1                  *((volatile unsigned int*)(0x42210DFCUL))
#define bM4_AOS_DMA_TRGSEL7_TRGSEL0                     *((volatile unsigned int*)(0x42210E00UL))
#define bM4_AOS_DMA_TRGSEL7_TRGSEL1                     *((volatile unsigned int*)(0x42210E04UL))
#define bM4_AOS_DMA_TRGSEL7_TRGSEL2                     *((volatile unsigned int*)(0x42210E08UL))
#define bM4_AOS_DMA_TRGSEL7_TRGSEL3                     *((volatile unsigned int*)(0x42210E0CUL))
#define bM4_AOS_DMA_TRGSEL7_TRGSEL4                     *((volatile unsigned int*)(0x42210E10UL))
#define bM4_AOS_DMA_TRGSEL7_TRGSEL5                     *((volatile unsigned int*)(0x42210E14UL))
#define bM4_AOS_DMA_TRGSEL7_TRGSEL6                     *((volatile unsigned int*)(0x42210E18UL))
#define bM4_AOS_DMA_TRGSEL7_TRGSEL7                     *((volatile unsigned int*)(0x42210E1CUL))
#define bM4_AOS_DMA_TRGSEL7_TRGSEL8                     *((volatile unsigned int*)(0x42210E20UL))
#define bM4_AOS_DMA_TRGSEL7_COMTRG_EN0                  *((volatile unsigned int*)(0x42210E78UL))
#define bM4_AOS_DMA_TRGSEL7_COMTRG_EN1                  *((volatile unsigned int*)(0x42210E7CUL))
#define bM4_AOS_COMTRG1_COMTRG0                         *((volatile unsigned int*)(0x42210E80UL))
#define bM4_AOS_COMTRG1_COMTRG1                         *((volatile unsigned int*)(0x42210E84UL))
#define bM4_AOS_COMTRG1_COMTRG2                         *((volatile unsigned int*)(0x42210E88UL))
#define bM4_AOS_COMTRG1_COMTRG3                         *((volatile unsigned int*)(0x42210E8CUL))
#define bM4_AOS_COMTRG1_COMTRG4                         *((volatile unsigned int*)(0x42210E90UL))
#define bM4_AOS_COMTRG1_COMTRG5                         *((volatile unsigned int*)(0x42210E94UL))
#define bM4_AOS_COMTRG1_COMTRG6                         *((volatile unsigned int*)(0x42210E98UL))
#define bM4_AOS_COMTRG1_COMTRG7                         *((volatile unsigned int*)(0x42210E9CUL))
#define bM4_AOS_COMTRG1_COMTRG8                         *((volatile unsigned int*)(0x42210EA0UL))
#define bM4_AOS_COMTRG1_RESV                            *((volatile unsigned int*)(0x42210EFCUL))
#define bM4_AOS_COMTRG2_COMTRG0                         *((volatile unsigned int*)(0x42210F00UL))
#define bM4_AOS_COMTRG2_COMTRG1                         *((volatile unsigned int*)(0x42210F04UL))
#define bM4_AOS_COMTRG2_COMTRG2                         *((volatile unsigned int*)(0x42210F08UL))
#define bM4_AOS_COMTRG2_COMTRG3                         *((volatile unsigned int*)(0x42210F0CUL))
#define bM4_AOS_COMTRG2_COMTRG4                         *((volatile unsigned int*)(0x42210F10UL))
#define bM4_AOS_COMTRG2_COMTRG5                         *((volatile unsigned int*)(0x42210F14UL))
#define bM4_AOS_COMTRG2_COMTRG6                         *((volatile unsigned int*)(0x42210F18UL))
#define bM4_AOS_COMTRG2_COMTRG7                         *((volatile unsigned int*)(0x42210F1CUL))
#define bM4_AOS_COMTRG2_COMTRG8                         *((volatile unsigned int*)(0x42210F20UL))
#define bM4_AOS_COMTRG2_RESV                            *((volatile unsigned int*)(0x42210F7CUL))
#define bM4_AOS_PEVNTNFCR_NFEN1                         *((volatile unsigned int*)(0x42212E00UL))
#define bM4_AOS_PEVNTNFCR_DIVS10                        *((volatile unsigned int*)(0x42212E04UL))
#define bM4_AOS_PEVNTNFCR_DIVS11                        *((volatile unsigned int*)(0x42212E08UL))
#define bM4_AOS_PEVNTNFCR_NFEN2                         *((volatile unsigned int*)(0x42212E20UL))
#define bM4_AOS_PEVNTNFCR_DIVS20                        *((volatile unsigned int*)(0x42212E24UL))
#define bM4_AOS_PEVNTNFCR_DIVS21                        *((volatile unsigned int*)(0x42212E28UL))
#define bM4_AOS_PEVNTNFCR_NFEN3                         *((volatile unsigned int*)(0x42212E40UL))
#define bM4_AOS_PEVNTNFCR_DIVS30                        *((volatile unsigned int*)(0x42212E44UL))
#define bM4_AOS_PEVNTNFCR_DIVS31                        *((volatile unsigned int*)(0x42212E48UL))
#define bM4_AOS_PEVNTNFCR_NFEN4                         *((volatile unsigned int*)(0x42212E60UL))
#define bM4_AOS_PEVNTNFCR_DIVS40                        *((volatile unsigned int*)(0x42212E64UL))
#define bM4_AOS_PEVNTNFCR_DIVS41                        *((volatile unsigned int*)(0x42212E68UL))
#define bM4_CAN_0_CFG_STAT_BUSOFF                       *((volatile unsigned int*)(0x422C1400UL))
#define bM4_CAN_0_CFG_STAT_TACTIVE                      *((volatile unsigned int*)(0x422C1404UL))
#define bM4_CAN_0_CFG_STAT_RACTIVE                      *((volatile unsigned int*)(0x422C1408UL))
#define bM4_CAN_0_CFG_STAT_TSSS                         *((volatile unsigned int*)(0x422C140CUL))
#define bM4_CAN_0_CFG_STAT_TPSS                         *((volatile unsigned int*)(0x422C1410UL))
#define bM4_CAN_0_CFG_STAT_LBMI                         *((volatile unsigned int*)(0x422C1414UL))
#define bM4_CAN_0_CFG_STAT_LBME                         *((volatile unsigned int*)(0x422C1418UL))
#define bM4_CAN_0_CFG_STAT_RESET                        *((volatile unsigned int*)(0x422C141CUL))
#define bM4_CAN_0_TCMD_TSA                              *((volatile unsigned int*)(0x422C1420UL))
#define bM4_CAN_0_TCMD_TSALL                            *((volatile unsigned int*)(0x422C1424UL))
#define bM4_CAN_0_TCMD_TSONE                            *((volatile unsigned int*)(0x422C1428UL))
#define bM4_CAN_0_TCMD_TPA                              *((volatile unsigned int*)(0x422C142CUL))
#define bM4_CAN_0_TCMD_TPE                              *((volatile unsigned int*)(0x422C1430UL))
#define bM4_CAN_0_TCMD_STBY                             *((volatile unsigned int*)(0x422C1434UL))
#define bM4_CAN_0_TCMD_LOM                              *((volatile unsigned int*)(0x422C1438UL))
#define bM4_CAN_0_TCMD_TBSEL                            *((volatile unsigned int*)(0x422C143CUL))
#define bM4_CAN_0_TCTRL_TSSTAT0                         *((volatile unsigned int*)(0x422C1440UL))
#define bM4_CAN_0_TCTRL_TSSTAT1                         *((volatile unsigned int*)(0x422C1444UL))
#define bM4_CAN_0_TCTRL_TTBM                            *((volatile unsigned int*)(0x422C1450UL))
#define bM4_CAN_0_TCTRL_TSMODE                          *((volatile unsigned int*)(0x422C1454UL))
#define bM4_CAN_0_TCTRL_TSNEXT                          *((volatile unsigned int*)(0x422C1458UL))
#define bM4_CAN_0_RCTRL_RSSTAT0                         *((volatile unsigned int*)(0x422C1460UL))
#define bM4_CAN_0_RCTRL_RSSTAT1                         *((volatile unsigned int*)(0x422C1464UL))
#define bM4_CAN_0_RCTRL_RBALL                           *((volatile unsigned int*)(0x422C146CUL))
#define bM4_CAN_0_RCTRL_RREL                            *((volatile unsigned int*)(0x422C1470UL))
#define bM4_CAN_0_RCTRL_ROV                             *((volatile unsigned int*)(0x422C1474UL))
#define bM4_CAN_0_RCTRL_ROM                             *((volatile unsigned int*)(0x422C1478UL))
#define bM4_CAN_0_RCTRL_SACK                            *((volatile unsigned int*)(0x422C147CUL))
#define bM4_CAN_0_RTIE_TSFF                             *((volatile unsigned int*)(0x422C1480UL))
#define bM4_CAN_0_RTIE_EIE                              *((volatile unsigned int*)(0x422C1484UL))
#define bM4_CAN_0_RTIE_TSIE                             *((volatile unsigned int*)(0x422C1488UL))
#define bM4_CAN_0_RTIE_TPIE                             *((volatile unsigned int*)(0x422C148CUL))
#define bM4_CAN_0_RTIE_RAFIE                            *((volatile unsigned int*)(0x422C1490UL))
#define bM4_CAN_0_RTIE_RFIE                             *((volatile unsigned int*)(0x422C1494UL))
#define bM4_CAN_0_RTIE_ROIE                             *((volatile unsigned int*)(0x422C1498UL))
#define bM4_CAN_0_RTIE_RIE                              *((volatile unsigned int*)(0x422C149CUL))
#define bM4_CAN_0_RTIF_AIF                              *((volatile unsigned int*)(0x422C14A0UL))
#define bM4_CAN_0_RTIF_EIF                              *((volatile unsigned int*)(0x422C14A4UL))
#define bM4_CAN_0_RTIF_TSIF                             *((volatile unsigned int*)(0x422C14A8UL))
#define bM4_CAN_0_RTIF_TPIF                             *((volatile unsigned int*)(0x422C14ACUL))
#define bM4_CAN_0_RTIF_RAFIF                            *((volatile unsigned int*)(0x422C14B0UL))
#define bM4_CAN_0_RTIF_RFIF                             *((volatile unsigned int*)(0x422C14B4UL))
#define bM4_CAN_0_RTIF_ROIF                             *((volatile unsigned int*)(0x422C14B8UL))
#define bM4_CAN_0_RTIF_RIF                              *((volatile unsigned int*)(0x422C14BCUL))
#define bM4_CAN_0_ERRINT_BEIF                           *((volatile unsigned int*)(0x422C14C0UL))
#define bM4_CAN_0_ERRINT_BEIE                           *((volatile unsigned int*)(0x422C14C4UL))
#define bM4_CAN_0_ERRINT_ALIF                           *((volatile unsigned int*)(0x422C14C8UL))
#define bM4_CAN_0_ERRINT_ALIE                           *((volatile unsigned int*)(0x422C14CCUL))
#define bM4_CAN_0_ERRINT_EPIF                           *((volatile unsigned int*)(0x422C14D0UL))
#define bM4_CAN_0_ERRINT_EPIE                           *((volatile unsigned int*)(0x422C14D4UL))
#define bM4_CAN_0_ERRINT_EPASS                          *((volatile unsigned int*)(0x422C14D8UL))
#define bM4_CAN_0_ERRINT_EWARN                          *((volatile unsigned int*)(0x422C14DCUL))
#define bM4_CAN_0_LIMIT_EWL0                            *((volatile unsigned int*)(0x422C14E0UL))
#define bM4_CAN_0_LIMIT_EWL1                            *((volatile unsigned int*)(0x422C14E4UL))
#define bM4_CAN_0_LIMIT_EWL2                            *((volatile unsigned int*)(0x422C14E8UL))
#define bM4_CAN_0_LIMIT_EWL3                            *((volatile unsigned int*)(0x422C14ECUL))
#define bM4_CAN_0_LIMIT_AFWL0                           *((volatile unsigned int*)(0x422C14F0UL))
#define bM4_CAN_0_LIMIT_AFWL1                           *((volatile unsigned int*)(0x422C14F4UL))
#define bM4_CAN_0_LIMIT_AFWL2                           *((volatile unsigned int*)(0x422C14F8UL))
#define bM4_CAN_0_LIMIT_AFWL3                           *((volatile unsigned int*)(0x422C14FCUL))
#define bM4_CAN_0_S_SEG_S_SEG_10                        *((volatile unsigned int*)(0x422C1500UL))
#define bM4_CAN_0_S_SEG_S_SEG_11                        *((volatile unsigned int*)(0x422C1504UL))
#define bM4_CAN_0_S_SEG_S_SEG_12                        *((volatile unsigned int*)(0x422C1508UL))
#define bM4_CAN_0_S_SEG_S_SEG_13                        *((volatile unsigned int*)(0x422C150CUL))
#define bM4_CAN_0_S_SEG_S_SEG_14                        *((volatile unsigned int*)(0x422C1510UL))
#define bM4_CAN_0_S_SEG_S_SEG_15                        *((volatile unsigned int*)(0x422C1514UL))
#define bM4_CAN_0_S_SEG_S_SEG_16                        *((volatile unsigned int*)(0x422C1518UL))
#define bM4_CAN_0_S_SEG_S_SEG_17                        *((volatile unsigned int*)(0x422C151CUL))
#define bM4_CAN_0_S_SEG_S_SEG_20                        *((volatile unsigned int*)(0x422C1520UL))
#define bM4_CAN_0_S_SEG_S_SEG_21                        *((volatile unsigned int*)(0x422C1524UL))
#define bM4_CAN_0_S_SEG_S_SEG_22                        *((volatile unsigned int*)(0x422C1528UL))
#define bM4_CAN_0_S_SEG_S_SEG_23                        *((volatile unsigned int*)(0x422C152CUL))
#define bM4_CAN_0_S_SEG_S_SEG_24                        *((volatile unsigned int*)(0x422C1530UL))
#define bM4_CAN_0_S_SEG_S_SEG_25                        *((volatile unsigned int*)(0x422C1534UL))
#define bM4_CAN_0_S_SEG_S_SEG_26                        *((volatile unsigned int*)(0x422C1538UL))
#define bM4_CAN_0_S_SEG_S_SJW0                          *((volatile unsigned int*)(0x422C1540UL))
#define bM4_CAN_0_S_SEG_S_SJW1                          *((volatile unsigned int*)(0x422C1544UL))
#define bM4_CAN_0_S_SEG_S_SJW2                          *((volatile unsigned int*)(0x422C1548UL))
#define bM4_CAN_0_S_SEG_S_SJW3                          *((volatile unsigned int*)(0x422C154CUL))
#define bM4_CAN_0_S_SEG_S_SJW4                          *((volatile unsigned int*)(0x422C1550UL))
#define bM4_CAN_0_S_SEG_S_SJW5                          *((volatile unsigned int*)(0x422C1554UL))
#define bM4_CAN_0_S_SEG_S_SJW6                          *((volatile unsigned int*)(0x422C1558UL))
#define bM4_CAN_0_S_SEG_S_PRESC0                        *((volatile unsigned int*)(0x422C1560UL))
#define bM4_CAN_0_S_SEG_S_PRESC1                        *((volatile unsigned int*)(0x422C1564UL))
#define bM4_CAN_0_S_SEG_S_PRESC2                        *((volatile unsigned int*)(0x422C1568UL))
#define bM4_CAN_0_S_SEG_S_PRESC3                        *((volatile unsigned int*)(0x422C156CUL))
#define bM4_CAN_0_S_SEG_S_PRESC4                        *((volatile unsigned int*)(0x422C1570UL))
#define bM4_CAN_0_S_SEG_S_PRESC5                        *((volatile unsigned int*)(0x422C1574UL))
#define bM4_CAN_0_S_SEG_S_PRESC6                        *((volatile unsigned int*)(0x422C1578UL))
#define bM4_CAN_0_S_SEG_S_PRESC7                        *((volatile unsigned int*)(0x422C157CUL))
#define bM4_CAN_0_EALCAP_ALC0                           *((volatile unsigned int*)(0x422C1600UL))
#define bM4_CAN_0_EALCAP_ALC1                           *((volatile unsigned int*)(0x422C1604UL))
#define bM4_CAN_0_EALCAP_ALC2                           *((volatile unsigned int*)(0x422C1608UL))
#define bM4_CAN_0_EALCAP_ALC3                           *((volatile unsigned int*)(0x422C160CUL))
#define bM4_CAN_0_EALCAP_ALC4                           *((volatile unsigned int*)(0x422C1610UL))
#define bM4_CAN_0_EALCAP_KOER0                          *((volatile unsigned int*)(0x422C1614UL))
#define bM4_CAN_0_EALCAP_KOER1                          *((volatile unsigned int*)(0x422C1618UL))
#define bM4_CAN_0_EALCAP_KOER2                          *((volatile unsigned int*)(0x422C161CUL))
#define bM4_CAN_0_TDC_SSPOFF0                           *((volatile unsigned int*)(0x422C1620UL))
#define bM4_CAN_0_TDC_SSPOFF1                           *((volatile unsigned int*)(0x422C1624UL))
#define bM4_CAN_0_TDC_SSPOFF2                           *((volatile unsigned int*)(0x422C1628UL))
#define bM4_CAN_0_TDC_SSPOFF3                           *((volatile unsigned int*)(0x422C162CUL))
#define bM4_CAN_0_TDC_SSPOFF4                           *((volatile unsigned int*)(0x422C1630UL))
#define bM4_CAN_0_TDC_SSPOFF5                           *((volatile unsigned int*)(0x422C1634UL))
#define bM4_CAN_0_TDC_SSPOFF6                           *((volatile unsigned int*)(0x422C1638UL))
#define bM4_CAN_0_TDC_TDCEN                             *((volatile unsigned int*)(0x422C163CUL))
#define bM4_CAN_0_ACFCTRL_ACFADR0                       *((volatile unsigned int*)(0x422C1680UL))
#define bM4_CAN_0_ACFCTRL_ACFADR1                       *((volatile unsigned int*)(0x422C1684UL))
#define bM4_CAN_0_ACFCTRL_ACFADR2                       *((volatile unsigned int*)(0x422C1688UL))
#define bM4_CAN_0_ACFCTRL_ACFADR3                       *((volatile unsigned int*)(0x422C168CUL))
#define bM4_CAN_0_ACFCTRL_SELMASK                       *((volatile unsigned int*)(0x422C1694UL))
#define bM4_CAN_0_ACF_EN_0_AE_0                         *((volatile unsigned int*)(0x422C16C0UL))
#define bM4_CAN_0_ACF_EN_0_AE_1                         *((volatile unsigned int*)(0x422C16C4UL))
#define bM4_CAN_0_ACF_EN_0_AE_2                         *((volatile unsigned int*)(0x422C16C8UL))
#define bM4_CAN_0_ACF_EN_0_AE_3                         *((volatile unsigned int*)(0x422C16CCUL))
#define bM4_CAN_0_ACF_EN_0_AE_4                         *((volatile unsigned int*)(0x422C16D0UL))
#define bM4_CAN_0_ACF_EN_0_AE_5                         *((volatile unsigned int*)(0x422C16D4UL))
#define bM4_CAN_0_ACF_EN_0_AE_6                         *((volatile unsigned int*)(0x422C16D8UL))
#define bM4_CAN_0_ACF_EN_0_AE_7                         *((volatile unsigned int*)(0x422C16DCUL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK0                   *((volatile unsigned int*)(0x422C1700UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK1                   *((volatile unsigned int*)(0x422C1704UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK2                   *((volatile unsigned int*)(0x422C1708UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK3                   *((volatile unsigned int*)(0x422C170CUL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK4                   *((volatile unsigned int*)(0x422C1710UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK5                   *((volatile unsigned int*)(0x422C1714UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK6                   *((volatile unsigned int*)(0x422C1718UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK7                   *((volatile unsigned int*)(0x422C171CUL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK8                   *((volatile unsigned int*)(0x422C1720UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK9                   *((volatile unsigned int*)(0x422C1724UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK10                  *((volatile unsigned int*)(0x422C1728UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK11                  *((volatile unsigned int*)(0x422C172CUL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK12                  *((volatile unsigned int*)(0x422C1730UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK13                  *((volatile unsigned int*)(0x422C1734UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK14                  *((volatile unsigned int*)(0x422C1738UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK15                  *((volatile unsigned int*)(0x422C173CUL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK16                  *((volatile unsigned int*)(0x422C1740UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK17                  *((volatile unsigned int*)(0x422C1744UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK18                  *((volatile unsigned int*)(0x422C1748UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK19                  *((volatile unsigned int*)(0x422C174CUL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK20                  *((volatile unsigned int*)(0x422C1750UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK21                  *((volatile unsigned int*)(0x422C1754UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK22                  *((volatile unsigned int*)(0x422C1758UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK23                  *((volatile unsigned int*)(0x422C175CUL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK24                  *((volatile unsigned int*)(0x422C1760UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK25                  *((volatile unsigned int*)(0x422C1764UL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK26                  *((volatile unsigned int*)(0x422C1768UL))
