RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_CAN_0_ACF_0_ACODEORAMASK27                  *((volatile unsigned int*)(0x422C176CUL))
#define bM4_CAN_0_ACF_0_ACODEORAMASK28                  *((volatile unsigned int*)(0x422C1770UL))
#define bM4_CAN_0_ACF_0_AIDE                            *((volatile unsigned int*)(0x422C1774UL))
#define bM4_CAN_0_ACF_0_AIDEE                           *((volatile unsigned int*)(0x422C1778UL))
#define bM4_CAN_0_TBSLOT_TBPTR0                         *((volatile unsigned int*)(0x422C17C0UL))
#define bM4_CAN_0_TBSLOT_TBPTR1                         *((volatile unsigned int*)(0x422C17C4UL))
#define bM4_CAN_0_TBSLOT_TBPTR2                         *((volatile unsigned int*)(0x422C17C8UL))
#define bM4_CAN_0_TBSLOT_TBPTR3                         *((volatile unsigned int*)(0x422C17CCUL))
#define bM4_CAN_0_TBSLOT_TBPTR4                         *((volatile unsigned int*)(0x422C17D0UL))
#define bM4_CAN_0_TBSLOT_TBPTR5                         *((volatile unsigned int*)(0x422C17D4UL))
#define bM4_CAN_0_TBSLOT_TBF                            *((volatile unsigned int*)(0x422C17D8UL))
#define bM4_CAN_0_TBSLOT_TBE                            *((volatile unsigned int*)(0x422C17DCUL))
#define bM4_CAN_0_TTCFG_TTEN                            *((volatile unsigned int*)(0x422C17E0UL))
#define bM4_CAN_0_TTCFG_T_PRESC0                        *((volatile unsigned int*)(0x422C17E4UL))
#define bM4_CAN_0_TTCFG_T_PRESC1                        *((volatile unsigned int*)(0x422C17E8UL))
#define bM4_CAN_0_TTCFG_TTIF                            *((volatile unsigned int*)(0x422C17ECUL))
#define bM4_CAN_0_TTCFG_TTIE                            *((volatile unsigned int*)(0x422C17F0UL))
#define bM4_CAN_0_TTCFG_TEIF                            *((volatile unsigned int*)(0x422C17F4UL))
#define bM4_CAN_0_TTCFG_WTIF                            *((volatile unsigned int*)(0x422C17F8UL))
#define bM4_CAN_0_TTCFG_WTIE                            *((volatile unsigned int*)(0x422C17FCUL))
#define bM4_CAN_0_TRG_CFG_TTPTR0                        *((volatile unsigned int*)(0x422C1880UL))
#define bM4_CAN_0_TRG_CFG_TTPTR1                        *((volatile unsigned int*)(0x422C1884UL))
#define bM4_CAN_0_TRG_CFG_TTPTR2                        *((volatile unsigned int*)(0x422C1888UL))
#define bM4_CAN_0_TRG_CFG_TTPTR3                        *((volatile unsigned int*)(0x422C188CUL))
#define bM4_CAN_0_TRG_CFG_TTPTR4                        *((volatile unsigned int*)(0x422C1890UL))
#define bM4_CAN_0_TRG_CFG_TTPTR5                        *((volatile unsigned int*)(0x422C1894UL))
#define bM4_CAN_0_TRG_CFG_TTYPE0                        *((volatile unsigned int*)(0x422C18A0UL))
#define bM4_CAN_0_TRG_CFG_TTYPE1                        *((volatile unsigned int*)(0x422C18A4UL))
#define bM4_CAN_0_TRG_CFG_TTYPE2                        *((volatile unsigned int*)(0x422C18A8UL))
#define bM4_CAN_0_TRG_CFG_TEW0                          *((volatile unsigned int*)(0x422C18B0UL))
#define bM4_CAN_0_TRG_CFG_TEW1                          *((volatile unsigned int*)(0x422C18B4UL))
#define bM4_CAN_0_TRG_CFG_TEW2                          *((volatile unsigned int*)(0x422C18B8UL))
#define bM4_CAN_0_TRG_CFG_TEW3                          *((volatile unsigned int*)(0x422C18BCUL))
#define bM4_CAN_1_CFG_STAT_BUSOFF                       *((volatile unsigned int*)(0x42429400UL))
#define bM4_CAN_1_CFG_STAT_TACTIVE                      *((volatile unsigned int*)(0x42429404UL))
#define bM4_CAN_1_CFG_STAT_RACTIVE                      *((volatile unsigned int*)(0x42429408UL))
#define bM4_CAN_1_CFG_STAT_TSSS                         *((volatile unsigned int*)(0x4242940CUL))
#define bM4_CAN_1_CFG_STAT_TPSS                         *((volatile unsigned int*)(0x42429410UL))
#define bM4_CAN_1_CFG_STAT_LBMI                         *((volatile unsigned int*)(0x42429414UL))
#define bM4_CAN_1_CFG_STAT_LBME                         *((volatile unsigned int*)(0x42429418UL))
#define bM4_CAN_1_CFG_STAT_RESET                        *((volatile unsigned int*)(0x4242941CUL))
#define bM4_CAN_1_TCMD_TSA                              *((volatile unsigned int*)(0x42429420UL))
#define bM4_CAN_1_TCMD_TSALL                            *((volatile unsigned int*)(0x42429424UL))
#define bM4_CAN_1_TCMD_TSONE                            *((volatile unsigned int*)(0x42429428UL))
#define bM4_CAN_1_TCMD_TPA                              *((volatile unsigned int*)(0x4242942CUL))
#define bM4_CAN_1_TCMD_TPE                              *((volatile unsigned int*)(0x42429430UL))
#define bM4_CAN_1_TCMD_STBY                             *((volatile unsigned int*)(0x42429434UL))
#define bM4_CAN_1_TCMD_LOM                              *((volatile unsigned int*)(0x42429438UL))
#define bM4_CAN_1_TCMD_TBSEL                            *((volatile unsigned int*)(0x4242943CUL))
#define bM4_CAN_1_TCTRL_TSSTAT0                         *((volatile unsigned int*)(0x42429440UL))
#define bM4_CAN_1_TCTRL_TSSTAT1                         *((volatile unsigned int*)(0x42429444UL))
#define bM4_CAN_1_TCTRL_TTBM                            *((volatile unsigned int*)(0x42429450UL))
#define bM4_CAN_1_TCTRL_TSMODE                          *((volatile unsigned int*)(0x42429454UL))
#define bM4_CAN_1_TCTRL_TSNEXT                          *((volatile unsigned int*)(0x42429458UL))
#define bM4_CAN_1_RCTRL_RSSTAT0                         *((volatile unsigned int*)(0x42429460UL))
#define bM4_CAN_1_RCTRL_RSSTAT1                         *((volatile unsigned int*)(0x42429464UL))
#define bM4_CAN_1_RCTRL_RBALL                           *((volatile unsigned int*)(0x4242946CUL))
#define bM4_CAN_1_RCTRL_RREL                            *((volatile unsigned int*)(0x42429470UL))
#define bM4_CAN_1_RCTRL_ROV                             *((volatile unsigned int*)(0x42429474UL))
#define bM4_CAN_1_RCTRL_ROM                             *((volatile unsigned int*)(0x42429478UL))
#define bM4_CAN_1_RCTRL_SACK                            *((volatile unsigned int*)(0x4242947CUL))
#define bM4_CAN_1_RTIE_TSFF                             *((volatile unsigned int*)(0x42429480UL))
#define bM4_CAN_1_RTIE_EIE                              *((volatile unsigned int*)(0x42429484UL))
#define bM4_CAN_1_RTIE_TSIE                             *((volatile unsigned int*)(0x42429488UL))
#define bM4_CAN_1_RTIE_TPIE                             *((volatile unsigned int*)(0x4242948CUL))
#define bM4_CAN_1_RTIE_RAFIE                            *((volatile unsigned int*)(0x42429490UL))
#define bM4_CAN_1_RTIE_RFIE                             *((volatile unsigned int*)(0x42429494UL))
#define bM4_CAN_1_RTIE_ROIE                             *((volatile unsigned int*)(0x42429498UL))
#define bM4_CAN_1_RTIE_RIE                              *((volatile unsigned int*)(0x4242949CUL))
#define bM4_CAN_1_RTIF_AIF                              *((volatile unsigned int*)(0x424294A0UL))
#define bM4_CAN_1_RTIF_EIF                              *((volatile unsigned int*)(0x424294A4UL))
#define bM4_CAN_1_RTIF_TSIF                             *((volatile unsigned int*)(0x424294A8UL))
#define bM4_CAN_1_RTIF_TPIF                             *((volatile unsigned int*)(0x424294ACUL))
#define bM4_CAN_1_RTIF_RAFIF                            *((volatile unsigned int*)(0x424294B0UL))
#define bM4_CAN_1_RTIF_RFIF                             *((volatile unsigned int*)(0x424294B4UL))
#define bM4_CAN_1_RTIF_ROIF                             *((volatile unsigned int*)(0x424294B8UL))
#define bM4_CAN_1_RTIF_RIF                              *((volatile unsigned int*)(0x424294BCUL))
#define bM4_CAN_1_ERRINT_BEIF                           *((volatile unsigned int*)(0x424294C0UL))
#define bM4_CAN_1_ERRINT_BEIE                           *((volatile unsigned int*)(0x424294C4UL))
#define bM4_CAN_1_ERRINT_ALIF                           *((volatile unsigned int*)(0x424294C8UL))
#define bM4_CAN_1_ERRINT_ALIE                           *((volatile unsigned int*)(0x424294CCUL))
#define bM4_CAN_1_ERRINT_EPIF                           *((volatile unsigned int*)(0x424294D0UL))
#define bM4_CAN_1_ERRINT_EPIE                           *((volatile unsigned int*)(0x424294D4UL))
#define bM4_CAN_1_ERRINT_EPASS                          *((volatile unsigned int*)(0x424294D8UL))
#define bM4_CAN_1_ERRINT_EWARN                          *((volatile unsigned int*)(0x424294DCUL))
#define bM4_CAN_1_LIMIT_EWL0                            *((volatile unsigned int*)(0x424294E0UL))
#define bM4_CAN_1_LIMIT_EWL1                            *((volatile unsigned int*)(0x424294E4UL))
#define bM4_CAN_1_LIMIT_EWL2                            *((volatile unsigned int*)(0x424294E8UL))
#define bM4_CAN_1_LIMIT_EWL3                            *((volatile unsigned int*)(0x424294ECUL))
#define bM4_CAN_1_LIMIT_AFWL0                           *((volatile unsigned int*)(0x424294F0UL))
#define bM4_CAN_1_LIMIT_AFWL1                           *((volatile unsigned int*)(0x424294F4UL))
#define bM4_CAN_1_LIMIT_AFWL2                           *((volatile unsigned int*)(0x424294F8UL))
#define bM4_CAN_1_LIMIT_AFWL3                           *((volatile unsigned int*)(0x424294FCUL))
#define bM4_CAN_1_S_SEG_S_SEG_10                        *((volatile unsigned int*)(0x42429500UL))
#define bM4_CAN_1_S_SEG_S_SEG_11                        *((volatile unsigned int*)(0x42429504UL))
#define bM4_CAN_1_S_SEG_S_SEG_12                        *((volatile unsigned int*)(0x42429508UL))
#define bM4_CAN_1_S_SEG_S_SEG_13                        *((volatile unsigned int*)(0x4242950CUL))
#define bM4_CAN_1_S_SEG_S_SEG_14                        *((volatile unsigned int*)(0x42429510UL))
#define bM4_CAN_1_S_SEG_S_SEG_15                        *((volatile unsigned int*)(0x42429514UL))
#define bM4_CAN_1_S_SEG_S_SEG_16                        *((volatile unsigned int*)(0x42429518UL))
#define bM4_CAN_1_S_SEG_S_SEG_17                        *((volatile unsigned int*)(0x4242951CUL))
#define bM4_CAN_1_S_SEG_S_SEG_20                        *((volatile unsigned int*)(0x42429520UL))
#define bM4_CAN_1_S_SEG_S_SEG_21                        *((volatile unsigned int*)(0x42429524UL))
#define bM4_CAN_1_S_SEG_S_SEG_22                        *((volatile unsigned int*)(0x42429528UL))
#define bM4_CAN_1_S_SEG_S_SEG_23                        *((volatile unsigned int*)(0x4242952CUL))
#define bM4_CAN_1_S_SEG_S_SEG_24                        *((volatile unsigned int*)(0x42429530UL))
#define bM4_CAN_1_S_SEG_S_SEG_25                        *((volatile unsigned int*)(0x42429534UL))
#define bM4_CAN_1_S_SEG_S_SEG_26                        *((volatile unsigned int*)(0x42429538UL))
#define bM4_CAN_1_S_SEG_S_SJW0                          *((volatile unsigned int*)(0x42429540UL))
#define bM4_CAN_1_S_SEG_S_SJW1                          *((volatile unsigned int*)(0x42429544UL))
#define bM4_CAN_1_S_SEG_S_SJW2                          *((volatile unsigned int*)(0x42429548UL))
#define bM4_CAN_1_S_SEG_S_SJW3                          *((volatile unsigned int*)(0x4242954CUL))
#define bM4_CAN_1_S_SEG_S_SJW4                          *((volatile unsigned int*)(0x42429550UL))
#define bM4_CAN_1_S_SEG_S_SJW5                          *((volatile unsigned int*)(0x42429554UL))
#define bM4_CAN_1_S_SEG_S_SJW6                          *((volatile unsigned int*)(0x42429558UL))
#define bM4_CAN_1_S_SEG_S_PRESC0                        *((volatile unsigned int*)(0x42429560UL))
#define bM4_CAN_1_S_SEG_S_PRESC1                        *((volatile unsigned int*)(0x42429564UL))
#define bM4_CAN_1_S_SEG_S_PRESC2                        *((volatile unsigned int*)(0x42429568UL))
#define bM4_CAN_1_S_SEG_S_PRESC3                        *((volatile unsigned int*)(0x4242956CUL))
#define bM4_CAN_1_S_SEG_S_PRESC4                        *((volatile unsigned int*)(0x42429570UL))
#define bM4_CAN_1_S_SEG_S_PRESC5                        *((volatile unsigned int*)(0x42429574UL))
#define bM4_CAN_1_S_SEG_S_PRESC6                        *((volatile unsigned int*)(0x42429578UL))
#define bM4_CAN_1_S_SEG_S_PRESC7                        *((volatile unsigned int*)(0x4242957CUL))
#define bM4_CAN_1_EALCAP_ALC0                           *((volatile unsigned int*)(0x42429600UL))
#define bM4_CAN_1_EALCAP_ALC1                           *((volatile unsigned int*)(0x42429604UL))
#define bM4_CAN_1_EALCAP_ALC2                           *((volatile unsigned int*)(0x42429608UL))
#define bM4_CAN_1_EALCAP_ALC3                           *((volatile unsigned int*)(0x4242960CUL))
#define bM4_CAN_1_EALCAP_ALC4                           *((volatile unsigned int*)(0x42429610UL))
#define bM4_CAN_1_EALCAP_KOER0                          *((volatile unsigned int*)(0x42429614UL))
#define bM4_CAN_1_EALCAP_KOER1                          *((volatile unsigned int*)(0x42429618UL))
#define bM4_CAN_1_EALCAP_KOER2                          *((volatile unsigned int*)(0x4242961CUL))
#define bM4_CAN_1_TDC_SSPOFF0                           *((volatile unsigned int*)(0x42429620UL))
#define bM4_CAN_1_TDC_SSPOFF1                           *((volatile unsigned int*)(0x42429624UL))
#define bM4_CAN_1_TDC_SSPOFF2                           *((volatile unsigned int*)(0x42429628UL))
#define bM4_CAN_1_TDC_SSPOFF3                           *((volatile unsigned int*)(0x4242962CUL))
#define bM4_CAN_1_TDC_SSPOFF4                           *((volatile unsigned int*)(0x42429630UL))
#define bM4_CAN_1_TDC_SSPOFF5                           *((volatile unsigned int*)(0x42429634UL))
#define bM4_CAN_1_TDC_SSPOFF6                           *((volatile unsigned int*)(0x42429638UL))
#define bM4_CAN_1_TDC_TDCEN                             *((volatile unsigned int*)(0x4242963CUL))
#define bM4_CAN_1_ACFCTRL_ACFADR0                       *((volatile unsigned int*)(0x42429680UL))
#define bM4_CAN_1_ACFCTRL_ACFADR1                       *((volatile unsigned int*)(0x42429684UL))
#define bM4_CAN_1_ACFCTRL_ACFADR2                       *((volatile unsigned int*)(0x42429688UL))
#define bM4_CAN_1_ACFCTRL_ACFADR3                       *((volatile unsigned int*)(0x4242968CUL))
#define bM4_CAN_1_ACFCTRL_SELMASK                       *((volatile unsigned int*)(0x42429694UL))
#define bM4_CAN_1_ACF_EN_0_AE_0                         *((volatile unsigned int*)(0x424296C0UL))
#define bM4_CAN_1_ACF_EN_0_AE_1                         *((volatile unsigned int*)(0x424296C4UL))
#define bM4_CAN_1_ACF_EN_0_AE_2                         *((volatile unsigned int*)(0x424296C8UL))
#define bM4_CAN_1_ACF_EN_0_AE_3                         *((volatile unsigned int*)(0x424296CCUL))
#define bM4_CAN_1_ACF_EN_0_AE_4                         *((volatile unsigned int*)(0x424296D0UL))
#define bM4_CAN_1_ACF_EN_0_AE_5                         *((volatile unsigned int*)(0x424296D4UL))
#define bM4_CAN_1_ACF_EN_0_AE_6                         *((volatile unsigned int*)(0x424296D8UL))
#define bM4_CAN_1_ACF_EN_0_AE_7                         *((volatile unsigned int*)(0x424296DCUL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK0                   *((volatile unsigned int*)(0x42429700UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK1                   *((volatile unsigned int*)(0x42429704UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK2                   *((volatile unsigned int*)(0x42429708UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK3                   *((volatile unsigned int*)(0x4242970CUL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK4                   *((volatile unsigned int*)(0x42429710UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK5                   *((volatile unsigned int*)(0x42429714UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK6                   *((volatile unsigned int*)(0x42429718UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK7                   *((volatile unsigned int*)(0x4242971CUL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK8                   *((volatile unsigned int*)(0x42429720UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK9                   *((volatile unsigned int*)(0x42429724UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK10                  *((volatile unsigned int*)(0x42429728UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK11                  *((volatile unsigned int*)(0x4242972CUL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK12                  *((volatile unsigned int*)(0x42429730UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK13                  *((volatile unsigned int*)(0x42429734UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK14                  *((volatile unsigned int*)(0x42429738UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK15                  *((volatile unsigned int*)(0x4242973CUL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK16                  *((volatile unsigned int*)(0x42429740UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK17                  *((volatile unsigned int*)(0x42429744UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK18                  *((volatile unsigned int*)(0x42429748UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK19                  *((volatile unsigned int*)(0x4242974CUL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK20                  *((volatile unsigned int*)(0x42429750UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK21                  *((volatile unsigned int*)(0x42429754UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK22                  *((volatile unsigned int*)(0x42429758UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK23                  *((volatile unsigned int*)(0x4242975CUL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK24                  *((volatile unsigned int*)(0x42429760UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK25                  *((volatile unsigned int*)(0x42429764UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK26                  *((volatile unsigned int*)(0x42429768UL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK27                  *((volatile unsigned int*)(0x4242976CUL))
#define bM4_CAN_1_ACF_0_ACODEORAMASK28                  *((volatile unsigned int*)(0x42429770UL))
#define bM4_CAN_1_ACF_0_AIDE                            *((volatile unsigned int*)(0x42429774UL))
#define bM4_CAN_1_ACF_0_AIDEE                           *((volatile unsigned int*)(0x42429778UL))
#define bM4_CAN_1_TBSLOT_TBPTR0                         *((volatile unsigned int*)(0x424297C0UL))
#define bM4_CAN_1_TBSLOT_TBPTR1                         *((volatile unsigned int*)(0x424297C4UL))
#define bM4_CAN_1_TBSLOT_TBPTR2                         *((volatile unsigned int*)(0x424297C8UL))
#define bM4_CAN_1_TBSLOT_TBPTR3                         *((volatile unsigned int*)(0x424297CCUL))
#define bM4_CAN_1_TBSLOT_TBPTR4                         *((volatile unsigned int*)(0x424297D0UL))
#define bM4_CAN_1_TBSLOT_TBPTR5                         *((volatile unsigned int*)(0x424297D4UL))
#define bM4_CAN_1_TBSLOT_TBF                            *((volatile unsigned int*)(0x424297D8UL))
#define bM4_CAN_1_TBSLOT_TBE                            *((volatile unsigned int*)(0x424297DCUL))
#define bM4_CAN_1_TTCFG_TTEN                            *((volatile unsigned int*)(0x424297E0UL))
#define bM4_CAN_1_TTCFG_T_PRESC0                        *((volatile unsigned int*)(0x424297E4UL))
#define bM4_CAN_1_TTCFG_T_PRESC1                        *((volatile unsigned int*)(0x424297E8UL))
#define bM4_CAN_1_TTCFG_TTIF                            *((volatile unsigned int*)(0x424297ECUL))
#define bM4_CAN_1_TTCFG_TTIE                            *((volatile unsigned int*)(0x424297F0UL))
#define bM4_CAN_1_TTCFG_TEIF                            *((volatile unsigned int*)(0x424297F4UL))
#define bM4_CAN_1_TTCFG_WTIF                            *((volatile unsigned int*)(0x424297F8UL))
#define bM4_CAN_1_TTCFG_WTIE                            *((volatile unsigned int*)(0x424297FCUL))
#define bM4_CAN_1_TRG_CFG_TTPTR0                        *((volatile unsigned int*)(0x42429880UL))
#define bM4_CAN_1_TRG_CFG_TTPTR1                        *((volatile unsigned int*)(0x42429884UL))
#define bM4_CAN_1_TRG_CFG_TTPTR2                        *((volatile unsigned int*)(0x42429888UL))
#define bM4_CAN_1_TRG_CFG_TTPTR3                        *((volatile unsigned int*)(0x4242988CUL))
#define bM4_CAN_1_TRG_CFG_TTPTR4                        *((volatile unsigned int*)(0x42429890UL))
#define bM4_CAN_1_TRG_CFG_TTPTR5                        *((volatile unsigned int*)(0x42429894UL))
#define bM4_CAN_1_TRG_CFG_TTYPE0                        *((volatile unsigned int*)(0x424298A0UL))
#define bM4_CAN_1_TRG_CFG_TTYPE1                        *((volatile unsigned int*)(0x424298A4UL))
#define bM4_CAN_1_TRG_CFG_TTYPE2                        *((volatile unsigned int*)(0x424298A8UL))
#define bM4_CAN_1_TRG_CFG_TEW0                          *((volatile unsigned int*)(0x424298B0UL))
#define bM4_CAN_1_TRG_CFG_TEW1                          *((volatile unsigned int*)(0x424298B4UL))
#define bM4_CAN_1_TRG_CFG_TEW2                          *((volatile unsigned int*)(0x424298B8UL))
#define bM4_CAN_1_TRG_CFG_TEW3                          *((volatile unsigned int*)(0x424298BCUL))
#define bM4_CMP_CMPCTL0_OREV                            *((volatile unsigned int*)(0x4294001CUL))
#define bM4_CMP_CMPCTL0_IEN                             *((volatile unsigned int*)(0x42940020UL))
#define bM4_CMP_CMPCTL0_EDG0                            *((volatile unsigned int*)(0x42940024UL))
#define bM4_CMP_CMPCTL0_EDG1                            *((volatile unsigned int*)(0x42940028UL))
#define bM4_CMP_CMPCTL0_FLTR0                           *((volatile unsigned int*)(0x4294002CUL))
#define bM4_CMP_CMPCTL0_FLTR1                           *((volatile unsigned int*)(0x42940030UL))
#define bM4_CMP_CMPCTL0_IOEN                            *((volatile unsigned int*)(0x42940034UL))
#define bM4_CMP_CMPCTL0_OEN                             *((volatile unsigned int*)(0x42940038UL))
#define bM4_CMP_CMPCTL0_CMPON                           *((volatile unsigned int*)(0x4294003CUL))
#define bM4_CMP_CMPVLTSEL0_RVSEL0                       *((volatile unsigned int*)(0x42940040UL))
#define bM4_CMP_CMPVLTSEL0_RVSEL1                       *((volatile unsigned int*)(0x42940044UL))
#define bM4_CMP_CMPVLTSEL0_RVSEL2                       *((volatile unsigned int*)(0x42940048UL))
#define bM4_CMP_CMPVLTSEL0_RVSEL3                       *((volatile unsigned int*)(0x4294004CUL))
#define bM4_CMP_CMPVLTSEL0_CVSEL0                       *((volatile unsigned int*)(0x42940060UL))
#define bM4_CMP_CMPVLTSEL0_CVSEL1                       *((volatile unsigned int*)(0x42940064UL))
#define bM4_CMP_CMPVLTSEL0_CVSEL2                       *((volatile unsigned int*)(0x42940068UL))
#define bM4_CMP_CMPVLTSEL0_CVSEL3                       *((volatile unsigned int*)(0x4294006CUL))
#define bM4_CMP_CMPMON0_OMON                            *((volatile unsigned int*)(0x42940080UL))
#define bM4_CMP_CMPCTL1_OREV                            *((volatile unsigned int*)(0x4294021CUL))
#define bM4_CMP_CMPCTL1_IEN                             *((volatile unsigned int*)(0x42940220UL))
#define bM4_CMP_CMPCTL1_EDG0                            *((volatile unsigned int*)(0x42940224UL))
#define bM4_CMP_CMPCTL1_EDG1                            *((volatile unsigned int*)(0x42940228UL))
#define bM4_CMP_CMPCTL1_FLTR0                           *((volatile unsigned int*)(0x4294022CUL))
#define bM4_CMP_CMPCTL1_FLTR1                           *((volatile unsigned int*)(0x42940230UL))
#define bM4_CMP_CMPCTL1_IOEN                            *((volatile unsigned int*)(0x42940234UL))
#define bM4_CMP_CMPCTL1_OEN                             *((volatile unsigned int*)(0x42940238UL))
#define bM4_CMP_CMPCTL1_CMPON                           *((volatile unsigned int*)(0x4294023CUL))
#define bM4_CMP_CMPVLTSEL1_RVSEL0                       *((volatile unsigned int*)(0x42940240UL))
#define bM4_CMP_CMPVLTSEL1_RVSEL1                       *((volatile unsigned int*)(0x42940244UL))
#define bM4_CMP_CMPVLTSEL1_RVSEL2                       *((volatile unsigned int*)(0x42940248UL))
#define bM4_CMP_CMPVLTSEL1_RVSEL3                       *((volatile unsigned int*)(0x4294024CUL))
#define bM4_CMP_CMPVLTSEL1_CVSEL0                       *((volatile unsigned int*)(0x42940260UL))
