RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_CMP_CMPVLTSEL1_CVSEL1                       *((volatile unsigned int*)(0x42940264UL))
#define bM4_CMP_CMPVLTSEL1_CVSEL2                       *((volatile unsigned int*)(0x42940268UL))
#define bM4_CMP_CMPVLTSEL1_CVSEL3                       *((volatile unsigned int*)(0x4294026CUL))
#define bM4_CMP_CMPMON1_OMON                            *((volatile unsigned int*)(0x42940280UL))
#define bM4_CMP_CMPCTL2_OREV                            *((volatile unsigned int*)(0x4294041CUL))
#define bM4_CMP_CMPCTL2_IEN                             *((volatile unsigned int*)(0x42940420UL))
#define bM4_CMP_CMPCTL2_EDG0                            *((volatile unsigned int*)(0x42940424UL))
#define bM4_CMP_CMPCTL2_EDG1                            *((volatile unsigned int*)(0x42940428UL))
#define bM4_CMP_CMPCTL2_FLTR0                           *((volatile unsigned int*)(0x4294042CUL))
#define bM4_CMP_CMPCTL2_FLTR1                           *((volatile unsigned int*)(0x42940430UL))
#define bM4_CMP_CMPCTL2_IOEN                            *((volatile unsigned int*)(0x42940434UL))
#define bM4_CMP_CMPCTL2_OEN                             *((volatile unsigned int*)(0x42940438UL))
#define bM4_CMP_CMPCTL2_CMPON                           *((volatile unsigned int*)(0x4294043CUL))
#define bM4_CMP_CMPVLTSEL2_RVSEL0                       *((volatile unsigned int*)(0x42940440UL))
#define bM4_CMP_CMPVLTSEL2_RVSEL1                       *((volatile unsigned int*)(0x42940444UL))
#define bM4_CMP_CMPVLTSEL2_RVSEL2                       *((volatile unsigned int*)(0x42940448UL))
#define bM4_CMP_CMPVLTSEL2_RVSEL3                       *((volatile unsigned int*)(0x4294044CUL))
#define bM4_CMP_CMPVLTSEL2_CVSEL0                       *((volatile unsigned int*)(0x42940460UL))
#define bM4_CMP_CMPVLTSEL2_CVSEL1                       *((volatile unsigned int*)(0x42940464UL))
#define bM4_CMP_CMPVLTSEL2_CVSEL2                       *((volatile unsigned int*)(0x42940468UL))
#define bM4_CMP_CMPVLTSEL2_CVSEL3                       *((volatile unsigned int*)(0x4294046CUL))
#define bM4_CMP_CMPMON2_OMON                            *((volatile unsigned int*)(0x42940480UL))
#define bM4_CMP_CMPCTL3_OREV                            *((volatile unsigned int*)(0x4294061CUL))
#define bM4_CMP_CMPCTL3_IEN                             *((volatile unsigned int*)(0x42940620UL))
#define bM4_CMP_CMPCTL3_EDG0                            *((volatile unsigned int*)(0x42940624UL))
#define bM4_CMP_CMPCTL3_EDG1                            *((volatile unsigned int*)(0x42940628UL))
#define bM4_CMP_CMPCTL3_FLTR0                           *((volatile unsigned int*)(0x4294062CUL))
#define bM4_CMP_CMPCTL3_FLTR1                           *((volatile unsigned int*)(0x42940630UL))
#define bM4_CMP_CMPCTL3_IOEN                            *((volatile unsigned int*)(0x42940634UL))
#define bM4_CMP_CMPCTL3_OEN                             *((volatile unsigned int*)(0x42940638UL))
#define bM4_CMP_CMPCTL3_CMPON                           *((volatile unsigned int*)(0x4294063CUL))
#define bM4_CMP_CMPVLTSEL3_RVSEL0                       *((volatile unsigned int*)(0x42940640UL))
#define bM4_CMP_CMPVLTSEL3_RVSEL1                       *((volatile unsigned int*)(0x42940644UL))
#define bM4_CMP_CMPVLTSEL3_RVSEL2                       *((volatile unsigned int*)(0x42940648UL))
#define bM4_CMP_CMPVLTSEL3_RVSEL3                       *((volatile unsigned int*)(0x4294064CUL))
#define bM4_CMP_CMPVLTSEL3_CVSEL0                       *((volatile unsigned int*)(0x42940660UL))
#define bM4_CMP_CMPVLTSEL3_CVSEL1                       *((volatile unsigned int*)(0x42940664UL))
#define bM4_CMP_CMPVLTSEL3_CVSEL2                       *((volatile unsigned int*)(0x42940668UL))
#define bM4_CMP_CMPVLTSEL3_CVSEL3                       *((volatile unsigned int*)(0x4294066CUL))
#define bM4_CMP_CMPMON3_OMON                            *((volatile unsigned int*)(0x42940680UL))
#define bM4_CRC_CR_CRC_SEL                              *((volatile unsigned int*)(0x42110004UL))
#define bM4_CRC_CR_REFIN                                *((volatile unsigned int*)(0x42110008UL))
#define bM4_CRC_CR_REFOUT                               *((volatile unsigned int*)(0x4211000CUL))
#define bM4_CRC_CR_XOROUT                               *((volatile unsigned int*)(0x42110010UL))
#define bM4_CRC_FLG_CRC_FLAG                            *((volatile unsigned int*)(0x42110180UL))
#define bM4_DAC_DADR0_DR0                               *((volatile unsigned int*)(0x42820000UL))
#define bM4_DAC_DADR0_DR1                               *((volatile unsigned int*)(0x42820004UL))
#define bM4_DAC_DADR0_DR2                               *((volatile unsigned int*)(0x42820008UL))
#define bM4_DAC_DADR0_DR3                               *((volatile unsigned int*)(0x4282000CUL))
#define bM4_DAC_DADR0_DL0R4                             *((volatile unsigned int*)(0x42820010UL))
#define bM4_DAC_DADR0_DL1R5                             *((volatile unsigned int*)(0x42820014UL))
#define bM4_DAC_DADR0_DL2R6                             *((volatile unsigned int*)(0x42820018UL))
#define bM4_DAC_DADR0_DL3R7                             *((volatile unsigned int*)(0x4282001CUL))
#define bM4_DAC_DADR0_DL4R8                             *((volatile unsigned int*)(0x42820020UL))
#define bM4_DAC_DADR0_DL5R9                             *((volatile unsigned int*)(0x42820024UL))
#define bM4_DAC_DADR0_DL6R10                            *((volatile unsigned int*)(0x42820028UL))
#define bM4_DAC_DADR0_DL7R11                            *((volatile unsigned int*)(0x4282002CUL))
#define bM4_DAC_DADR0_DL8                               *((volatile unsigned int*)(0x42820030UL))
#define bM4_DAC_DADR0_DL9                               *((volatile unsigned int*)(0x42820034UL))
#define bM4_DAC_DADR0_DL10                              *((volatile unsigned int*)(0x42820038UL))
#define bM4_DAC_DADR0_DL11                              *((volatile unsigned int*)(0x4282003CUL))
#define bM4_DAC_DADR1_DR0                               *((volatile unsigned int*)(0x42820040UL))
#define bM4_DAC_DADR1_DR1                               *((volatile unsigned int*)(0x42820044UL))
#define bM4_DAC_DADR1_DR2                               *((volatile unsigned int*)(0x42820048UL))
#define bM4_DAC_DADR1_DR3                               *((volatile unsigned int*)(0x4282004CUL))
#define bM4_DAC_DADR1_DL0R4                             *((volatile unsigned int*)(0x42820050UL))
#define bM4_DAC_DADR1_DL1R5                             *((volatile unsigned int*)(0x42820054UL))
#define bM4_DAC_DADR1_DL2R6                             *((volatile unsigned int*)(0x42820058UL))
#define bM4_DAC_DADR1_DL3R7                             *((volatile unsigned int*)(0x4282005CUL))
#define bM4_DAC_DADR1_DL4R8                             *((volatile unsigned int*)(0x42820060UL))
#define bM4_DAC_DADR1_DL5R9                             *((volatile unsigned int*)(0x42820064UL))
#define bM4_DAC_DADR1_DL6R10                            *((volatile unsigned int*)(0x42820068UL))
#define bM4_DAC_DADR1_DL7R11                            *((volatile unsigned int*)(0x4282006CUL))
#define bM4_DAC_DADR1_DL8                               *((volatile unsigned int*)(0x42820070UL))
#define bM4_DAC_DADR1_DL9                               *((volatile unsigned int*)(0x42820074UL))
#define bM4_DAC_DADR1_DL10                              *((volatile unsigned int*)(0x42820078UL))
#define bM4_DAC_DADR1_DL11                              *((volatile unsigned int*)(0x4282007CUL))
#define bM4_DAC_DACR_DAE                                *((volatile unsigned int*)(0x42820080UL))
#define bM4_DAC_DACR_DA0E                               *((volatile unsigned int*)(0x42820084UL))
#define bM4_DAC_DACR_DA1E                               *((volatile unsigned int*)(0x42820088UL))
#define bM4_DAC_DACR_DPSEL                              *((volatile unsigned int*)(0x428200A4UL))
#define bM4_DAC_DACR_DAAMP0                             *((volatile unsigned int*)(0x428200A8UL))
#define bM4_DAC_DACR_DAAMP1                             *((volatile unsigned int*)(0x428200ACUL))
#define bM4_DAC_DAADPCR_ADPSL0                          *((volatile unsigned int*)(0x428200C0UL))
#define bM4_DAC_DAADPCR_ADPSL1                          *((volatile unsigned int*)(0x428200C4UL))
#define bM4_DAC_DAADPCR_ADPSL2                          *((volatile unsigned int*)(0x428200C8UL))
#define bM4_DAC_DAADPCR_ADPSL3                          *((volatile unsigned int*)(0x428200CCUL))
#define bM4_DAC_DAADPCR_DA0SF                           *((volatile unsigned int*)(0x428200E0UL))
#define bM4_DAC_DAADPCR_DA1SF                           *((volatile unsigned int*)(0x428200E4UL))
#define bM4_DAC_DAADPCR_ADPEN                           *((volatile unsigned int*)(0x428200FCUL))
#define bM4_DAC_DADIVCR_DADIV0                          *((volatile unsigned int*)(0x42820178UL))
#define bM4_DAC_DADIVCR_DADIV1                          *((volatile unsigned int*)(0x4282017CUL))
#define bM4_DAC_DIVPR11AB_DIVPR11B0                     *((volatile unsigned int*)(0x42820180UL))
#define bM4_DAC_DIVPR11AB_DIVPR11B1                     *((volatile unsigned int*)(0x42820184UL))
#define bM4_DAC_DIVPR11AB_DIVPR11B2                     *((volatile unsigned int*)(0x42820188UL))
#define bM4_DAC_DIVPR11AB_DIVPR11B3                     *((volatile unsigned int*)(0x4282018CUL))
#define bM4_DAC_DIVPR11AB_DIVPR11B4                     *((volatile unsigned int*)(0x42820190UL))
#define bM4_DAC_DIVPR11AB_DIVPR11A0                     *((volatile unsigned int*)(0x428201A0UL))
#define bM4_DAC_DIVPR11AB_DIVPR11A1                     *((volatile unsigned int*)(0x428201A4UL))
#define bM4_DAC_DIVPR11AB_DIVPR11A2                     *((volatile unsigned int*)(0x428201A8UL))
#define bM4_DAC_DIVPR11AB_DIVPR11A3                     *((volatile unsigned int*)(0x428201ACUL))
#define bM4_DAC_DIVPR11AB_DIVPR11A4                     *((volatile unsigned int*)(0x428201B0UL))
#define bM4_DAC_DIVPR11C_DIVPR11C0                      *((volatile unsigned int*)(0x428201E0UL))
#define bM4_DAC_DIVPR11C_DIVPR11C1                      *((volatile unsigned int*)(0x428201E4UL))
#define bM4_DAC_DIVPR11C_DIVPR11C2                      *((volatile unsigned int*)(0x428201E8UL))
#define bM4_DAC_DIVPR11C_DIVPR11C3                      *((volatile unsigned int*)(0x428201ECUL))
#define bM4_DAC_DIVPR11C_DIVPR11C4                      *((volatile unsigned int*)(0x428201F0UL))
#define bM4_DAC_DIVPR10AB_DIVPR10B0                     *((volatile unsigned int*)(0x42820200UL))
#define bM4_DAC_DIVPR10AB_DIVPR10B1                     *((volatile unsigned int*)(0x42820204UL))
#define bM4_DAC_DIVPR10AB_DIVPR10B2                     *((volatile unsigned int*)(0x42820208UL))
#define bM4_DAC_DIVPR10AB_DIVPR10B3                     *((volatile unsigned int*)(0x4282020CUL))
#define bM4_DAC_DIVPR10AB_DIVPR10B4                     *((volatile unsigned int*)(0x42820210UL))
#define bM4_DAC_DIVPR10AB_DIVPR10A0                     *((volatile unsigned int*)(0x42820220UL))
#define bM4_DAC_DIVPR10AB_DIVPR10A1                     *((volatile unsigned int*)(0x42820224UL))
#define bM4_DAC_DIVPR10AB_DIVPR10A2                     *((volatile unsigned int*)(0x42820228UL))
#define bM4_DAC_DIVPR10AB_DIVPR10A3                     *((volatile unsigned int*)(0x4282022CUL))
#define bM4_DAC_DIVPR10AB_DIVPR10A4                     *((volatile unsigned int*)(0x42820230UL))
#define bM4_DAC_DIVPR98_DIVPR80                         *((volatile unsigned int*)(0x42820240UL))
#define bM4_DAC_DIVPR98_DIVPR81                         *((volatile unsigned int*)(0x42820244UL))
#define bM4_DAC_DIVPR98_DIVPR82                         *((volatile unsigned int*)(0x42820248UL))
#define bM4_DAC_DIVPR98_DIVPR83                         *((volatile unsigned int*)(0x4282024CUL))
#define bM4_DAC_DIVPR98_DIVPR84                         *((volatile unsigned int*)(0x42820250UL))
#define bM4_DAC_DIVPR98_DIVPR90                         *((volatile unsigned int*)(0x42820260UL))
#define bM4_DAC_DIVPR98_DIVPR91                         *((volatile unsigned int*)(0x42820264UL))
#define bM4_DAC_DIVPR98_DIVPR92                         *((volatile unsigned int*)(0x42820268UL))
#define bM4_DAC_DIVPR98_DIVPR93                         *((volatile unsigned int*)(0x4282026CUL))
#define bM4_DAC_DIVPR98_DIVPR94                         *((volatile unsigned int*)(0x42820270UL))
#define bM4_DAC_DIVPR76_DIVPR60                         *((volatile unsigned int*)(0x42820280UL))
#define bM4_DAC_DIVPR76_DIVPR61                         *((volatile unsigned int*)(0x42820284UL))
#define bM4_DAC_DIVPR76_DIVPR62                         *((volatile unsigned int*)(0x42820288UL))
#define bM4_DAC_DIVPR76_DIVPR63                         *((volatile unsigned int*)(0x4282028CUL))
#define bM4_DAC_DIVPR76_DIVPR64                         *((volatile unsigned int*)(0x42820290UL))
#define bM4_DAC_DIVPR76_DIVPR70                         *((volatile unsigned int*)(0x428202A0UL))
#define bM4_DAC_DIVPR76_DIVPR71                         *((volatile unsigned int*)(0x428202A4UL))
#define bM4_DAC_DIVPR76_DIVPR72                         *((volatile unsigned int*)(0x428202A8UL))
#define bM4_DAC_DIVPR76_DIVPR73                         *((volatile unsigned int*)(0x428202ACUL))
#define bM4_DAC_DIVPR76_DIVPR74                         *((volatile unsigned int*)(0x428202B0UL))
#define bM4_DAC_DIVPR54_DIVPR40                         *((volatile unsigned int*)(0x428202C0UL))
#define bM4_DAC_DIVPR54_DIVPR41                         *((volatile unsigned int*)(0x428202C4UL))
#define bM4_DAC_DIVPR54_DIVPR42                         *((volatile unsigned int*)(0x428202C8UL))
#define bM4_DAC_DIVPR54_DIVPR43                         *((volatile unsigned int*)(0x428202CCUL))
#define bM4_DAC_DIVPR54_DIVPR44                         *((volatile unsigned int*)(0x428202D0UL))
#define bM4_DAC_DIVPR54_DIVPR50                         *((volatile unsigned int*)(0x428202E0UL))
#define bM4_DAC_DIVPR54_DIVPR51                         *((volatile unsigned int*)(0x428202E4UL))
#define bM4_DAC_DIVPR54_DIVPR52                         *((volatile unsigned int*)(0x428202E8UL))
#define bM4_DAC_DIVPR54_DIVPR53                         *((volatile unsigned int*)(0x428202ECUL))
#define bM4_DAC_DIVPR54_DIVPR54                         *((volatile unsigned int*)(0x428202F0UL))
#define bM4_DAC_DIVPR32_DIVPR20                         *((volatile unsigned int*)(0x42820300UL))
#define bM4_DAC_DIVPR32_DIVPR21                         *((volatile unsigned int*)(0x42820304UL))
#define bM4_DAC_DIVPR32_DIVPR22                         *((volatile unsigned int*)(0x42820308UL))
#define bM4_DAC_DIVPR32_DIVPR23                         *((volatile unsigned int*)(0x4282030CUL))
#define bM4_DAC_DIVPR32_DIVPR24                         *((volatile unsigned int*)(0x42820310UL))
#define bM4_DAC_DIVPR32_DIVPR30                         *((volatile unsigned int*)(0x42820320UL))
#define bM4_DAC_DIVPR32_DIVPR31                         *((volatile unsigned int*)(0x42820324UL))
#define bM4_DAC_DIVPR32_DIVPR32                         *((volatile unsigned int*)(0x42820328UL))
#define bM4_DAC_DIVPR32_DIVPR33                         *((volatile unsigned int*)(0x4282032CUL))
#define bM4_DAC_DIVPR32_DIVPR34                         *((volatile unsigned int*)(0x42820330UL))
#define bM4_DAC_DIVPR10_DIVPR00                         *((volatile unsigned int*)(0x42820340UL))
#define bM4_DAC_DIVPR10_DIVPR01                         *((volatile unsigned int*)(0x42820344UL))
#define bM4_DAC_DIVPR10_DIVPR02                         *((volatile unsigned int*)(0x42820348UL))
#define bM4_DAC_DIVPR10_DIVPR03                         *((volatile unsigned int*)(0x4282034CUL))
#define bM4_DAC_DIVPR10_DIVPR04                         *((volatile unsigned int*)(0x42820350UL))
#define bM4_DAC_DIVPR10_DIVPR10                         *((volatile unsigned int*)(0x42820360UL))
#define bM4_DAC_DIVPR10_DIVPR11                         *((volatile unsigned int*)(0x42820364UL))
#define bM4_DAC_DIVPR10_DIVPR12                         *((volatile unsigned int*)(0x42820368UL))
#define bM4_DAC_DIVPR10_DIVPR13                         *((volatile unsigned int*)(0x4282036CUL))
#define bM4_DAC_DIVPR10_DIVPR14                         *((volatile unsigned int*)(0x42820370UL))
#define bM4_DAC_DAODIS_DAODIS0                          *((volatile unsigned int*)(0x428203B8UL))
#define bM4_DAC_DAODIS_DAODIS1                          *((volatile unsigned int*)(0x428203BCUL))
#define bM4_DCU0_CTL_MODE0                              *((volatile unsigned int*)(0x42A40000UL))
#define bM4_DCU0_CTL_MODE1                              *((volatile unsigned int*)(0x42A40004UL))
#define bM4_DCU0_CTL_MODE2                              *((volatile unsigned int*)(0x42A40008UL))
#define bM4_DCU0_CTL_DATASIZE0                          *((volatile unsigned int*)(0x42A4000CUL))
#define bM4_DCU0_CTL_DATASIZE1                          *((volatile unsigned int*)(0x42A40010UL))
#define bM4_DCU0_CTL_COMP_TRG                           *((volatile unsigned int*)(0x42A40020UL))
#define bM4_DCU0_CTL_INTEN                              *((volatile unsigned int*)(0x42A4007CUL))
#define bM4_DCU0_FLAG_FLAG_OP                           *((volatile unsigned int*)(0x42A40080UL))
#define bM4_DCU0_FLAG_FLAG_LS2                          *((volatile unsigned int*)(0x42A40084UL))
#define bM4_DCU0_FLAG_FLAG_EQ2                          *((volatile unsigned int*)(0x42A40088UL))
#define bM4_DCU0_FLAG_FLAG_GT2                          *((volatile unsigned int*)(0x42A4008CUL))
#define bM4_DCU0_FLAG_FLAG_LS1                          *((volatile unsigned int*)(0x42A40090UL))
#define bM4_DCU0_FLAG_FLAG_EQ1                          *((volatile unsigned int*)(0x42A40094UL))
#define bM4_DCU0_FLAG_FLAG_GT1                          *((volatile unsigned int*)(0x42A40098UL))
#define bM4_DCU0_FLAGCLR_CLR_OP                         *((volatile unsigned int*)(0x42A40280UL))
#define bM4_DCU0_FLAGCLR_CLR_LS2                        *((volatile unsigned int*)(0x42A40284UL))
#define bM4_DCU0_FLAGCLR_CLR_EQ2                        *((volatile unsigned int*)(0x42A40288UL))
#define bM4_DCU0_FLAGCLR_CLR_GT2                        *((volatile unsigned int*)(0x42A4028CUL))
#define bM4_DCU0_FLAGCLR_CLR_LS1                        *((volatile unsigned int*)(0x42A40290UL))
#define bM4_DCU0_FLAGCLR_CLR_EQ1                        *((volatile unsigned int*)(0x42A40294UL))
#define bM4_DCU0_FLAGCLR_CLR_GT1                        *((volatile unsigned int*)(0x42A40298UL))
#define bM4_DCU0_INTSEL_INT_OP                          *((volatile unsigned int*)(0x42A40300UL))
#define bM4_DCU0_INTSEL_INT_LS2                         *((volatile unsigned int*)(0x42A40304UL))
#define bM4_DCU0_INTSEL_INT_EQ2                         *((volatile unsigned int*)(0x42A40308UL))
#define bM4_DCU0_INTSEL_INT_GT2                         *((volatile unsigned int*)(0x42A4030CUL))
#define bM4_DCU0_INTSEL_INT_LS1                         *((volatile unsigned int*)(0x42A40310UL))
#define bM4_DCU0_INTSEL_INT_EQ1                         *((volatile unsigned int*)(0x42A40314UL))
#define bM4_DCU0_INTSEL_INT_GT1                         *((volatile unsigned int*)(0x42A40318UL))
#define bM4_DCU0_INTSEL_INT_WIN0                        *((volatile unsigned int*)(0x42A4031CUL))
#define bM4_DCU0_INTSEL_INT_WIN1                        *((volatile unsigned int*)(0x42A40320UL))
#define bM4_DCU1_CTL_MODE0                              *((volatile unsigned int*)(0x42A48000UL))
#define bM4_DCU1_CTL_MODE1                              *((volatile unsigned int*)(0x42A48004UL))
#define bM4_DCU1_CTL_MODE2                              *((volatile unsigned int*)(0x42A48008UL))
#define bM4_DCU1_CTL_DATASIZE0                          *((volatile unsigned int*)(0x42A4800CUL))
#define bM4_DCU1_CTL_DATASIZE1                          *((volatile unsigned int*)(0x42A48010UL))
#define bM4_DCU1_CTL_COMP_TRG                           *((volatile unsigned int*)(0x42A48020UL))
#define bM4_DCU1_CTL_INTEN                              *((volatile unsigned int*)(0x42A4807CUL))
#define bM4_DCU1_FLAG_FLAG_OP                           *((volatile unsigned int*)(0x42A48080UL))
#define bM4_DCU1_FLAG_FLAG_LS2                          *((volatile unsigned int*)(0x42A48084UL))
#define bM4_DCU1_FLAG_FLAG_EQ2                          *((volatile unsigned int*)(0x42A48088UL))
#define bM4_DCU1_FLAG_FLAG_GT2                          *((volatile unsigned int*)(0x42A4808CUL))
#define bM4_DCU1_FLAG_FLAG_LS1                          *((volatile unsigned int*)(0x42A48090UL))
#define bM4_DCU1_FLAG_FLAG_EQ1                          *((volatile unsigned int*)(0x42A48094UL))
#define bM4_DCU1_FLAG_FLAG_GT1                          *((volatile unsigned int*)(0x42A48098UL))
#define bM4_DCU1_FLAGCLR_CLR_OP                         *((volatile unsigned int*)(0x42A48280UL))
#define bM4_DCU1_FLAGCLR_CLR_LS2                        *((volatile unsigned int*)(0x42A48284UL))
#define bM4_DCU1_FLAGCLR_CLR_EQ2                        *((volatile unsigned int*)(0x42A48288UL))
#define bM4_DCU1_FLAGCLR_CLR_GT2                        *((volatile unsigned int*)(0x42A4828CUL))
#define bM4_DCU1_FLAGCLR_CLR_LS1                        *((volatile unsigned int*)(0x42A48290UL))
#define bM4_DCU1_FLAGCLR_CLR_EQ1                        *((volatile unsigned int*)(0x42A48294UL))
#define bM4_DCU1_FLAGCLR_CLR_GT1                        *((volatile unsigned int*)(0x42A48298UL))
#define bM4_DCU1_INTSEL_INT_OP                          *((volatile unsigned int*)(0x42A48300UL))
#define bM4_DCU1_INTSEL_INT_LS2                         *((volatile unsigned int*)(0x42A48304UL))
#define bM4_DCU1_INTSEL_INT_EQ2                         *((volatile unsigned int*)(0x42A48308UL))
#define bM4_DCU1_INTSEL_INT_GT2                         *((volatile unsigned int*)(0x42A4830CUL))
#define bM4_DCU1_INTSEL_INT_LS1                         *((volatile unsigned int*)(0x42A48310UL))
#define bM4_DCU1_INTSEL_INT_EQ1                         *((volatile unsigned int*)(0x42A48314UL))
#define bM4_DCU1_INTSEL_INT_GT1                         *((volatile unsigned int*)(0x42A48318UL))
#define bM4_DCU1_INTSEL_INT_WIN0                        *((volatile unsigned int*)(0x42A4831CUL))
#define bM4_DCU1_INTSEL_INT_WIN1                        *((volatile unsigned int*)(0x42A48320UL))
#define bM4_DCU2_CTL_MODE0                              *((volatile unsigned int*)(0x42A50000UL))
#define bM4_DCU2_CTL_MODE1                              *((volatile unsigned int*)(0x42A50004UL))
#define bM4_DCU2_CTL_MODE2                              *((volatile unsigned int*)(0x42A50008UL))
#define bM4_DCU2_CTL_DATASIZE0                          *((volatile unsigned int*)(0x42A5000CUL))
#define bM4_DCU2_CTL_DATASIZE1                          *((volatile unsigned int*)(0x42A50010UL))
#define bM4_DCU2_CTL_COMP_TRG                           *((volatile unsigned int*)(0x42A50020UL))
#define bM4_DCU2_CTL_INTEN                              *((volatile unsigned int*)(0x42A5007CUL))
#define bM4_DCU2_FLAG_FLAG_OP                           *((volatile unsigned int*)(0x42A50080UL))
#define bM4_DCU2_FLAG_FLAG_LS2                          *((volatile unsigned int*)(0x42A50084UL))
#define bM4_DCU2_FLAG_FLAG_EQ2                          *((volatile unsigned int*)(0x42A50088UL))
#define bM4_DCU2_FLAG_FLAG_GT2                          *((volatile unsigned int*)(0x42A5008CUL))
#define bM4_DCU2_FLAG_FLAG_LS1                          *((volatile unsigned int*)(0x42A50090UL))
#define bM4_DCU2_FLAG_FLAG_EQ1                          *((volatile unsigned int*)(0x42A50094UL))
#define bM4_DCU2_FLAG_FLAG_GT1                          *((volatile unsigned int*)(0x42A50098UL))
#define bM4_DCU2_FLAGCLR_CLR_OP                         *((volatile unsigned int*)(0x42A50280UL))
