RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_DCU2_FLAGCLR_CLR_LS2                        *((volatile unsigned int*)(0x42A50284UL))
#define bM4_DCU2_FLAGCLR_CLR_EQ2                        *((volatile unsigned int*)(0x42A50288UL))
#define bM4_DCU2_FLAGCLR_CLR_GT2                        *((volatile unsigned int*)(0x42A5028CUL))
#define bM4_DCU2_FLAGCLR_CLR_LS1                        *((volatile unsigned int*)(0x42A50290UL))
#define bM4_DCU2_FLAGCLR_CLR_EQ1                        *((volatile unsigned int*)(0x42A50294UL))
#define bM4_DCU2_FLAGCLR_CLR_GT1                        *((volatile unsigned int*)(0x42A50298UL))
#define bM4_DCU2_INTSEL_INT_OP                          *((volatile unsigned int*)(0x42A50300UL))
#define bM4_DCU2_INTSEL_INT_LS2                         *((volatile unsigned int*)(0x42A50304UL))
#define bM4_DCU2_INTSEL_INT_EQ2                         *((volatile unsigned int*)(0x42A50308UL))
#define bM4_DCU2_INTSEL_INT_GT2                         *((volatile unsigned int*)(0x42A5030CUL))
#define bM4_DCU2_INTSEL_INT_LS1                         *((volatile unsigned int*)(0x42A50310UL))
#define bM4_DCU2_INTSEL_INT_EQ1                         *((volatile unsigned int*)(0x42A50314UL))
#define bM4_DCU2_INTSEL_INT_GT1                         *((volatile unsigned int*)(0x42A50318UL))
#define bM4_DCU2_INTSEL_INT_WIN0                        *((volatile unsigned int*)(0x42A5031CUL))
#define bM4_DCU2_INTSEL_INT_WIN1                        *((volatile unsigned int*)(0x42A50320UL))
#define bM4_DCU3_CTL_MODE0                              *((volatile unsigned int*)(0x42A58000UL))
#define bM4_DCU3_CTL_MODE1                              *((volatile unsigned int*)(0x42A58004UL))
#define bM4_DCU3_CTL_MODE2                              *((volatile unsigned int*)(0x42A58008UL))
#define bM4_DCU3_CTL_DATASIZE0                          *((volatile unsigned int*)(0x42A5800CUL))
#define bM4_DCU3_CTL_DATASIZE1                          *((volatile unsigned int*)(0x42A58010UL))
#define bM4_DCU3_CTL_COMP_TRG                           *((volatile unsigned int*)(0x42A58020UL))
#define bM4_DCU3_CTL_INTEN                              *((volatile unsigned int*)(0x42A5807CUL))
#define bM4_DCU3_FLAG_FLAG_OP                           *((volatile unsigned int*)(0x42A58080UL))
#define bM4_DCU3_FLAG_FLAG_LS2                          *((volatile unsigned int*)(0x42A58084UL))
#define bM4_DCU3_FLAG_FLAG_EQ2                          *((volatile unsigned int*)(0x42A58088UL))
#define bM4_DCU3_FLAG_FLAG_GT2                          *((volatile unsigned int*)(0x42A5808CUL))
#define bM4_DCU3_FLAG_FLAG_LS1                          *((volatile unsigned int*)(0x42A58090UL))
#define bM4_DCU3_FLAG_FLAG_EQ1                          *((volatile unsigned int*)(0x42A58094UL))
#define bM4_DCU3_FLAG_FLAG_GT1                          *((volatile unsigned int*)(0x42A58098UL))
#define bM4_DCU3_FLAGCLR_CLR_OP                         *((volatile unsigned int*)(0x42A58280UL))
#define bM4_DCU3_FLAGCLR_CLR_LS2                        *((volatile unsigned int*)(0x42A58284UL))
#define bM4_DCU3_FLAGCLR_CLR_EQ2                        *((volatile unsigned int*)(0x42A58288UL))
#define bM4_DCU3_FLAGCLR_CLR_GT2                        *((volatile unsigned int*)(0x42A5828CUL))
#define bM4_DCU3_FLAGCLR_CLR_LS1                        *((volatile unsigned int*)(0x42A58290UL))
#define bM4_DCU3_FLAGCLR_CLR_EQ1                        *((volatile unsigned int*)(0x42A58294UL))
#define bM4_DCU3_FLAGCLR_CLR_GT1                        *((volatile unsigned int*)(0x42A58298UL))
#define bM4_DCU3_INTSEL_INT_OP                          *((volatile unsigned int*)(0x42A58300UL))
#define bM4_DCU3_INTSEL_INT_LS2                         *((volatile unsigned int*)(0x42A58304UL))
#define bM4_DCU3_INTSEL_INT_EQ2                         *((volatile unsigned int*)(0x42A58308UL))
#define bM4_DCU3_INTSEL_INT_GT2                         *((volatile unsigned int*)(0x42A5830CUL))
#define bM4_DCU3_INTSEL_INT_LS1                         *((volatile unsigned int*)(0x42A58310UL))
#define bM4_DCU3_INTSEL_INT_EQ1                         *((volatile unsigned int*)(0x42A58314UL))
#define bM4_DCU3_INTSEL_INT_GT1                         *((volatile unsigned int*)(0x42A58318UL))
#define bM4_DCU3_INTSEL_INT_WIN0                        *((volatile unsigned int*)(0x42A5831CUL))
#define bM4_DCU3_INTSEL_INT_WIN1                        *((volatile unsigned int*)(0x42A58320UL))
#define bM4_DMAC_EN_EN                                  *((volatile unsigned int*)(0x42A60000UL))
#define bM4_DMAC_INTSTAT0_TRNERR0                       *((volatile unsigned int*)(0x42A60080UL))
#define bM4_DMAC_INTSTAT0_TRNERR1                       *((volatile unsigned int*)(0x42A60084UL))
#define bM4_DMAC_INTSTAT0_TRNERR2                       *((volatile unsigned int*)(0x42A60088UL))
#define bM4_DMAC_INTSTAT0_TRNERR3                       *((volatile unsigned int*)(0x42A6008CUL))
#define bM4_DMAC_INTSTAT0_TRNERR4                       *((volatile unsigned int*)(0x42A60090UL))
#define bM4_DMAC_INTSTAT0_TRNERR5                       *((volatile unsigned int*)(0x42A60094UL))
#define bM4_DMAC_INTSTAT0_TRNERR6                       *((volatile unsigned int*)(0x42A60098UL))
#define bM4_DMAC_INTSTAT0_TRNERR7                       *((volatile unsigned int*)(0x42A6009CUL))
#define bM4_DMAC_INTSTAT0_REQERR0                       *((volatile unsigned int*)(0x42A600C0UL))
#define bM4_DMAC_INTSTAT0_REQERR1                       *((volatile unsigned int*)(0x42A600C4UL))
#define bM4_DMAC_INTSTAT0_REQERR2                       *((volatile unsigned int*)(0x42A600C8UL))
#define bM4_DMAC_INTSTAT0_REQERR3                       *((volatile unsigned int*)(0x42A600CCUL))
#define bM4_DMAC_INTSTAT0_REQERR4                       *((volatile unsigned int*)(0x42A600D0UL))
#define bM4_DMAC_INTSTAT0_REQERR5                       *((volatile unsigned int*)(0x42A600D4UL))
#define bM4_DMAC_INTSTAT0_REQERR6                       *((volatile unsigned int*)(0x42A600D8UL))
#define bM4_DMAC_INTSTAT0_REQERR7                       *((volatile unsigned int*)(0x42A600DCUL))
#define bM4_DMAC_INTSTAT0_RESV0                         *((volatile unsigned int*)(0x42A600E0UL))
#define bM4_DMAC_INTSTAT1_TC0                           *((volatile unsigned int*)(0x42A60100UL))
#define bM4_DMAC_INTSTAT1_TC1                           *((volatile unsigned int*)(0x42A60104UL))
#define bM4_DMAC_INTSTAT1_TC2                           *((volatile unsigned int*)(0x42A60108UL))
#define bM4_DMAC_INTSTAT1_TC3                           *((volatile unsigned int*)(0x42A6010CUL))
#define bM4_DMAC_INTSTAT1_TC4                           *((volatile unsigned int*)(0x42A60110UL))
#define bM4_DMAC_INTSTAT1_TC5                           *((volatile unsigned int*)(0x42A60114UL))
#define bM4_DMAC_INTSTAT1_TC6                           *((volatile unsigned int*)(0x42A60118UL))
#define bM4_DMAC_INTSTAT1_TC7                           *((volatile unsigned int*)(0x42A6011CUL))
#define bM4_DMAC_INTSTAT1_BTC0                          *((volatile unsigned int*)(0x42A60140UL))
#define bM4_DMAC_INTSTAT1_BTC1                          *((volatile unsigned int*)(0x42A60144UL))
#define bM4_DMAC_INTSTAT1_BTC2                          *((volatile unsigned int*)(0x42A60148UL))
#define bM4_DMAC_INTSTAT1_BTC3                          *((volatile unsigned int*)(0x42A6014CUL))
#define bM4_DMAC_INTSTAT1_BTC4                          *((volatile unsigned int*)(0x42A60150UL))
#define bM4_DMAC_INTSTAT1_BTC5                          *((volatile unsigned int*)(0x42A60154UL))
#define bM4_DMAC_INTSTAT1_BTC6                          *((volatile unsigned int*)(0x42A60158UL))
#define bM4_DMAC_INTSTAT1_BTC7                          *((volatile unsigned int*)(0x42A6015CUL))
#define bM4_DMAC_INTSTAT1_RESV1                         *((volatile unsigned int*)(0x42A60160UL))
#define bM4_DMAC_INTMASK0_MSKTRNERR0                    *((volatile unsigned int*)(0x42A60180UL))
#define bM4_DMAC_INTMASK0_MSKTRNERR1                    *((volatile unsigned int*)(0x42A60184UL))
#define bM4_DMAC_INTMASK0_MSKTRNERR2                    *((volatile unsigned int*)(0x42A60188UL))
#define bM4_DMAC_INTMASK0_MSKTRNERR3                    *((volatile unsigned int*)(0x42A6018CUL))
#define bM4_DMAC_INTMASK0_MSKTRNERR4                    *((volatile unsigned int*)(0x42A60190UL))
#define bM4_DMAC_INTMASK0_MSKTRNERR5                    *((volatile unsigned int*)(0x42A60194UL))
#define bM4_DMAC_INTMASK0_MSKTRNERR6                    *((volatile unsigned int*)(0x42A60198UL))
#define bM4_DMAC_INTMASK0_MSKTRNERR7                    *((volatile unsigned int*)(0x42A6019CUL))
#define bM4_DMAC_INTMASK0_MSKREQERR0                    *((volatile unsigned int*)(0x42A601C0UL))
#define bM4_DMAC_INTMASK0_MSKREQERR1                    *((volatile unsigned int*)(0x42A601C4UL))
#define bM4_DMAC_INTMASK0_MSKREQERR2                    *((volatile unsigned int*)(0x42A601C8UL))
#define bM4_DMAC_INTMASK0_MSKREQERR3                    *((volatile unsigned int*)(0x42A601CCUL))
#define bM4_DMAC_INTMASK0_MSKREQERR4                    *((volatile unsigned int*)(0x42A601D0UL))
#define bM4_DMAC_INTMASK0_MSKREQERR5                    *((volatile unsigned int*)(0x42A601D4UL))
#define bM4_DMAC_INTMASK0_MSKREQERR6                    *((volatile unsigned int*)(0x42A601D8UL))
#define bM4_DMAC_INTMASK0_MSKREQERR7                    *((volatile unsigned int*)(0x42A601DCUL))
#define bM4_DMAC_INTMASK0_RESV2                         *((volatile unsigned int*)(0x42A601E0UL))
#define bM4_DMAC_INTMASK1_MSKTC0                        *((volatile unsigned int*)(0x42A60200UL))
#define bM4_DMAC_INTMASK1_MSKTC1                        *((volatile unsigned int*)(0x42A60204UL))
#define bM4_DMAC_INTMASK1_MSKTC2                        *((volatile unsigned int*)(0x42A60208UL))
#define bM4_DMAC_INTMASK1_MSKTC3                        *((volatile unsigned int*)(0x42A6020CUL))
#define bM4_DMAC_INTMASK1_MSKTC4                        *((volatile unsigned int*)(0x42A60210UL))
#define bM4_DMAC_INTMASK1_MSKTC5                        *((volatile unsigned int*)(0x42A60214UL))
#define bM4_DMAC_INTMASK1_MSKTC6                        *((volatile unsigned int*)(0x42A60218UL))
#define bM4_DMAC_INTMASK1_MSKTC7                        *((volatile unsigned int*)(0x42A6021CUL))
#define bM4_DMAC_INTMASK1_MSKBTC0                       *((volatile unsigned int*)(0x42A60240UL))
#define bM4_DMAC_INTMASK1_MSKBTC1                       *((volatile unsigned int*)(0x42A60244UL))
#define bM4_DMAC_INTMASK1_MSKBTC2                       *((volatile unsigned int*)(0x42A60248UL))
#define bM4_DMAC_INTMASK1_MSKBTC3                       *((volatile unsigned int*)(0x42A6024CUL))
#define bM4_DMAC_INTMASK1_MSKBTC4                       *((volatile unsigned int*)(0x42A60250UL))
#define bM4_DMAC_INTMASK1_MSKBTC5                       *((volatile unsigned int*)(0x42A60254UL))
#define bM4_DMAC_INTMASK1_MSKBTC6                       *((volatile unsigned int*)(0x42A60258UL))
#define bM4_DMAC_INTMASK1_MSKBTC7                       *((volatile unsigned int*)(0x42A6025CUL))
#define bM4_DMAC_INTMASK1_RESV3                         *((volatile unsigned int*)(0x42A60260UL))
#define bM4_DMAC_INTCLR0_CLRTRNERR0                     *((volatile unsigned int*)(0x42A60280UL))
#define bM4_DMAC_INTCLR0_CLRTRNERR1                     *((volatile unsigned int*)(0x42A60284UL))
#define bM4_DMAC_INTCLR0_CLRTRNERR2                     *((volatile unsigned int*)(0x42A60288UL))
#define bM4_DMAC_INTCLR0_CLRTRNERR3                     *((volatile unsigned int*)(0x42A6028CUL))
#define bM4_DMAC_INTCLR0_CLRTRNERR4                     *((volatile unsigned int*)(0x42A60290UL))
#define bM4_DMAC_INTCLR0_CLRTRNERR5                     *((volatile unsigned int*)(0x42A60294UL))
#define bM4_DMAC_INTCLR0_CLRTRNERR6                     *((volatile unsigned int*)(0x42A60298UL))
#define bM4_DMAC_INTCLR0_CLRTRNERR7                     *((volatile unsigned int*)(0x42A6029CUL))
#define bM4_DMAC_INTCLR0_CLRREQERR0                     *((volatile unsigned int*)(0x42A602C0UL))
#define bM4_DMAC_INTCLR0_CLRREQERR1                     *((volatile unsigned int*)(0x42A602C4UL))
#define bM4_DMAC_INTCLR0_CLRREQERR2                     *((volatile unsigned int*)(0x42A602C8UL))
#define bM4_DMAC_INTCLR0_CLRREQERR3                     *((volatile unsigned int*)(0x42A602CCUL))
#define bM4_DMAC_INTCLR0_CLRREQERR4                     *((volatile unsigned int*)(0x42A602D0UL))
#define bM4_DMAC_INTCLR0_CLRREQERR5                     *((volatile unsigned int*)(0x42A602D4UL))
#define bM4_DMAC_INTCLR0_CLRREQERR6                     *((volatile unsigned int*)(0x42A602D8UL))
#define bM4_DMAC_INTCLR0_CLRREQERR7                     *((volatile unsigned int*)(0x42A602DCUL))
#define bM4_DMAC_INTCLR0_RESV4                          *((volatile unsigned int*)(0x42A602E0UL))
#define bM4_DMAC_INTCLR1_CLRTC0                         *((volatile unsigned int*)(0x42A60300UL))
#define bM4_DMAC_INTCLR1_CLRTC1                         *((volatile unsigned int*)(0x42A60304UL))
#define bM4_DMAC_INTCLR1_CLRTC2                         *((volatile unsigned int*)(0x42A60308UL))
#define bM4_DMAC_INTCLR1_CLRTC3                         *((volatile unsigned int*)(0x42A6030CUL))
#define bM4_DMAC_INTCLR1_CLRTC4                         *((volatile unsigned int*)(0x42A60310UL))
#define bM4_DMAC_INTCLR1_CLRTC5                         *((volatile unsigned int*)(0x42A60314UL))
#define bM4_DMAC_INTCLR1_CLRTC6                         *((volatile unsigned int*)(0x42A60318UL))
#define bM4_DMAC_INTCLR1_CLRTC7                         *((volatile unsigned int*)(0x42A6031CUL))
#define bM4_DMAC_INTCLR1_CLRBTC0                        *((volatile unsigned int*)(0x42A60340UL))
#define bM4_DMAC_INTCLR1_CLRBTC1                        *((volatile unsigned int*)(0x42A60344UL))
#define bM4_DMAC_INTCLR1_CLRBTC2                        *((volatile unsigned int*)(0x42A60348UL))
#define bM4_DMAC_INTCLR1_CLRBTC3                        *((volatile unsigned int*)(0x42A6034CUL))
#define bM4_DMAC_INTCLR1_CLRBTC4                        *((volatile unsigned int*)(0x42A60350UL))
#define bM4_DMAC_INTCLR1_CLRBTC5                        *((volatile unsigned int*)(0x42A60354UL))
#define bM4_DMAC_INTCLR1_CLRBTC6                        *((volatile unsigned int*)(0x42A60358UL))
#define bM4_DMAC_INTCLR1_CLRBTC7                        *((volatile unsigned int*)(0x42A6035CUL))
#define bM4_DMAC_INTCLR1_RESV5                          *((volatile unsigned int*)(0x42A60360UL))
#define bM4_DMAC_DTCTL0_BLKSIZE0                        *((volatile unsigned int*)(0x42A60900UL))
#define bM4_DMAC_DTCTL0_BLKSIZE1                        *((volatile unsigned int*)(0x42A60904UL))
#define bM4_DMAC_DTCTL0_BLKSIZE2                        *((volatile unsigned int*)(0x42A60908UL))
#define bM4_DMAC_DTCTL0_BLKSIZE3                        *((volatile unsigned int*)(0x42A6090CUL))
#define bM4_DMAC_DTCTL0_BLKSIZE4                        *((volatile unsigned int*)(0x42A60910UL))
#define bM4_DMAC_DTCTL0_BLKSIZE5                        *((volatile unsigned int*)(0x42A60914UL))
#define bM4_DMAC_DTCTL0_BLKSIZE6                        *((volatile unsigned int*)(0x42A60918UL))
#define bM4_DMAC_DTCTL0_BLKSIZE7                        *((volatile unsigned int*)(0x42A6091CUL))
#define bM4_DMAC_DTCTL0_BLKSIZE8                        *((volatile unsigned int*)(0x42A60920UL))
#define bM4_DMAC_DTCTL0_BLKSIZE9                        *((volatile unsigned int*)(0x42A60924UL))
#define bM4_DMAC_DTCTL0_CNT0                            *((volatile unsigned int*)(0x42A60940UL))
#define bM4_DMAC_DTCTL0_CNT1                            *((volatile unsigned int*)(0x42A60944UL))
#define bM4_DMAC_DTCTL0_CNT2                            *((volatile unsigned int*)(0x42A60948UL))
#define bM4_DMAC_DTCTL0_CNT3                            *((volatile unsigned int*)(0x42A6094CUL))
#define bM4_DMAC_DTCTL0_CNT4                            *((volatile unsigned int*)(0x42A60950UL))
#define bM4_DMAC_DTCTL0_CNT5                            *((volatile unsigned int*)(0x42A60954UL))
#define bM4_DMAC_DTCTL0_CNT6                            *((volatile unsigned int*)(0x42A60958UL))
#define bM4_DMAC_DTCTL0_CNT7                            *((volatile unsigned int*)(0x42A6095CUL))
#define bM4_DMAC_DTCTL0_CNT8                            *((volatile unsigned int*)(0x42A60960UL))
#define bM4_DMAC_DTCTL0_CNT9                            *((volatile unsigned int*)(0x42A60964UL))
#define bM4_DMAC_DTCTL0_CNT10                           *((volatile unsigned int*)(0x42A60968UL))
#define bM4_DMAC_DTCTL0_CNT11                           *((volatile unsigned int*)(0x42A6096CUL))
#define bM4_DMAC_DTCTL0_CNT12                           *((volatile unsigned int*)(0x42A60970UL))
#define bM4_DMAC_DTCTL0_CNT13                           *((volatile unsigned int*)(0x42A60974UL))
#define bM4_DMAC_DTCTL0_CNT14                           *((volatile unsigned int*)(0x42A60978UL))
#define bM4_DMAC_DTCTL0_CNT15                           *((volatile unsigned int*)(0x42A6097CUL))
#define bM4_DMAC_RPT0_SRPT0                             *((volatile unsigned int*)(0x42A60980UL))
#define bM4_DMAC_RPT0_SRPT1                             *((volatile unsigned int*)(0x42A60984UL))
#define bM4_DMAC_RPT0_SRPT2                             *((volatile unsigned int*)(0x42A60988UL))
#define bM4_DMAC_RPT0_SRPT3                             *((volatile unsigned int*)(0x42A6098CUL))
#define bM4_DMAC_RPT0_SRPT4                             *((volatile unsigned int*)(0x42A60990UL))
#define bM4_DMAC_RPT0_SRPT5                             *((volatile unsigned int*)(0x42A60994UL))
#define bM4_DMAC_RPT0_SRPT6                             *((volatile unsigned int*)(0x42A60998UL))
#define bM4_DMAC_RPT0_SRPT7                             *((volatile unsigned int*)(0x42A6099CUL))
#define bM4_DMAC_RPT0_SRPT8                             *((volatile unsigned int*)(0x42A609A0UL))
#define bM4_DMAC_RPT0_SRPT9                             *((volatile unsigned int*)(0x42A609A4UL))
#define bM4_DMAC_RPT0_DRPT0                             *((volatile unsigned int*)(0x42A609C0UL))
#define bM4_DMAC_RPT0_DRPT1                             *((volatile unsigned int*)(0x42A609C4UL))
#define bM4_DMAC_RPT0_DRPT2                             *((volatile unsigned int*)(0x42A609C8UL))
#define bM4_DMAC_RPT0_DRPT3                             *((volatile unsigned int*)(0x42A609CCUL))
#define bM4_DMAC_RPT0_DRPT4                             *((volatile unsigned int*)(0x42A609D0UL))
#define bM4_DMAC_RPT0_DRPT5                             *((volatile unsigned int*)(0x42A609D4UL))
#define bM4_DMAC_RPT0_DRPT6                             *((volatile unsigned int*)(0x42A609D8UL))
#define bM4_DMAC_RPT0_DRPT7                             *((volatile unsigned int*)(0x42A609DCUL))
#define bM4_DMAC_RPT0_DRPT8                             *((volatile unsigned int*)(0x42A609E0UL))
#define bM4_DMAC_RPT0_DRPT9                             *((volatile unsigned int*)(0x42A609E4UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET0                     *((volatile unsigned int*)(0x42A60A00UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET1                     *((volatile unsigned int*)(0x42A60A04UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET2                     *((volatile unsigned int*)(0x42A60A08UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET3                     *((volatile unsigned int*)(0x42A60A0CUL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET4                     *((volatile unsigned int*)(0x42A60A10UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET5                     *((volatile unsigned int*)(0x42A60A14UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET6                     *((volatile unsigned int*)(0x42A60A18UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET7                     *((volatile unsigned int*)(0x42A60A1CUL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET8                     *((volatile unsigned int*)(0x42A60A20UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET9                     *((volatile unsigned int*)(0x42A60A24UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET10                    *((volatile unsigned int*)(0x42A60A28UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET11                    *((volatile unsigned int*)(0x42A60A2CUL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET12                    *((volatile unsigned int*)(0x42A60A30UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET13                    *((volatile unsigned int*)(0x42A60A34UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET14                    *((volatile unsigned int*)(0x42A60A38UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET15                    *((volatile unsigned int*)(0x42A60A3CUL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET16                    *((volatile unsigned int*)(0x42A60A40UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET17                    *((volatile unsigned int*)(0x42A60A44UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET18                    *((volatile unsigned int*)(0x42A60A48UL))
#define bM4_DMAC_SNSEQCTL0_SOFFSET19                    *((volatile unsigned int*)(0x42A60A4CUL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT0                      *((volatile unsigned int*)(0x42A60A50UL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT1                      *((volatile unsigned int*)(0x42A60A54UL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT2                      *((volatile unsigned int*)(0x42A60A58UL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT3                      *((volatile unsigned int*)(0x42A60A5CUL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT4                      *((volatile unsigned int*)(0x42A60A60UL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT5                      *((volatile unsigned int*)(0x42A60A64UL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT6                      *((volatile unsigned int*)(0x42A60A68UL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT7                      *((volatile unsigned int*)(0x42A60A6CUL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT8                      *((volatile unsigned int*)(0x42A60A70UL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT9                      *((volatile unsigned int*)(0x42A60A74UL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT10                     *((volatile unsigned int*)(0x42A60A78UL))
#define bM4_DMAC_SNSEQCTL0_SNSCNT11                     *((volatile unsigned int*)(0x42A60A7CUL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET0                     *((volatile unsigned int*)(0x42A60A80UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET1                     *((volatile unsigned int*)(0x42A60A84UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET2                     *((volatile unsigned int*)(0x42A60A88UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET3                     *((volatile unsigned int*)(0x42A60A8CUL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET4                     *((volatile unsigned int*)(0x42A60A90UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET5                     *((volatile unsigned int*)(0x42A60A94UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET6                     *((volatile unsigned int*)(0x42A60A98UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET7                     *((volatile unsigned int*)(0x42A60A9CUL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET8                     *((volatile unsigned int*)(0x42A60AA0UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET9                     *((volatile unsigned int*)(0x42A60AA4UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET10                    *((volatile unsigned int*)(0x42A60AA8UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET11                    *((volatile unsigned int*)(0x42A60AACUL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET12                    *((volatile unsigned int*)(0x42A60AB0UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET13                    *((volatile unsigned int*)(0x42A60AB4UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET14                    *((volatile unsigned int*)(0x42A60AB8UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET15                    *((volatile unsigned int*)(0x42A60ABCUL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET16                    *((volatile unsigned int*)(0x42A60AC0UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET17                    *((volatile unsigned int*)(0x42A60AC4UL))
