RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_DMAC_DNSEQCTL0_DOFFSET18                    *((volatile unsigned int*)(0x42A60AC8UL))
#define bM4_DMAC_DNSEQCTL0_DOFFSET19                    *((volatile unsigned int*)(0x42A60ACCUL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT0                      *((volatile unsigned int*)(0x42A60AD0UL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT1                      *((volatile unsigned int*)(0x42A60AD4UL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT2                      *((volatile unsigned int*)(0x42A60AD8UL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT3                      *((volatile unsigned int*)(0x42A60ADCUL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT4                      *((volatile unsigned int*)(0x42A60AE0UL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT5                      *((volatile unsigned int*)(0x42A60AE4UL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT6                      *((volatile unsigned int*)(0x42A60AE8UL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT7                      *((volatile unsigned int*)(0x42A60AECUL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT8                      *((volatile unsigned int*)(0x42A60AF0UL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT9                      *((volatile unsigned int*)(0x42A60AF4UL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT10                     *((volatile unsigned int*)(0x42A60AF8UL))
#define bM4_DMAC_DNSEQCTL0_DNSCNT11                     *((volatile unsigned int*)(0x42A60AFCUL))
#define bM4_DMAC_LLP0_LLP0                              *((volatile unsigned int*)(0x42A60B08UL))
#define bM4_DMAC_LLP0_LLP1                              *((volatile unsigned int*)(0x42A60B0CUL))
#define bM4_DMAC_LLP0_LLP2                              *((volatile unsigned int*)(0x42A60B10UL))
#define bM4_DMAC_LLP0_LLP3                              *((volatile unsigned int*)(0x42A60B14UL))
#define bM4_DMAC_LLP0_LLP4                              *((volatile unsigned int*)(0x42A60B18UL))
#define bM4_DMAC_LLP0_LLP5                              *((volatile unsigned int*)(0x42A60B1CUL))
#define bM4_DMAC_LLP0_LLP6                              *((volatile unsigned int*)(0x42A60B20UL))
#define bM4_DMAC_LLP0_LLP7                              *((volatile unsigned int*)(0x42A60B24UL))
#define bM4_DMAC_LLP0_LLP8                              *((volatile unsigned int*)(0x42A60B28UL))
#define bM4_DMAC_LLP0_LLP9                              *((volatile unsigned int*)(0x42A60B2CUL))
#define bM4_DMAC_LLP0_LLP10                             *((volatile unsigned int*)(0x42A60B30UL))
#define bM4_DMAC_LLP0_LLP11                             *((volatile unsigned int*)(0x42A60B34UL))
#define bM4_DMAC_LLP0_LLP12                             *((volatile unsigned int*)(0x42A60B38UL))
#define bM4_DMAC_LLP0_LLP13                             *((volatile unsigned int*)(0x42A60B3CUL))
#define bM4_DMAC_LLP0_LLP14                             *((volatile unsigned int*)(0x42A60B40UL))
#define bM4_DMAC_LLP0_LLP15                             *((volatile unsigned int*)(0x42A60B44UL))
#define bM4_DMAC_LLP0_LLP16                             *((volatile unsigned int*)(0x42A60B48UL))
#define bM4_DMAC_LLP0_LLP17                             *((volatile unsigned int*)(0x42A60B4CUL))
#define bM4_DMAC_LLP0_LLP18                             *((volatile unsigned int*)(0x42A60B50UL))
#define bM4_DMAC_LLP0_LLP19                             *((volatile unsigned int*)(0x42A60B54UL))
#define bM4_DMAC_LLP0_LLP20                             *((volatile unsigned int*)(0x42A60B58UL))
#define bM4_DMAC_LLP0_LLP21                             *((volatile unsigned int*)(0x42A60B5CUL))
#define bM4_DMAC_LLP0_LLP22                             *((volatile unsigned int*)(0x42A60B60UL))
#define bM4_DMAC_LLP0_LLP23                             *((volatile unsigned int*)(0x42A60B64UL))
#define bM4_DMAC_LLP0_LLP24                             *((volatile unsigned int*)(0x42A60B68UL))
#define bM4_DMAC_LLP0_LLP25                             *((volatile unsigned int*)(0x42A60B6CUL))
#define bM4_DMAC_LLP0_LLP26                             *((volatile unsigned int*)(0x42A60B70UL))
#define bM4_DMAC_LLP0_LLP27                             *((volatile unsigned int*)(0x42A60B74UL))
#define bM4_DMAC_LLP0_LLP28                             *((volatile unsigned int*)(0x42A60B78UL))
#define bM4_DMAC_LLP0_LLP29                             *((volatile unsigned int*)(0x42A60B7CUL))
#define bM4_DMAC_CH0CTL_SINC0                           *((volatile unsigned int*)(0x42A60B80UL))
#define bM4_DMAC_CH0CTL_SINC1                           *((volatile unsigned int*)(0x42A60B84UL))
#define bM4_DMAC_CH0CTL_DINC0                           *((volatile unsigned int*)(0x42A60B88UL))
#define bM4_DMAC_CH0CTL_DINC1                           *((volatile unsigned int*)(0x42A60B8CUL))
#define bM4_DMAC_CH0CTL_SRTPEN                          *((volatile unsigned int*)(0x42A60B90UL))
#define bM4_DMAC_CH0CTL_DRPTEN                          *((volatile unsigned int*)(0x42A60B94UL))
#define bM4_DMAC_CH0CTL_SNSEQEN                         *((volatile unsigned int*)(0x42A60B98UL))
#define bM4_DMAC_CH0CTL_DNSEQEN                         *((volatile unsigned int*)(0x42A60B9CUL))
#define bM4_DMAC_CH0CTL_HSIZE0                          *((volatile unsigned int*)(0x42A60BA0UL))
#define bM4_DMAC_CH0CTL_HSIZE1                          *((volatile unsigned int*)(0x42A60BA4UL))
#define bM4_DMAC_CH0CTL_LLPEN                           *((volatile unsigned int*)(0x42A60BA8UL))
#define bM4_DMAC_CH0CTL_LLPRUN                          *((volatile unsigned int*)(0x42A60BACUL))
#define bM4_DMAC_CH0CTL_IE                              *((volatile unsigned int*)(0x42A60BB0UL))
#define bM4_DMAC_CH0CTL_PROT0                           *((volatile unsigned int*)(0x42A60BB4UL))
#define bM4_DMAC_CH0CTL_PROT1                           *((volatile unsigned int*)(0x42A60BB8UL))
#define bM4_DMAC_CH0CTL_PROT2                           *((volatile unsigned int*)(0x42A60BBCUL))
#define bM4_DMAC_DTCTL1_BLKSIZE0                        *((volatile unsigned int*)(0x42A61100UL))
#define bM4_DMAC_DTCTL1_BLKSIZE1                        *((volatile unsigned int*)(0x42A61104UL))
#define bM4_DMAC_DTCTL1_BLKSIZE2                        *((volatile unsigned int*)(0x42A61108UL))
#define bM4_DMAC_DTCTL1_BLKSIZE3                        *((volatile unsigned int*)(0x42A6110CUL))
#define bM4_DMAC_DTCTL1_BLKSIZE4                        *((volatile unsigned int*)(0x42A61110UL))
#define bM4_DMAC_DTCTL1_BLKSIZE5                        *((volatile unsigned int*)(0x42A61114UL))
#define bM4_DMAC_DTCTL1_BLKSIZE6                        *((volatile unsigned int*)(0x42A61118UL))
#define bM4_DMAC_DTCTL1_BLKSIZE7                        *((volatile unsigned int*)(0x42A6111CUL))
#define bM4_DMAC_DTCTL1_BLKSIZE8                        *((volatile unsigned int*)(0x42A61120UL))
#define bM4_DMAC_DTCTL1_BLKSIZE9                        *((volatile unsigned int*)(0x42A61124UL))
#define bM4_DMAC_DTCTL1_CNT0                            *((volatile unsigned int*)(0x42A61140UL))
#define bM4_DMAC_DTCTL1_CNT1                            *((volatile unsigned int*)(0x42A61144UL))
#define bM4_DMAC_DTCTL1_CNT2                            *((volatile unsigned int*)(0x42A61148UL))
#define bM4_DMAC_DTCTL1_CNT3                            *((volatile unsigned int*)(0x42A6114CUL))
#define bM4_DMAC_DTCTL1_CNT4                            *((volatile unsigned int*)(0x42A61150UL))
#define bM4_DMAC_DTCTL1_CNT5                            *((volatile unsigned int*)(0x42A61154UL))
#define bM4_DMAC_DTCTL1_CNT6                            *((volatile unsigned int*)(0x42A61158UL))
#define bM4_DMAC_DTCTL1_CNT7                            *((volatile unsigned int*)(0x42A6115CUL))
#define bM4_DMAC_DTCTL1_CNT8                            *((volatile unsigned int*)(0x42A61160UL))
#define bM4_DMAC_DTCTL1_CNT9                            *((volatile unsigned int*)(0x42A61164UL))
#define bM4_DMAC_DTCTL1_CNT10                           *((volatile unsigned int*)(0x42A61168UL))
#define bM4_DMAC_DTCTL1_CNT11                           *((volatile unsigned int*)(0x42A6116CUL))
#define bM4_DMAC_DTCTL1_CNT12                           *((volatile unsigned int*)(0x42A61170UL))
#define bM4_DMAC_DTCTL1_CNT13                           *((volatile unsigned int*)(0x42A61174UL))
#define bM4_DMAC_DTCTL1_CNT14                           *((volatile unsigned int*)(0x42A61178UL))
#define bM4_DMAC_DTCTL1_CNT15                           *((volatile unsigned int*)(0x42A6117CUL))
#define bM4_DMAC_RPT1_SRPT0                             *((volatile unsigned int*)(0x42A61180UL))
#define bM4_DMAC_RPT1_SRPT1                             *((volatile unsigned int*)(0x42A61184UL))
#define bM4_DMAC_RPT1_SRPT2                             *((volatile unsigned int*)(0x42A61188UL))
#define bM4_DMAC_RPT1_SRPT3                             *((volatile unsigned int*)(0x42A6118CUL))
#define bM4_DMAC_RPT1_SRPT4                             *((volatile unsigned int*)(0x42A61190UL))
#define bM4_DMAC_RPT1_SRPT5                             *((volatile unsigned int*)(0x42A61194UL))
#define bM4_DMAC_RPT1_SRPT6                             *((volatile unsigned int*)(0x42A61198UL))
#define bM4_DMAC_RPT1_SRPT7                             *((volatile unsigned int*)(0x42A6119CUL))
#define bM4_DMAC_RPT1_SRPT8                             *((volatile unsigned int*)(0x42A611A0UL))
#define bM4_DMAC_RPT1_SRPT9                             *((volatile unsigned int*)(0x42A611A4UL))
#define bM4_DMAC_RPT1_DRPT0                             *((volatile unsigned int*)(0x42A611C0UL))
#define bM4_DMAC_RPT1_DRPT1                             *((volatile unsigned int*)(0x42A611C4UL))
#define bM4_DMAC_RPT1_DRPT2                             *((volatile unsigned int*)(0x42A611C8UL))
#define bM4_DMAC_RPT1_DRPT3                             *((volatile unsigned int*)(0x42A611CCUL))
#define bM4_DMAC_RPT1_DRPT4                             *((volatile unsigned int*)(0x42A611D0UL))
#define bM4_DMAC_RPT1_DRPT5                             *((volatile unsigned int*)(0x42A611D4UL))
#define bM4_DMAC_RPT1_DRPT6                             *((volatile unsigned int*)(0x42A611D8UL))
#define bM4_DMAC_RPT1_DRPT7                             *((volatile unsigned int*)(0x42A611DCUL))
#define bM4_DMAC_RPT1_DRPT8                             *((volatile unsigned int*)(0x42A611E0UL))
#define bM4_DMAC_RPT1_DRPT9                             *((volatile unsigned int*)(0x42A611E4UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET0                     *((volatile unsigned int*)(0x42A61200UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET1                     *((volatile unsigned int*)(0x42A61204UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET2                     *((volatile unsigned int*)(0x42A61208UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET3                     *((volatile unsigned int*)(0x42A6120CUL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET4                     *((volatile unsigned int*)(0x42A61210UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET5                     *((volatile unsigned int*)(0x42A61214UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET6                     *((volatile unsigned int*)(0x42A61218UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET7                     *((volatile unsigned int*)(0x42A6121CUL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET8                     *((volatile unsigned int*)(0x42A61220UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET9                     *((volatile unsigned int*)(0x42A61224UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET10                    *((volatile unsigned int*)(0x42A61228UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET11                    *((volatile unsigned int*)(0x42A6122CUL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET12                    *((volatile unsigned int*)(0x42A61230UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET13                    *((volatile unsigned int*)(0x42A61234UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET14                    *((volatile unsigned int*)(0x42A61238UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET15                    *((volatile unsigned int*)(0x42A6123CUL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET16                    *((volatile unsigned int*)(0x42A61240UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET17                    *((volatile unsigned int*)(0x42A61244UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET18                    *((volatile unsigned int*)(0x42A61248UL))
#define bM4_DMAC_SNSEQCTL1_SOFFSET19                    *((volatile unsigned int*)(0x42A6124CUL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT0                      *((volatile unsigned int*)(0x42A61250UL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT1                      *((volatile unsigned int*)(0x42A61254UL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT2                      *((volatile unsigned int*)(0x42A61258UL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT3                      *((volatile unsigned int*)(0x42A6125CUL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT4                      *((volatile unsigned int*)(0x42A61260UL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT5                      *((volatile unsigned int*)(0x42A61264UL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT6                      *((volatile unsigned int*)(0x42A61268UL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT7                      *((volatile unsigned int*)(0x42A6126CUL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT8                      *((volatile unsigned int*)(0x42A61270UL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT9                      *((volatile unsigned int*)(0x42A61274UL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT10                     *((volatile unsigned int*)(0x42A61278UL))
#define bM4_DMAC_SNSEQCTL1_SNSCNT11                     *((volatile unsigned int*)(0x42A6127CUL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET0                     *((volatile unsigned int*)(0x42A61280UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET1                     *((volatile unsigned int*)(0x42A61284UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET2                     *((volatile unsigned int*)(0x42A61288UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET3                     *((volatile unsigned int*)(0x42A6128CUL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET4                     *((volatile unsigned int*)(0x42A61290UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET5                     *((volatile unsigned int*)(0x42A61294UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET6                     *((volatile unsigned int*)(0x42A61298UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET7                     *((volatile unsigned int*)(0x42A6129CUL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET8                     *((volatile unsigned int*)(0x42A612A0UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET9                     *((volatile unsigned int*)(0x42A612A4UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET10                    *((volatile unsigned int*)(0x42A612A8UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET11                    *((volatile unsigned int*)(0x42A612ACUL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET12                    *((volatile unsigned int*)(0x42A612B0UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET13                    *((volatile unsigned int*)(0x42A612B4UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET14                    *((volatile unsigned int*)(0x42A612B8UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET15                    *((volatile unsigned int*)(0x42A612BCUL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET16                    *((volatile unsigned int*)(0x42A612C0UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET17                    *((volatile unsigned int*)(0x42A612C4UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET18                    *((volatile unsigned int*)(0x42A612C8UL))
#define bM4_DMAC_DNSEQCTL1_DOFFSET19                    *((volatile unsigned int*)(0x42A612CCUL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT0                      *((volatile unsigned int*)(0x42A612D0UL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT1                      *((volatile unsigned int*)(0x42A612D4UL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT2                      *((volatile unsigned int*)(0x42A612D8UL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT3                      *((volatile unsigned int*)(0x42A612DCUL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT4                      *((volatile unsigned int*)(0x42A612E0UL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT5                      *((volatile unsigned int*)(0x42A612E4UL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT6                      *((volatile unsigned int*)(0x42A612E8UL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT7                      *((volatile unsigned int*)(0x42A612ECUL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT8                      *((volatile unsigned int*)(0x42A612F0UL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT9                      *((volatile unsigned int*)(0x42A612F4UL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT10                     *((volatile unsigned int*)(0x42A612F8UL))
#define bM4_DMAC_DNSEQCTL1_DNSCNT11                     *((volatile unsigned int*)(0x42A612FCUL))
#define bM4_DMAC_LLP1_LLP0                              *((volatile unsigned int*)(0x42A61308UL))
#define bM4_DMAC_LLP1_LLP1                              *((volatile unsigned int*)(0x42A6130CUL))
#define bM4_DMAC_LLP1_LLP2                              *((volatile unsigned int*)(0x42A61310UL))
#define bM4_DMAC_LLP1_LLP3                              *((volatile unsigned int*)(0x42A61314UL))
#define bM4_DMAC_LLP1_LLP4                              *((volatile unsigned int*)(0x42A61318UL))
#define bM4_DMAC_LLP1_LLP5                              *((volatile unsigned int*)(0x42A6131CUL))
#define bM4_DMAC_LLP1_LLP6                              *((volatile unsigned int*)(0x42A61320UL))
#define bM4_DMAC_LLP1_LLP7                              *((volatile unsigned int*)(0x42A61324UL))
#define bM4_DMAC_LLP1_LLP8                              *((volatile unsigned int*)(0x42A61328UL))
#define bM4_DMAC_LLP1_LLP9                              *((volatile unsigned int*)(0x42A6132CUL))
#define bM4_DMAC_LLP1_LLP10                             *((volatile unsigned int*)(0x42A61330UL))
#define bM4_DMAC_LLP1_LLP11                             *((volatile unsigned int*)(0x42A61334UL))
#define bM4_DMAC_LLP1_LLP12                             *((volatile unsigned int*)(0x42A61338UL))
#define bM4_DMAC_LLP1_LLP13                             *((volatile unsigned int*)(0x42A6133CUL))
#define bM4_DMAC_LLP1_LLP14                             *((volatile unsigned int*)(0x42A61340UL))
#define bM4_DMAC_LLP1_LLP15                             *((volatile unsigned int*)(0x42A61344UL))
#define bM4_DMAC_LLP1_LLP16                             *((volatile unsigned int*)(0x42A61348UL))
#define bM4_DMAC_LLP1_LLP17                             *((volatile unsigned int*)(0x42A6134CUL))
#define bM4_DMAC_LLP1_LLP18                             *((volatile unsigned int*)(0x42A61350UL))
#define bM4_DMAC_LLP1_LLP19                             *((volatile unsigned int*)(0x42A61354UL))
#define bM4_DMAC_LLP1_LLP20                             *((volatile unsigned int*)(0x42A61358UL))
#define bM4_DMAC_LLP1_LLP21                             *((volatile unsigned int*)(0x42A6135CUL))
#define bM4_DMAC_LLP1_LLP22                             *((volatile unsigned int*)(0x42A61360UL))
#define bM4_DMAC_LLP1_LLP23                             *((volatile unsigned int*)(0x42A61364UL))
#define bM4_DMAC_LLP1_LLP24                             *((volatile unsigned int*)(0x42A61368UL))
#define bM4_DMAC_LLP1_LLP25                             *((volatile unsigned int*)(0x42A6136CUL))
#define bM4_DMAC_LLP1_LLP26                             *((volatile unsigned int*)(0x42A61370UL))
#define bM4_DMAC_LLP1_LLP27                             *((volatile unsigned int*)(0x42A61374UL))
#define bM4_DMAC_LLP1_LLP28                             *((volatile unsigned int*)(0x42A61378UL))
#define bM4_DMAC_LLP1_LLP29                             *((volatile unsigned int*)(0x42A6137CUL))
#define bM4_DMAC_CH1CTL_SINC0                           *((volatile unsigned int*)(0x42A61380UL))
#define bM4_DMAC_CH1CTL_SINC1                           *((volatile unsigned int*)(0x42A61384UL))
#define bM4_DMAC_CH1CTL_DINC0                           *((volatile unsigned int*)(0x42A61388UL))
#define bM4_DMAC_CH1CTL_DINC1                           *((volatile unsigned int*)(0x42A6138CUL))
#define bM4_DMAC_CH1CTL_SRTPEN                          *((volatile unsigned int*)(0x42A61390UL))
#define bM4_DMAC_CH1CTL_DRPTEN                          *((volatile unsigned int*)(0x42A61394UL))
#define bM4_DMAC_CH1CTL_SNSEQEN                         *((volatile unsigned int*)(0x42A61398UL))
#define bM4_DMAC_CH1CTL_DNSEQEN                         *((volatile unsigned int*)(0x42A6139CUL))
#define bM4_DMAC_CH1CTL_HSIZE0                          *((volatile unsigned int*)(0x42A613A0UL))
#define bM4_DMAC_CH1CTL_HSIZE1                          *((volatile unsigned int*)(0x42A613A4UL))
#define bM4_DMAC_CH1CTL_LLPEN                           *((volatile unsigned int*)(0x42A613A8UL))
#define bM4_DMAC_CH1CTL_LLPRUN                          *((volatile unsigned int*)(0x42A613ACUL))
#define bM4_DMAC_CH1CTL_IE                              *((volatile unsigned int*)(0x42A613B0UL))
#define bM4_DMAC_CH1CTL_PROT0                           *((volatile unsigned int*)(0x42A613B4UL))
#define bM4_DMAC_CH1CTL_PROT1                           *((volatile unsigned int*)(0x42A613B8UL))
#define bM4_DMAC_CH1CTL_PROT2                           *((volatile unsigned int*)(0x42A613BCUL))
#define bM4_DMAC_DTCTL2_BLKSIZE0                        *((volatile unsigned int*)(0x42A61900UL))
#define bM4_DMAC_DTCTL2_BLKSIZE1                        *((volatile unsigned int*)(0x42A61904UL))
#define bM4_DMAC_DTCTL2_BLKSIZE2                        *((volatile unsigned int*)(0x42A61908UL))
#define bM4_DMAC_DTCTL2_BLKSIZE3                        *((volatile unsigned int*)(0x42A6190CUL))
#define bM4_DMAC_DTCTL2_BLKSIZE4                        *((volatile unsigned int*)(0x42A61910UL))
#define bM4_DMAC_DTCTL2_BLKSIZE5                        *((volatile unsigned int*)(0x42A61914UL))
#define bM4_DMAC_DTCTL2_BLKSIZE6                        *((volatile unsigned int*)(0x42A61918UL))
#define bM4_DMAC_DTCTL2_BLKSIZE7                        *((volatile unsigned int*)(0x42A6191CUL))
#define bM4_DMAC_DTCTL2_BLKSIZE8                        *((volatile unsigned int*)(0x42A61920UL))
#define bM4_DMAC_DTCTL2_BLKSIZE9                        *((volatile unsigned int*)(0x42A61924UL))
#define bM4_DMAC_DTCTL2_CNT0                            *((volatile unsigned int*)(0x42A61940UL))
#define bM4_DMAC_DTCTL2_CNT1                            *((volatile unsigned int*)(0x42A61944UL))
#define bM4_DMAC_DTCTL2_CNT2                            *((volatile unsigned int*)(0x42A61948UL))
#define bM4_DMAC_DTCTL2_CNT3                            *((volatile unsigned int*)(0x42A6194CUL))
#define bM4_DMAC_DTCTL2_CNT4                            *((volatile unsigned int*)(0x42A61950UL))
#define bM4_DMAC_DTCTL2_CNT5                            *((volatile unsigned int*)(0x42A61954UL))
#define bM4_DMAC_DTCTL2_CNT6                            *((volatile unsigned int*)(0x42A61958UL))
#define bM4_DMAC_DTCTL2_CNT7                            *((volatile unsigned int*)(0x42A6195CUL))
#define bM4_DMAC_DTCTL2_CNT8                            *((volatile unsigned int*)(0x42A61960UL))
#define bM4_DMAC_DTCTL2_CNT9                            *((volatile unsigned int*)(0x42A61964UL))
#define bM4_DMAC_DTCTL2_CNT10                           *((volatile unsigned int*)(0x42A61968UL))
#define bM4_DMAC_DTCTL2_CNT11                           *((volatile unsigned int*)(0x42A6196CUL))
#define bM4_DMAC_DTCTL2_CNT12                           *((volatile unsigned int*)(0x42A61970UL))
#define bM4_DMAC_DTCTL2_CNT13                           *((volatile unsigned int*)(0x42A61974UL))
#define bM4_DMAC_DTCTL2_CNT14                           *((volatile unsigned int*)(0x42A61978UL))
#define bM4_DMAC_DTCTL2_CNT15                           *((volatile unsigned int*)(0x42A6197CUL))
#define bM4_DMAC_RPT2_SRPT0                             *((volatile unsigned int*)(0x42A61980UL))
#define bM4_DMAC_RPT2_SRPT1                             *((volatile unsigned int*)(0x42A61984UL))
