RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_DMAC_RPT2_SRPT2                             *((volatile unsigned int*)(0x42A61988UL))
#define bM4_DMAC_RPT2_SRPT3                             *((volatile unsigned int*)(0x42A6198CUL))
#define bM4_DMAC_RPT2_SRPT4                             *((volatile unsigned int*)(0x42A61990UL))
#define bM4_DMAC_RPT2_SRPT5                             *((volatile unsigned int*)(0x42A61994UL))
#define bM4_DMAC_RPT2_SRPT6                             *((volatile unsigned int*)(0x42A61998UL))
#define bM4_DMAC_RPT2_SRPT7                             *((volatile unsigned int*)(0x42A6199CUL))
#define bM4_DMAC_RPT2_SRPT8                             *((volatile unsigned int*)(0x42A619A0UL))
#define bM4_DMAC_RPT2_SRPT9                             *((volatile unsigned int*)(0x42A619A4UL))
#define bM4_DMAC_RPT2_DRPT0                             *((volatile unsigned int*)(0x42A619C0UL))
#define bM4_DMAC_RPT2_DRPT1                             *((volatile unsigned int*)(0x42A619C4UL))
#define bM4_DMAC_RPT2_DRPT2                             *((volatile unsigned int*)(0x42A619C8UL))
#define bM4_DMAC_RPT2_DRPT3                             *((volatile unsigned int*)(0x42A619CCUL))
#define bM4_DMAC_RPT2_DRPT4                             *((volatile unsigned int*)(0x42A619D0UL))
#define bM4_DMAC_RPT2_DRPT5                             *((volatile unsigned int*)(0x42A619D4UL))
#define bM4_DMAC_RPT2_DRPT6                             *((volatile unsigned int*)(0x42A619D8UL))
#define bM4_DMAC_RPT2_DRPT7                             *((volatile unsigned int*)(0x42A619DCUL))
#define bM4_DMAC_RPT2_DRPT8                             *((volatile unsigned int*)(0x42A619E0UL))
#define bM4_DMAC_RPT2_DRPT9                             *((volatile unsigned int*)(0x42A619E4UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET0                     *((volatile unsigned int*)(0x42A61A00UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET1                     *((volatile unsigned int*)(0x42A61A04UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET2                     *((volatile unsigned int*)(0x42A61A08UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET3                     *((volatile unsigned int*)(0x42A61A0CUL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET4                     *((volatile unsigned int*)(0x42A61A10UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET5                     *((volatile unsigned int*)(0x42A61A14UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET6                     *((volatile unsigned int*)(0x42A61A18UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET7                     *((volatile unsigned int*)(0x42A61A1CUL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET8                     *((volatile unsigned int*)(0x42A61A20UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET9                     *((volatile unsigned int*)(0x42A61A24UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET10                    *((volatile unsigned int*)(0x42A61A28UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET11                    *((volatile unsigned int*)(0x42A61A2CUL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET12                    *((volatile unsigned int*)(0x42A61A30UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET13                    *((volatile unsigned int*)(0x42A61A34UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET14                    *((volatile unsigned int*)(0x42A61A38UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET15                    *((volatile unsigned int*)(0x42A61A3CUL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET16                    *((volatile unsigned int*)(0x42A61A40UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET17                    *((volatile unsigned int*)(0x42A61A44UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET18                    *((volatile unsigned int*)(0x42A61A48UL))
#define bM4_DMAC_SNSEQCTL2_SOFFSET19                    *((volatile unsigned int*)(0x42A61A4CUL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT0                      *((volatile unsigned int*)(0x42A61A50UL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT1                      *((volatile unsigned int*)(0x42A61A54UL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT2                      *((volatile unsigned int*)(0x42A61A58UL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT3                      *((volatile unsigned int*)(0x42A61A5CUL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT4                      *((volatile unsigned int*)(0x42A61A60UL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT5                      *((volatile unsigned int*)(0x42A61A64UL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT6                      *((volatile unsigned int*)(0x42A61A68UL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT7                      *((volatile unsigned int*)(0x42A61A6CUL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT8                      *((volatile unsigned int*)(0x42A61A70UL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT9                      *((volatile unsigned int*)(0x42A61A74UL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT10                     *((volatile unsigned int*)(0x42A61A78UL))
#define bM4_DMAC_SNSEQCTL2_SNSCNT11                     *((volatile unsigned int*)(0x42A61A7CUL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET0                     *((volatile unsigned int*)(0x42A61A80UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET1                     *((volatile unsigned int*)(0x42A61A84UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET2                     *((volatile unsigned int*)(0x42A61A88UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET3                     *((volatile unsigned int*)(0x42A61A8CUL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET4                     *((volatile unsigned int*)(0x42A61A90UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET5                     *((volatile unsigned int*)(0x42A61A94UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET6                     *((volatile unsigned int*)(0x42A61A98UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET7                     *((volatile unsigned int*)(0x42A61A9CUL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET8                     *((volatile unsigned int*)(0x42A61AA0UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET9                     *((volatile unsigned int*)(0x42A61AA4UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET10                    *((volatile unsigned int*)(0x42A61AA8UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET11                    *((volatile unsigned int*)(0x42A61AACUL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET12                    *((volatile unsigned int*)(0x42A61AB0UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET13                    *((volatile unsigned int*)(0x42A61AB4UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET14                    *((volatile unsigned int*)(0x42A61AB8UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET15                    *((volatile unsigned int*)(0x42A61ABCUL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET16                    *((volatile unsigned int*)(0x42A61AC0UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET17                    *((volatile unsigned int*)(0x42A61AC4UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET18                    *((volatile unsigned int*)(0x42A61AC8UL))
#define bM4_DMAC_DNSEQCTL2_DOFFSET19                    *((volatile unsigned int*)(0x42A61ACCUL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT0                      *((volatile unsigned int*)(0x42A61AD0UL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT1                      *((volatile unsigned int*)(0x42A61AD4UL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT2                      *((volatile unsigned int*)(0x42A61AD8UL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT3                      *((volatile unsigned int*)(0x42A61ADCUL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT4                      *((volatile unsigned int*)(0x42A61AE0UL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT5                      *((volatile unsigned int*)(0x42A61AE4UL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT6                      *((volatile unsigned int*)(0x42A61AE8UL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT7                      *((volatile unsigned int*)(0x42A61AECUL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT8                      *((volatile unsigned int*)(0x42A61AF0UL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT9                      *((volatile unsigned int*)(0x42A61AF4UL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT10                     *((volatile unsigned int*)(0x42A61AF8UL))
#define bM4_DMAC_DNSEQCTL2_DNSCNT11                     *((volatile unsigned int*)(0x42A61AFCUL))
#define bM4_DMAC_LLP2_LLP0                              *((volatile unsigned int*)(0x42A61B08UL))
#define bM4_DMAC_LLP2_LLP1                              *((volatile unsigned int*)(0x42A61B0CUL))
#define bM4_DMAC_LLP2_LLP2                              *((volatile unsigned int*)(0x42A61B10UL))
#define bM4_DMAC_LLP2_LLP3                              *((volatile unsigned int*)(0x42A61B14UL))
#define bM4_DMAC_LLP2_LLP4                              *((volatile unsigned int*)(0x42A61B18UL))
#define bM4_DMAC_LLP2_LLP5                              *((volatile unsigned int*)(0x42A61B1CUL))
#define bM4_DMAC_LLP2_LLP6                              *((volatile unsigned int*)(0x42A61B20UL))
#define bM4_DMAC_LLP2_LLP7                              *((volatile unsigned int*)(0x42A61B24UL))
#define bM4_DMAC_LLP2_LLP8                              *((volatile unsigned int*)(0x42A61B28UL))
#define bM4_DMAC_LLP2_LLP9                              *((volatile unsigned int*)(0x42A61B2CUL))
#define bM4_DMAC_LLP2_LLP10                             *((volatile unsigned int*)(0x42A61B30UL))
#define bM4_DMAC_LLP2_LLP11                             *((volatile unsigned int*)(0x42A61B34UL))
#define bM4_DMAC_LLP2_LLP12                             *((volatile unsigned int*)(0x42A61B38UL))
#define bM4_DMAC_LLP2_LLP13                             *((volatile unsigned int*)(0x42A61B3CUL))
#define bM4_DMAC_LLP2_LLP14                             *((volatile unsigned int*)(0x42A61B40UL))
#define bM4_DMAC_LLP2_LLP15                             *((volatile unsigned int*)(0x42A61B44UL))
#define bM4_DMAC_LLP2_LLP16                             *((volatile unsigned int*)(0x42A61B48UL))
#define bM4_DMAC_LLP2_LLP17                             *((volatile unsigned int*)(0x42A61B4CUL))
#define bM4_DMAC_LLP2_LLP18                             *((volatile unsigned int*)(0x42A61B50UL))
#define bM4_DMAC_LLP2_LLP19                             *((volatile unsigned int*)(0x42A61B54UL))
#define bM4_DMAC_LLP2_LLP20                             *((volatile unsigned int*)(0x42A61B58UL))
#define bM4_DMAC_LLP2_LLP21                             *((volatile unsigned int*)(0x42A61B5CUL))
#define bM4_DMAC_LLP2_LLP22                             *((volatile unsigned int*)(0x42A61B60UL))
#define bM4_DMAC_LLP2_LLP23                             *((volatile unsigned int*)(0x42A61B64UL))
#define bM4_DMAC_LLP2_LLP24                             *((volatile unsigned int*)(0x42A61B68UL))
#define bM4_DMAC_LLP2_LLP25                             *((volatile unsigned int*)(0x42A61B6CUL))
#define bM4_DMAC_LLP2_LLP26                             *((volatile unsigned int*)(0x42A61B70UL))
#define bM4_DMAC_LLP2_LLP27                             *((volatile unsigned int*)(0x42A61B74UL))
#define bM4_DMAC_LLP2_LLP28                             *((volatile unsigned int*)(0x42A61B78UL))
#define bM4_DMAC_LLP2_LLP29                             *((volatile unsigned int*)(0x42A61B7CUL))
#define bM4_DMAC_CH2CTL_SINC0                           *((volatile unsigned int*)(0x42A61B80UL))
#define bM4_DMAC_CH2CTL_SINC1                           *((volatile unsigned int*)(0x42A61B84UL))
#define bM4_DMAC_CH2CTL_DINC0                           *((volatile unsigned int*)(0x42A61B88UL))
#define bM4_DMAC_CH2CTL_DINC1                           *((volatile unsigned int*)(0x42A61B8CUL))
#define bM4_DMAC_CH2CTL_SRTPEN                          *((volatile unsigned int*)(0x42A61B90UL))
#define bM4_DMAC_CH2CTL_DRPTEN                          *((volatile unsigned int*)(0x42A61B94UL))
#define bM4_DMAC_CH2CTL_SNSEQEN                         *((volatile unsigned int*)(0x42A61B98UL))
#define bM4_DMAC_CH2CTL_DNSEQEN                         *((volatile unsigned int*)(0x42A61B9CUL))
#define bM4_DMAC_CH2CTL_HSIZE0                          *((volatile unsigned int*)(0x42A61BA0UL))
#define bM4_DMAC_CH2CTL_HSIZE1                          *((volatile unsigned int*)(0x42A61BA4UL))
#define bM4_DMAC_CH2CTL_LLPEN                           *((volatile unsigned int*)(0x42A61BA8UL))
#define bM4_DMAC_CH2CTL_LLPRUN                          *((volatile unsigned int*)(0x42A61BACUL))
#define bM4_DMAC_CH2CTL_IE                              *((volatile unsigned int*)(0x42A61BB0UL))
#define bM4_DMAC_CH2CTL_PROT0                           *((volatile unsigned int*)(0x42A61BB4UL))
#define bM4_DMAC_CH2CTL_PROT1                           *((volatile unsigned int*)(0x42A61BB8UL))
#define bM4_DMAC_CH2CTL_PROT2                           *((volatile unsigned int*)(0x42A61BBCUL))
#define bM4_DMAC_DTCTL3_BLKSIZE0                        *((volatile unsigned int*)(0x42A62100UL))
#define bM4_DMAC_DTCTL3_BLKSIZE1                        *((volatile unsigned int*)(0x42A62104UL))
#define bM4_DMAC_DTCTL3_BLKSIZE2                        *((volatile unsigned int*)(0x42A62108UL))
#define bM4_DMAC_DTCTL3_BLKSIZE3                        *((volatile unsigned int*)(0x42A6210CUL))
#define bM4_DMAC_DTCTL3_BLKSIZE4                        *((volatile unsigned int*)(0x42A62110UL))
#define bM4_DMAC_DTCTL3_BLKSIZE5                        *((volatile unsigned int*)(0x42A62114UL))
#define bM4_DMAC_DTCTL3_BLKSIZE6                        *((volatile unsigned int*)(0x42A62118UL))
#define bM4_DMAC_DTCTL3_BLKSIZE7                        *((volatile unsigned int*)(0x42A6211CUL))
#define bM4_DMAC_DTCTL3_BLKSIZE8                        *((volatile unsigned int*)(0x42A62120UL))
#define bM4_DMAC_DTCTL3_BLKSIZE9                        *((volatile unsigned int*)(0x42A62124UL))
#define bM4_DMAC_DTCTL3_CNT0                            *((volatile unsigned int*)(0x42A62140UL))
#define bM4_DMAC_DTCTL3_CNT1                            *((volatile unsigned int*)(0x42A62144UL))
#define bM4_DMAC_DTCTL3_CNT2                            *((volatile unsigned int*)(0x42A62148UL))
#define bM4_DMAC_DTCTL3_CNT3                            *((volatile unsigned int*)(0x42A6214CUL))
#define bM4_DMAC_DTCTL3_CNT4                            *((volatile unsigned int*)(0x42A62150UL))
#define bM4_DMAC_DTCTL3_CNT5                            *((volatile unsigned int*)(0x42A62154UL))
#define bM4_DMAC_DTCTL3_CNT6                            *((volatile unsigned int*)(0x42A62158UL))
#define bM4_DMAC_DTCTL3_CNT7                            *((volatile unsigned int*)(0x42A6215CUL))
#define bM4_DMAC_DTCTL3_CNT8                            *((volatile unsigned int*)(0x42A62160UL))
#define bM4_DMAC_DTCTL3_CNT9                            *((volatile unsigned int*)(0x42A62164UL))
#define bM4_DMAC_DTCTL3_CNT10                           *((volatile unsigned int*)(0x42A62168UL))
#define bM4_DMAC_DTCTL3_CNT11                           *((volatile unsigned int*)(0x42A6216CUL))
#define bM4_DMAC_DTCTL3_CNT12                           *((volatile unsigned int*)(0x42A62170UL))
#define bM4_DMAC_DTCTL3_CNT13                           *((volatile unsigned int*)(0x42A62174UL))
#define bM4_DMAC_DTCTL3_CNT14                           *((volatile unsigned int*)(0x42A62178UL))
#define bM4_DMAC_DTCTL3_CNT15                           *((volatile unsigned int*)(0x42A6217CUL))
#define bM4_DMAC_RPT3_SRPT0                             *((volatile unsigned int*)(0x42A62180UL))
#define bM4_DMAC_RPT3_SRPT1                             *((volatile unsigned int*)(0x42A62184UL))
#define bM4_DMAC_RPT3_SRPT2                             *((volatile unsigned int*)(0x42A62188UL))
#define bM4_DMAC_RPT3_SRPT3                             *((volatile unsigned int*)(0x42A6218CUL))
#define bM4_DMAC_RPT3_SRPT4                             *((volatile unsigned int*)(0x42A62190UL))
#define bM4_DMAC_RPT3_SRPT5                             *((volatile unsigned int*)(0x42A62194UL))
#define bM4_DMAC_RPT3_SRPT6                             *((volatile unsigned int*)(0x42A62198UL))
#define bM4_DMAC_RPT3_SRPT7                             *((volatile unsigned int*)(0x42A6219CUL))
#define bM4_DMAC_RPT3_SRPT8                             *((volatile unsigned int*)(0x42A621A0UL))
#define bM4_DMAC_RPT3_SRPT9                             *((volatile unsigned int*)(0x42A621A4UL))
#define bM4_DMAC_RPT3_DRPT0                             *((volatile unsigned int*)(0x42A621C0UL))
#define bM4_DMAC_RPT3_DRPT1                             *((volatile unsigned int*)(0x42A621C4UL))
#define bM4_DMAC_RPT3_DRPT2                             *((volatile unsigned int*)(0x42A621C8UL))
#define bM4_DMAC_RPT3_DRPT3                             *((volatile unsigned int*)(0x42A621CCUL))
#define bM4_DMAC_RPT3_DRPT4                             *((volatile unsigned int*)(0x42A621D0UL))
#define bM4_DMAC_RPT3_DRPT5                             *((volatile unsigned int*)(0x42A621D4UL))
#define bM4_DMAC_RPT3_DRPT6                             *((volatile unsigned int*)(0x42A621D8UL))
#define bM4_DMAC_RPT3_DRPT7                             *((volatile unsigned int*)(0x42A621DCUL))
#define bM4_DMAC_RPT3_DRPT8                             *((volatile unsigned int*)(0x42A621E0UL))
#define bM4_DMAC_RPT3_DRPT9                             *((volatile unsigned int*)(0x42A621E4UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET0                     *((volatile unsigned int*)(0x42A62200UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET1                     *((volatile unsigned int*)(0x42A62204UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET2                     *((volatile unsigned int*)(0x42A62208UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET3                     *((volatile unsigned int*)(0x42A6220CUL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET4                     *((volatile unsigned int*)(0x42A62210UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET5                     *((volatile unsigned int*)(0x42A62214UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET6                     *((volatile unsigned int*)(0x42A62218UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET7                     *((volatile unsigned int*)(0x42A6221CUL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET8                     *((volatile unsigned int*)(0x42A62220UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET9                     *((volatile unsigned int*)(0x42A62224UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET10                    *((volatile unsigned int*)(0x42A62228UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET11                    *((volatile unsigned int*)(0x42A6222CUL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET12                    *((volatile unsigned int*)(0x42A62230UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET13                    *((volatile unsigned int*)(0x42A62234UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET14                    *((volatile unsigned int*)(0x42A62238UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET15                    *((volatile unsigned int*)(0x42A6223CUL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET16                    *((volatile unsigned int*)(0x42A62240UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET17                    *((volatile unsigned int*)(0x42A62244UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET18                    *((volatile unsigned int*)(0x42A62248UL))
#define bM4_DMAC_SNSEQCTL3_SOFFSET19                    *((volatile unsigned int*)(0x42A6224CUL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT0                      *((volatile unsigned int*)(0x42A62250UL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT1                      *((volatile unsigned int*)(0x42A62254UL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT2                      *((volatile unsigned int*)(0x42A62258UL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT3                      *((volatile unsigned int*)(0x42A6225CUL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT4                      *((volatile unsigned int*)(0x42A62260UL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT5                      *((volatile unsigned int*)(0x42A62264UL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT6                      *((volatile unsigned int*)(0x42A62268UL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT7                      *((volatile unsigned int*)(0x42A6226CUL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT8                      *((volatile unsigned int*)(0x42A62270UL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT9                      *((volatile unsigned int*)(0x42A62274UL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT10                     *((volatile unsigned int*)(0x42A62278UL))
#define bM4_DMAC_SNSEQCTL3_SNSCNT11                     *((volatile unsigned int*)(0x42A6227CUL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET0                     *((volatile unsigned int*)(0x42A62280UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET1                     *((volatile unsigned int*)(0x42A62284UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET2                     *((volatile unsigned int*)(0x42A62288UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET3                     *((volatile unsigned int*)(0x42A6228CUL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET4                     *((volatile unsigned int*)(0x42A62290UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET5                     *((volatile unsigned int*)(0x42A62294UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET6                     *((volatile unsigned int*)(0x42A62298UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET7                     *((volatile unsigned int*)(0x42A6229CUL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET8                     *((volatile unsigned int*)(0x42A622A0UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET9                     *((volatile unsigned int*)(0x42A622A4UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET10                    *((volatile unsigned int*)(0x42A622A8UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET11                    *((volatile unsigned int*)(0x42A622ACUL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET12                    *((volatile unsigned int*)(0x42A622B0UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET13                    *((volatile unsigned int*)(0x42A622B4UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET14                    *((volatile unsigned int*)(0x42A622B8UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET15                    *((volatile unsigned int*)(0x42A622BCUL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET16                    *((volatile unsigned int*)(0x42A622C0UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET17                    *((volatile unsigned int*)(0x42A622C4UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET18                    *((volatile unsigned int*)(0x42A622C8UL))
#define bM4_DMAC_DNSEQCTL3_DOFFSET19                    *((volatile unsigned int*)(0x42A622CCUL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT0                      *((volatile unsigned int*)(0x42A622D0UL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT1                      *((volatile unsigned int*)(0x42A622D4UL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT2                      *((volatile unsigned int*)(0x42A622D8UL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT3                      *((volatile unsigned int*)(0x42A622DCUL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT4                      *((volatile unsigned int*)(0x42A622E0UL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT5                      *((volatile unsigned int*)(0x42A622E4UL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT6                      *((volatile unsigned int*)(0x42A622E8UL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT7                      *((volatile unsigned int*)(0x42A622ECUL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT8                      *((volatile unsigned int*)(0x42A622F0UL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT9                      *((volatile unsigned int*)(0x42A622F4UL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT10                     *((volatile unsigned int*)(0x42A622F8UL))
#define bM4_DMAC_DNSEQCTL3_DNSCNT11                     *((volatile unsigned int*)(0x42A622FCUL))
#define bM4_DMAC_LLP3_LLP0                              *((volatile unsigned int*)(0x42A62308UL))
#define bM4_DMAC_LLP3_LLP1                              *((volatile unsigned int*)(0x42A6230CUL))
#define bM4_DMAC_LLP3_LLP2                              *((volatile unsigned int*)(0x42A62310UL))
#define bM4_DMAC_LLP3_LLP3                              *((volatile unsigned int*)(0x42A62314UL))
#define bM4_DMAC_LLP3_LLP4                              *((volatile unsigned int*)(0x42A62318UL))
#define bM4_DMAC_LLP3_LLP5                              *((volatile unsigned int*)(0x42A6231CUL))
