RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_DMAC_LLP3_LLP6                              *((volatile unsigned int*)(0x42A62320UL))
#define bM4_DMAC_LLP3_LLP7                              *((volatile unsigned int*)(0x42A62324UL))
#define bM4_DMAC_LLP3_LLP8                              *((volatile unsigned int*)(0x42A62328UL))
#define bM4_DMAC_LLP3_LLP9                              *((volatile unsigned int*)(0x42A6232CUL))
#define bM4_DMAC_LLP3_LLP10                             *((volatile unsigned int*)(0x42A62330UL))
#define bM4_DMAC_LLP3_LLP11                             *((volatile unsigned int*)(0x42A62334UL))
#define bM4_DMAC_LLP3_LLP12                             *((volatile unsigned int*)(0x42A62338UL))
#define bM4_DMAC_LLP3_LLP13                             *((volatile unsigned int*)(0x42A6233CUL))
#define bM4_DMAC_LLP3_LLP14                             *((volatile unsigned int*)(0x42A62340UL))
#define bM4_DMAC_LLP3_LLP15                             *((volatile unsigned int*)(0x42A62344UL))
#define bM4_DMAC_LLP3_LLP16                             *((volatile unsigned int*)(0x42A62348UL))
#define bM4_DMAC_LLP3_LLP17                             *((volatile unsigned int*)(0x42A6234CUL))
#define bM4_DMAC_LLP3_LLP18                             *((volatile unsigned int*)(0x42A62350UL))
#define bM4_DMAC_LLP3_LLP19                             *((volatile unsigned int*)(0x42A62354UL))
#define bM4_DMAC_LLP3_LLP20                             *((volatile unsigned int*)(0x42A62358UL))
#define bM4_DMAC_LLP3_LLP21                             *((volatile unsigned int*)(0x42A6235CUL))
#define bM4_DMAC_LLP3_LLP22                             *((volatile unsigned int*)(0x42A62360UL))
#define bM4_DMAC_LLP3_LLP23                             *((volatile unsigned int*)(0x42A62364UL))
#define bM4_DMAC_LLP3_LLP24                             *((volatile unsigned int*)(0x42A62368UL))
#define bM4_DMAC_LLP3_LLP25                             *((volatile unsigned int*)(0x42A6236CUL))
#define bM4_DMAC_LLP3_LLP26                             *((volatile unsigned int*)(0x42A62370UL))
#define bM4_DMAC_LLP3_LLP27                             *((volatile unsigned int*)(0x42A62374UL))
#define bM4_DMAC_LLP3_LLP28                             *((volatile unsigned int*)(0x42A62378UL))
#define bM4_DMAC_LLP3_LLP29                             *((volatile unsigned int*)(0x42A6237CUL))
#define bM4_DMAC_CH3CTL_SINC0                           *((volatile unsigned int*)(0x42A62380UL))
#define bM4_DMAC_CH3CTL_SINC1                           *((volatile unsigned int*)(0x42A62384UL))
#define bM4_DMAC_CH3CTL_DINC0                           *((volatile unsigned int*)(0x42A62388UL))
#define bM4_DMAC_CH3CTL_DINC1                           *((volatile unsigned int*)(0x42A6238CUL))
#define bM4_DMAC_CH3CTL_SRTPEN                          *((volatile unsigned int*)(0x42A62390UL))
#define bM4_DMAC_CH3CTL_DRPTEN                          *((volatile unsigned int*)(0x42A62394UL))
#define bM4_DMAC_CH3CTL_SNSEQEN                         *((volatile unsigned int*)(0x42A62398UL))
#define bM4_DMAC_CH3CTL_DNSEQEN                         *((volatile unsigned int*)(0x42A6239CUL))
#define bM4_DMAC_CH3CTL_HSIZE0                          *((volatile unsigned int*)(0x42A623A0UL))
#define bM4_DMAC_CH3CTL_HSIZE1                          *((volatile unsigned int*)(0x42A623A4UL))
#define bM4_DMAC_CH3CTL_LLPEN                           *((volatile unsigned int*)(0x42A623A8UL))
#define bM4_DMAC_CH3CTL_LLPRUN                          *((volatile unsigned int*)(0x42A623ACUL))
#define bM4_DMAC_CH3CTL_IE                              *((volatile unsigned int*)(0x42A623B0UL))
#define bM4_DMAC_CH3CTL_PROT0                           *((volatile unsigned int*)(0x42A623B4UL))
#define bM4_DMAC_CH3CTL_PROT1                           *((volatile unsigned int*)(0x42A623B8UL))
#define bM4_DMAC_CH3CTL_PROT2                           *((volatile unsigned int*)(0x42A623BCUL))
#define bM4_DMAC_DTCTL4_BLKSIZE0                        *((volatile unsigned int*)(0x42A62900UL))
#define bM4_DMAC_DTCTL4_BLKSIZE1                        *((volatile unsigned int*)(0x42A62904UL))
#define bM4_DMAC_DTCTL4_BLKSIZE2                        *((volatile unsigned int*)(0x42A62908UL))
#define bM4_DMAC_DTCTL4_BLKSIZE3                        *((volatile unsigned int*)(0x42A6290CUL))
#define bM4_DMAC_DTCTL4_BLKSIZE4                        *((volatile unsigned int*)(0x42A62910UL))
#define bM4_DMAC_DTCTL4_BLKSIZE5                        *((volatile unsigned int*)(0x42A62914UL))
#define bM4_DMAC_DTCTL4_BLKSIZE6                        *((volatile unsigned int*)(0x42A62918UL))
#define bM4_DMAC_DTCTL4_BLKSIZE7                        *((volatile unsigned int*)(0x42A6291CUL))
#define bM4_DMAC_DTCTL4_BLKSIZE8                        *((volatile unsigned int*)(0x42A62920UL))
#define bM4_DMAC_DTCTL4_BLKSIZE9                        *((volatile unsigned int*)(0x42A62924UL))
#define bM4_DMAC_DTCTL4_CNT0                            *((volatile unsigned int*)(0x42A62940UL))
#define bM4_DMAC_DTCTL4_CNT1                            *((volatile unsigned int*)(0x42A62944UL))
#define bM4_DMAC_DTCTL4_CNT2                            *((volatile unsigned int*)(0x42A62948UL))
#define bM4_DMAC_DTCTL4_CNT3                            *((volatile unsigned int*)(0x42A6294CUL))
#define bM4_DMAC_DTCTL4_CNT4                            *((volatile unsigned int*)(0x42A62950UL))
#define bM4_DMAC_DTCTL4_CNT5                            *((volatile unsigned int*)(0x42A62954UL))
#define bM4_DMAC_DTCTL4_CNT6                            *((volatile unsigned int*)(0x42A62958UL))
#define bM4_DMAC_DTCTL4_CNT7                            *((volatile unsigned int*)(0x42A6295CUL))
#define bM4_DMAC_DTCTL4_CNT8                            *((volatile unsigned int*)(0x42A62960UL))
#define bM4_DMAC_DTCTL4_CNT9                            *((volatile unsigned int*)(0x42A62964UL))
#define bM4_DMAC_DTCTL4_CNT10                           *((volatile unsigned int*)(0x42A62968UL))
#define bM4_DMAC_DTCTL4_CNT11                           *((volatile unsigned int*)(0x42A6296CUL))
#define bM4_DMAC_DTCTL4_CNT12                           *((volatile unsigned int*)(0x42A62970UL))
#define bM4_DMAC_DTCTL4_CNT13                           *((volatile unsigned int*)(0x42A62974UL))
#define bM4_DMAC_DTCTL4_CNT14                           *((volatile unsigned int*)(0x42A62978UL))
#define bM4_DMAC_DTCTL4_CNT15                           *((volatile unsigned int*)(0x42A6297CUL))
#define bM4_DMAC_RPT4_SRPT0                             *((volatile unsigned int*)(0x42A62980UL))
#define bM4_DMAC_RPT4_SRPT1                             *((volatile unsigned int*)(0x42A62984UL))
#define bM4_DMAC_RPT4_SRPT2                             *((volatile unsigned int*)(0x42A62988UL))
#define bM4_DMAC_RPT4_SRPT3                             *((volatile unsigned int*)(0x42A6298CUL))
#define bM4_DMAC_RPT4_SRPT4                             *((volatile unsigned int*)(0x42A62990UL))
#define bM4_DMAC_RPT4_SRPT5                             *((volatile unsigned int*)(0x42A62994UL))
#define bM4_DMAC_RPT4_SRPT6                             *((volatile unsigned int*)(0x42A62998UL))
#define bM4_DMAC_RPT4_SRPT7                             *((volatile unsigned int*)(0x42A6299CUL))
#define bM4_DMAC_RPT4_SRPT8                             *((volatile unsigned int*)(0x42A629A0UL))
#define bM4_DMAC_RPT4_SRPT9                             *((volatile unsigned int*)(0x42A629A4UL))
#define bM4_DMAC_RPT4_DRPT0                             *((volatile unsigned int*)(0x42A629C0UL))
#define bM4_DMAC_RPT4_DRPT1                             *((volatile unsigned int*)(0x42A629C4UL))
#define bM4_DMAC_RPT4_DRPT2                             *((volatile unsigned int*)(0x42A629C8UL))
#define bM4_DMAC_RPT4_DRPT3                             *((volatile unsigned int*)(0x42A629CCUL))
#define bM4_DMAC_RPT4_DRPT4                             *((volatile unsigned int*)(0x42A629D0UL))
#define bM4_DMAC_RPT4_DRPT5                             *((volatile unsigned int*)(0x42A629D4UL))
#define bM4_DMAC_RPT4_DRPT6                             *((volatile unsigned int*)(0x42A629D8UL))
#define bM4_DMAC_RPT4_DRPT7                             *((volatile unsigned int*)(0x42A629DCUL))
#define bM4_DMAC_RPT4_DRPT8                             *((volatile unsigned int*)(0x42A629E0UL))
#define bM4_DMAC_RPT4_DRPT9                             *((volatile unsigned int*)(0x42A629E4UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET0                     *((volatile unsigned int*)(0x42A62A00UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET1                     *((volatile unsigned int*)(0x42A62A04UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET2                     *((volatile unsigned int*)(0x42A62A08UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET3                     *((volatile unsigned int*)(0x42A62A0CUL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET4                     *((volatile unsigned int*)(0x42A62A10UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET5                     *((volatile unsigned int*)(0x42A62A14UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET6                     *((volatile unsigned int*)(0x42A62A18UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET7                     *((volatile unsigned int*)(0x42A62A1CUL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET8                     *((volatile unsigned int*)(0x42A62A20UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET9                     *((volatile unsigned int*)(0x42A62A24UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET10                    *((volatile unsigned int*)(0x42A62A28UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET11                    *((volatile unsigned int*)(0x42A62A2CUL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET12                    *((volatile unsigned int*)(0x42A62A30UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET13                    *((volatile unsigned int*)(0x42A62A34UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET14                    *((volatile unsigned int*)(0x42A62A38UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET15                    *((volatile unsigned int*)(0x42A62A3CUL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET16                    *((volatile unsigned int*)(0x42A62A40UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET17                    *((volatile unsigned int*)(0x42A62A44UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET18                    *((volatile unsigned int*)(0x42A62A48UL))
#define bM4_DMAC_SNSEQCTL4_SOFFSET19                    *((volatile unsigned int*)(0x42A62A4CUL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT0                      *((volatile unsigned int*)(0x42A62A50UL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT1                      *((volatile unsigned int*)(0x42A62A54UL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT2                      *((volatile unsigned int*)(0x42A62A58UL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT3                      *((volatile unsigned int*)(0x42A62A5CUL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT4                      *((volatile unsigned int*)(0x42A62A60UL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT5                      *((volatile unsigned int*)(0x42A62A64UL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT6                      *((volatile unsigned int*)(0x42A62A68UL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT7                      *((volatile unsigned int*)(0x42A62A6CUL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT8                      *((volatile unsigned int*)(0x42A62A70UL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT9                      *((volatile unsigned int*)(0x42A62A74UL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT10                     *((volatile unsigned int*)(0x42A62A78UL))
#define bM4_DMAC_SNSEQCTL4_SNSCNT11                     *((volatile unsigned int*)(0x42A62A7CUL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET0                     *((volatile unsigned int*)(0x42A62A80UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET1                     *((volatile unsigned int*)(0x42A62A84UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET2                     *((volatile unsigned int*)(0x42A62A88UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET3                     *((volatile unsigned int*)(0x42A62A8CUL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET4                     *((volatile unsigned int*)(0x42A62A90UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET5                     *((volatile unsigned int*)(0x42A62A94UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET6                     *((volatile unsigned int*)(0x42A62A98UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET7                     *((volatile unsigned int*)(0x42A62A9CUL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET8                     *((volatile unsigned int*)(0x42A62AA0UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET9                     *((volatile unsigned int*)(0x42A62AA4UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET10                    *((volatile unsigned int*)(0x42A62AA8UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET11                    *((volatile unsigned int*)(0x42A62AACUL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET12                    *((volatile unsigned int*)(0x42A62AB0UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET13                    *((volatile unsigned int*)(0x42A62AB4UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET14                    *((volatile unsigned int*)(0x42A62AB8UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET15                    *((volatile unsigned int*)(0x42A62ABCUL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET16                    *((volatile unsigned int*)(0x42A62AC0UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET17                    *((volatile unsigned int*)(0x42A62AC4UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET18                    *((volatile unsigned int*)(0x42A62AC8UL))
#define bM4_DMAC_DNSEQCTL4_DOFFSET19                    *((volatile unsigned int*)(0x42A62ACCUL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT0                      *((volatile unsigned int*)(0x42A62AD0UL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT1                      *((volatile unsigned int*)(0x42A62AD4UL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT2                      *((volatile unsigned int*)(0x42A62AD8UL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT3                      *((volatile unsigned int*)(0x42A62ADCUL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT4                      *((volatile unsigned int*)(0x42A62AE0UL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT5                      *((volatile unsigned int*)(0x42A62AE4UL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT6                      *((volatile unsigned int*)(0x42A62AE8UL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT7                      *((volatile unsigned int*)(0x42A62AECUL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT8                      *((volatile unsigned int*)(0x42A62AF0UL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT9                      *((volatile unsigned int*)(0x42A62AF4UL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT10                     *((volatile unsigned int*)(0x42A62AF8UL))
#define bM4_DMAC_DNSEQCTL4_DNSCNT11                     *((volatile unsigned int*)(0x42A62AFCUL))
#define bM4_DMAC_LLP4_LLP0                              *((volatile unsigned int*)(0x42A62B08UL))
#define bM4_DMAC_LLP4_LLP1                              *((volatile unsigned int*)(0x42A62B0CUL))
#define bM4_DMAC_LLP4_LLP2                              *((volatile unsigned int*)(0x42A62B10UL))
#define bM4_DMAC_LLP4_LLP3                              *((volatile unsigned int*)(0x42A62B14UL))
#define bM4_DMAC_LLP4_LLP4                              *((volatile unsigned int*)(0x42A62B18UL))
#define bM4_DMAC_LLP4_LLP5                              *((volatile unsigned int*)(0x42A62B1CUL))
#define bM4_DMAC_LLP4_LLP6                              *((volatile unsigned int*)(0x42A62B20UL))
#define bM4_DMAC_LLP4_LLP7                              *((volatile unsigned int*)(0x42A62B24UL))
#define bM4_DMAC_LLP4_LLP8                              *((volatile unsigned int*)(0x42A62B28UL))
#define bM4_DMAC_LLP4_LLP9                              *((volatile unsigned int*)(0x42A62B2CUL))
#define bM4_DMAC_LLP4_LLP10                             *((volatile unsigned int*)(0x42A62B30UL))
#define bM4_DMAC_LLP4_LLP11                             *((volatile unsigned int*)(0x42A62B34UL))
#define bM4_DMAC_LLP4_LLP12                             *((volatile unsigned int*)(0x42A62B38UL))
#define bM4_DMAC_LLP4_LLP13                             *((volatile unsigned int*)(0x42A62B3CUL))
#define bM4_DMAC_LLP4_LLP14                             *((volatile unsigned int*)(0x42A62B40UL))
#define bM4_DMAC_LLP4_LLP15                             *((volatile unsigned int*)(0x42A62B44UL))
#define bM4_DMAC_LLP4_LLP16                             *((volatile unsigned int*)(0x42A62B48UL))
#define bM4_DMAC_LLP4_LLP17                             *((volatile unsigned int*)(0x42A62B4CUL))
#define bM4_DMAC_LLP4_LLP18                             *((volatile unsigned int*)(0x42A62B50UL))
#define bM4_DMAC_LLP4_LLP19                             *((volatile unsigned int*)(0x42A62B54UL))
#define bM4_DMAC_LLP4_LLP20                             *((volatile unsigned int*)(0x42A62B58UL))
#define bM4_DMAC_LLP4_LLP21                             *((volatile unsigned int*)(0x42A62B5CUL))
#define bM4_DMAC_LLP4_LLP22                             *((volatile unsigned int*)(0x42A62B60UL))
#define bM4_DMAC_LLP4_LLP23                             *((volatile unsigned int*)(0x42A62B64UL))
#define bM4_DMAC_LLP4_LLP24                             *((volatile unsigned int*)(0x42A62B68UL))
#define bM4_DMAC_LLP4_LLP25                             *((volatile unsigned int*)(0x42A62B6CUL))
#define bM4_DMAC_LLP4_LLP26                             *((volatile unsigned int*)(0x42A62B70UL))
#define bM4_DMAC_LLP4_LLP27                             *((volatile unsigned int*)(0x42A62B74UL))
#define bM4_DMAC_LLP4_LLP28                             *((volatile unsigned int*)(0x42A62B78UL))
#define bM4_DMAC_LLP4_LLP29                             *((volatile unsigned int*)(0x42A62B7CUL))
#define bM4_DMAC_CH4CTL_SINC0                           *((volatile unsigned int*)(0x42A62B80UL))
#define bM4_DMAC_CH4CTL_SINC1                           *((volatile unsigned int*)(0x42A62B84UL))
#define bM4_DMAC_CH4CTL_DINC0                           *((volatile unsigned int*)(0x42A62B88UL))
#define bM4_DMAC_CH4CTL_DINC1                           *((volatile unsigned int*)(0x42A62B8CUL))
#define bM4_DMAC_CH4CTL_SRTPEN                          *((volatile unsigned int*)(0x42A62B90UL))
#define bM4_DMAC_CH4CTL_DRPTEN                          *((volatile unsigned int*)(0x42A62B94UL))
#define bM4_DMAC_CH4CTL_SNSEQEN                         *((volatile unsigned int*)(0x42A62B98UL))
#define bM4_DMAC_CH4CTL_DNSEQEN                         *((volatile unsigned int*)(0x42A62B9CUL))
#define bM4_DMAC_CH4CTL_HSIZE0                          *((volatile unsigned int*)(0x42A62BA0UL))
#define bM4_DMAC_CH4CTL_HSIZE1                          *((volatile unsigned int*)(0x42A62BA4UL))
#define bM4_DMAC_CH4CTL_LLPEN                           *((volatile unsigned int*)(0x42A62BA8UL))
#define bM4_DMAC_CH4CTL_LLPRUN                          *((volatile unsigned int*)(0x42A62BACUL))
#define bM4_DMAC_CH4CTL_IE                              *((volatile unsigned int*)(0x42A62BB0UL))
#define bM4_DMAC_CH4CTL_PROT0                           *((volatile unsigned int*)(0x42A62BB4UL))
#define bM4_DMAC_CH4CTL_PROT1                           *((volatile unsigned int*)(0x42A62BB8UL))
#define bM4_DMAC_CH4CTL_PROT2                           *((volatile unsigned int*)(0x42A62BBCUL))
#define bM4_DMAC_DTCTL5_BLKSIZE0                        *((volatile unsigned int*)(0x42A63100UL))
#define bM4_DMAC_DTCTL5_BLKSIZE1                        *((volatile unsigned int*)(0x42A63104UL))
#define bM4_DMAC_DTCTL5_BLKSIZE2                        *((volatile unsigned int*)(0x42A63108UL))
#define bM4_DMAC_DTCTL5_BLKSIZE3                        *((volatile unsigned int*)(0x42A6310CUL))
#define bM4_DMAC_DTCTL5_BLKSIZE4                        *((volatile unsigned int*)(0x42A63110UL))
#define bM4_DMAC_DTCTL5_BLKSIZE5                        *((volatile unsigned int*)(0x42A63114UL))
#define bM4_DMAC_DTCTL5_BLKSIZE6                        *((volatile unsigned int*)(0x42A63118UL))
#define bM4_DMAC_DTCTL5_BLKSIZE7                        *((volatile unsigned int*)(0x42A6311CUL))
#define bM4_DMAC_DTCTL5_BLKSIZE8                        *((volatile unsigned int*)(0x42A63120UL))
#define bM4_DMAC_DTCTL5_BLKSIZE9                        *((volatile unsigned int*)(0x42A63124UL))
#define bM4_DMAC_DTCTL5_CNT0                            *((volatile unsigned int*)(0x42A63140UL))
#define bM4_DMAC_DTCTL5_CNT1                            *((volatile unsigned int*)(0x42A63144UL))
#define bM4_DMAC_DTCTL5_CNT2                            *((volatile unsigned int*)(0x42A63148UL))
#define bM4_DMAC_DTCTL5_CNT3                            *((volatile unsigned int*)(0x42A6314CUL))
#define bM4_DMAC_DTCTL5_CNT4                            *((volatile unsigned int*)(0x42A63150UL))
#define bM4_DMAC_DTCTL5_CNT5                            *((volatile unsigned int*)(0x42A63154UL))
#define bM4_DMAC_DTCTL5_CNT6                            *((volatile unsigned int*)(0x42A63158UL))
#define bM4_DMAC_DTCTL5_CNT7                            *((volatile unsigned int*)(0x42A6315CUL))
#define bM4_DMAC_DTCTL5_CNT8                            *((volatile unsigned int*)(0x42A63160UL))
#define bM4_DMAC_DTCTL5_CNT9                            *((volatile unsigned int*)(0x42A63164UL))
#define bM4_DMAC_DTCTL5_CNT10                           *((volatile unsigned int*)(0x42A63168UL))
#define bM4_DMAC_DTCTL5_CNT11                           *((volatile unsigned int*)(0x42A6316CUL))
#define bM4_DMAC_DTCTL5_CNT12                           *((volatile unsigned int*)(0x42A63170UL))
#define bM4_DMAC_DTCTL5_CNT13                           *((volatile unsigned int*)(0x42A63174UL))
#define bM4_DMAC_DTCTL5_CNT14                           *((volatile unsigned int*)(0x42A63178UL))
#define bM4_DMAC_DTCTL5_CNT15                           *((volatile unsigned int*)(0x42A6317CUL))
#define bM4_DMAC_RPT5_SRPT0                             *((volatile unsigned int*)(0x42A63180UL))
#define bM4_DMAC_RPT5_SRPT1                             *((volatile unsigned int*)(0x42A63184UL))
#define bM4_DMAC_RPT5_SRPT2                             *((volatile unsigned int*)(0x42A63188UL))
#define bM4_DMAC_RPT5_SRPT3                             *((volatile unsigned int*)(0x42A6318CUL))
#define bM4_DMAC_RPT5_SRPT4                             *((volatile unsigned int*)(0x42A63190UL))
#define bM4_DMAC_RPT5_SRPT5                             *((volatile unsigned int*)(0x42A63194UL))
#define bM4_DMAC_RPT5_SRPT6                             *((volatile unsigned int*)(0x42A63198UL))
#define bM4_DMAC_RPT5_SRPT7                             *((volatile unsigned int*)(0x42A6319CUL))
#define bM4_DMAC_RPT5_SRPT8                             *((volatile unsigned int*)(0x42A631A0UL))
#define bM4_DMAC_RPT5_SRPT9                             *((volatile unsigned int*)(0x42A631A4UL))
#define bM4_DMAC_RPT5_DRPT0                             *((volatile unsigned int*)(0x42A631C0UL))
#define bM4_DMAC_RPT5_DRPT1                             *((volatile unsigned int*)(0x42A631C4UL))
#define bM4_DMAC_RPT5_DRPT2                             *((volatile unsigned int*)(0x42A631C8UL))
#define bM4_DMAC_RPT5_DRPT3                             *((volatile unsigned int*)(0x42A631CCUL))
#define bM4_DMAC_RPT5_DRPT4                             *((volatile unsigned int*)(0x42A631D0UL))
#define bM4_DMAC_RPT5_DRPT5                             *((volatile unsigned int*)(0x42A631D4UL))
#define bM4_DMAC_RPT5_DRPT6                             *((volatile unsigned int*)(0x42A631D8UL))
#define bM4_DMAC_RPT5_DRPT7                             *((volatile unsigned int*)(0x42A631DCUL))
#define bM4_DMAC_RPT5_DRPT8                             *((volatile unsigned int*)(0x42A631E0UL))
#define bM4_DMAC_RPT5_DRPT9                             *((volatile unsigned int*)(0x42A631E4UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET0                     *((volatile unsigned int*)(0x42A63200UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET1                     *((volatile unsigned int*)(0x42A63204UL))
