RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_DMAC_SNSEQCTL5_SOFFSET2                     *((volatile unsigned int*)(0x42A63208UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET3                     *((volatile unsigned int*)(0x42A6320CUL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET4                     *((volatile unsigned int*)(0x42A63210UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET5                     *((volatile unsigned int*)(0x42A63214UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET6                     *((volatile unsigned int*)(0x42A63218UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET7                     *((volatile unsigned int*)(0x42A6321CUL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET8                     *((volatile unsigned int*)(0x42A63220UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET9                     *((volatile unsigned int*)(0x42A63224UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET10                    *((volatile unsigned int*)(0x42A63228UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET11                    *((volatile unsigned int*)(0x42A6322CUL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET12                    *((volatile unsigned int*)(0x42A63230UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET13                    *((volatile unsigned int*)(0x42A63234UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET14                    *((volatile unsigned int*)(0x42A63238UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET15                    *((volatile unsigned int*)(0x42A6323CUL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET16                    *((volatile unsigned int*)(0x42A63240UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET17                    *((volatile unsigned int*)(0x42A63244UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET18                    *((volatile unsigned int*)(0x42A63248UL))
#define bM4_DMAC_SNSEQCTL5_SOFFSET19                    *((volatile unsigned int*)(0x42A6324CUL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT0                      *((volatile unsigned int*)(0x42A63250UL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT1                      *((volatile unsigned int*)(0x42A63254UL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT2                      *((volatile unsigned int*)(0x42A63258UL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT3                      *((volatile unsigned int*)(0x42A6325CUL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT4                      *((volatile unsigned int*)(0x42A63260UL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT5                      *((volatile unsigned int*)(0x42A63264UL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT6                      *((volatile unsigned int*)(0x42A63268UL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT7                      *((volatile unsigned int*)(0x42A6326CUL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT8                      *((volatile unsigned int*)(0x42A63270UL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT9                      *((volatile unsigned int*)(0x42A63274UL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT10                     *((volatile unsigned int*)(0x42A63278UL))
#define bM4_DMAC_SNSEQCTL5_SNSCNT11                     *((volatile unsigned int*)(0x42A6327CUL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET0                     *((volatile unsigned int*)(0x42A63280UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET1                     *((volatile unsigned int*)(0x42A63284UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET2                     *((volatile unsigned int*)(0x42A63288UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET3                     *((volatile unsigned int*)(0x42A6328CUL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET4                     *((volatile unsigned int*)(0x42A63290UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET5                     *((volatile unsigned int*)(0x42A63294UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET6                     *((volatile unsigned int*)(0x42A63298UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET7                     *((volatile unsigned int*)(0x42A6329CUL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET8                     *((volatile unsigned int*)(0x42A632A0UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET9                     *((volatile unsigned int*)(0x42A632A4UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET10                    *((volatile unsigned int*)(0x42A632A8UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET11                    *((volatile unsigned int*)(0x42A632ACUL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET12                    *((volatile unsigned int*)(0x42A632B0UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET13                    *((volatile unsigned int*)(0x42A632B4UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET14                    *((volatile unsigned int*)(0x42A632B8UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET15                    *((volatile unsigned int*)(0x42A632BCUL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET16                    *((volatile unsigned int*)(0x42A632C0UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET17                    *((volatile unsigned int*)(0x42A632C4UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET18                    *((volatile unsigned int*)(0x42A632C8UL))
#define bM4_DMAC_DNSEQCTL5_DOFFSET19                    *((volatile unsigned int*)(0x42A632CCUL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT0                      *((volatile unsigned int*)(0x42A632D0UL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT1                      *((volatile unsigned int*)(0x42A632D4UL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT2                      *((volatile unsigned int*)(0x42A632D8UL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT3                      *((volatile unsigned int*)(0x42A632DCUL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT4                      *((volatile unsigned int*)(0x42A632E0UL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT5                      *((volatile unsigned int*)(0x42A632E4UL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT6                      *((volatile unsigned int*)(0x42A632E8UL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT7                      *((volatile unsigned int*)(0x42A632ECUL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT8                      *((volatile unsigned int*)(0x42A632F0UL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT9                      *((volatile unsigned int*)(0x42A632F4UL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT10                     *((volatile unsigned int*)(0x42A632F8UL))
#define bM4_DMAC_DNSEQCTL5_DNSCNT11                     *((volatile unsigned int*)(0x42A632FCUL))
#define bM4_DMAC_LLP5_LLP0                              *((volatile unsigned int*)(0x42A63308UL))
#define bM4_DMAC_LLP5_LLP1                              *((volatile unsigned int*)(0x42A6330CUL))
#define bM4_DMAC_LLP5_LLP2                              *((volatile unsigned int*)(0x42A63310UL))
#define bM4_DMAC_LLP5_LLP3                              *((volatile unsigned int*)(0x42A63314UL))
#define bM4_DMAC_LLP5_LLP4                              *((volatile unsigned int*)(0x42A63318UL))
#define bM4_DMAC_LLP5_LLP5                              *((volatile unsigned int*)(0x42A6331CUL))
#define bM4_DMAC_LLP5_LLP6                              *((volatile unsigned int*)(0x42A63320UL))
#define bM4_DMAC_LLP5_LLP7                              *((volatile unsigned int*)(0x42A63324UL))
#define bM4_DMAC_LLP5_LLP8                              *((volatile unsigned int*)(0x42A63328UL))
#define bM4_DMAC_LLP5_LLP9                              *((volatile unsigned int*)(0x42A6332CUL))
#define bM4_DMAC_LLP5_LLP10                             *((volatile unsigned int*)(0x42A63330UL))
#define bM4_DMAC_LLP5_LLP11                             *((volatile unsigned int*)(0x42A63334UL))
#define bM4_DMAC_LLP5_LLP12                             *((volatile unsigned int*)(0x42A63338UL))
#define bM4_DMAC_LLP5_LLP13                             *((volatile unsigned int*)(0x42A6333CUL))
#define bM4_DMAC_LLP5_LLP14                             *((volatile unsigned int*)(0x42A63340UL))
#define bM4_DMAC_LLP5_LLP15                             *((volatile unsigned int*)(0x42A63344UL))
#define bM4_DMAC_LLP5_LLP16                             *((volatile unsigned int*)(0x42A63348UL))
#define bM4_DMAC_LLP5_LLP17                             *((volatile unsigned int*)(0x42A6334CUL))
#define bM4_DMAC_LLP5_LLP18                             *((volatile unsigned int*)(0x42A63350UL))
#define bM4_DMAC_LLP5_LLP19                             *((volatile unsigned int*)(0x42A63354UL))
#define bM4_DMAC_LLP5_LLP20                             *((volatile unsigned int*)(0x42A63358UL))
#define bM4_DMAC_LLP5_LLP21                             *((volatile unsigned int*)(0x42A6335CUL))
#define bM4_DMAC_LLP5_LLP22                             *((volatile unsigned int*)(0x42A63360UL))
#define bM4_DMAC_LLP5_LLP23                             *((volatile unsigned int*)(0x42A63364UL))
#define bM4_DMAC_LLP5_LLP24                             *((volatile unsigned int*)(0x42A63368UL))
#define bM4_DMAC_LLP5_LLP25                             *((volatile unsigned int*)(0x42A6336CUL))
#define bM4_DMAC_LLP5_LLP26                             *((volatile unsigned int*)(0x42A63370UL))
#define bM4_DMAC_LLP5_LLP27                             *((volatile unsigned int*)(0x42A63374UL))
#define bM4_DMAC_LLP5_LLP28                             *((volatile unsigned int*)(0x42A63378UL))
#define bM4_DMAC_LLP5_LLP29                             *((volatile unsigned int*)(0x42A6337CUL))
#define bM4_DMAC_CH5CTL_SINC0                           *((volatile unsigned int*)(0x42A63380UL))
#define bM4_DMAC_CH5CTL_SINC1                           *((volatile unsigned int*)(0x42A63384UL))
#define bM4_DMAC_CH5CTL_DINC0                           *((volatile unsigned int*)(0x42A63388UL))
#define bM4_DMAC_CH5CTL_DINC1                           *((volatile unsigned int*)(0x42A6338CUL))
#define bM4_DMAC_CH5CTL_SRTPEN                          *((volatile unsigned int*)(0x42A63390UL))
#define bM4_DMAC_CH5CTL_DRPTEN                          *((volatile unsigned int*)(0x42A63394UL))
#define bM4_DMAC_CH5CTL_SNSEQEN                         *((volatile unsigned int*)(0x42A63398UL))
#define bM4_DMAC_CH5CTL_DNSEQEN                         *((volatile unsigned int*)(0x42A6339CUL))
#define bM4_DMAC_CH5CTL_HSIZE0                          *((volatile unsigned int*)(0x42A633A0UL))
#define bM4_DMAC_CH5CTL_HSIZE1                          *((volatile unsigned int*)(0x42A633A4UL))
#define bM4_DMAC_CH5CTL_LLPEN                           *((volatile unsigned int*)(0x42A633A8UL))
#define bM4_DMAC_CH5CTL_LLPRUN                          *((volatile unsigned int*)(0x42A633ACUL))
#define bM4_DMAC_CH5CTL_IE                              *((volatile unsigned int*)(0x42A633B0UL))
#define bM4_DMAC_CH5CTL_PROT0                           *((volatile unsigned int*)(0x42A633B4UL))
#define bM4_DMAC_CH5CTL_PROT1                           *((volatile unsigned int*)(0x42A633B8UL))
#define bM4_DMAC_CH5CTL_PROT2                           *((volatile unsigned int*)(0x42A633BCUL))
#define bM4_DMAC_DTCTL6_BLKSIZE0                        *((volatile unsigned int*)(0x42A63900UL))
#define bM4_DMAC_DTCTL6_BLKSIZE1                        *((volatile unsigned int*)(0x42A63904UL))
#define bM4_DMAC_DTCTL6_BLKSIZE2                        *((volatile unsigned int*)(0x42A63908UL))
#define bM4_DMAC_DTCTL6_BLKSIZE3                        *((volatile unsigned int*)(0x42A6390CUL))
#define bM4_DMAC_DTCTL6_BLKSIZE4                        *((volatile unsigned int*)(0x42A63910UL))
#define bM4_DMAC_DTCTL6_BLKSIZE5                        *((volatile unsigned int*)(0x42A63914UL))
#define bM4_DMAC_DTCTL6_BLKSIZE6                        *((volatile unsigned int*)(0x42A63918UL))
#define bM4_DMAC_DTCTL6_BLKSIZE7                        *((volatile unsigned int*)(0x42A6391CUL))
#define bM4_DMAC_DTCTL6_BLKSIZE8                        *((volatile unsigned int*)(0x42A63920UL))
#define bM4_DMAC_DTCTL6_BLKSIZE9                        *((volatile unsigned int*)(0x42A63924UL))
#define bM4_DMAC_DTCTL6_CNT0                            *((volatile unsigned int*)(0x42A63940UL))
#define bM4_DMAC_DTCTL6_CNT1                            *((volatile unsigned int*)(0x42A63944UL))
#define bM4_DMAC_DTCTL6_CNT2                            *((volatile unsigned int*)(0x42A63948UL))
#define bM4_DMAC_DTCTL6_CNT3                            *((volatile unsigned int*)(0x42A6394CUL))
#define bM4_DMAC_DTCTL6_CNT4                            *((volatile unsigned int*)(0x42A63950UL))
#define bM4_DMAC_DTCTL6_CNT5                            *((volatile unsigned int*)(0x42A63954UL))
#define bM4_DMAC_DTCTL6_CNT6                            *((volatile unsigned int*)(0x42A63958UL))
#define bM4_DMAC_DTCTL6_CNT7                            *((volatile unsigned int*)(0x42A6395CUL))
#define bM4_DMAC_DTCTL6_CNT8                            *((volatile unsigned int*)(0x42A63960UL))
#define bM4_DMAC_DTCTL6_CNT9                            *((volatile unsigned int*)(0x42A63964UL))
#define bM4_DMAC_DTCTL6_CNT10                           *((volatile unsigned int*)(0x42A63968UL))
#define bM4_DMAC_DTCTL6_CNT11                           *((volatile unsigned int*)(0x42A6396CUL))
#define bM4_DMAC_DTCTL6_CNT12                           *((volatile unsigned int*)(0x42A63970UL))
#define bM4_DMAC_DTCTL6_CNT13                           *((volatile unsigned int*)(0x42A63974UL))
#define bM4_DMAC_DTCTL6_CNT14                           *((volatile unsigned int*)(0x42A63978UL))
#define bM4_DMAC_DTCTL6_CNT15                           *((volatile unsigned int*)(0x42A6397CUL))
#define bM4_DMAC_RPT6_SRPT0                             *((volatile unsigned int*)(0x42A63980UL))
#define bM4_DMAC_RPT6_SRPT1                             *((volatile unsigned int*)(0x42A63984UL))
#define bM4_DMAC_RPT6_SRPT2                             *((volatile unsigned int*)(0x42A63988UL))
#define bM4_DMAC_RPT6_SRPT3                             *((volatile unsigned int*)(0x42A6398CUL))
#define bM4_DMAC_RPT6_SRPT4                             *((volatile unsigned int*)(0x42A63990UL))
#define bM4_DMAC_RPT6_SRPT5                             *((volatile unsigned int*)(0x42A63994UL))
#define bM4_DMAC_RPT6_SRPT6                             *((volatile unsigned int*)(0x42A63998UL))
#define bM4_DMAC_RPT6_SRPT7                             *((volatile unsigned int*)(0x42A6399CUL))
#define bM4_DMAC_RPT6_SRPT8                             *((volatile unsigned int*)(0x42A639A0UL))
#define bM4_DMAC_RPT6_SRPT9                             *((volatile unsigned int*)(0x42A639A4UL))
#define bM4_DMAC_RPT6_DRPT0                             *((volatile unsigned int*)(0x42A639C0UL))
#define bM4_DMAC_RPT6_DRPT1                             *((volatile unsigned int*)(0x42A639C4UL))
#define bM4_DMAC_RPT6_DRPT2                             *((volatile unsigned int*)(0x42A639C8UL))
#define bM4_DMAC_RPT6_DRPT3                             *((volatile unsigned int*)(0x42A639CCUL))
#define bM4_DMAC_RPT6_DRPT4                             *((volatile unsigned int*)(0x42A639D0UL))
#define bM4_DMAC_RPT6_DRPT5                             *((volatile unsigned int*)(0x42A639D4UL))
#define bM4_DMAC_RPT6_DRPT6                             *((volatile unsigned int*)(0x42A639D8UL))
#define bM4_DMAC_RPT6_DRPT7                             *((volatile unsigned int*)(0x42A639DCUL))
#define bM4_DMAC_RPT6_DRPT8                             *((volatile unsigned int*)(0x42A639E0UL))
#define bM4_DMAC_RPT6_DRPT9                             *((volatile unsigned int*)(0x42A639E4UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET0                     *((volatile unsigned int*)(0x42A63A00UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET1                     *((volatile unsigned int*)(0x42A63A04UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET2                     *((volatile unsigned int*)(0x42A63A08UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET3                     *((volatile unsigned int*)(0x42A63A0CUL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET4                     *((volatile unsigned int*)(0x42A63A10UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET5                     *((volatile unsigned int*)(0x42A63A14UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET6                     *((volatile unsigned int*)(0x42A63A18UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET7                     *((volatile unsigned int*)(0x42A63A1CUL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET8                     *((volatile unsigned int*)(0x42A63A20UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET9                     *((volatile unsigned int*)(0x42A63A24UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET10                    *((volatile unsigned int*)(0x42A63A28UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET11                    *((volatile unsigned int*)(0x42A63A2CUL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET12                    *((volatile unsigned int*)(0x42A63A30UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET13                    *((volatile unsigned int*)(0x42A63A34UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET14                    *((volatile unsigned int*)(0x42A63A38UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET15                    *((volatile unsigned int*)(0x42A63A3CUL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET16                    *((volatile unsigned int*)(0x42A63A40UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET17                    *((volatile unsigned int*)(0x42A63A44UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET18                    *((volatile unsigned int*)(0x42A63A48UL))
#define bM4_DMAC_SNSEQCTL6_SOFFSET19                    *((volatile unsigned int*)(0x42A63A4CUL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT0                      *((volatile unsigned int*)(0x42A63A50UL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT1                      *((volatile unsigned int*)(0x42A63A54UL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT2                      *((volatile unsigned int*)(0x42A63A58UL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT3                      *((volatile unsigned int*)(0x42A63A5CUL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT4                      *((volatile unsigned int*)(0x42A63A60UL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT5                      *((volatile unsigned int*)(0x42A63A64UL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT6                      *((volatile unsigned int*)(0x42A63A68UL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT7                      *((volatile unsigned int*)(0x42A63A6CUL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT8                      *((volatile unsigned int*)(0x42A63A70UL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT9                      *((volatile unsigned int*)(0x42A63A74UL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT10                     *((volatile unsigned int*)(0x42A63A78UL))
#define bM4_DMAC_SNSEQCTL6_SNSCNT11                     *((volatile unsigned int*)(0x42A63A7CUL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET0                     *((volatile unsigned int*)(0x42A63A80UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET1                     *((volatile unsigned int*)(0x42A63A84UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET2                     *((volatile unsigned int*)(0x42A63A88UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET3                     *((volatile unsigned int*)(0x42A63A8CUL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET4                     *((volatile unsigned int*)(0x42A63A90UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET5                     *((volatile unsigned int*)(0x42A63A94UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET6                     *((volatile unsigned int*)(0x42A63A98UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET7                     *((volatile unsigned int*)(0x42A63A9CUL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET8                     *((volatile unsigned int*)(0x42A63AA0UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET9                     *((volatile unsigned int*)(0x42A63AA4UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET10                    *((volatile unsigned int*)(0x42A63AA8UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET11                    *((volatile unsigned int*)(0x42A63AACUL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET12                    *((volatile unsigned int*)(0x42A63AB0UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET13                    *((volatile unsigned int*)(0x42A63AB4UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET14                    *((volatile unsigned int*)(0x42A63AB8UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET15                    *((volatile unsigned int*)(0x42A63ABCUL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET16                    *((volatile unsigned int*)(0x42A63AC0UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET17                    *((volatile unsigned int*)(0x42A63AC4UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET18                    *((volatile unsigned int*)(0x42A63AC8UL))
#define bM4_DMAC_DNSEQCTL6_DOFFSET19                    *((volatile unsigned int*)(0x42A63ACCUL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT0                      *((volatile unsigned int*)(0x42A63AD0UL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT1                      *((volatile unsigned int*)(0x42A63AD4UL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT2                      *((volatile unsigned int*)(0x42A63AD8UL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT3                      *((volatile unsigned int*)(0x42A63ADCUL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT4                      *((volatile unsigned int*)(0x42A63AE0UL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT5                      *((volatile unsigned int*)(0x42A63AE4UL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT6                      *((volatile unsigned int*)(0x42A63AE8UL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT7                      *((volatile unsigned int*)(0x42A63AECUL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT8                      *((volatile unsigned int*)(0x42A63AF0UL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT9                      *((volatile unsigned int*)(0x42A63AF4UL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT10                     *((volatile unsigned int*)(0x42A63AF8UL))
#define bM4_DMAC_DNSEQCTL6_DNSCNT11                     *((volatile unsigned int*)(0x42A63AFCUL))
#define bM4_DMAC_LLP6_LLP0                              *((volatile unsigned int*)(0x42A63B08UL))
#define bM4_DMAC_LLP6_LLP1                              *((volatile unsigned int*)(0x42A63B0CUL))
#define bM4_DMAC_LLP6_LLP2                              *((volatile unsigned int*)(0x42A63B10UL))
#define bM4_DMAC_LLP6_LLP3                              *((volatile unsigned int*)(0x42A63B14UL))
#define bM4_DMAC_LLP6_LLP4                              *((volatile unsigned int*)(0x42A63B18UL))
#define bM4_DMAC_LLP6_LLP5                              *((volatile unsigned int*)(0x42A63B1CUL))
#define bM4_DMAC_LLP6_LLP6                              *((volatile unsigned int*)(0x42A63B20UL))
#define bM4_DMAC_LLP6_LLP7                              *((volatile unsigned int*)(0x42A63B24UL))
#define bM4_DMAC_LLP6_LLP8                              *((volatile unsigned int*)(0x42A63B28UL))
#define bM4_DMAC_LLP6_LLP9                              *((volatile unsigned int*)(0x42A63B2CUL))
#define bM4_DMAC_LLP6_LLP10                             *((volatile unsigned int*)(0x42A63B30UL))
#define bM4_DMAC_LLP6_LLP11                             *((volatile unsigned int*)(0x42A63B34UL))
#define bM4_DMAC_LLP6_LLP12                             *((volatile unsigned int*)(0x42A63B38UL))
#define bM4_DMAC_LLP6_LLP13                             *((volatile unsigned int*)(0x42A63B3CUL))
#define bM4_DMAC_LLP6_LLP14                             *((volatile unsigned int*)(0x42A63B40UL))
#define bM4_DMAC_LLP6_LLP15                             *((volatile unsigned int*)(0x42A63B44UL))
#define bM4_DMAC_LLP6_LLP16                             *((volatile unsigned int*)(0x42A63B48UL))
#define bM4_DMAC_LLP6_LLP17                             *((volatile unsigned int*)(0x42A63B4CUL))
#define bM4_DMAC_LLP6_LLP18                             *((volatile unsigned int*)(0x42A63B50UL))
#define bM4_DMAC_LLP6_LLP19                             *((volatile unsigned int*)(0x42A63B54UL))
#define bM4_DMAC_LLP6_LLP20                             *((volatile unsigned int*)(0x42A63B58UL))
#define bM4_DMAC_LLP6_LLP21                             *((volatile unsigned int*)(0x42A63B5CUL))
#define bM4_DMAC_LLP6_LLP22                             *((volatile unsigned int*)(0x42A63B60UL))
#define bM4_DMAC_LLP6_LLP23                             *((volatile unsigned int*)(0x42A63B64UL))
#define bM4_DMAC_LLP6_LLP24                             *((volatile unsigned int*)(0x42A63B68UL))
#define bM4_DMAC_LLP6_LLP25                             *((volatile unsigned int*)(0x42A63B6CUL))
