RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_DMAC_LLP6_LLP26                             *((volatile unsigned int*)(0x42A63B70UL))
#define bM4_DMAC_LLP6_LLP27                             *((volatile unsigned int*)(0x42A63B74UL))
#define bM4_DMAC_LLP6_LLP28                             *((volatile unsigned int*)(0x42A63B78UL))
#define bM4_DMAC_LLP6_LLP29                             *((volatile unsigned int*)(0x42A63B7CUL))
#define bM4_DMAC_CH6CTL_SINC0                           *((volatile unsigned int*)(0x42A63B80UL))
#define bM4_DMAC_CH6CTL_SINC1                           *((volatile unsigned int*)(0x42A63B84UL))
#define bM4_DMAC_CH6CTL_DINC0                           *((volatile unsigned int*)(0x42A63B88UL))
#define bM4_DMAC_CH6CTL_DINC1                           *((volatile unsigned int*)(0x42A63B8CUL))
#define bM4_DMAC_CH6CTL_SRTPEN                          *((volatile unsigned int*)(0x42A63B90UL))
#define bM4_DMAC_CH6CTL_DRPTEN                          *((volatile unsigned int*)(0x42A63B94UL))
#define bM4_DMAC_CH6CTL_SNSEQEN                         *((volatile unsigned int*)(0x42A63B98UL))
#define bM4_DMAC_CH6CTL_DNSEQEN                         *((volatile unsigned int*)(0x42A63B9CUL))
#define bM4_DMAC_CH6CTL_HSIZE0                          *((volatile unsigned int*)(0x42A63BA0UL))
#define bM4_DMAC_CH6CTL_HSIZE1                          *((volatile unsigned int*)(0x42A63BA4UL))
#define bM4_DMAC_CH6CTL_LLPEN                           *((volatile unsigned int*)(0x42A63BA8UL))
#define bM4_DMAC_CH6CTL_LLPRUN                          *((volatile unsigned int*)(0x42A63BACUL))
#define bM4_DMAC_CH6CTL_IE                              *((volatile unsigned int*)(0x42A63BB0UL))
#define bM4_DMAC_CH6CTL_PROT0                           *((volatile unsigned int*)(0x42A63BB4UL))
#define bM4_DMAC_CH6CTL_PROT1                           *((volatile unsigned int*)(0x42A63BB8UL))
#define bM4_DMAC_CH6CTL_PROT2                           *((volatile unsigned int*)(0x42A63BBCUL))
#define bM4_DMAC_DTCTL7_BLKSIZE0                        *((volatile unsigned int*)(0x42A64100UL))
#define bM4_DMAC_DTCTL7_BLKSIZE1                        *((volatile unsigned int*)(0x42A64104UL))
#define bM4_DMAC_DTCTL7_BLKSIZE2                        *((volatile unsigned int*)(0x42A64108UL))
#define bM4_DMAC_DTCTL7_BLKSIZE3                        *((volatile unsigned int*)(0x42A6410CUL))
#define bM4_DMAC_DTCTL7_BLKSIZE4                        *((volatile unsigned int*)(0x42A64110UL))
#define bM4_DMAC_DTCTL7_BLKSIZE5                        *((volatile unsigned int*)(0x42A64114UL))
#define bM4_DMAC_DTCTL7_BLKSIZE6                        *((volatile unsigned int*)(0x42A64118UL))
#define bM4_DMAC_DTCTL7_BLKSIZE7                        *((volatile unsigned int*)(0x42A6411CUL))
#define bM4_DMAC_DTCTL7_BLKSIZE8                        *((volatile unsigned int*)(0x42A64120UL))
#define bM4_DMAC_DTCTL7_BLKSIZE9                        *((volatile unsigned int*)(0x42A64124UL))
#define bM4_DMAC_DTCTL7_CNT0                            *((volatile unsigned int*)(0x42A64140UL))
#define bM4_DMAC_DTCTL7_CNT1                            *((volatile unsigned int*)(0x42A64144UL))
#define bM4_DMAC_DTCTL7_CNT2                            *((volatile unsigned int*)(0x42A64148UL))
#define bM4_DMAC_DTCTL7_CNT3                            *((volatile unsigned int*)(0x42A6414CUL))
#define bM4_DMAC_DTCTL7_CNT4                            *((volatile unsigned int*)(0x42A64150UL))
#define bM4_DMAC_DTCTL7_CNT5                            *((volatile unsigned int*)(0x42A64154UL))
#define bM4_DMAC_DTCTL7_CNT6                            *((volatile unsigned int*)(0x42A64158UL))
#define bM4_DMAC_DTCTL7_CNT7                            *((volatile unsigned int*)(0x42A6415CUL))
#define bM4_DMAC_DTCTL7_CNT8                            *((volatile unsigned int*)(0x42A64160UL))
#define bM4_DMAC_DTCTL7_CNT9                            *((volatile unsigned int*)(0x42A64164UL))
#define bM4_DMAC_DTCTL7_CNT10                           *((volatile unsigned int*)(0x42A64168UL))
#define bM4_DMAC_DTCTL7_CNT11                           *((volatile unsigned int*)(0x42A6416CUL))
#define bM4_DMAC_DTCTL7_CNT12                           *((volatile unsigned int*)(0x42A64170UL))
#define bM4_DMAC_DTCTL7_CNT13                           *((volatile unsigned int*)(0x42A64174UL))
#define bM4_DMAC_DTCTL7_CNT14                           *((volatile unsigned int*)(0x42A64178UL))
#define bM4_DMAC_DTCTL7_CNT15                           *((volatile unsigned int*)(0x42A6417CUL))
#define bM4_DMAC_RPT7_SRPT0                             *((volatile unsigned int*)(0x42A64180UL))
#define bM4_DMAC_RPT7_SRPT1                             *((volatile unsigned int*)(0x42A64184UL))
#define bM4_DMAC_RPT7_SRPT2                             *((volatile unsigned int*)(0x42A64188UL))
#define bM4_DMAC_RPT7_SRPT3                             *((volatile unsigned int*)(0x42A6418CUL))
#define bM4_DMAC_RPT7_SRPT4                             *((volatile unsigned int*)(0x42A64190UL))
#define bM4_DMAC_RPT7_SRPT5                             *((volatile unsigned int*)(0x42A64194UL))
#define bM4_DMAC_RPT7_SRPT6                             *((volatile unsigned int*)(0x42A64198UL))
#define bM4_DMAC_RPT7_SRPT7                             *((volatile unsigned int*)(0x42A6419CUL))
#define bM4_DMAC_RPT7_SRPT8                             *((volatile unsigned int*)(0x42A641A0UL))
#define bM4_DMAC_RPT7_SRPT9                             *((volatile unsigned int*)(0x42A641A4UL))
#define bM4_DMAC_RPT7_DRPT0                             *((volatile unsigned int*)(0x42A641C0UL))
#define bM4_DMAC_RPT7_DRPT1                             *((volatile unsigned int*)(0x42A641C4UL))
#define bM4_DMAC_RPT7_DRPT2                             *((volatile unsigned int*)(0x42A641C8UL))
#define bM4_DMAC_RPT7_DRPT3                             *((volatile unsigned int*)(0x42A641CCUL))
#define bM4_DMAC_RPT7_DRPT4                             *((volatile unsigned int*)(0x42A641D0UL))
#define bM4_DMAC_RPT7_DRPT5                             *((volatile unsigned int*)(0x42A641D4UL))
#define bM4_DMAC_RPT7_DRPT6                             *((volatile unsigned int*)(0x42A641D8UL))
#define bM4_DMAC_RPT7_DRPT7                             *((volatile unsigned int*)(0x42A641DCUL))
#define bM4_DMAC_RPT7_DRPT8                             *((volatile unsigned int*)(0x42A641E0UL))
#define bM4_DMAC_RPT7_DRPT9                             *((volatile unsigned int*)(0x42A641E4UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET0                     *((volatile unsigned int*)(0x42A64200UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET1                     *((volatile unsigned int*)(0x42A64204UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET2                     *((volatile unsigned int*)(0x42A64208UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET3                     *((volatile unsigned int*)(0x42A6420CUL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET4                     *((volatile unsigned int*)(0x42A64210UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET5                     *((volatile unsigned int*)(0x42A64214UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET6                     *((volatile unsigned int*)(0x42A64218UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET7                     *((volatile unsigned int*)(0x42A6421CUL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET8                     *((volatile unsigned int*)(0x42A64220UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET9                     *((volatile unsigned int*)(0x42A64224UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET10                    *((volatile unsigned int*)(0x42A64228UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET11                    *((volatile unsigned int*)(0x42A6422CUL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET12                    *((volatile unsigned int*)(0x42A64230UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET13                    *((volatile unsigned int*)(0x42A64234UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET14                    *((volatile unsigned int*)(0x42A64238UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET15                    *((volatile unsigned int*)(0x42A6423CUL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET16                    *((volatile unsigned int*)(0x42A64240UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET17                    *((volatile unsigned int*)(0x42A64244UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET18                    *((volatile unsigned int*)(0x42A64248UL))
#define bM4_DMAC_SNSEQCTL7_SOFFSET19                    *((volatile unsigned int*)(0x42A6424CUL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT0                      *((volatile unsigned int*)(0x42A64250UL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT1                      *((volatile unsigned int*)(0x42A64254UL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT2                      *((volatile unsigned int*)(0x42A64258UL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT3                      *((volatile unsigned int*)(0x42A6425CUL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT4                      *((volatile unsigned int*)(0x42A64260UL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT5                      *((volatile unsigned int*)(0x42A64264UL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT6                      *((volatile unsigned int*)(0x42A64268UL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT7                      *((volatile unsigned int*)(0x42A6426CUL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT8                      *((volatile unsigned int*)(0x42A64270UL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT9                      *((volatile unsigned int*)(0x42A64274UL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT10                     *((volatile unsigned int*)(0x42A64278UL))
#define bM4_DMAC_SNSEQCTL7_SNSCNT11                     *((volatile unsigned int*)(0x42A6427CUL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET0                     *((volatile unsigned int*)(0x42A64280UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET1                     *((volatile unsigned int*)(0x42A64284UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET2                     *((volatile unsigned int*)(0x42A64288UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET3                     *((volatile unsigned int*)(0x42A6428CUL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET4                     *((volatile unsigned int*)(0x42A64290UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET5                     *((volatile unsigned int*)(0x42A64294UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET6                     *((volatile unsigned int*)(0x42A64298UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET7                     *((volatile unsigned int*)(0x42A6429CUL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET8                     *((volatile unsigned int*)(0x42A642A0UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET9                     *((volatile unsigned int*)(0x42A642A4UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET10                    *((volatile unsigned int*)(0x42A642A8UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET11                    *((volatile unsigned int*)(0x42A642ACUL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET12                    *((volatile unsigned int*)(0x42A642B0UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET13                    *((volatile unsigned int*)(0x42A642B4UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET14                    *((volatile unsigned int*)(0x42A642B8UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET15                    *((volatile unsigned int*)(0x42A642BCUL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET16                    *((volatile unsigned int*)(0x42A642C0UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET17                    *((volatile unsigned int*)(0x42A642C4UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET18                    *((volatile unsigned int*)(0x42A642C8UL))
#define bM4_DMAC_DNSEQCTL7_DOFFSET19                    *((volatile unsigned int*)(0x42A642CCUL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT0                      *((volatile unsigned int*)(0x42A642D0UL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT1                      *((volatile unsigned int*)(0x42A642D4UL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT2                      *((volatile unsigned int*)(0x42A642D8UL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT3                      *((volatile unsigned int*)(0x42A642DCUL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT4                      *((volatile unsigned int*)(0x42A642E0UL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT5                      *((volatile unsigned int*)(0x42A642E4UL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT6                      *((volatile unsigned int*)(0x42A642E8UL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT7                      *((volatile unsigned int*)(0x42A642ECUL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT8                      *((volatile unsigned int*)(0x42A642F0UL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT9                      *((volatile unsigned int*)(0x42A642F4UL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT10                     *((volatile unsigned int*)(0x42A642F8UL))
#define bM4_DMAC_DNSEQCTL7_DNSCNT11                     *((volatile unsigned int*)(0x42A642FCUL))
#define bM4_DMAC_LLP7_LLP0                              *((volatile unsigned int*)(0x42A64308UL))
#define bM4_DMAC_LLP7_LLP1                              *((volatile unsigned int*)(0x42A6430CUL))
#define bM4_DMAC_LLP7_LLP2                              *((volatile unsigned int*)(0x42A64310UL))
#define bM4_DMAC_LLP7_LLP3                              *((volatile unsigned int*)(0x42A64314UL))
#define bM4_DMAC_LLP7_LLP4                              *((volatile unsigned int*)(0x42A64318UL))
#define bM4_DMAC_LLP7_LLP5                              *((volatile unsigned int*)(0x42A6431CUL))
#define bM4_DMAC_LLP7_LLP6                              *((volatile unsigned int*)(0x42A64320UL))
#define bM4_DMAC_LLP7_LLP7                              *((volatile unsigned int*)(0x42A64324UL))
#define bM4_DMAC_LLP7_LLP8                              *((volatile unsigned int*)(0x42A64328UL))
#define bM4_DMAC_LLP7_LLP9                              *((volatile unsigned int*)(0x42A6432CUL))
#define bM4_DMAC_LLP7_LLP10                             *((volatile unsigned int*)(0x42A64330UL))
#define bM4_DMAC_LLP7_LLP11                             *((volatile unsigned int*)(0x42A64334UL))
#define bM4_DMAC_LLP7_LLP12                             *((volatile unsigned int*)(0x42A64338UL))
#define bM4_DMAC_LLP7_LLP13                             *((volatile unsigned int*)(0x42A6433CUL))
#define bM4_DMAC_LLP7_LLP14                             *((volatile unsigned int*)(0x42A64340UL))
#define bM4_DMAC_LLP7_LLP15                             *((volatile unsigned int*)(0x42A64344UL))
#define bM4_DMAC_LLP7_LLP16                             *((volatile unsigned int*)(0x42A64348UL))
#define bM4_DMAC_LLP7_LLP17                             *((volatile unsigned int*)(0x42A6434CUL))
#define bM4_DMAC_LLP7_LLP18                             *((volatile unsigned int*)(0x42A64350UL))
#define bM4_DMAC_LLP7_LLP19                             *((volatile unsigned int*)(0x42A64354UL))
#define bM4_DMAC_LLP7_LLP20                             *((volatile unsigned int*)(0x42A64358UL))
#define bM4_DMAC_LLP7_LLP21                             *((volatile unsigned int*)(0x42A6435CUL))
#define bM4_DMAC_LLP7_LLP22                             *((volatile unsigned int*)(0x42A64360UL))
#define bM4_DMAC_LLP7_LLP23                             *((volatile unsigned int*)(0x42A64364UL))
#define bM4_DMAC_LLP7_LLP24                             *((volatile unsigned int*)(0x42A64368UL))
#define bM4_DMAC_LLP7_LLP25                             *((volatile unsigned int*)(0x42A6436CUL))
#define bM4_DMAC_LLP7_LLP26                             *((volatile unsigned int*)(0x42A64370UL))
#define bM4_DMAC_LLP7_LLP27                             *((volatile unsigned int*)(0x42A64374UL))
#define bM4_DMAC_LLP7_LLP28                             *((volatile unsigned int*)(0x42A64378UL))
#define bM4_DMAC_LLP7_LLP29                             *((volatile unsigned int*)(0x42A6437CUL))
#define bM4_DMAC_CH7CTL_SINC0                           *((volatile unsigned int*)(0x42A64380UL))
#define bM4_DMAC_CH7CTL_SINC1                           *((volatile unsigned int*)(0x42A64384UL))
#define bM4_DMAC_CH7CTL_DINC0                           *((volatile unsigned int*)(0x42A64388UL))
#define bM4_DMAC_CH7CTL_DINC1                           *((volatile unsigned int*)(0x42A6438CUL))
#define bM4_DMAC_CH7CTL_SRTPEN                          *((volatile unsigned int*)(0x42A64390UL))
#define bM4_DMAC_CH7CTL_DRPTEN                          *((volatile unsigned int*)(0x42A64394UL))
#define bM4_DMAC_CH7CTL_SNSEQEN                         *((volatile unsigned int*)(0x42A64398UL))
#define bM4_DMAC_CH7CTL_DNSEQEN                         *((volatile unsigned int*)(0x42A6439CUL))
#define bM4_DMAC_CH7CTL_HSIZE0                          *((volatile unsigned int*)(0x42A643A0UL))
#define bM4_DMAC_CH7CTL_HSIZE1                          *((volatile unsigned int*)(0x42A643A4UL))
#define bM4_DMAC_CH7CTL_LLPEN                           *((volatile unsigned int*)(0x42A643A8UL))
#define bM4_DMAC_CH7CTL_LLPRUN                          *((volatile unsigned int*)(0x42A643ACUL))
#define bM4_DMAC_CH7CTL_IE                              *((volatile unsigned int*)(0x42A643B0UL))
#define bM4_DMAC_CH7CTL_PROT0                           *((volatile unsigned int*)(0x42A643B4UL))
#define bM4_DMAC_CH7CTL_PROT1                           *((volatile unsigned int*)(0x42A643B8UL))
#define bM4_DMAC_CH7CTL_PROT2                           *((volatile unsigned int*)(0x42A643BCUL))
#define bM4_EFM_FSTP_FSTP                               *((volatile unsigned int*)(0x42208080UL))
#define bM4_EFM_FRMC_SLPMD                              *((volatile unsigned int*)(0x42208100UL))
#define bM4_EFM_FRMC_FLWT0                              *((volatile unsigned int*)(0x42208110UL))
#define bM4_EFM_FRMC_FLWT1                              *((volatile unsigned int*)(0x42208114UL))
#define bM4_EFM_FRMC_FLWT2                              *((volatile unsigned int*)(0x42208118UL))
#define bM4_EFM_FRMC_FLWT3                              *((volatile unsigned int*)(0x4220811CUL))
#define bM4_EFM_FRMC_LVRM                               *((volatile unsigned int*)(0x42208120UL))
#define bM4_EFM_FRMC_CACHE                              *((volatile unsigned int*)(0x42208140UL))
#define bM4_EFM_FRMC_PREFETE                            *((volatile unsigned int*)(0x42208144UL))
#define bM4_EFM_FRMC_CRST                               *((volatile unsigned int*)(0x42208160UL))
#define bM4_EFM_FWMC_PEMODE                             *((volatile unsigned int*)(0x42208180UL))
#define bM4_EFM_FWMC_PEMOD0                             *((volatile unsigned int*)(0x42208190UL))
#define bM4_EFM_FWMC_PEMOD1                             *((volatile unsigned int*)(0x42208194UL))
#define bM4_EFM_FWMC_PEMOD2                             *((volatile unsigned int*)(0x42208198UL))
#define bM4_EFM_FSR_PEWERR                              *((volatile unsigned int*)(0x42208200UL))
#define bM4_EFM_FSR_PEPRTERR                            *((volatile unsigned int*)(0x42208204UL))
#define bM4_EFM_FSR_PGSZERR                             *((volatile unsigned int*)(0x42208208UL))
#define bM4_EFM_FSR_PGMISMTCH                           *((volatile unsigned int*)(0x4220820CUL))
#define bM4_EFM_FSR_OPTEND                              *((volatile unsigned int*)(0x42208210UL))
#define bM4_EFM_FSR_RDCOLERR                            *((volatile unsigned int*)(0x42208214UL))
#define bM4_EFM_FSR_RDY                                 *((volatile unsigned int*)(0x42208220UL))
#define bM4_EFM_FSCLR_PEWERRCLR                         *((volatile unsigned int*)(0x42208280UL))
#define bM4_EFM_FSCLR_PEPRTERRCLR                       *((volatile unsigned int*)(0x42208284UL))
#define bM4_EFM_FSCLR_PGSZERRCLR                        *((volatile unsigned int*)(0x42208288UL))
#define bM4_EFM_FSCLR_PGMISMTCHCLR                      *((volatile unsigned int*)(0x4220828CUL))
#define bM4_EFM_FSCLR_OPTENDCLR                         *((volatile unsigned int*)(0x42208290UL))
#define bM4_EFM_FSCLR_RDCOLERRCLR                       *((volatile unsigned int*)(0x42208294UL))
#define bM4_EFM_FITE_PEERRITE                           *((volatile unsigned int*)(0x42208300UL))
#define bM4_EFM_FITE_OPTENDITE                          *((volatile unsigned int*)(0x42208304UL))
#define bM4_EFM_FITE_RDCOLERRITE                        *((volatile unsigned int*)(0x42208308UL))
#define bM4_EFM_FSWP_FSWP                               *((volatile unsigned int*)(0x42208380UL))
#define bM4_EFM_FPMTSW_FPMTSW0                          *((volatile unsigned int*)(0x42208400UL))
#define bM4_EFM_FPMTSW_FPMTSW1                          *((volatile unsigned int*)(0x42208404UL))
#define bM4_EFM_FPMTSW_FPMTSW2                          *((volatile unsigned int*)(0x42208408UL))
#define bM4_EFM_FPMTSW_FPMTSW3                          *((volatile unsigned int*)(0x4220840CUL))
#define bM4_EFM_FPMTSW_FPMTSW4                          *((volatile unsigned int*)(0x42208410UL))
#define bM4_EFM_FPMTSW_FPMTSW5                          *((volatile unsigned int*)(0x42208414UL))
#define bM4_EFM_FPMTSW_FPMTSW6                          *((volatile unsigned int*)(0x42208418UL))
#define bM4_EFM_FPMTSW_FPMTSW7                          *((volatile unsigned int*)(0x4220841CUL))
#define bM4_EFM_FPMTSW_FPMTSW8                          *((volatile unsigned int*)(0x42208420UL))
#define bM4_EFM_FPMTSW_FPMTSW9                          *((volatile unsigned int*)(0x42208424UL))
#define bM4_EFM_FPMTSW_FPMTSW10                         *((volatile unsigned int*)(0x42208428UL))
#define bM4_EFM_FPMTSW_FPMTSW11                         *((volatile unsigned int*)(0x4220842CUL))
#define bM4_EFM_FPMTSW_FPMTSW12                         *((volatile unsigned int*)(0x42208430UL))
#define bM4_EFM_FPMTSW_FPMTSW13                         *((volatile unsigned int*)(0x42208434UL))
#define bM4_EFM_FPMTSW_FPMTSW14                         *((volatile unsigned int*)(0x42208438UL))
#define bM4_EFM_FPMTSW_FPMTSW15                         *((volatile unsigned int*)(0x4220843CUL))
#define bM4_EFM_FPMTSW_FPMTSW16                         *((volatile unsigned int*)(0x42208440UL))
#define bM4_EFM_FPMTSW_FPMTSW17                         *((volatile unsigned int*)(0x42208444UL))
#define bM4_EFM_FPMTSW_FPMTSW18                         *((volatile unsigned int*)(0x42208448UL))
#define bM4_EFM_FPMTSW_FPMTSW19                         *((volatile unsigned int*)(0x4220844CUL))
#define bM4_EFM_FPMTSW_RESV0                            *((volatile unsigned int*)(0x42208460UL))
#define bM4_EFM_FPMTEW_FPMTEW0                          *((volatile unsigned int*)(0x42208480UL))
#define bM4_EFM_FPMTEW_FPMTEW1                          *((volatile unsigned int*)(0x42208484UL))
#define bM4_EFM_FPMTEW_FPMTEW2                          *((volatile unsigned int*)(0x42208488UL))
#define bM4_EFM_FPMTEW_FPMTEW3                          *((volatile unsigned int*)(0x4220848CUL))
#define bM4_EFM_FPMTEW_FPMTEW4                          *((volatile unsigned int*)(0x42208490UL))
#define bM4_EFM_FPMTEW_FPMTEW5                          *((volatile unsigned int*)(0x42208494UL))
#define bM4_EFM_FPMTEW_FPMTEW6                          *((volatile unsigned int*)(0x42208498UL))
#define bM4_EFM_FPMTEW_FPMTEW7                          *((volatile unsigned int*)(0x4220849CUL))
#define bM4_EFM_FPMTEW_FPMTEW8                          *((volatile unsigned int*)(0x422084A0UL))
#define bM4_EFM_FPMTEW_FPMTEW9                          *((volatile unsigned int*)(0x422084A4UL))
#define bM4_EFM_FPMTEW_FPMTEW10                         *((volatile unsigned int*)(0x422084A8UL))
#define bM4_EFM_FPMTEW_FPMTEW11                         *((volatile unsigned int*)(0x422084ACUL))
#define bM4_EFM_FPMTEW_FPMTEW12                         *((volatile unsigned int*)(0x422084B0UL))
#define bM4_EFM_FPMTEW_FPMTEW13                         *((volatile unsigned int*)(0x422084B4UL))
#define bM4_EFM_FPMTEW_FPMTEW14                         *((volatile unsigned int*)(0x422084B8UL))
#define bM4_EFM_FPMTEW_FPMTEW15                         *((volatile unsigned int*)(0x422084BCUL))
