RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EFM_FPMTEW_FPMTEW16                         *((volatile unsigned int*)(0x422084C0UL))
#define bM4_EFM_FPMTEW_FPMTEW17                         *((volatile unsigned int*)(0x422084C4UL))
#define bM4_EFM_FPMTEW_FPMTEW18                         *((volatile unsigned int*)(0x422084C8UL))
#define bM4_EFM_FPMTEW_FPMTEW19                         *((volatile unsigned int*)(0x422084CCUL))
#define bM4_EFM_FPMTEW_RESV1                            *((volatile unsigned int*)(0x422084E0UL))
#define bM4_EFM_REMCR0_RM0SIZE0                         *((volatile unsigned int*)(0x4220A080UL))
#define bM4_EFM_REMCR0_RM0SIZE1                         *((volatile unsigned int*)(0x4220A084UL))
#define bM4_EFM_REMCR0_RM0SIZE2                         *((volatile unsigned int*)(0x4220A088UL))
#define bM4_EFM_REMCR0_RM0SIZE3                         *((volatile unsigned int*)(0x4220A08CUL))
#define bM4_EFM_REMCR0_RM0SIZE4                         *((volatile unsigned int*)(0x4220A090UL))
#define bM4_EFM_REMCR0_RM0TADDR0                        *((volatile unsigned int*)(0x4220A0B0UL))
#define bM4_EFM_REMCR0_RM0TADDR1                        *((volatile unsigned int*)(0x4220A0B4UL))
#define bM4_EFM_REMCR0_RM0TADDR2                        *((volatile unsigned int*)(0x4220A0B8UL))
#define bM4_EFM_REMCR0_RM0TADDR3                        *((volatile unsigned int*)(0x4220A0BCUL))
#define bM4_EFM_REMCR0_RM0TADDR4                        *((volatile unsigned int*)(0x4220A0C0UL))
#define bM4_EFM_REMCR0_RM0TADDR5                        *((volatile unsigned int*)(0x4220A0C4UL))
#define bM4_EFM_REMCR0_RM0TADDR6                        *((volatile unsigned int*)(0x4220A0C8UL))
#define bM4_EFM_REMCR0_RM0TADDR7                        *((volatile unsigned int*)(0x4220A0CCUL))
#define bM4_EFM_REMCR0_RM0TADDR8                        *((volatile unsigned int*)(0x4220A0D0UL))
#define bM4_EFM_REMCR0_RM0TADDR9                        *((volatile unsigned int*)(0x4220A0D4UL))
#define bM4_EFM_REMCR0_RM0TADDR10                       *((volatile unsigned int*)(0x4220A0D8UL))
#define bM4_EFM_REMCR0_RM0TADDR11                       *((volatile unsigned int*)(0x4220A0DCUL))
#define bM4_EFM_REMCR0_RM0TADDR12                       *((volatile unsigned int*)(0x4220A0E0UL))
#define bM4_EFM_REMCR0_RM0TADDR13                       *((volatile unsigned int*)(0x4220A0E4UL))
#define bM4_EFM_REMCR0_RM0TADDR14                       *((volatile unsigned int*)(0x4220A0E8UL))
#define bM4_EFM_REMCR0_RM0TADDR15                       *((volatile unsigned int*)(0x4220A0ECUL))
#define bM4_EFM_REMCR0_RM0TADDR16                       *((volatile unsigned int*)(0x4220A0F0UL))
#define bM4_EFM_REMCR0_EN0                              *((volatile unsigned int*)(0x4220A0FCUL))
#define bM4_EFM_REMCR1_RM1SIZE0                         *((volatile unsigned int*)(0x4220A100UL))
#define bM4_EFM_REMCR1_RM1SIZE1                         *((volatile unsigned int*)(0x4220A104UL))
#define bM4_EFM_REMCR1_RM1SIZE2                         *((volatile unsigned int*)(0x4220A108UL))
#define bM4_EFM_REMCR1_RM1SIZE3                         *((volatile unsigned int*)(0x4220A10CUL))
#define bM4_EFM_REMCR1_RM1SIZE4                         *((volatile unsigned int*)(0x4220A110UL))
#define bM4_EFM_REMCR1_RM1TADDR0                        *((volatile unsigned int*)(0x4220A130UL))
#define bM4_EFM_REMCR1_RM1TADDR1                        *((volatile unsigned int*)(0x4220A134UL))
#define bM4_EFM_REMCR1_RM1TADDR2                        *((volatile unsigned int*)(0x4220A138UL))
#define bM4_EFM_REMCR1_RM1TADDR3                        *((volatile unsigned int*)(0x4220A13CUL))
#define bM4_EFM_REMCR1_RM1TADDR4                        *((volatile unsigned int*)(0x4220A140UL))
#define bM4_EFM_REMCR1_RM1TADDR5                        *((volatile unsigned int*)(0x4220A144UL))
#define bM4_EFM_REMCR1_RM1TADDR6                        *((volatile unsigned int*)(0x4220A148UL))
#define bM4_EFM_REMCR1_RM1TADDR7                        *((volatile unsigned int*)(0x4220A14CUL))
#define bM4_EFM_REMCR1_RM1TADDR8                        *((volatile unsigned int*)(0x4220A150UL))
#define bM4_EFM_REMCR1_RM1TADDR9                        *((volatile unsigned int*)(0x4220A154UL))
#define bM4_EFM_REMCR1_RM1TADDR10                       *((volatile unsigned int*)(0x4220A158UL))
#define bM4_EFM_REMCR1_RM1TADDR11                       *((volatile unsigned int*)(0x4220A15CUL))
#define bM4_EFM_REMCR1_RM1TADDR12                       *((volatile unsigned int*)(0x4220A160UL))
#define bM4_EFM_REMCR1_RM1TADDR13                       *((volatile unsigned int*)(0x4220A164UL))
#define bM4_EFM_REMCR1_RM1TADDR14                       *((volatile unsigned int*)(0x4220A168UL))
#define bM4_EFM_REMCR1_RM1TADDR15                       *((volatile unsigned int*)(0x4220A16CUL))
#define bM4_EFM_REMCR1_RM1TADDR16                       *((volatile unsigned int*)(0x4220A170UL))
#define bM4_EFM_REMCR1_EN1                              *((volatile unsigned int*)(0x4220A17CUL))
#define bM4_EFMD_DFSTP_FSTP                             *((volatile unsigned int*)(0x42200080UL))
#define bM4_EFMD_DFRMC_SLPMD                            *((volatile unsigned int*)(0x42200100UL))
#define bM4_EFMD_DFRMC_FLWT0                            *((volatile unsigned int*)(0x42200110UL))
#define bM4_EFMD_DFRMC_FLWT1                            *((volatile unsigned int*)(0x42200114UL))
#define bM4_EFMD_DFRMC_FLWT2                            *((volatile unsigned int*)(0x42200118UL))
#define bM4_EFMD_DFRMC_FLWT3                            *((volatile unsigned int*)(0x4220011CUL))
#define bM4_EFMD_DFRMC_LVRM                             *((volatile unsigned int*)(0x42200120UL))
#define bM4_EFMD_DFWMC_PEMODE                           *((volatile unsigned int*)(0x42200180UL))
#define bM4_EFMD_DFWMC_PEMOD0                           *((volatile unsigned int*)(0x42200190UL))
#define bM4_EFMD_DFWMC_PEMOD1                           *((volatile unsigned int*)(0x42200194UL))
#define bM4_EFMD_DFWMC_PEMOD2                           *((volatile unsigned int*)(0x42200198UL))
#define bM4_EFMD_DFSR_PEWERR                            *((volatile unsigned int*)(0x42200200UL))
#define bM4_EFMD_DFSR_PGSZERR                           *((volatile unsigned int*)(0x42200208UL))
#define bM4_EFMD_DFSR_PGMISMTCH                         *((volatile unsigned int*)(0x4220020CUL))
#define bM4_EFMD_DFSR_OPTEND                            *((volatile unsigned int*)(0x42200210UL))
#define bM4_EFMD_DFSR_RDCOLERR                          *((volatile unsigned int*)(0x42200214UL))
#define bM4_EFMD_DFSR_RDY                               *((volatile unsigned int*)(0x42200220UL))
#define bM4_EFMD_DFSCLR_PEWERRCLR                       *((volatile unsigned int*)(0x42200280UL))
#define bM4_EFMD_DFSCLR_PGSZERRCLR                      *((volatile unsigned int*)(0x42200288UL))
#define bM4_EFMD_DFSCLR_PGMISMTCHCLR                    *((volatile unsigned int*)(0x4220028CUL))
#define bM4_EFMD_DFSCLR_OPTENDCLR                       *((volatile unsigned int*)(0x42200290UL))
#define bM4_EFMD_DFSCLR_RDCOLERRCLR                     *((volatile unsigned int*)(0x42200294UL))
#define bM4_EFMD_DFITE_PEERRITE                         *((volatile unsigned int*)(0x42200300UL))
#define bM4_EFMD_DFITE_OPTENDITE                        *((volatile unsigned int*)(0x42200304UL))
#define bM4_EFMD_DFITE_RDCOLERRITE                      *((volatile unsigned int*)(0x42200308UL))
#define bM4_EMB_CTL0_PORTINEN                           *((volatile unsigned int*)(0x42378000UL))
#define bM4_EMB_CTL0_CMPEN0                             *((volatile unsigned int*)(0x42378004UL))
#define bM4_EMB_CTL0_CMPEN1                             *((volatile unsigned int*)(0x42378008UL))
#define bM4_EMB_CTL0_CMPEN2                             *((volatile unsigned int*)(0x4237800CUL))
#define bM4_EMB_CTL0_CMPEN3                             *((volatile unsigned int*)(0x42378010UL))
#define bM4_EMB_CTL0_OSCSTPEN                           *((volatile unsigned int*)(0x42378014UL))
#define bM4_EMB_CTL0_PWMSEL0                            *((volatile unsigned int*)(0x42378018UL))
#define bM4_EMB_CTL0_PWMSEL1                            *((volatile unsigned int*)(0x4237801CUL))
#define bM4_EMB_CTL0_PWMSEL2                            *((volatile unsigned int*)(0x42378020UL))
#define bM4_EMB_CTL0_PWMSEL3                            *((volatile unsigned int*)(0x42378024UL))
#define bM4_EMB_CTL0_PWMSEL4                            *((volatile unsigned int*)(0x42378028UL))
#define bM4_EMB_CTL0_PWMSEL5                            *((volatile unsigned int*)(0x4237802CUL))
#define bM4_EMB_CTL0_PWMSEL6                            *((volatile unsigned int*)(0x42378030UL))
#define bM4_EMB_CTL0_PWMSEL7                            *((volatile unsigned int*)(0x42378034UL))
#define bM4_EMB_CTL0_PWMSEL8                            *((volatile unsigned int*)(0x42378038UL))
#define bM4_EMB_CTL0_PWMSEL9                            *((volatile unsigned int*)(0x4237803CUL))
#define bM4_EMB_CTL0_PWMSEL10                           *((volatile unsigned int*)(0x42378040UL))
#define bM4_EMB_CTL0_PWMSEL11                           *((volatile unsigned int*)(0x42378044UL))
#define bM4_EMB_CTL0_PWMSEL12                           *((volatile unsigned int*)(0x42378048UL))
#define bM4_EMB_CTL0_NFSEL0                             *((volatile unsigned int*)(0x42378070UL))
#define bM4_EMB_CTL0_NFSEL1                             *((volatile unsigned int*)(0x42378074UL))
#define bM4_EMB_CTL0_NFEN                               *((volatile unsigned int*)(0x42378078UL))
#define bM4_EMB_CTL0_INVSEL                             *((volatile unsigned int*)(0x4237807CUL))
#define bM4_EMB_PWMLV0_PWMLV0                           *((volatile unsigned int*)(0x42378080UL))
#define bM4_EMB_PWMLV0_PWMLV1                           *((volatile unsigned int*)(0x42378084UL))
#define bM4_EMB_PWMLV0_PWMLV2                           *((volatile unsigned int*)(0x42378088UL))
#define bM4_EMB_PWMLV0_PWMLV3                           *((volatile unsigned int*)(0x4237808CUL))
#define bM4_EMB_PWMLV0_PWMLV4                           *((volatile unsigned int*)(0x42378090UL))
#define bM4_EMB_PWMLV0_PWMLV5                           *((volatile unsigned int*)(0x42378094UL))
#define bM4_EMB_PWMLV0_PWMLV6                           *((volatile unsigned int*)(0x42378098UL))
#define bM4_EMB_PWMLV0_PWMLV7                           *((volatile unsigned int*)(0x4237809CUL))
#define bM4_EMB_PWMLV0_PWMLV8                           *((volatile unsigned int*)(0x423780A0UL))
#define bM4_EMB_PWMLV0_PWMLV9                           *((volatile unsigned int*)(0x423780A4UL))
#define bM4_EMB_PWMLV0_PWMLV10                          *((volatile unsigned int*)(0x423780A8UL))
#define bM4_EMB_PWMLV0_PWMLV11                          *((volatile unsigned int*)(0x423780ACUL))
#define bM4_EMB_PWMLV0_PWMLV12                          *((volatile unsigned int*)(0x423780B0UL))
#define bM4_EMB_PWMLV0_RESV                             *((volatile unsigned int*)(0x423780FCUL))
#define bM4_EMB_SOE0_SOE                                *((volatile unsigned int*)(0x42378100UL))
#define bM4_EMB_SOE0_RESV                               *((volatile unsigned int*)(0x4237817CUL))
#define bM4_EMB_STAT0_PORTINF                           *((volatile unsigned int*)(0x42378180UL))
#define bM4_EMB_STAT0_PWMSF                             *((volatile unsigned int*)(0x42378184UL))
#define bM4_EMB_STAT0_CMPF                              *((volatile unsigned int*)(0x42378188UL))
#define bM4_EMB_STAT0_OSF                               *((volatile unsigned int*)(0x4237818CUL))
#define bM4_EMB_STAT0_PORTINST                          *((volatile unsigned int*)(0x42378190UL))
#define bM4_EMB_STAT0_PWMST                             *((volatile unsigned int*)(0x42378194UL))
#define bM4_EMB_STAT0_RESV                              *((volatile unsigned int*)(0x423781FCUL))
#define bM4_EMB_STATCLR0_PORTINFCLR                     *((volatile unsigned int*)(0x42378200UL))
#define bM4_EMB_STATCLR0_PWMSFCLR                       *((volatile unsigned int*)(0x42378204UL))
#define bM4_EMB_STATCLR0_CMPFCLR                        *((volatile unsigned int*)(0x42378208UL))
#define bM4_EMB_STATCLR0_OSFCLR                         *((volatile unsigned int*)(0x4237820CUL))
#define bM4_EMB_STATCLR0_RESV                           *((volatile unsigned int*)(0x4237827CUL))
#define bM4_EMB_INTEN0_PORTINTEN                        *((volatile unsigned int*)(0x42378280UL))
#define bM4_EMB_INTEN0_PWMINTEN                         *((volatile unsigned int*)(0x42378284UL))
#define bM4_EMB_INTEN0_CMPINTEN                         *((volatile unsigned int*)(0x42378288UL))
#define bM4_EMB_INTEN0_OSINTEN                          *((volatile unsigned int*)(0x4237828CUL))
#define bM4_EMB_INTEN0_RESV                             *((volatile unsigned int*)(0x423782FCUL))
#define bM4_EMB_STATCLR1_PORTINFCLR                     *((volatile unsigned int*)(0x42378400UL))
#define bM4_EMB_STATCLR1_PWMSFCLR                       *((volatile unsigned int*)(0x42378404UL))
#define bM4_EMB_STATCLR1_CMPFCLR                        *((volatile unsigned int*)(0x42378408UL))
#define bM4_EMB_STATCLR1_OSFCLR                         *((volatile unsigned int*)(0x4237840CUL))
#define bM4_EMB_STATCLR1_RESV                           *((volatile unsigned int*)(0x4237847CUL))
#define bM4_EMB_PWMLV1_PWMLV0                           *((volatile unsigned int*)(0x42378480UL))
#define bM4_EMB_PWMLV1_PWMLV1                           *((volatile unsigned int*)(0x42378484UL))
#define bM4_EMB_PWMLV1_PWMLV2                           *((volatile unsigned int*)(0x42378488UL))
#define bM4_EMB_PWMLV1_PWMLV3                           *((volatile unsigned int*)(0x4237848CUL))
#define bM4_EMB_PWMLV1_PWMLV4                           *((volatile unsigned int*)(0x42378490UL))
#define bM4_EMB_PWMLV1_PWMLV5                           *((volatile unsigned int*)(0x42378494UL))
#define bM4_EMB_PWMLV1_PWMLV6                           *((volatile unsigned int*)(0x42378498UL))
#define bM4_EMB_PWMLV1_PWMLV7                           *((volatile unsigned int*)(0x4237849CUL))
#define bM4_EMB_PWMLV1_PWMLV8                           *((volatile unsigned int*)(0x423784A0UL))
#define bM4_EMB_PWMLV1_PWMLV9                           *((volatile unsigned int*)(0x423784A4UL))
#define bM4_EMB_PWMLV1_RESV                             *((volatile unsigned int*)(0x423784FCUL))
#define bM4_EMB_SOE1_SOE                                *((volatile unsigned int*)(0x42378500UL))
#define bM4_EMB_SOE1_RESV                               *((volatile unsigned int*)(0x4237857CUL))
#define bM4_EMB_STAT1_PORTINF                           *((volatile unsigned int*)(0x42378580UL))
#define bM4_EMB_STAT1_PWMSF                             *((volatile unsigned int*)(0x42378584UL))
#define bM4_EMB_STAT1_CMPF                              *((volatile unsigned int*)(0x42378588UL))
#define bM4_EMB_STAT1_OSF                               *((volatile unsigned int*)(0x4237858CUL))
#define bM4_EMB_STAT1_PORTINST                          *((volatile unsigned int*)(0x42378590UL))
#define bM4_EMB_STAT1_PWMST                             *((volatile unsigned int*)(0x42378594UL))
#define bM4_EMB_STAT1_RESV                              *((volatile unsigned int*)(0x423785FCUL))
#define bM4_EMB_INTEN1_PORTINTEN                        *((volatile unsigned int*)(0x42378680UL))
#define bM4_EMB_INTEN1_PWMINTEN                         *((volatile unsigned int*)(0x42378684UL))
#define bM4_EMB_INTEN1_CMPINTEN                         *((volatile unsigned int*)(0x42378688UL))
#define bM4_EMB_INTEN1_OSINTEN                          *((volatile unsigned int*)(0x4237868CUL))
#define bM4_EMB_INTEN1_RESV                             *((volatile unsigned int*)(0x423786FCUL))
#define bM4_EMB_CTL2_PORTINEN                           *((volatile unsigned int*)(0x42378800UL))
#define bM4_EMB_CTL2_CMPEN0                             *((volatile unsigned int*)(0x42378804UL))
#define bM4_EMB_CTL2_CMPEN1                             *((volatile unsigned int*)(0x42378808UL))
#define bM4_EMB_CTL2_CMPEN2                             *((volatile unsigned int*)(0x4237880CUL))
#define bM4_EMB_CTL2_CMPEN3                             *((volatile unsigned int*)(0x42378810UL))
#define bM4_EMB_CTL2_OSCSTPEN                           *((volatile unsigned int*)(0x42378814UL))
#define bM4_EMB_CTL2_PWMSEL0                            *((volatile unsigned int*)(0x42378818UL))
#define bM4_EMB_CTL2_PWMSEL1                            *((volatile unsigned int*)(0x4237881CUL))
#define bM4_EMB_CTL2_PWMSEL2                            *((volatile unsigned int*)(0x42378820UL))
#define bM4_EMB_CTL2_PWMSEL3                            *((volatile unsigned int*)(0x42378824UL))
#define bM4_EMB_CTL2_PWMSEL4                            *((volatile unsigned int*)(0x42378828UL))
#define bM4_EMB_CTL2_PWMSEL5                            *((volatile unsigned int*)(0x4237882CUL))
#define bM4_EMB_CTL2_PWMSEL6                            *((volatile unsigned int*)(0x42378830UL))
#define bM4_EMB_CTL2_PWMSEL7                            *((volatile unsigned int*)(0x42378834UL))
#define bM4_EMB_CTL2_PWMSEL8                            *((volatile unsigned int*)(0x42378838UL))
#define bM4_EMB_CTL2_PWMSEL9                            *((volatile unsigned int*)(0x4237883CUL))
#define bM4_EMB_CTL2_NFSEL0                             *((volatile unsigned int*)(0x42378870UL))
#define bM4_EMB_CTL2_NFSEL1                             *((volatile unsigned int*)(0x42378874UL))
#define bM4_EMB_CTL2_NFEN                               *((volatile unsigned int*)(0x42378878UL))
#define bM4_EMB_CTL2_INVSEL                             *((volatile unsigned int*)(0x4237887CUL))
#define bM4_EMB_PWMLV2_PWMLV0                           *((volatile unsigned int*)(0x42378880UL))
#define bM4_EMB_PWMLV2_PWMLV1                           *((volatile unsigned int*)(0x42378884UL))
#define bM4_EMB_PWMLV2_PWMLV2                           *((volatile unsigned int*)(0x42378888UL))
#define bM4_EMB_PWMLV2_PWMLV3                           *((volatile unsigned int*)(0x4237888CUL))
#define bM4_EMB_PWMLV2_PWMLV4                           *((volatile unsigned int*)(0x42378890UL))
#define bM4_EMB_PWMLV2_PWMLV5                           *((volatile unsigned int*)(0x42378894UL))
#define bM4_EMB_PWMLV2_PWMLV6                           *((volatile unsigned int*)(0x42378898UL))
#define bM4_EMB_PWMLV2_PWMLV7                           *((volatile unsigned int*)(0x4237889CUL))
#define bM4_EMB_PWMLV2_PWMLV8                           *((volatile unsigned int*)(0x423788A0UL))
#define bM4_EMB_PWMLV2_PWMLV9                           *((volatile unsigned int*)(0x423788A4UL))
#define bM4_EMB_PWMLV2_RESV                             *((volatile unsigned int*)(0x423788FCUL))
#define bM4_EMB_SOE2_SOE                                *((volatile unsigned int*)(0x42378900UL))
#define bM4_EMB_SOE2_RESV                               *((volatile unsigned int*)(0x4237897CUL))
#define bM4_EMB_STAT2_PORTINF                           *((volatile unsigned int*)(0x42378980UL))
#define bM4_EMB_STAT2_PWMSF                             *((volatile unsigned int*)(0x42378984UL))
#define bM4_EMB_STAT2_CMPF                              *((volatile unsigned int*)(0x42378988UL))
#define bM4_EMB_STAT2_OSF                               *((volatile unsigned int*)(0x4237898CUL))
#define bM4_EMB_STAT2_PORTINST                          *((volatile unsigned int*)(0x42378990UL))
#define bM4_EMB_STAT2_PWMST                             *((volatile unsigned int*)(0x42378994UL))
#define bM4_EMB_STAT2_RESV                              *((volatile unsigned int*)(0x423789FCUL))
#define bM4_EMB_STATCLR2_PORTINFCLR                     *((volatile unsigned int*)(0x42378A00UL))
#define bM4_EMB_STATCLR2_PWMSFCLR                       *((volatile unsigned int*)(0x42378A04UL))
#define bM4_EMB_STATCLR2_CMPFCLR                        *((volatile unsigned int*)(0x42378A08UL))
#define bM4_EMB_STATCLR2_OSFCLR                         *((volatile unsigned int*)(0x42378A0CUL))
#define bM4_EMB_STATCLR2_RESV                           *((volatile unsigned int*)(0x42378A7CUL))
#define bM4_EMB_INTEN2_PORTINTEN                        *((volatile unsigned int*)(0x42378A80UL))
#define bM4_EMB_INTEN2_PWMINTEN                         *((volatile unsigned int*)(0x42378A84UL))
#define bM4_EMB_INTEN2_CMPINTEN                         *((volatile unsigned int*)(0x42378A88UL))
#define bM4_EMB_INTEN2_OSINTEN                          *((volatile unsigned int*)(0x42378A8CUL))
#define bM4_EMB_INTEN2_RESV                             *((volatile unsigned int*)(0x42378AFCUL))
#define bM4_EMB_CTL3_PORTINEN                           *((volatile unsigned int*)(0x42378C00UL))
#define bM4_EMB_CTL3_CMPEN0                             *((volatile unsigned int*)(0x42378C04UL))
#define bM4_EMB_CTL3_CMPEN1                             *((volatile unsigned int*)(0x42378C08UL))
#define bM4_EMB_CTL3_CMPEN2                             *((volatile unsigned int*)(0x42378C0CUL))
#define bM4_EMB_CTL3_CMPEN3                             *((volatile unsigned int*)(0x42378C10UL))
#define bM4_EMB_CTL3_OSCSTPEN                           *((volatile unsigned int*)(0x42378C14UL))
#define bM4_EMB_CTL3_PWMSEL0                            *((volatile unsigned int*)(0x42378C18UL))
#define bM4_EMB_CTL3_PWMSEL1                            *((volatile unsigned int*)(0x42378C1CUL))
#define bM4_EMB_CTL3_PWMSEL2                            *((volatile unsigned int*)(0x42378C20UL))
#define bM4_EMB_CTL3_PWMSEL3                            *((volatile unsigned int*)(0x42378C24UL))
#define bM4_EMB_CTL3_PWMSEL4                            *((volatile unsigned int*)(0x42378C28UL))
#define bM4_EMB_CTL3_PWMSEL5                            *((volatile unsigned int*)(0x42378C2CUL))
#define bM4_EMB_CTL3_PWMSEL6                            *((volatile unsigned int*)(0x42378C30UL))
#define bM4_EMB_CTL3_PWMSEL7                            *((volatile unsigned int*)(0x42378C34UL))
#define bM4_EMB_CTL3_PWMSEL8                            *((volatile unsigned int*)(0x42378C38UL))
#define bM4_EMB_CTL3_PWMSEL9                            *((volatile unsigned int*)(0x42378C3CUL))
#define bM4_EMB_CTL3_NFSEL0                             *((volatile unsigned int*)(0x42378C70UL))
#define bM4_EMB_CTL3_NFSEL1                             *((volatile unsigned int*)(0x42378C74UL))
#define bM4_EMB_CTL3_NFEN                               *((volatile unsigned int*)(0x42378C78UL))
#define bM4_EMB_CTL3_INVSEL                             *((volatile unsigned int*)(0x42378C7CUL))
#define bM4_EMB_PWMLV3_PWMLV0                           *((volatile unsigned int*)(0x42378C80UL))
#define bM4_EMB_PWMLV3_PWMLV1                           *((volatile unsigned int*)(0x42378C84UL))
#define bM4_EMB_PWMLV3_PWMLV2                           *((volatile unsigned int*)(0x42378C88UL))
#define bM4_EMB_PWMLV3_PWMLV3                           *((volatile unsigned int*)(0x42378C8CUL))
#define bM4_EMB_PWMLV3_PWMLV4                           *((volatile unsigned int*)(0x42378C90UL))
#define bM4_EMB_PWMLV3_PWMLV5                           *((volatile unsigned int*)(0x42378C94UL))
#define bM4_EMB_PWMLV3_PWMLV6                           *((volatile unsigned int*)(0x42378C98UL))
#define bM4_EMB_PWMLV3_PWMLV7                           *((volatile unsigned int*)(0x42378C9CUL))
#define bM4_EMB_PWMLV3_PWMLV8                           *((volatile unsigned int*)(0x42378CA0UL))
#define bM4_EMB_PWMLV3_PWMLV9                           *((volatile unsigned int*)(0x42378CA4UL))
#define bM4_EMB_PWMLV3_RESV                             *((volatile unsigned int*)(0x42378CFCUL))
#define bM4_EMB_SOE3_SOE                                *((volatile unsigned int*)(0x42378D00UL))
