RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EMB_SOE3_RESV                               *((volatile unsigned int*)(0x42378D7CUL))
#define bM4_EMB_STAT3_PORTINF                           *((volatile unsigned int*)(0x42378D80UL))
#define bM4_EMB_STAT3_PWMSF                             *((volatile unsigned int*)(0x42378D84UL))
#define bM4_EMB_STAT3_CMPF                              *((volatile unsigned int*)(0x42378D88UL))
#define bM4_EMB_STAT3_OSF                               *((volatile unsigned int*)(0x42378D8CUL))
#define bM4_EMB_STAT3_PORTINST                          *((volatile unsigned int*)(0x42378D90UL))
#define bM4_EMB_STAT3_PWMST                             *((volatile unsigned int*)(0x42378D94UL))
#define bM4_EMB_STAT3_RESV                              *((volatile unsigned int*)(0x42378DFCUL))
#define bM4_EMB_STATCLR3_PORTINFCLR                     *((volatile unsigned int*)(0x42378E00UL))
#define bM4_EMB_STATCLR3_PWMSFCLR                       *((volatile unsigned int*)(0x42378E04UL))
#define bM4_EMB_STATCLR3_CMPFCLR                        *((volatile unsigned int*)(0x42378E08UL))
#define bM4_EMB_STATCLR3_OSFCLR                         *((volatile unsigned int*)(0x42378E0CUL))
#define bM4_EMB_STATCLR3_RESV                           *((volatile unsigned int*)(0x42378E7CUL))
#define bM4_EMB_INTEN3_PORTINTEN                        *((volatile unsigned int*)(0x42378E80UL))
#define bM4_EMB_INTEN3_PWMINTEN                         *((volatile unsigned int*)(0x42378E84UL))
#define bM4_EMB_INTEN3_CMPINTEN                         *((volatile unsigned int*)(0x42378E88UL))
#define bM4_EMB_INTEN3_OSINTEN                          *((volatile unsigned int*)(0x42378E8CUL))
#define bM4_EMB_INTEN3_RESV                             *((volatile unsigned int*)(0x42378EFCUL))
#define bM4_EMB_CTL4_PORTINEN                           *((volatile unsigned int*)(0x42379000UL))
#define bM4_EMB_CTL4_CMPEN0                             *((volatile unsigned int*)(0x42379004UL))
#define bM4_EMB_CTL4_CMPEN1                             *((volatile unsigned int*)(0x42379008UL))
#define bM4_EMB_CTL4_CMPEN2                             *((volatile unsigned int*)(0x4237900CUL))
#define bM4_EMB_CTL4_CMPEN3                             *((volatile unsigned int*)(0x42379010UL))
#define bM4_EMB_CTL4_OSCSTPEN                           *((volatile unsigned int*)(0x42379014UL))
#define bM4_EMB_CTL4_PWMSEL0                            *((volatile unsigned int*)(0x42379018UL))
#define bM4_EMB_CTL4_PWMSEL1                            *((volatile unsigned int*)(0x4237901CUL))
#define bM4_EMB_CTL4_PWMSEL2                            *((volatile unsigned int*)(0x42379020UL))
#define bM4_EMB_CTL4_NFSEL0                             *((volatile unsigned int*)(0x42379070UL))
#define bM4_EMB_CTL4_NFSEL1                             *((volatile unsigned int*)(0x42379074UL))
#define bM4_EMB_CTL4_NFEN                               *((volatile unsigned int*)(0x42379078UL))
#define bM4_EMB_CTL4_INVSEL                             *((volatile unsigned int*)(0x4237907CUL))
#define bM4_EMB_PWMLV4_PWMLV0                           *((volatile unsigned int*)(0x42379080UL))
#define bM4_EMB_PWMLV4_PWMLV1                           *((volatile unsigned int*)(0x42379084UL))
#define bM4_EMB_PWMLV4_PWMLV2                           *((volatile unsigned int*)(0x42379088UL))
#define bM4_EMB_PWMLV4_RESV                             *((volatile unsigned int*)(0x423790FCUL))
#define bM4_EMB_SOE4_SOE                                *((volatile unsigned int*)(0x42379100UL))
#define bM4_EMB_SOE4_RESV                               *((volatile unsigned int*)(0x4237917CUL))
#define bM4_EMB_STAT4_PORTINF                           *((volatile unsigned int*)(0x42379180UL))
#define bM4_EMB_STAT4_PWMSF                             *((volatile unsigned int*)(0x42379184UL))
#define bM4_EMB_STAT4_CMPF                              *((volatile unsigned int*)(0x42379188UL))
#define bM4_EMB_STAT4_OSF                               *((volatile unsigned int*)(0x4237918CUL))
#define bM4_EMB_STAT4_PORTINST                          *((volatile unsigned int*)(0x42379190UL))
#define bM4_EMB_STAT4_PWMST                             *((volatile unsigned int*)(0x42379194UL))
#define bM4_EMB_STAT4_RESV                              *((volatile unsigned int*)(0x423791FCUL))
#define bM4_EMB_STATCLR4_PORTINFCLR                     *((volatile unsigned int*)(0x42379200UL))
#define bM4_EMB_STATCLR4_PWMSFCLR                       *((volatile unsigned int*)(0x42379204UL))
#define bM4_EMB_STATCLR4_CMPFCLR                        *((volatile unsigned int*)(0x42379208UL))
#define bM4_EMB_STATCLR4_OSFCLR                         *((volatile unsigned int*)(0x4237920CUL))
#define bM4_EMB_STATCLR4_RESV                           *((volatile unsigned int*)(0x4237927CUL))
#define bM4_EMB_INTEN4_PORTINTEN                        *((volatile unsigned int*)(0x42379280UL))
#define bM4_EMB_INTEN4_PWMINTEN                         *((volatile unsigned int*)(0x42379284UL))
#define bM4_EMB_INTEN4_CMPINTEN                         *((volatile unsigned int*)(0x42379288UL))
#define bM4_EMB_INTEN4_OSINTEN                          *((volatile unsigned int*)(0x4237928CUL))
#define bM4_EMB_INTEN4_RESV                             *((volatile unsigned int*)(0x423792FCUL))
#define bM4_EMB_CTL5_PORTINEN                           *((volatile unsigned int*)(0x42379400UL))
#define bM4_EMB_CTL5_CMPEN0                             *((volatile unsigned int*)(0x42379404UL))
#define bM4_EMB_CTL5_CMPEN1                             *((volatile unsigned int*)(0x42379408UL))
#define bM4_EMB_CTL5_CMPEN2                             *((volatile unsigned int*)(0x4237940CUL))
#define bM4_EMB_CTL5_CMPEN3                             *((volatile unsigned int*)(0x42379410UL))
#define bM4_EMB_CTL5_OSCSTPEN                           *((volatile unsigned int*)(0x42379414UL))
#define bM4_EMB_CTL5_PWMSEL0                            *((volatile unsigned int*)(0x42379418UL))
#define bM4_EMB_CTL5_PWMSEL1                            *((volatile unsigned int*)(0x4237941CUL))
#define bM4_EMB_CTL5_PWMSEL2                            *((volatile unsigned int*)(0x42379420UL))
#define bM4_EMB_CTL5_NFSEL0                             *((volatile unsigned int*)(0x42379470UL))
#define bM4_EMB_CTL5_NFSEL1                             *((volatile unsigned int*)(0x42379474UL))
#define bM4_EMB_CTL5_NFEN                               *((volatile unsigned int*)(0x42379478UL))
#define bM4_EMB_CTL5_INVSEL                             *((volatile unsigned int*)(0x4237947CUL))
#define bM4_EMB_PWMLV5_PWMLV0                           *((volatile unsigned int*)(0x42379480UL))
#define bM4_EMB_PWMLV5_PWMLV1                           *((volatile unsigned int*)(0x42379484UL))
#define bM4_EMB_PWMLV5_PWMLV2                           *((volatile unsigned int*)(0x42379488UL))
#define bM4_EMB_PWMLV5_RESV                             *((volatile unsigned int*)(0x423794FCUL))
#define bM4_EMB_SOE5_SOE                                *((volatile unsigned int*)(0x42379500UL))
#define bM4_EMB_SOE5_RESV                               *((volatile unsigned int*)(0x4237957CUL))
#define bM4_EMB_STAT5_PORTINF                           *((volatile unsigned int*)(0x42379580UL))
#define bM4_EMB_STAT5_PWMSF                             *((volatile unsigned int*)(0x42379584UL))
#define bM4_EMB_STAT5_CMPF                              *((volatile unsigned int*)(0x42379588UL))
#define bM4_EMB_STAT5_OSF                               *((volatile unsigned int*)(0x4237958CUL))
#define bM4_EMB_STAT5_PORTINST                          *((volatile unsigned int*)(0x42379590UL))
#define bM4_EMB_STAT5_PWMST                             *((volatile unsigned int*)(0x42379594UL))
#define bM4_EMB_STAT5_RESV                              *((volatile unsigned int*)(0x423795FCUL))
#define bM4_EMB_STATCLR5_PORTINFCLR                     *((volatile unsigned int*)(0x42379600UL))
#define bM4_EMB_STATCLR5_PWMSFCLR                       *((volatile unsigned int*)(0x42379604UL))
#define bM4_EMB_STATCLR5_CMPFCLR                        *((volatile unsigned int*)(0x42379608UL))
#define bM4_EMB_STATCLR5_OSFCLR                         *((volatile unsigned int*)(0x4237960CUL))
#define bM4_EMB_STATCLR5_RESV                           *((volatile unsigned int*)(0x4237967CUL))
#define bM4_EMB_INTEN5_PORTINTEN                        *((volatile unsigned int*)(0x42379680UL))
#define bM4_EMB_INTEN5_PWMINTEN                         *((volatile unsigned int*)(0x42379684UL))
#define bM4_EMB_INTEN5_CMPINTEN                         *((volatile unsigned int*)(0x42379688UL))
#define bM4_EMB_INTEN5_OSINTEN                          *((volatile unsigned int*)(0x4237968CUL))
#define bM4_EMB_INTEN5_RESV                             *((volatile unsigned int*)(0x423796FCUL))
#define bM4_ETH_MAC_IFCONFR_IFSEL                       *((volatile unsigned int*)(0x42AA8200UL))
#define bM4_ETH_MAC_CONFIGR_RE                          *((volatile unsigned int*)(0x42C00008UL))
#define bM4_ETH_MAC_CONFIGR_TE                          *((volatile unsigned int*)(0x42C0000CUL))
#define bM4_ETH_MAC_CONFIGR_DC                          *((volatile unsigned int*)(0x42C00010UL))
#define bM4_ETH_MAC_CONFIGR_BL0                         *((volatile unsigned int*)(0x42C00014UL))
#define bM4_ETH_MAC_CONFIGR_BL1                         *((volatile unsigned int*)(0x42C00018UL))
#define bM4_ETH_MAC_CONFIGR_ACS                         *((volatile unsigned int*)(0x42C0001CUL))
#define bM4_ETH_MAC_CONFIGR_DRTY                        *((volatile unsigned int*)(0x42C00024UL))
#define bM4_ETH_MAC_CONFIGR_IPCO                        *((volatile unsigned int*)(0x42C00028UL))
#define bM4_ETH_MAC_CONFIGR_DM                          *((volatile unsigned int*)(0x42C0002CUL))
#define bM4_ETH_MAC_CONFIGR_LM                          *((volatile unsigned int*)(0x42C00030UL))
#define bM4_ETH_MAC_CONFIGR_DO                          *((volatile unsigned int*)(0x42C00034UL))
#define bM4_ETH_MAC_CONFIGR_FES                         *((volatile unsigned int*)(0x42C00038UL))
#define bM4_ETH_MAC_CONFIGR_DCRS                        *((volatile unsigned int*)(0x42C00040UL))
#define bM4_ETH_MAC_CONFIGR_IFG0                        *((volatile unsigned int*)(0x42C00044UL))
#define bM4_ETH_MAC_CONFIGR_IFG1                        *((volatile unsigned int*)(0x42C00048UL))
#define bM4_ETH_MAC_CONFIGR_IFG2                        *((volatile unsigned int*)(0x42C0004CUL))
#define bM4_ETH_MAC_CONFIGR_MJB                         *((volatile unsigned int*)(0x42C00058UL))
#define bM4_ETH_MAC_CONFIGR_MWD                         *((volatile unsigned int*)(0x42C0005CUL))
#define bM4_ETH_MAC_CONFIGR_CST                         *((volatile unsigned int*)(0x42C00064UL))
#define bM4_ETH_MAC_CONFIGR_SAIRC0                      *((volatile unsigned int*)(0x42C00070UL))
#define bM4_ETH_MAC_CONFIGR_SAIRC1                      *((volatile unsigned int*)(0x42C00074UL))
#define bM4_ETH_MAC_CONFIGR_SAIRC2                      *((volatile unsigned int*)(0x42C00078UL))
#define bM4_ETH_MAC_FLTCTLR_PR                          *((volatile unsigned int*)(0x42C00080UL))
#define bM4_ETH_MAC_FLTCTLR_HUC                         *((volatile unsigned int*)(0x42C00084UL))
#define bM4_ETH_MAC_FLTCTLR_HMC                         *((volatile unsigned int*)(0x42C00088UL))
#define bM4_ETH_MAC_FLTCTLR_DAIF                        *((volatile unsigned int*)(0x42C0008CUL))
#define bM4_ETH_MAC_FLTCTLR_PMF                         *((volatile unsigned int*)(0x42C00090UL))
#define bM4_ETH_MAC_FLTCTLR_DBF                         *((volatile unsigned int*)(0x42C00094UL))
#define bM4_ETH_MAC_FLTCTLR_PCF0                        *((volatile unsigned int*)(0x42C00098UL))
#define bM4_ETH_MAC_FLTCTLR_PCF1                        *((volatile unsigned int*)(0x42C0009CUL))
#define bM4_ETH_MAC_FLTCTLR_SAIF                        *((volatile unsigned int*)(0x42C000A0UL))
#define bM4_ETH_MAC_FLTCTLR_SAF                         *((volatile unsigned int*)(0x42C000A4UL))
#define bM4_ETH_MAC_FLTCTLR_HPF                         *((volatile unsigned int*)(0x42C000A8UL))
#define bM4_ETH_MAC_FLTCTLR_VTFE                        *((volatile unsigned int*)(0x42C000C0UL))
#define bM4_ETH_MAC_FLTCTLR_IPFE                        *((volatile unsigned int*)(0x42C000D0UL))
#define bM4_ETH_MAC_FLTCTLR_DNTU                        *((volatile unsigned int*)(0x42C000D4UL))
#define bM4_ETH_MAC_FLTCTLR_RA                          *((volatile unsigned int*)(0x42C000FCUL))
#define bM4_ETH_MAC_SMIADDR_SMIB                        *((volatile unsigned int*)(0x42C00200UL))
#define bM4_ETH_MAC_SMIADDR_SMIW                        *((volatile unsigned int*)(0x42C00204UL))
#define bM4_ETH_MAC_SMIADDR_SMIC0                       *((volatile unsigned int*)(0x42C00208UL))
#define bM4_ETH_MAC_SMIADDR_SMIC1                       *((volatile unsigned int*)(0x42C0020CUL))
#define bM4_ETH_MAC_SMIADDR_SMIC2                       *((volatile unsigned int*)(0x42C00210UL))
#define bM4_ETH_MAC_SMIADDR_SMIC3                       *((volatile unsigned int*)(0x42C00214UL))
#define bM4_ETH_MAC_SMIADDR_SMIR0                       *((volatile unsigned int*)(0x42C00218UL))
#define bM4_ETH_MAC_SMIADDR_SMIR1                       *((volatile unsigned int*)(0x42C0021CUL))
#define bM4_ETH_MAC_SMIADDR_SMIR2                       *((volatile unsigned int*)(0x42C00220UL))
#define bM4_ETH_MAC_SMIADDR_SMIR3                       *((volatile unsigned int*)(0x42C00224UL))
#define bM4_ETH_MAC_SMIADDR_SMIR4                       *((volatile unsigned int*)(0x42C00228UL))
#define bM4_ETH_MAC_SMIADDR_SMIA0                       *((volatile unsigned int*)(0x42C0022CUL))
#define bM4_ETH_MAC_SMIADDR_SMIA1                       *((volatile unsigned int*)(0x42C00230UL))
#define bM4_ETH_MAC_SMIADDR_SMIA2                       *((volatile unsigned int*)(0x42C00234UL))
#define bM4_ETH_MAC_SMIADDR_SMIA3                       *((volatile unsigned int*)(0x42C00238UL))
#define bM4_ETH_MAC_SMIADDR_SMIA4                       *((volatile unsigned int*)(0x42C0023CUL))
#define bM4_ETH_MAC_FLOCTLR_FCA_BPA                     *((volatile unsigned int*)(0x42C00300UL))
#define bM4_ETH_MAC_FLOCTLR_TFE                         *((volatile unsigned int*)(0x42C00304UL))
#define bM4_ETH_MAC_FLOCTLR_RFE                         *((volatile unsigned int*)(0x42C00308UL))
#define bM4_ETH_MAC_FLOCTLR_UNP                         *((volatile unsigned int*)(0x42C0030CUL))
#define bM4_ETH_MAC_FLOCTLR_PLT0                        *((volatile unsigned int*)(0x42C00310UL))
#define bM4_ETH_MAC_FLOCTLR_PLT1                        *((volatile unsigned int*)(0x42C00314UL))
#define bM4_ETH_MAC_FLOCTLR_DZPQ                        *((volatile unsigned int*)(0x42C0031CUL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET0                     *((volatile unsigned int*)(0x42C00340UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET1                     *((volatile unsigned int*)(0x42C00344UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET2                     *((volatile unsigned int*)(0x42C00348UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET3                     *((volatile unsigned int*)(0x42C0034CUL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET4                     *((volatile unsigned int*)(0x42C00350UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET5                     *((volatile unsigned int*)(0x42C00354UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET6                     *((volatile unsigned int*)(0x42C00358UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET7                     *((volatile unsigned int*)(0x42C0035CUL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET8                     *((volatile unsigned int*)(0x42C00360UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET9                     *((volatile unsigned int*)(0x42C00364UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET10                    *((volatile unsigned int*)(0x42C00368UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET11                    *((volatile unsigned int*)(0x42C0036CUL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET12                    *((volatile unsigned int*)(0x42C00370UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET13                    *((volatile unsigned int*)(0x42C00374UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET14                    *((volatile unsigned int*)(0x42C00378UL))
#define bM4_ETH_MAC_FLOCTLR_PAUSET15                    *((volatile unsigned int*)(0x42C0037CUL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT0                      *((volatile unsigned int*)(0x42C00380UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT1                      *((volatile unsigned int*)(0x42C00384UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT2                      *((volatile unsigned int*)(0x42C00388UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT3                      *((volatile unsigned int*)(0x42C0038CUL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT4                      *((volatile unsigned int*)(0x42C00390UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT5                      *((volatile unsigned int*)(0x42C00394UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT6                      *((volatile unsigned int*)(0x42C00398UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT7                      *((volatile unsigned int*)(0x42C0039CUL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT8                      *((volatile unsigned int*)(0x42C003A0UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT9                      *((volatile unsigned int*)(0x42C003A4UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT10                     *((volatile unsigned int*)(0x42C003A8UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT11                     *((volatile unsigned int*)(0x42C003ACUL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT12                     *((volatile unsigned int*)(0x42C003B0UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT13                     *((volatile unsigned int*)(0x42C003B4UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT14                     *((volatile unsigned int*)(0x42C003B8UL))
#define bM4_ETH_MAC_VTAFLTR_VLFLT15                     *((volatile unsigned int*)(0x42C003BCUL))
#define bM4_ETH_MAC_VTAFLTR_VTAL                        *((volatile unsigned int*)(0x42C003C0UL))
#define bM4_ETH_MAC_VTAFLTR_VTIM                        *((volatile unsigned int*)(0x42C003C4UL))
#define bM4_ETH_MAC_VTAFLTR_VTHM                        *((volatile unsigned int*)(0x42C003CCUL))
#define bM4_ETH_MAC_VTAFLTR_RESV0                       *((volatile unsigned int*)(0x42C003E0UL))
#define bM4_ETH_MAC_MACSTSR_MREA                        *((volatile unsigned int*)(0x42C00480UL))
#define bM4_ETH_MAC_MACSTSR_MRS0                        *((volatile unsigned int*)(0x42C00484UL))
#define bM4_ETH_MAC_MACSTSR_MRS1                        *((volatile unsigned int*)(0x42C00488UL))
#define bM4_ETH_MAC_MACSTSR_RFWA                        *((volatile unsigned int*)(0x42C00490UL))
#define bM4_ETH_MAC_MACSTSR_RFRS0                       *((volatile unsigned int*)(0x42C00494UL))
#define bM4_ETH_MAC_MACSTSR_RFRS1                       *((volatile unsigned int*)(0x42C00498UL))
#define bM4_ETH_MAC_MACSTSR_RFFL0                       *((volatile unsigned int*)(0x42C004A0UL))
#define bM4_ETH_MAC_MACSTSR_RFFL1                       *((volatile unsigned int*)(0x42C004A4UL))
#define bM4_ETH_MAC_MACSTSR_MTEA                        *((volatile unsigned int*)(0x42C004C0UL))
#define bM4_ETH_MAC_MACSTSR_MTS0                        *((volatile unsigned int*)(0x42C004C4UL))
#define bM4_ETH_MAC_MACSTSR_MTS1                        *((volatile unsigned int*)(0x42C004C8UL))
#define bM4_ETH_MAC_MACSTSR_MTP                         *((volatile unsigned int*)(0x42C004CCUL))
#define bM4_ETH_MAC_MACSTSR_TFRS0                       *((volatile unsigned int*)(0x42C004D0UL))
#define bM4_ETH_MAC_MACSTSR_TFRS1                       *((volatile unsigned int*)(0x42C004D4UL))
#define bM4_ETH_MAC_MACSTSR_TFWA                        *((volatile unsigned int*)(0x42C004D8UL))
#define bM4_ETH_MAC_MACSTSR_TFNE                        *((volatile unsigned int*)(0x42C004E0UL))
#define bM4_ETH_MAC_MACSTSR_TFF                         *((volatile unsigned int*)(0x42C004E4UL))
#define bM4_ETH_MAC_PMTCTLR_PWDN                        *((volatile unsigned int*)(0x42C00580UL))
#define bM4_ETH_MAC_PMTCTLR_MPEN                        *((volatile unsigned int*)(0x42C00584UL))
#define bM4_ETH_MAC_PMTCTLR_WKEN                        *((volatile unsigned int*)(0x42C00588UL))
#define bM4_ETH_MAC_PMTCTLR_MPFR                        *((volatile unsigned int*)(0x42C00594UL))
#define bM4_ETH_MAC_PMTCTLR_WKFR                        *((volatile unsigned int*)(0x42C00598UL))
#define bM4_ETH_MAC_PMTCTLR_GLUB                        *((volatile unsigned int*)(0x42C005A4UL))
#define bM4_ETH_MAC_PMTCTLR_RTWKTR                      *((volatile unsigned int*)(0x42C005A8UL))
#define bM4_ETH_MAC_PMTCTLR_RTWKPT0                     *((volatile unsigned int*)(0x42C005E0UL))
#define bM4_ETH_MAC_PMTCTLR_RTWKPT1                     *((volatile unsigned int*)(0x42C005E4UL))
#define bM4_ETH_MAC_PMTCTLR_RTWKPT2                     *((volatile unsigned int*)(0x42C005E8UL))
#define bM4_ETH_MAC_PMTCTLR_RTWKFR                      *((volatile unsigned int*)(0x42C005FCUL))
#define bM4_ETH_MAC_INTSTSR_PMTIS                       *((volatile unsigned int*)(0x42C0070CUL))
#define bM4_ETH_MAC_INTSTSR_MMCIS                       *((volatile unsigned int*)(0x42C00710UL))
#define bM4_ETH_MAC_INTSTSR_MMCRXIS                     *((volatile unsigned int*)(0x42C00714UL))
#define bM4_ETH_MAC_INTSTSR_MMCTXIS                     *((volatile unsigned int*)(0x42C00718UL))
#define bM4_ETH_MAC_INTSTSR_TSPIS                       *((volatile unsigned int*)(0x42C00724UL))
#define bM4_ETH_MAC_INTMSKR_PMTIM                       *((volatile unsigned int*)(0x42C0078CUL))
#define bM4_ETH_MAC_INTMSKR_TSPIM                       *((volatile unsigned int*)(0x42C007A4UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH00                    *((volatile unsigned int*)(0x42C00800UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH01                    *((volatile unsigned int*)(0x42C00804UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH02                    *((volatile unsigned int*)(0x42C00808UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH03                    *((volatile unsigned int*)(0x42C0080CUL))
#define bM4_ETH_MAC_MACADHR0_ADDRH04                    *((volatile unsigned int*)(0x42C00810UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH05                    *((volatile unsigned int*)(0x42C00814UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH06                    *((volatile unsigned int*)(0x42C00818UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH07                    *((volatile unsigned int*)(0x42C0081CUL))
#define bM4_ETH_MAC_MACADHR0_ADDRH08                    *((volatile unsigned int*)(0x42C00820UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH09                    *((volatile unsigned int*)(0x42C00824UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH010                   *((volatile unsigned int*)(0x42C00828UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH011                   *((volatile unsigned int*)(0x42C0082CUL))
#define bM4_ETH_MAC_MACADHR0_ADDRH012                   *((volatile unsigned int*)(0x42C00830UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH013                   *((volatile unsigned int*)(0x42C00834UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH014                   *((volatile unsigned int*)(0x42C00838UL))
#define bM4_ETH_MAC_MACADHR0_ADDRH015                   *((volatile unsigned int*)(0x42C0083CUL))
#define bM4_ETH_MAC_MACADHR0_AE0                        *((volatile unsigned int*)(0x42C0087CUL))
#define bM4_ETH_MAC_MACADHR1_ADDRH10                    *((volatile unsigned int*)(0x42C00900UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH11                    *((volatile unsigned int*)(0x42C00904UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH12                    *((volatile unsigned int*)(0x42C00908UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH13                    *((volatile unsigned int*)(0x42C0090CUL))
#define bM4_ETH_MAC_MACADHR1_ADDRH14                    *((volatile unsigned int*)(0x42C00910UL))
