RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_ETH_MAC_MACADHR1_ADDRH15                    *((volatile unsigned int*)(0x42C00914UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH16                    *((volatile unsigned int*)(0x42C00918UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH17                    *((volatile unsigned int*)(0x42C0091CUL))
#define bM4_ETH_MAC_MACADHR1_ADDRH18                    *((volatile unsigned int*)(0x42C00920UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH19                    *((volatile unsigned int*)(0x42C00924UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH110                   *((volatile unsigned int*)(0x42C00928UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH111                   *((volatile unsigned int*)(0x42C0092CUL))
#define bM4_ETH_MAC_MACADHR1_ADDRH112                   *((volatile unsigned int*)(0x42C00930UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH113                   *((volatile unsigned int*)(0x42C00934UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH114                   *((volatile unsigned int*)(0x42C00938UL))
#define bM4_ETH_MAC_MACADHR1_ADDRH115                   *((volatile unsigned int*)(0x42C0093CUL))
#define bM4_ETH_MAC_MACADHR1_MBC10                      *((volatile unsigned int*)(0x42C00960UL))
#define bM4_ETH_MAC_MACADHR1_MBC11                      *((volatile unsigned int*)(0x42C00964UL))
#define bM4_ETH_MAC_MACADHR1_MBC12                      *((volatile unsigned int*)(0x42C00968UL))
#define bM4_ETH_MAC_MACADHR1_MBC13                      *((volatile unsigned int*)(0x42C0096CUL))
#define bM4_ETH_MAC_MACADHR1_MBC14                      *((volatile unsigned int*)(0x42C00970UL))
#define bM4_ETH_MAC_MACADHR1_MBC15                      *((volatile unsigned int*)(0x42C00974UL))
#define bM4_ETH_MAC_MACADHR1_SA1                        *((volatile unsigned int*)(0x42C00978UL))
#define bM4_ETH_MAC_MACADHR1_AE1                        *((volatile unsigned int*)(0x42C0097CUL))
#define bM4_ETH_MAC_MACADHR2_ADDRH20                    *((volatile unsigned int*)(0x42C00A00UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH21                    *((volatile unsigned int*)(0x42C00A04UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH22                    *((volatile unsigned int*)(0x42C00A08UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH23                    *((volatile unsigned int*)(0x42C00A0CUL))
#define bM4_ETH_MAC_MACADHR2_ADDRH24                    *((volatile unsigned int*)(0x42C00A10UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH25                    *((volatile unsigned int*)(0x42C00A14UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH26                    *((volatile unsigned int*)(0x42C00A18UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH27                    *((volatile unsigned int*)(0x42C00A1CUL))
#define bM4_ETH_MAC_MACADHR2_ADDRH28                    *((volatile unsigned int*)(0x42C00A20UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH29                    *((volatile unsigned int*)(0x42C00A24UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH210                   *((volatile unsigned int*)(0x42C00A28UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH211                   *((volatile unsigned int*)(0x42C00A2CUL))
#define bM4_ETH_MAC_MACADHR2_ADDRH212                   *((volatile unsigned int*)(0x42C00A30UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH213                   *((volatile unsigned int*)(0x42C00A34UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH214                   *((volatile unsigned int*)(0x42C00A38UL))
#define bM4_ETH_MAC_MACADHR2_ADDRH215                   *((volatile unsigned int*)(0x42C00A3CUL))
#define bM4_ETH_MAC_MACADHR2_MBC20                      *((volatile unsigned int*)(0x42C00A60UL))
#define bM4_ETH_MAC_MACADHR2_MBC21                      *((volatile unsigned int*)(0x42C00A64UL))
#define bM4_ETH_MAC_MACADHR2_MBC22                      *((volatile unsigned int*)(0x42C00A68UL))
#define bM4_ETH_MAC_MACADHR2_MBC23                      *((volatile unsigned int*)(0x42C00A6CUL))
#define bM4_ETH_MAC_MACADHR2_MBC24                      *((volatile unsigned int*)(0x42C00A70UL))
#define bM4_ETH_MAC_MACADHR2_MBC25                      *((volatile unsigned int*)(0x42C00A74UL))
#define bM4_ETH_MAC_MACADHR2_SA2                        *((volatile unsigned int*)(0x42C00A78UL))
#define bM4_ETH_MAC_MACADHR2_AE2                        *((volatile unsigned int*)(0x42C00A7CUL))
#define bM4_ETH_MAC_MACADHR3_ADDRH30                    *((volatile unsigned int*)(0x42C00B00UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH31                    *((volatile unsigned int*)(0x42C00B04UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH32                    *((volatile unsigned int*)(0x42C00B08UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH33                    *((volatile unsigned int*)(0x42C00B0CUL))
#define bM4_ETH_MAC_MACADHR3_ADDRH34                    *((volatile unsigned int*)(0x42C00B10UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH35                    *((volatile unsigned int*)(0x42C00B14UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH36                    *((volatile unsigned int*)(0x42C00B18UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH37                    *((volatile unsigned int*)(0x42C00B1CUL))
#define bM4_ETH_MAC_MACADHR3_ADDRH38                    *((volatile unsigned int*)(0x42C00B20UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH39                    *((volatile unsigned int*)(0x42C00B24UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH310                   *((volatile unsigned int*)(0x42C00B28UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH311                   *((volatile unsigned int*)(0x42C00B2CUL))
#define bM4_ETH_MAC_MACADHR3_ADDRH312                   *((volatile unsigned int*)(0x42C00B30UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH313                   *((volatile unsigned int*)(0x42C00B34UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH314                   *((volatile unsigned int*)(0x42C00B38UL))
#define bM4_ETH_MAC_MACADHR3_ADDRH315                   *((volatile unsigned int*)(0x42C00B3CUL))
#define bM4_ETH_MAC_MACADHR3_MBC30                      *((volatile unsigned int*)(0x42C00B60UL))
#define bM4_ETH_MAC_MACADHR3_MBC31                      *((volatile unsigned int*)(0x42C00B64UL))
#define bM4_ETH_MAC_MACADHR3_MBC32                      *((volatile unsigned int*)(0x42C00B68UL))
#define bM4_ETH_MAC_MACADHR3_MBC33                      *((volatile unsigned int*)(0x42C00B6CUL))
#define bM4_ETH_MAC_MACADHR3_MBC34                      *((volatile unsigned int*)(0x42C00B70UL))
#define bM4_ETH_MAC_MACADHR3_MBC35                      *((volatile unsigned int*)(0x42C00B74UL))
#define bM4_ETH_MAC_MACADHR3_SA3                        *((volatile unsigned int*)(0x42C00B78UL))
#define bM4_ETH_MAC_MACADHR3_AE3                        *((volatile unsigned int*)(0x42C00B7CUL))
#define bM4_ETH_MAC_MACADHR4_ADDRH40                    *((volatile unsigned int*)(0x42C00C00UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH41                    *((volatile unsigned int*)(0x42C00C04UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH42                    *((volatile unsigned int*)(0x42C00C08UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH43                    *((volatile unsigned int*)(0x42C00C0CUL))
#define bM4_ETH_MAC_MACADHR4_ADDRH44                    *((volatile unsigned int*)(0x42C00C10UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH45                    *((volatile unsigned int*)(0x42C00C14UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH46                    *((volatile unsigned int*)(0x42C00C18UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH47                    *((volatile unsigned int*)(0x42C00C1CUL))
#define bM4_ETH_MAC_MACADHR4_ADDRH48                    *((volatile unsigned int*)(0x42C00C20UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH49                    *((volatile unsigned int*)(0x42C00C24UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH410                   *((volatile unsigned int*)(0x42C00C28UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH411                   *((volatile unsigned int*)(0x42C00C2CUL))
#define bM4_ETH_MAC_MACADHR4_ADDRH412                   *((volatile unsigned int*)(0x42C00C30UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH413                   *((volatile unsigned int*)(0x42C00C34UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH414                   *((volatile unsigned int*)(0x42C00C38UL))
#define bM4_ETH_MAC_MACADHR4_ADDRH415                   *((volatile unsigned int*)(0x42C00C3CUL))
#define bM4_ETH_MAC_MACADHR4_MBC40                      *((volatile unsigned int*)(0x42C00C60UL))
#define bM4_ETH_MAC_MACADHR4_MBC41                      *((volatile unsigned int*)(0x42C00C64UL))
#define bM4_ETH_MAC_MACADHR4_MBC42                      *((volatile unsigned int*)(0x42C00C68UL))
#define bM4_ETH_MAC_MACADHR4_MBC43                      *((volatile unsigned int*)(0x42C00C6CUL))
#define bM4_ETH_MAC_MACADHR4_MBC44                      *((volatile unsigned int*)(0x42C00C70UL))
#define bM4_ETH_MAC_MACADHR4_MBC45                      *((volatile unsigned int*)(0x42C00C74UL))
#define bM4_ETH_MAC_MACADHR4_SA4                        *((volatile unsigned int*)(0x42C00C78UL))
#define bM4_ETH_MAC_MACADHR4_AE4                        *((volatile unsigned int*)(0x42C00C7CUL))
#define bM4_ETH_MMC_MMCCTLR_CRST                        *((volatile unsigned int*)(0x42C02000UL))
#define bM4_ETH_MMC_MMCCTLR_COS                         *((volatile unsigned int*)(0x42C02004UL))
#define bM4_ETH_MMC_MMCCTLR_ROR                         *((volatile unsigned int*)(0x42C02008UL))
#define bM4_ETH_MMC_MMCCTLR_MCF                         *((volatile unsigned int*)(0x42C0200CUL))
#define bM4_ETH_MMC_MMCCTLR_MCPSET                      *((volatile unsigned int*)(0x42C02010UL))
#define bM4_ETH_MMC_MMCCTLR_MCPSEL                      *((volatile unsigned int*)(0x42C02014UL))
#define bM4_ETH_MMC_REVSTSR_RXBGIS                      *((volatile unsigned int*)(0x42C0208CUL))
#define bM4_ETH_MMC_REVSTSR_RXMGIS                      *((volatile unsigned int*)(0x42C02090UL))
#define bM4_ETH_MMC_REVSTSR_RXCEIS                      *((volatile unsigned int*)(0x42C02094UL))
#define bM4_ETH_MMC_REVSTSR_RXAEIS                      *((volatile unsigned int*)(0x42C02098UL))
#define bM4_ETH_MMC_REVSTSR_RXREIS                      *((volatile unsigned int*)(0x42C0209CUL))
#define bM4_ETH_MMC_REVSTSR_RXUGIS                      *((volatile unsigned int*)(0x42C020C4UL))
#define bM4_ETH_MMC_REVSTSR_RXLEIS                      *((volatile unsigned int*)(0x42C020C8UL))
#define bM4_ETH_MMC_REVSTSR_RXOEIS                      *((volatile unsigned int*)(0x42C020CCUL))
#define bM4_ETH_MMC_REVSTSR_RESV3                       *((volatile unsigned int*)(0x42C020E0UL))
#define bM4_ETH_MMC_TRSSTSR_TXBGIS                      *((volatile unsigned int*)(0x42C02108UL))
#define bM4_ETH_MMC_TRSSTSR_TXMGIS                      *((volatile unsigned int*)(0x42C0210CUL))
#define bM4_ETH_MMC_TRSSTSR_TXDEEIS                     *((volatile unsigned int*)(0x42C02140UL))
#define bM4_ETH_MMC_TRSSTSR_TXLCEIS                     *((volatile unsigned int*)(0x42C02144UL))
#define bM4_ETH_MMC_TRSSTSR_TXECEIS                     *((volatile unsigned int*)(0x42C02148UL))
#define bM4_ETH_MMC_TRSSTSR_TXCAEIS                     *((volatile unsigned int*)(0x42C0214CUL))
#define bM4_ETH_MMC_TRSSTSR_TXUGIS                      *((volatile unsigned int*)(0x42C02154UL))
#define bM4_ETH_MMC_TRSSTSR_TXEDEIS                     *((volatile unsigned int*)(0x42C02158UL))
#define bM4_ETH_MMC_TRSSTSR_RESV4                       *((volatile unsigned int*)(0x42C02160UL))
#define bM4_ETH_MMC_RITCTLR_RXBGIM                      *((volatile unsigned int*)(0x42C0218CUL))
#define bM4_ETH_MMC_RITCTLR_RXMGIM                      *((volatile unsigned int*)(0x42C02190UL))
#define bM4_ETH_MMC_RITCTLR_RXCEIM                      *((volatile unsigned int*)(0x42C02194UL))
#define bM4_ETH_MMC_RITCTLR_RXAEIM                      *((volatile unsigned int*)(0x42C02198UL))
#define bM4_ETH_MMC_RITCTLR_RXREIM                      *((volatile unsigned int*)(0x42C0219CUL))
#define bM4_ETH_MMC_RITCTLR_RXUGIM                      *((volatile unsigned int*)(0x42C021C4UL))
#define bM4_ETH_MMC_RITCTLR_RXLEIM                      *((volatile unsigned int*)(0x42C021C8UL))
#define bM4_ETH_MMC_RITCTLR_RXOEIM                      *((volatile unsigned int*)(0x42C021CCUL))
#define bM4_ETH_MMC_RITCTLR_RESV5                       *((volatile unsigned int*)(0x42C021E0UL))
#define bM4_ETH_MMC_TITCTLR_TXBGIM                      *((volatile unsigned int*)(0x42C02208UL))
#define bM4_ETH_MMC_TITCTLR_TXMGIM                      *((volatile unsigned int*)(0x42C0220CUL))
#define bM4_ETH_MMC_TITCTLR_TXDEEIM                     *((volatile unsigned int*)(0x42C02240UL))
#define bM4_ETH_MMC_TITCTLR_TXLCEIM                     *((volatile unsigned int*)(0x42C02244UL))
#define bM4_ETH_MMC_TITCTLR_TXECEIM                     *((volatile unsigned int*)(0x42C02248UL))
#define bM4_ETH_MMC_TITCTLR_TXCAEIM                     *((volatile unsigned int*)(0x42C0224CUL))
#define bM4_ETH_MMC_TITCTLR_TXUGIM                      *((volatile unsigned int*)(0x42C02254UL))
#define bM4_ETH_MMC_TITCTLR_TXEDEIM                     *((volatile unsigned int*)(0x42C02258UL))
#define bM4_ETH_MMC_TITCTLR_RESV6                       *((volatile unsigned int*)(0x42C02260UL))
#define bM4_ETH_MAC_L34CTLR_L3PEN                       *((volatile unsigned int*)(0x42C08000UL))
#define bM4_ETH_MAC_L34CTLR_L3SAM                       *((volatile unsigned int*)(0x42C08008UL))
#define bM4_ETH_MAC_L34CTLR_L3SAIM                      *((volatile unsigned int*)(0x42C0800CUL))
#define bM4_ETH_MAC_L34CTLR_L3DAM                       *((volatile unsigned int*)(0x42C08010UL))
#define bM4_ETH_MAC_L34CTLR_L3DAIM                      *((volatile unsigned int*)(0x42C08014UL))
#define bM4_ETH_MAC_L34CTLR_L3HSBM0                     *((volatile unsigned int*)(0x42C08018UL))
#define bM4_ETH_MAC_L34CTLR_L3HSBM1                     *((volatile unsigned int*)(0x42C0801CUL))
#define bM4_ETH_MAC_L34CTLR_L3HSBM2                     *((volatile unsigned int*)(0x42C08020UL))
#define bM4_ETH_MAC_L34CTLR_L3HSBM3                     *((volatile unsigned int*)(0x42C08024UL))
#define bM4_ETH_MAC_L34CTLR_L3HSBM4                     *((volatile unsigned int*)(0x42C08028UL))
#define bM4_ETH_MAC_L34CTLR_L3HDBM0                     *((volatile unsigned int*)(0x42C0802CUL))
#define bM4_ETH_MAC_L34CTLR_L3HDBM1                     *((volatile unsigned int*)(0x42C08030UL))
#define bM4_ETH_MAC_L34CTLR_L3HDBM2                     *((volatile unsigned int*)(0x42C08034UL))
#define bM4_ETH_MAC_L34CTLR_L3HDBM3                     *((volatile unsigned int*)(0x42C08038UL))
#define bM4_ETH_MAC_L34CTLR_L3HDBM4                     *((volatile unsigned int*)(0x42C0803CUL))
#define bM4_ETH_MAC_L34CTLR_L4PEN                       *((volatile unsigned int*)(0x42C08040UL))
#define bM4_ETH_MAC_L34CTLR_L4SPM                       *((volatile unsigned int*)(0x42C08048UL))
#define bM4_ETH_MAC_L34CTLR_L4SPIM                      *((volatile unsigned int*)(0x42C0804CUL))
#define bM4_ETH_MAC_L34CTLR_L4DPM                       *((volatile unsigned int*)(0x42C08050UL))
#define bM4_ETH_MAC_L34CTLR_L4DPIM                      *((volatile unsigned int*)(0x42C08054UL))
#define bM4_ETH_MAC_L34CTLR_RESV1                       *((volatile unsigned int*)(0x42C08060UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL0                    *((volatile unsigned int*)(0x42C08080UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL1                    *((volatile unsigned int*)(0x42C08084UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL2                    *((volatile unsigned int*)(0x42C08088UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL3                    *((volatile unsigned int*)(0x42C0808CUL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL4                    *((volatile unsigned int*)(0x42C08090UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL5                    *((volatile unsigned int*)(0x42C08094UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL6                    *((volatile unsigned int*)(0x42C08098UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL7                    *((volatile unsigned int*)(0x42C0809CUL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL8                    *((volatile unsigned int*)(0x42C080A0UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL9                    *((volatile unsigned int*)(0x42C080A4UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL10                   *((volatile unsigned int*)(0x42C080A8UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL11                   *((volatile unsigned int*)(0x42C080ACUL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL12                   *((volatile unsigned int*)(0x42C080B0UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL13                   *((volatile unsigned int*)(0x42C080B4UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL14                   *((volatile unsigned int*)(0x42C080B8UL))
#define bM4_ETH_MAC_L4PORTR_L4SPVAL15                   *((volatile unsigned int*)(0x42C080BCUL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL0                    *((volatile unsigned int*)(0x42C080C0UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL1                    *((volatile unsigned int*)(0x42C080C4UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL2                    *((volatile unsigned int*)(0x42C080C8UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL3                    *((volatile unsigned int*)(0x42C080CCUL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL4                    *((volatile unsigned int*)(0x42C080D0UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL5                    *((volatile unsigned int*)(0x42C080D4UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL6                    *((volatile unsigned int*)(0x42C080D8UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL7                    *((volatile unsigned int*)(0x42C080DCUL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL8                    *((volatile unsigned int*)(0x42C080E0UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL9                    *((volatile unsigned int*)(0x42C080E4UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL10                   *((volatile unsigned int*)(0x42C080E8UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL11                   *((volatile unsigned int*)(0x42C080ECUL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL12                   *((volatile unsigned int*)(0x42C080F0UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL13                   *((volatile unsigned int*)(0x42C080F4UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL14                   *((volatile unsigned int*)(0x42C080F8UL))
#define bM4_ETH_MAC_L4PORTR_L4DPVAL15                   *((volatile unsigned int*)(0x42C080FCUL))
#define bM4_ETH_MAC_VTACTLR_VLANV0                      *((volatile unsigned int*)(0x42C0B080UL))
#define bM4_ETH_MAC_VTACTLR_VLANV1                      *((volatile unsigned int*)(0x42C0B084UL))
#define bM4_ETH_MAC_VTACTLR_VLANV2                      *((volatile unsigned int*)(0x42C0B088UL))
#define bM4_ETH_MAC_VTACTLR_VLANV3                      *((volatile unsigned int*)(0x42C0B08CUL))
#define bM4_ETH_MAC_VTACTLR_VLANV4                      *((volatile unsigned int*)(0x42C0B090UL))
#define bM4_ETH_MAC_VTACTLR_VLANV5                      *((volatile unsigned int*)(0x42C0B094UL))
#define bM4_ETH_MAC_VTACTLR_VLANV6                      *((volatile unsigned int*)(0x42C0B098UL))
#define bM4_ETH_MAC_VTACTLR_VLANV7                      *((volatile unsigned int*)(0x42C0B09CUL))
#define bM4_ETH_MAC_VTACTLR_VLANV8                      *((volatile unsigned int*)(0x42C0B0A0UL))
#define bM4_ETH_MAC_VTACTLR_VLANV9                      *((volatile unsigned int*)(0x42C0B0A4UL))
#define bM4_ETH_MAC_VTACTLR_VLANV10                     *((volatile unsigned int*)(0x42C0B0A8UL))
#define bM4_ETH_MAC_VTACTLR_VLANV11                     *((volatile unsigned int*)(0x42C0B0ACUL))
#define bM4_ETH_MAC_VTACTLR_VLANV12                     *((volatile unsigned int*)(0x42C0B0B0UL))
#define bM4_ETH_MAC_VTACTLR_VLANV13                     *((volatile unsigned int*)(0x42C0B0B4UL))
#define bM4_ETH_MAC_VTACTLR_VLANV14                     *((volatile unsigned int*)(0x42C0B0B8UL))
#define bM4_ETH_MAC_VTACTLR_VLANV15                     *((volatile unsigned int*)(0x42C0B0BCUL))
#define bM4_ETH_MAC_VTACTLR_VLANC0                      *((volatile unsigned int*)(0x42C0B0C0UL))
#define bM4_ETH_MAC_VTACTLR_VLANC1                      *((volatile unsigned int*)(0x42C0B0C4UL))
#define bM4_ETH_MAC_VTACTLR_RESV7                       *((volatile unsigned int*)(0x42C0B0E0UL))
#define bM4_ETH_PTP_TSPCTLR_TSPEN                       *((volatile unsigned int*)(0x42C0E000UL))
#define bM4_ETH_PTP_TSPCTLR_TSPUPSEL                    *((volatile unsigned int*)(0x42C0E004UL))
#define bM4_ETH_PTP_TSPCTLR_TSPINI                      *((volatile unsigned int*)(0x42C0E008UL))
#define bM4_ETH_PTP_TSPCTLR_TSPUP                       *((volatile unsigned int*)(0x42C0E00CUL))
#define bM4_ETH_PTP_TSPCTLR_TSPINT                      *((volatile unsigned int*)(0x42C0E010UL))
#define bM4_ETH_PTP_TSPCTLR_TSPADUP                     *((volatile unsigned int*)(0x42C0E014UL))
#define bM4_ETH_PTP_TSPCTLR_TSPEALL                     *((volatile unsigned int*)(0x42C0E020UL))
#define bM4_ETH_PTP_TSPCTLR_TSPSSR                      *((volatile unsigned int*)(0x42C0E024UL))
#define bM4_ETH_PTP_TSPCTLR_TSPVER                      *((volatile unsigned int*)(0x42C0E028UL))
#define bM4_ETH_PTP_TSPCTLR_TSPOVETH                    *((volatile unsigned int*)(0x42C0E02CUL))
#define bM4_ETH_PTP_TSPCTLR_TSPOVIPV6                   *((volatile unsigned int*)(0x42C0E030UL))
#define bM4_ETH_PTP_TSPCTLR_TSPOVIPV4                   *((volatile unsigned int*)(0x42C0E034UL))
#define bM4_ETH_PTP_TSPCTLR_TSPMTSEL0                   *((volatile unsigned int*)(0x42C0E038UL))
#define bM4_ETH_PTP_TSPCTLR_TSPMTSEL1                   *((volatile unsigned int*)(0x42C0E03CUL))
#define bM4_ETH_PTP_TSPCTLR_TSPMTSEL2                   *((volatile unsigned int*)(0x42C0E040UL))
#define bM4_ETH_PTP_TSPCTLR_TSPMTSEL3                   *((volatile unsigned int*)(0x42C0E044UL))
#define bM4_ETH_PTP_TSPCTLR_TSPADF                      *((volatile unsigned int*)(0x42C0E048UL))
#define bM4_ETH_PTP_TSPCTLR_RESV2                       *((volatile unsigned int*)(0x42C0E060UL))
#define bM4_ETH_PTP_TSPSTSR_TSOVF                       *((volatile unsigned int*)(0x42C0E500UL))
#define bM4_ETH_PTP_TSPSTSR_TSTAR0                      *((volatile unsigned int*)(0x42C0E504UL))
#define bM4_ETH_PTP_TSPSTSR_TSERR0                      *((volatile unsigned int*)(0x42C0E50CUL))
#define bM4_ETH_PTP_TSPSTSR_TSTAR1                      *((volatile unsigned int*)(0x42C0E510UL))
#define bM4_ETH_PTP_TSPSTSR_TSERR1                      *((volatile unsigned int*)(0x42C0E514UL))
#define bM4_ETH_PTP_PPSCTLR_PPSFRE00                    *((volatile unsigned int*)(0x42C0E580UL))
#define bM4_ETH_PTP_PPSCTLR_PPSFRE01                    *((volatile unsigned int*)(0x42C0E584UL))
#define bM4_ETH_PTP_PPSCTLR_PPSFRE02                    *((volatile unsigned int*)(0x42C0E588UL))
#define bM4_ETH_PTP_PPSCTLR_PPSFRE03                    *((volatile unsigned int*)(0x42C0E58CUL))
#define bM4_ETH_PTP_PPSCTLR_PPSOMD                      *((volatile unsigned int*)(0x42C0E590UL))
#define bM4_ETH_PTP_PPSCTLR_TT0SEL0                     *((volatile unsigned int*)(0x42C0E594UL))
#define bM4_ETH_PTP_PPSCTLR_TT0SEL1                     *((volatile unsigned int*)(0x42C0E598UL))
#define bM4_ETH_PTP_PPSCTLR_PPSFRE10                    *((volatile unsigned int*)(0x42C0E5A0UL))
#define bM4_ETH_PTP_PPSCTLR_PPSFRE11                    *((volatile unsigned int*)(0x42C0E5A4UL))
#define bM4_ETH_PTP_PPSCTLR_PPSFRE12                    *((volatile unsigned int*)(0x42C0E5A8UL))
#define bM4_ETH_PTP_PPSCTLR_TT1SEL0                     *((volatile unsigned int*)(0x42C0E5B4UL))
#define bM4_ETH_PTP_PPSCTLR_TT1SEL1                     *((volatile unsigned int*)(0x42C0E5B8UL))
#define bM4_ETH_DMA_BUSMODR_SWR                         *((volatile unsigned int*)(0x42C20000UL))
#define bM4_ETH_DMA_BUSMODR_DMAA                        *((volatile unsigned int*)(0x42C20004UL))
#define bM4_ETH_DMA_BUSMODR_DSL0                        *((volatile unsigned int*)(0x42C20008UL))
#define bM4_ETH_DMA_BUSMODR_DSL1                        *((volatile unsigned int*)(0x42C2000CUL))
