RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_ETH_DMA_BUSMODR_DSL2                        *((volatile unsigned int*)(0x42C20010UL))
#define bM4_ETH_DMA_BUSMODR_DSL3                        *((volatile unsigned int*)(0x42C20014UL))
#define bM4_ETH_DMA_BUSMODR_DSL4                        *((volatile unsigned int*)(0x42C20018UL))
#define bM4_ETH_DMA_BUSMODR_DSEN                        *((volatile unsigned int*)(0x42C2001CUL))
#define bM4_ETH_DMA_BUSMODR_TPBL0                       *((volatile unsigned int*)(0x42C20020UL))
#define bM4_ETH_DMA_BUSMODR_TPBL1                       *((volatile unsigned int*)(0x42C20024UL))
#define bM4_ETH_DMA_BUSMODR_TPBL2                       *((volatile unsigned int*)(0x42C20028UL))
#define bM4_ETH_DMA_BUSMODR_TPBL3                       *((volatile unsigned int*)(0x42C2002CUL))
#define bM4_ETH_DMA_BUSMODR_TPBL4                       *((volatile unsigned int*)(0x42C20030UL))
#define bM4_ETH_DMA_BUSMODR_TPBL5                       *((volatile unsigned int*)(0x42C20034UL))
#define bM4_ETH_DMA_BUSMODR_PRAT0                       *((volatile unsigned int*)(0x42C20038UL))
#define bM4_ETH_DMA_BUSMODR_PRAT1                       *((volatile unsigned int*)(0x42C2003CUL))
#define bM4_ETH_DMA_BUSMODR_FBST                        *((volatile unsigned int*)(0x42C20040UL))
#define bM4_ETH_DMA_BUSMODR_RPBL0                       *((volatile unsigned int*)(0x42C20044UL))
#define bM4_ETH_DMA_BUSMODR_RPBL1                       *((volatile unsigned int*)(0x42C20048UL))
#define bM4_ETH_DMA_BUSMODR_RPBL2                       *((volatile unsigned int*)(0x42C2004CUL))
#define bM4_ETH_DMA_BUSMODR_RPBL3                       *((volatile unsigned int*)(0x42C20050UL))
#define bM4_ETH_DMA_BUSMODR_RPBL4                       *((volatile unsigned int*)(0x42C20054UL))
#define bM4_ETH_DMA_BUSMODR_RPBL5                       *((volatile unsigned int*)(0x42C20058UL))
#define bM4_ETH_DMA_BUSMODR_SPBL                        *((volatile unsigned int*)(0x42C2005CUL))
#define bM4_ETH_DMA_BUSMODR_M8PBL                       *((volatile unsigned int*)(0x42C20060UL))
#define bM4_ETH_DMA_BUSMODR_AAL                         *((volatile unsigned int*)(0x42C20064UL))
#define bM4_ETH_DMA_BUSMODR_MBST                        *((volatile unsigned int*)(0x42C20068UL))
#define bM4_ETH_DMA_BUSMODR_TXPR                        *((volatile unsigned int*)(0x42C2006CUL))
#define bM4_ETH_DMA_DMASTSR_TIS                         *((volatile unsigned int*)(0x42C20280UL))
#define bM4_ETH_DMA_DMASTSR_TSS                         *((volatile unsigned int*)(0x42C20284UL))
#define bM4_ETH_DMA_DMASTSR_TUS                         *((volatile unsigned int*)(0x42C20288UL))
#define bM4_ETH_DMA_DMASTSR_TJS                         *((volatile unsigned int*)(0x42C2028CUL))
#define bM4_ETH_DMA_DMASTSR_OVS                         *((volatile unsigned int*)(0x42C20290UL))
#define bM4_ETH_DMA_DMASTSR_UNS                         *((volatile unsigned int*)(0x42C20294UL))
#define bM4_ETH_DMA_DMASTSR_RIS                         *((volatile unsigned int*)(0x42C20298UL))
#define bM4_ETH_DMA_DMASTSR_RUS                         *((volatile unsigned int*)(0x42C2029CUL))
#define bM4_ETH_DMA_DMASTSR_RSS                         *((volatile unsigned int*)(0x42C202A0UL))
#define bM4_ETH_DMA_DMASTSR_RWS                         *((volatile unsigned int*)(0x42C202A4UL))
#define bM4_ETH_DMA_DMASTSR_ETS                         *((volatile unsigned int*)(0x42C202A8UL))
#define bM4_ETH_DMA_DMASTSR_FBS                         *((volatile unsigned int*)(0x42C202B4UL))
#define bM4_ETH_DMA_DMASTSR_ERS                         *((volatile unsigned int*)(0x42C202B8UL))
#define bM4_ETH_DMA_DMASTSR_AIS                         *((volatile unsigned int*)(0x42C202BCUL))
#define bM4_ETH_DMA_DMASTSR_NIS                         *((volatile unsigned int*)(0x42C202C0UL))
#define bM4_ETH_DMA_DMASTSR_RSTS0                       *((volatile unsigned int*)(0x42C202C4UL))
#define bM4_ETH_DMA_DMASTSR_RSTS1                       *((volatile unsigned int*)(0x42C202C8UL))
#define bM4_ETH_DMA_DMASTSR_RSTS2                       *((volatile unsigned int*)(0x42C202CCUL))
#define bM4_ETH_DMA_DMASTSR_TSTS0                       *((volatile unsigned int*)(0x42C202D0UL))
#define bM4_ETH_DMA_DMASTSR_TSTS1                       *((volatile unsigned int*)(0x42C202D4UL))
#define bM4_ETH_DMA_DMASTSR_TSTS2                       *((volatile unsigned int*)(0x42C202D8UL))
#define bM4_ETH_DMA_DMASTSR_EBUS0                       *((volatile unsigned int*)(0x42C202DCUL))
#define bM4_ETH_DMA_DMASTSR_EBUS1                       *((volatile unsigned int*)(0x42C202E0UL))
#define bM4_ETH_DMA_DMASTSR_EBUS2                       *((volatile unsigned int*)(0x42C202E4UL))
#define bM4_ETH_DMA_DMASTSR_MMCS                        *((volatile unsigned int*)(0x42C202ECUL))
#define bM4_ETH_DMA_DMASTSR_PMTS                        *((volatile unsigned int*)(0x42C202F0UL))
#define bM4_ETH_DMA_DMASTSR_PTPS                        *((volatile unsigned int*)(0x42C202F4UL))
#define bM4_ETH_DMA_OPRMODR_STR                         *((volatile unsigned int*)(0x42C20304UL))
#define bM4_ETH_DMA_OPRMODR_OSF                         *((volatile unsigned int*)(0x42C20308UL))
#define bM4_ETH_DMA_OPRMODR_RTC0                        *((volatile unsigned int*)(0x42C2030CUL))
#define bM4_ETH_DMA_OPRMODR_RTC1                        *((volatile unsigned int*)(0x42C20310UL))
#define bM4_ETH_DMA_OPRMODR_DGF                         *((volatile unsigned int*)(0x42C20314UL))
#define bM4_ETH_DMA_OPRMODR_FUF                         *((volatile unsigned int*)(0x42C20318UL))
#define bM4_ETH_DMA_OPRMODR_FEF                         *((volatile unsigned int*)(0x42C2031CUL))
#define bM4_ETH_DMA_OPRMODR_STT                         *((volatile unsigned int*)(0x42C20334UL))
#define bM4_ETH_DMA_OPRMODR_TTC0                        *((volatile unsigned int*)(0x42C20338UL))
#define bM4_ETH_DMA_OPRMODR_TTC1                        *((volatile unsigned int*)(0x42C2033CUL))
#define bM4_ETH_DMA_OPRMODR_TTC2                        *((volatile unsigned int*)(0x42C20340UL))
#define bM4_ETH_DMA_OPRMODR_FTF                         *((volatile unsigned int*)(0x42C20350UL))
#define bM4_ETH_DMA_OPRMODR_TSF                         *((volatile unsigned int*)(0x42C20354UL))
#define bM4_ETH_DMA_OPRMODR_DFRF                        *((volatile unsigned int*)(0x42C20360UL))
#define bM4_ETH_DMA_OPRMODR_RSF                         *((volatile unsigned int*)(0x42C20364UL))
#define bM4_ETH_DMA_OPRMODR_DTCOE                       *((volatile unsigned int*)(0x42C20368UL))
#define bM4_ETH_DMA_INTENAR_TIE                         *((volatile unsigned int*)(0x42C20380UL))
#define bM4_ETH_DMA_INTENAR_TSE                         *((volatile unsigned int*)(0x42C20384UL))
#define bM4_ETH_DMA_INTENAR_TUE                         *((volatile unsigned int*)(0x42C20388UL))
#define bM4_ETH_DMA_INTENAR_TJE                         *((volatile unsigned int*)(0x42C2038CUL))
#define bM4_ETH_DMA_INTENAR_OVE                         *((volatile unsigned int*)(0x42C20390UL))
#define bM4_ETH_DMA_INTENAR_UNE                         *((volatile unsigned int*)(0x42C20394UL))
#define bM4_ETH_DMA_INTENAR_RIE                         *((volatile unsigned int*)(0x42C20398UL))
#define bM4_ETH_DMA_INTENAR_RUE                         *((volatile unsigned int*)(0x42C2039CUL))
#define bM4_ETH_DMA_INTENAR_RSE                         *((volatile unsigned int*)(0x42C203A0UL))
#define bM4_ETH_DMA_INTENAR_RWE                         *((volatile unsigned int*)(0x42C203A4UL))
#define bM4_ETH_DMA_INTENAR_ETE                         *((volatile unsigned int*)(0x42C203A8UL))
#define bM4_ETH_DMA_INTENAR_FBE                         *((volatile unsigned int*)(0x42C203B4UL))
#define bM4_ETH_DMA_INTENAR_ERE                         *((volatile unsigned int*)(0x42C203B8UL))
#define bM4_ETH_DMA_INTENAR_AIE                         *((volatile unsigned int*)(0x42C203BCUL))
#define bM4_ETH_DMA_INTENAR_NIE                         *((volatile unsigned int*)(0x42C203C0UL))
#define bM4_ETH_DMA_INTENAR_RESV8                       *((volatile unsigned int*)(0x42C203E0UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT0                     *((volatile unsigned int*)(0x42C20400UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT1                     *((volatile unsigned int*)(0x42C20404UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT2                     *((volatile unsigned int*)(0x42C20408UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT3                     *((volatile unsigned int*)(0x42C2040CUL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT4                     *((volatile unsigned int*)(0x42C20410UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT5                     *((volatile unsigned int*)(0x42C20414UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT6                     *((volatile unsigned int*)(0x42C20418UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT7                     *((volatile unsigned int*)(0x42C2041CUL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT8                     *((volatile unsigned int*)(0x42C20420UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT9                     *((volatile unsigned int*)(0x42C20424UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT10                    *((volatile unsigned int*)(0x42C20428UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT11                    *((volatile unsigned int*)(0x42C2042CUL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT12                    *((volatile unsigned int*)(0x42C20430UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT13                    *((volatile unsigned int*)(0x42C20434UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT14                    *((volatile unsigned int*)(0x42C20438UL))
#define bM4_ETH_DMA_RFRCNTR_UNACNT15                    *((volatile unsigned int*)(0x42C2043CUL))
#define bM4_ETH_DMA_RFRCNTR_UNAOVF                      *((volatile unsigned int*)(0x42C20440UL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT0                     *((volatile unsigned int*)(0x42C20444UL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT1                     *((volatile unsigned int*)(0x42C20448UL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT2                     *((volatile unsigned int*)(0x42C2044CUL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT3                     *((volatile unsigned int*)(0x42C20450UL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT4                     *((volatile unsigned int*)(0x42C20454UL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT5                     *((volatile unsigned int*)(0x42C20458UL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT6                     *((volatile unsigned int*)(0x42C2045CUL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT7                     *((volatile unsigned int*)(0x42C20460UL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT8                     *((volatile unsigned int*)(0x42C20464UL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT9                     *((volatile unsigned int*)(0x42C20468UL))
#define bM4_ETH_DMA_RFRCNTR_OVFCNT10                    *((volatile unsigned int*)(0x42C2046CUL))
#define bM4_ETH_DMA_RFRCNTR_OVFOVF                      *((volatile unsigned int*)(0x42C20470UL))
#define bM4_EXMC_EXMC_EXCR0_DMCEN                       *((volatile unsigned int*)(0x42AA8400UL))
#define bM4_EXMC_EXMC_EXCR0_SMCEN                       *((volatile unsigned int*)(0x42AA8404UL))
#define bM4_EXMC_EXMC_EXCR0_NFCEN                       *((volatile unsigned int*)(0x42AA8408UL))
#define bM4_EXMC_EXMC_EXCR1_DMCMW0                      *((volatile unsigned int*)(0x42AA8484UL))
#define bM4_EXMC_EXMC_EXCR1_DMCMW1                      *((volatile unsigned int*)(0x42AA8488UL))
#define bM4_EXMC_EXMC_EXCR1_SMCMUX                      *((volatile unsigned int*)(0x42AA84A4UL))
#define bM4_EXMC_EXMC_EXCR1_NFCOPENP                    *((volatile unsigned int*)(0x42AA84C0UL))
#define bM4_EXMC_EXMC_EXCR1_RESV12                      *((volatile unsigned int*)(0x42AA84E0UL))
#define bM4_EXMC_DMC_STSR_STATUS0                       *((volatile unsigned int*)(0x942000000UL))
#define bM4_EXMC_DMC_STSR_STATUS1                       *((volatile unsigned int*)(0x942000004UL))
#define bM4_EXMC_DMC_STSR_MEMMW0                        *((volatile unsigned int*)(0x942000008UL))
#define bM4_EXMC_DMC_STSR_MEMMW1                        *((volatile unsigned int*)(0x94200000CUL))
#define bM4_EXMC_DMC_STCR_STCTL0                        *((volatile unsigned int*)(0x942000080UL))
#define bM4_EXMC_DMC_STCR_STCTL1                        *((volatile unsigned int*)(0x942000084UL))
#define bM4_EXMC_DMC_STCR_STCTL2                        *((volatile unsigned int*)(0x942000088UL))
#define bM4_EXMC_DMC_CMDR_CMDADD0                       *((volatile unsigned int*)(0x942000100UL))
#define bM4_EXMC_DMC_CMDR_CMDADD1                       *((volatile unsigned int*)(0x942000104UL))
#define bM4_EXMC_DMC_CMDR_CMDADD2                       *((volatile unsigned int*)(0x942000108UL))
#define bM4_EXMC_DMC_CMDR_CMDADD3                       *((volatile unsigned int*)(0x94200010CUL))
#define bM4_EXMC_DMC_CMDR_CMDADD4                       *((volatile unsigned int*)(0x942000110UL))
#define bM4_EXMC_DMC_CMDR_CMDADD5                       *((volatile unsigned int*)(0x942000114UL))
#define bM4_EXMC_DMC_CMDR_CMDADD6                       *((volatile unsigned int*)(0x942000118UL))
#define bM4_EXMC_DMC_CMDR_CMDADD7                       *((volatile unsigned int*)(0x94200011CUL))
#define bM4_EXMC_DMC_CMDR_CMDADD8                       *((volatile unsigned int*)(0x942000120UL))
#define bM4_EXMC_DMC_CMDR_CMDADD9                       *((volatile unsigned int*)(0x942000124UL))
#define bM4_EXMC_DMC_CMDR_CMDADD10                      *((volatile unsigned int*)(0x942000128UL))
#define bM4_EXMC_DMC_CMDR_CMDADD11                      *((volatile unsigned int*)(0x94200012CUL))
#define bM4_EXMC_DMC_CMDR_CMDADD12                      *((volatile unsigned int*)(0x942000130UL))
#define bM4_EXMC_DMC_CMDR_CMDADD13                      *((volatile unsigned int*)(0x942000134UL))
#define bM4_EXMC_DMC_CMDR_CMDBA0                        *((volatile unsigned int*)(0x942000140UL))
#define bM4_EXMC_DMC_CMDR_CMDBA1                        *((volatile unsigned int*)(0x942000144UL))
#define bM4_EXMC_DMC_CMDR_CMD0                          *((volatile unsigned int*)(0x942000148UL))
#define bM4_EXMC_DMC_CMDR_CMD1                          *((volatile unsigned int*)(0x94200014CUL))
#define bM4_EXMC_DMC_CMDR_CMDCHIP0                      *((volatile unsigned int*)(0x942000150UL))
#define bM4_EXMC_DMC_CMDR_CMDCHIP1                      *((volatile unsigned int*)(0x942000154UL))
#define bM4_EXMC_DMC_CMDR_RESV5                         *((volatile unsigned int*)(0x942000160UL))
#define bM4_EXMC_DMC_BACR_COLBS0                        *((volatile unsigned int*)(0x942000180UL))
#define bM4_EXMC_DMC_BACR_COLBS1                        *((volatile unsigned int*)(0x942000184UL))
#define bM4_EXMC_DMC_BACR_COLBS2                        *((volatile unsigned int*)(0x942000188UL))
#define bM4_EXMC_DMC_BACR_ROWBS0                        *((volatile unsigned int*)(0x94200018CUL))
#define bM4_EXMC_DMC_BACR_ROWBS1                        *((volatile unsigned int*)(0x942000190UL))
#define bM4_EXMC_DMC_BACR_ROWBS2                        *((volatile unsigned int*)(0x942000194UL))
#define bM4_EXMC_DMC_BACR_APBS                          *((volatile unsigned int*)(0x942000198UL))
#define bM4_EXMC_DMC_BACR_CKEDISPRD0                    *((volatile unsigned int*)(0x94200019CUL))
#define bM4_EXMC_DMC_BACR_CKEDISPRD1                    *((volatile unsigned int*)(0x9420001A0UL))
#define bM4_EXMC_DMC_BACR_CKEDISPRD2                    *((volatile unsigned int*)(0x9420001A4UL))
#define bM4_EXMC_DMC_BACR_CKEDISPRD3                    *((volatile unsigned int*)(0x9420001A8UL))
#define bM4_EXMC_DMC_BACR_CKEDISPRD4                    *((volatile unsigned int*)(0x9420001ACUL))
#define bM4_EXMC_DMC_BACR_CKEDISPRD5                    *((volatile unsigned int*)(0x9420001B0UL))
#define bM4_EXMC_DMC_BACR_CKEDIS                        *((volatile unsigned int*)(0x9420001B4UL))
#define bM4_EXMC_DMC_BACR_CKSTOP                        *((volatile unsigned int*)(0x9420001B8UL))
#define bM4_EXMC_DMC_BACR_BURST0                        *((volatile unsigned int*)(0x9420001BCUL))
#define bM4_EXMC_DMC_BACR_BURST1                        *((volatile unsigned int*)(0x9420001C0UL))
#define bM4_EXMC_DMC_BACR_BURST2                        *((volatile unsigned int*)(0x9420001C4UL))
#define bM4_EXMC_DMC_BACR_ACTCP0                        *((volatile unsigned int*)(0x9420001D4UL))
#define bM4_EXMC_DMC_BACR_ACTCP1                        *((volatile unsigned int*)(0x9420001D8UL))
#define bM4_EXMC_DMC_BACR_RESV6                         *((volatile unsigned int*)(0x9420001E0UL))
#define bM4_EXMC_DMC_RFCR_REFPRD0                       *((volatile unsigned int*)(0x942000200UL))
#define bM4_EXMC_DMC_RFCR_REFPRD1                       *((volatile unsigned int*)(0x942000204UL))
#define bM4_EXMC_DMC_RFCR_REFPRD2                       *((volatile unsigned int*)(0x942000208UL))
#define bM4_EXMC_DMC_RFCR_REFPRD3                       *((volatile unsigned int*)(0x94200020CUL))
#define bM4_EXMC_DMC_RFCR_REFPRD4                       *((volatile unsigned int*)(0x942000210UL))
#define bM4_EXMC_DMC_RFCR_REFPRD5                       *((volatile unsigned int*)(0x942000214UL))
#define bM4_EXMC_DMC_RFCR_REFPRD6                       *((volatile unsigned int*)(0x942000218UL))
#define bM4_EXMC_DMC_RFCR_REFPRD7                       *((volatile unsigned int*)(0x94200021CUL))
#define bM4_EXMC_DMC_RFCR_REFPRD8                       *((volatile unsigned int*)(0x942000220UL))
#define bM4_EXMC_DMC_RFCR_REFPRD9                       *((volatile unsigned int*)(0x942000224UL))
#define bM4_EXMC_DMC_RFCR_REFPRD10                      *((volatile unsigned int*)(0x942000228UL))
#define bM4_EXMC_DMC_RFCR_REFPRD11                      *((volatile unsigned int*)(0x94200022CUL))
#define bM4_EXMC_DMC_RFCR_REFPRD12                      *((volatile unsigned int*)(0x942000230UL))
#define bM4_EXMC_DMC_RFCR_REFPRD13                      *((volatile unsigned int*)(0x942000234UL))
#define bM4_EXMC_DMC_RFCR_REFPRD14                      *((volatile unsigned int*)(0x942000238UL))
#define bM4_EXMC_DMC_TMCR_T_CASL_T_CASL0                *((volatile unsigned int*)(0x942000284UL))
#define bM4_EXMC_DMC_TMCR_T_CASL_T_CASL1                *((volatile unsigned int*)(0x942000288UL))
#define bM4_EXMC_DMC_TMCR_T_CASL_T_CASL2                *((volatile unsigned int*)(0x94200028CUL))
#define bM4_EXMC_DMC_TMCR_T_DQSS_T_DQSS0                *((volatile unsigned int*)(0x942000300UL))
#define bM4_EXMC_DMC_TMCR_T_DQSS_T_DQSS1                *((volatile unsigned int*)(0x942000304UL))
#define bM4_EXMC_DMC_TMCR_T_MRD_T_MRD0                  *((volatile unsigned int*)(0x942000380UL))
#define bM4_EXMC_DMC_TMCR_T_MRD_T_MRD1                  *((volatile unsigned int*)(0x942000384UL))
#define bM4_EXMC_DMC_TMCR_T_MRD_T_MRD2                  *((volatile unsigned int*)(0x942000388UL))
#define bM4_EXMC_DMC_TMCR_T_MRD_T_MRD3                  *((volatile unsigned int*)(0x94200038CUL))
#define bM4_EXMC_DMC_TMCR_T_MRD_T_MRD4                  *((volatile unsigned int*)(0x942000390UL))
#define bM4_EXMC_DMC_TMCR_T_MRD_T_MRD5                  *((volatile unsigned int*)(0x942000394UL))
#define bM4_EXMC_DMC_TMCR_T_MRD_T_MRD6                  *((volatile unsigned int*)(0x942000398UL))
#define bM4_EXMC_DMC_TMCR_T_RAS_T_RAS0                  *((volatile unsigned int*)(0x942000400UL))
#define bM4_EXMC_DMC_TMCR_T_RAS_T_RAS1                  *((volatile unsigned int*)(0x942000404UL))
#define bM4_EXMC_DMC_TMCR_T_RAS_T_RAS2                  *((volatile unsigned int*)(0x942000408UL))
#define bM4_EXMC_DMC_TMCR_T_RAS_T_RAS3                  *((volatile unsigned int*)(0x94200040CUL))
#define bM4_EXMC_DMC_TMCR_T_RC_T_RC0                    *((volatile unsigned int*)(0x942000480UL))
#define bM4_EXMC_DMC_TMCR_T_RC_T_RC1                    *((volatile unsigned int*)(0x942000484UL))
#define bM4_EXMC_DMC_TMCR_T_RC_T_RC2                    *((volatile unsigned int*)(0x942000488UL))
#define bM4_EXMC_DMC_TMCR_T_RC_T_RC3                    *((volatile unsigned int*)(0x94200048CUL))
#define bM4_EXMC_DMC_TMCR_T_RCD_T_RCD0                  *((volatile unsigned int*)(0x942000500UL))
#define bM4_EXMC_DMC_TMCR_T_RCD_T_RCD1                  *((volatile unsigned int*)(0x942000504UL))
#define bM4_EXMC_DMC_TMCR_T_RCD_T_RCD2                  *((volatile unsigned int*)(0x942000508UL))
#define bM4_EXMC_DMC_TMCR_T_RFC_T_RFC0                  *((volatile unsigned int*)(0x942000580UL))
#define bM4_EXMC_DMC_TMCR_T_RFC_T_RFC1                  *((volatile unsigned int*)(0x942000584UL))
#define bM4_EXMC_DMC_TMCR_T_RFC_T_RFC2                  *((volatile unsigned int*)(0x942000588UL))
#define bM4_EXMC_DMC_TMCR_T_RFC_T_RFC3                  *((volatile unsigned int*)(0x94200058CUL))
#define bM4_EXMC_DMC_TMCR_T_RFC_T_RFC4                  *((volatile unsigned int*)(0x942000590UL))
#define bM4_EXMC_DMC_TMCR_T_RP_T_RP0                    *((volatile unsigned int*)(0x942000600UL))
#define bM4_EXMC_DMC_TMCR_T_RP_T_RP1                    *((volatile unsigned int*)(0x942000604UL))
#define bM4_EXMC_DMC_TMCR_T_RP_T_RP2                    *((volatile unsigned int*)(0x942000608UL))
#define bM4_EXMC_DMC_TMCR_T_RRD_T_RRD0                  *((volatile unsigned int*)(0x942000680UL))
#define bM4_EXMC_DMC_TMCR_T_RRD_T_RRD1                  *((volatile unsigned int*)(0x942000684UL))
#define bM4_EXMC_DMC_TMCR_T_RRD_T_RRD2                  *((volatile unsigned int*)(0x942000688UL))
#define bM4_EXMC_DMC_TMCR_T_RRD_T_RRD3                  *((volatile unsigned int*)(0x94200068CUL))
#define bM4_EXMC_DMC_TMCR_T_WR_T_WR0                    *((volatile unsigned int*)(0x942000700UL))
#define bM4_EXMC_DMC_TMCR_T_WR_T_WR1                    *((volatile unsigned int*)(0x942000704UL))
#define bM4_EXMC_DMC_TMCR_T_WR_T_WR2                    *((volatile unsigned int*)(0x942000708UL))
#define bM4_EXMC_DMC_TMCR_T_WTR_T_WTR0                  *((volatile unsigned int*)(0x942000780UL))
#define bM4_EXMC_DMC_TMCR_T_WTR_T_WTR1                  *((volatile unsigned int*)(0x942000784UL))
#define bM4_EXMC_DMC_TMCR_T_WTR_T_WTR2                  *((volatile unsigned int*)(0x942000788UL))
#define bM4_EXMC_DMC_CPCR0_ADDMSK00                     *((volatile unsigned int*)(0x942004000UL))
#define bM4_EXMC_DMC_CPCR0_ADDMSK01                     *((volatile unsigned int*)(0x942004004UL))
#define bM4_EXMC_DMC_CPCR0_ADDMSK02                     *((volatile unsigned int*)(0x942004008UL))
#define bM4_EXMC_DMC_CPCR0_ADDMSK03                     *((volatile unsigned int*)(0x94200400CUL))
#define bM4_EXMC_DMC_CPCR0_ADDMSK04                     *((volatile unsigned int*)(0x942004010UL))
#define bM4_EXMC_DMC_CPCR0_ADDMSK05                     *((volatile unsigned int*)(0x942004014UL))
#define bM4_EXMC_DMC_CPCR0_ADDMSK06                     *((volatile unsigned int*)(0x942004018UL))
#define bM4_EXMC_DMC_CPCR0_ADDMSK07                     *((volatile unsigned int*)(0x94200401CUL))
#define bM4_EXMC_DMC_CPCR0_ADDMAT00                     *((volatile unsigned int*)(0x942004020UL))
#define bM4_EXMC_DMC_CPCR0_ADDMAT01                     *((volatile unsigned int*)(0x942004024UL))
#define bM4_EXMC_DMC_CPCR0_ADDMAT02                     *((volatile unsigned int*)(0x942004028UL))
#define bM4_EXMC_DMC_CPCR0_ADDMAT03                     *((volatile unsigned int*)(0x94200402CUL))
#define bM4_EXMC_DMC_CPCR0_ADDMAT04                     *((volatile unsigned int*)(0x942004030UL))
#define bM4_EXMC_DMC_CPCR0_ADDMAT05                     *((volatile unsigned int*)(0x942004034UL))
#define bM4_EXMC_DMC_CPCR0_ADDMAT06                     *((volatile unsigned int*)(0x942004038UL))
#define bM4_EXMC_DMC_CPCR0_ADDMAT07                     *((volatile unsigned int*)(0x94200403CUL))
#define bM4_EXMC_DMC_CPCR0_BRC0                         *((volatile unsigned int*)(0x942004040UL))
#define bM4_EXMC_DMC_CPCR0_RESV8                        *((volatile unsigned int*)(0x942004060UL))
