RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EXMC_DMC_CPCR1_ADDMSK10                     *((volatile unsigned int*)(0x942004080UL))
#define bM4_EXMC_DMC_CPCR1_ADDMSK11                     *((volatile unsigned int*)(0x942004084UL))
#define bM4_EXMC_DMC_CPCR1_ADDMSK12                     *((volatile unsigned int*)(0x942004088UL))
#define bM4_EXMC_DMC_CPCR1_ADDMSK13                     *((volatile unsigned int*)(0x94200408CUL))
#define bM4_EXMC_DMC_CPCR1_ADDMSK14                     *((volatile unsigned int*)(0x942004090UL))
#define bM4_EXMC_DMC_CPCR1_ADDMSK15                     *((volatile unsigned int*)(0x942004094UL))
#define bM4_EXMC_DMC_CPCR1_ADDMSK16                     *((volatile unsigned int*)(0x942004098UL))
#define bM4_EXMC_DMC_CPCR1_ADDMSK17                     *((volatile unsigned int*)(0x94200409CUL))
#define bM4_EXMC_DMC_CPCR1_ADDMAT10                     *((volatile unsigned int*)(0x9420040A0UL))
#define bM4_EXMC_DMC_CPCR1_ADDMAT11                     *((volatile unsigned int*)(0x9420040A4UL))
#define bM4_EXMC_DMC_CPCR1_ADDMAT12                     *((volatile unsigned int*)(0x9420040A8UL))
#define bM4_EXMC_DMC_CPCR1_ADDMAT13                     *((volatile unsigned int*)(0x9420040ACUL))
#define bM4_EXMC_DMC_CPCR1_ADDMAT14                     *((volatile unsigned int*)(0x9420040B0UL))
#define bM4_EXMC_DMC_CPCR1_ADDMAT15                     *((volatile unsigned int*)(0x9420040B4UL))
#define bM4_EXMC_DMC_CPCR1_ADDMAT16                     *((volatile unsigned int*)(0x9420040B8UL))
#define bM4_EXMC_DMC_CPCR1_ADDMAT17                     *((volatile unsigned int*)(0x9420040BCUL))
#define bM4_EXMC_DMC_CPCR1_BRC1                         *((volatile unsigned int*)(0x9420040C0UL))
#define bM4_EXMC_DMC_CPCR1_RESV9                        *((volatile unsigned int*)(0x9420040E0UL))
#define bM4_EXMC_DMC_CPCR2_ADDMSK20                     *((volatile unsigned int*)(0x942004100UL))
#define bM4_EXMC_DMC_CPCR2_ADDMSK21                     *((volatile unsigned int*)(0x942004104UL))
#define bM4_EXMC_DMC_CPCR2_ADDMSK22                     *((volatile unsigned int*)(0x942004108UL))
#define bM4_EXMC_DMC_CPCR2_ADDMSK23                     *((volatile unsigned int*)(0x94200410CUL))
#define bM4_EXMC_DMC_CPCR2_ADDMSK24                     *((volatile unsigned int*)(0x942004110UL))
#define bM4_EXMC_DMC_CPCR2_ADDMSK25                     *((volatile unsigned int*)(0x942004114UL))
#define bM4_EXMC_DMC_CPCR2_ADDMSK26                     *((volatile unsigned int*)(0x942004118UL))
#define bM4_EXMC_DMC_CPCR2_ADDMSK27                     *((volatile unsigned int*)(0x94200411CUL))
#define bM4_EXMC_DMC_CPCR2_ADDMAT20                     *((volatile unsigned int*)(0x942004120UL))
#define bM4_EXMC_DMC_CPCR2_ADDMAT21                     *((volatile unsigned int*)(0x942004124UL))
#define bM4_EXMC_DMC_CPCR2_ADDMAT22                     *((volatile unsigned int*)(0x942004128UL))
#define bM4_EXMC_DMC_CPCR2_ADDMAT23                     *((volatile unsigned int*)(0x94200412CUL))
#define bM4_EXMC_DMC_CPCR2_ADDMAT24                     *((volatile unsigned int*)(0x942004130UL))
#define bM4_EXMC_DMC_CPCR2_ADDMAT25                     *((volatile unsigned int*)(0x942004134UL))
#define bM4_EXMC_DMC_CPCR2_ADDMAT26                     *((volatile unsigned int*)(0x942004138UL))
#define bM4_EXMC_DMC_CPCR2_ADDMAT27                     *((volatile unsigned int*)(0x94200413CUL))
#define bM4_EXMC_DMC_CPCR2_BRC2                         *((volatile unsigned int*)(0x942004140UL))
#define bM4_EXMC_DMC_CPCR2_RESV10                       *((volatile unsigned int*)(0x942004160UL))
#define bM4_EXMC_DMC_CPCR3_ADDMSK30                     *((volatile unsigned int*)(0x942004180UL))
#define bM4_EXMC_DMC_CPCR3_ADDMSK31                     *((volatile unsigned int*)(0x942004184UL))
#define bM4_EXMC_DMC_CPCR3_ADDMSK32                     *((volatile unsigned int*)(0x942004188UL))
#define bM4_EXMC_DMC_CPCR3_ADDMSK33                     *((volatile unsigned int*)(0x94200418CUL))
#define bM4_EXMC_DMC_CPCR3_ADDMSK34                     *((volatile unsigned int*)(0x942004190UL))
#define bM4_EXMC_DMC_CPCR3_ADDMSK35                     *((volatile unsigned int*)(0x942004194UL))
#define bM4_EXMC_DMC_CPCR3_ADDMSK36                     *((volatile unsigned int*)(0x942004198UL))
#define bM4_EXMC_DMC_CPCR3_ADDMSK37                     *((volatile unsigned int*)(0x94200419CUL))
#define bM4_EXMC_DMC_CPCR3_ADDMAT30                     *((volatile unsigned int*)(0x9420041A0UL))
#define bM4_EXMC_DMC_CPCR3_ADDMAT31                     *((volatile unsigned int*)(0x9420041A4UL))
#define bM4_EXMC_DMC_CPCR3_ADDMAT32                     *((volatile unsigned int*)(0x9420041A8UL))
#define bM4_EXMC_DMC_CPCR3_ADDMAT33                     *((volatile unsigned int*)(0x9420041ACUL))
#define bM4_EXMC_DMC_CPCR3_ADDMAT34                     *((volatile unsigned int*)(0x9420041B0UL))
#define bM4_EXMC_DMC_CPCR3_ADDMAT35                     *((volatile unsigned int*)(0x9420041B4UL))
#define bM4_EXMC_DMC_CPCR3_ADDMAT36                     *((volatile unsigned int*)(0x9420041B8UL))
#define bM4_EXMC_DMC_CPCR3_ADDMAT37                     *((volatile unsigned int*)(0x9420041BCUL))
#define bM4_EXMC_DMC_CPCR3_BRC3                         *((volatile unsigned int*)(0x9420041C0UL))
#define bM4_EXMC_DMC_CPCR3_RESV11                       *((volatile unsigned int*)(0x9420041E0UL))
#define bM4_EXMC_SMC_STSR_STATUS                        *((volatile unsigned int*)(0x942020000UL))
#define bM4_EXMC_SMC_STCR0_LPWIR                        *((volatile unsigned int*)(0x942020108UL))
#define bM4_EXMC_SMC_STCR1_LPWOR                        *((volatile unsigned int*)(0x942020188UL))
#define bM4_EXMC_SMC_CMDR_CMDADD0                       *((volatile unsigned int*)(0x942020200UL))
#define bM4_EXMC_SMC_CMDR_CMDADD1                       *((volatile unsigned int*)(0x942020204UL))
#define bM4_EXMC_SMC_CMDR_CMDADD2                       *((volatile unsigned int*)(0x942020208UL))
#define bM4_EXMC_SMC_CMDR_CMDADD3                       *((volatile unsigned int*)(0x94202020CUL))
#define bM4_EXMC_SMC_CMDR_CMDADD4                       *((volatile unsigned int*)(0x942020210UL))
#define bM4_EXMC_SMC_CMDR_CMDADD5                       *((volatile unsigned int*)(0x942020214UL))
#define bM4_EXMC_SMC_CMDR_CMDADD6                       *((volatile unsigned int*)(0x942020218UL))
#define bM4_EXMC_SMC_CMDR_CMDADD7                       *((volatile unsigned int*)(0x94202021CUL))
#define bM4_EXMC_SMC_CMDR_CMDADD8                       *((volatile unsigned int*)(0x942020220UL))
#define bM4_EXMC_SMC_CMDR_CMDADD9                       *((volatile unsigned int*)(0x942020224UL))
#define bM4_EXMC_SMC_CMDR_CMDADD10                      *((volatile unsigned int*)(0x942020228UL))
#define bM4_EXMC_SMC_CMDR_CMDADD11                      *((volatile unsigned int*)(0x94202022CUL))
#define bM4_EXMC_SMC_CMDR_CMDADD12                      *((volatile unsigned int*)(0x942020230UL))
#define bM4_EXMC_SMC_CMDR_CMDADD13                      *((volatile unsigned int*)(0x942020234UL))
#define bM4_EXMC_SMC_CMDR_CMDADD14                      *((volatile unsigned int*)(0x942020238UL))
#define bM4_EXMC_SMC_CMDR_CMDADD15                      *((volatile unsigned int*)(0x94202023CUL))
#define bM4_EXMC_SMC_CMDR_CMDADD16                      *((volatile unsigned int*)(0x942020240UL))
#define bM4_EXMC_SMC_CMDR_CMDADD17                      *((volatile unsigned int*)(0x942020244UL))
#define bM4_EXMC_SMC_CMDR_CMDADD18                      *((volatile unsigned int*)(0x942020248UL))
#define bM4_EXMC_SMC_CMDR_CMDADD19                      *((volatile unsigned int*)(0x94202024CUL))
#define bM4_EXMC_SMC_CMDR_CRES                          *((volatile unsigned int*)(0x942020250UL))
#define bM4_EXMC_SMC_CMDR_CMD0                          *((volatile unsigned int*)(0x942020254UL))
#define bM4_EXMC_SMC_CMDR_CMD1                          *((volatile unsigned int*)(0x942020258UL))
#define bM4_EXMC_SMC_CMDR_CMDCHIP0                      *((volatile unsigned int*)(0x94202025CUL))
#define bM4_EXMC_SMC_CMDR_CMDCHIP1                      *((volatile unsigned int*)(0x942020260UL))
#define bM4_EXMC_SMC_CMDR_CMDCHIP2                      *((volatile unsigned int*)(0x942020264UL))
#define bM4_EXMC_SMC_TMCR_T_RC0                         *((volatile unsigned int*)(0x942020280UL))
#define bM4_EXMC_SMC_TMCR_T_RC1                         *((volatile unsigned int*)(0x942020284UL))
#define bM4_EXMC_SMC_TMCR_T_RC2                         *((volatile unsigned int*)(0x942020288UL))
#define bM4_EXMC_SMC_TMCR_T_RC3                         *((volatile unsigned int*)(0x94202028CUL))
#define bM4_EXMC_SMC_TMCR_T_WC0                         *((volatile unsigned int*)(0x942020290UL))
#define bM4_EXMC_SMC_TMCR_T_WC1                         *((volatile unsigned int*)(0x942020294UL))
#define bM4_EXMC_SMC_TMCR_T_WC2                         *((volatile unsigned int*)(0x942020298UL))
#define bM4_EXMC_SMC_TMCR_T_WC3                         *((volatile unsigned int*)(0x94202029CUL))
#define bM4_EXMC_SMC_TMCR_T_CEOE0                       *((volatile unsigned int*)(0x9420202A0UL))
#define bM4_EXMC_SMC_TMCR_T_CEOE1                       *((volatile unsigned int*)(0x9420202A4UL))
#define bM4_EXMC_SMC_TMCR_T_CEOE2                       *((volatile unsigned int*)(0x9420202A8UL))
#define bM4_EXMC_SMC_TMCR_T_WP0                         *((volatile unsigned int*)(0x9420202ACUL))
#define bM4_EXMC_SMC_TMCR_T_WP1                         *((volatile unsigned int*)(0x9420202B0UL))
#define bM4_EXMC_SMC_TMCR_T_WP2                         *((volatile unsigned int*)(0x9420202B4UL))
#define bM4_EXMC_SMC_TMCR_T_PC0                         *((volatile unsigned int*)(0x9420202B8UL))
#define bM4_EXMC_SMC_TMCR_T_PC1                         *((volatile unsigned int*)(0x9420202BCUL))
#define bM4_EXMC_SMC_TMCR_T_PC2                         *((volatile unsigned int*)(0x9420202C0UL))
#define bM4_EXMC_SMC_TMCR_T_TR0                         *((volatile unsigned int*)(0x9420202C4UL))
#define bM4_EXMC_SMC_TMCR_T_TR1                         *((volatile unsigned int*)(0x9420202C8UL))
#define bM4_EXMC_SMC_TMCR_T_TR2                         *((volatile unsigned int*)(0x9420202CCUL))
#define bM4_EXMC_SMC_TMCR_RESV0                         *((volatile unsigned int*)(0x9420202E0UL))
#define bM4_EXMC_SMC_BACR_MW0                           *((volatile unsigned int*)(0x942020300UL))
#define bM4_EXMC_SMC_BACR_MW1                           *((volatile unsigned int*)(0x942020304UL))
#define bM4_EXMC_SMC_BACR_RSYN                          *((volatile unsigned int*)(0x942020308UL))
#define bM4_EXMC_SMC_BACR_RBL0                          *((volatile unsigned int*)(0x94202030CUL))
#define bM4_EXMC_SMC_BACR_RBL1                          *((volatile unsigned int*)(0x942020310UL))
#define bM4_EXMC_SMC_BACR_RBL2                          *((volatile unsigned int*)(0x942020314UL))
#define bM4_EXMC_SMC_BACR_WSYN                          *((volatile unsigned int*)(0x942020318UL))
#define bM4_EXMC_SMC_BACR_WBL0                          *((volatile unsigned int*)(0x94202031CUL))
#define bM4_EXMC_SMC_BACR_WBL1                          *((volatile unsigned int*)(0x942020320UL))
#define bM4_EXMC_SMC_BACR_WBL2                          *((volatile unsigned int*)(0x942020324UL))
#define bM4_EXMC_SMC_BACR_BAAS                          *((volatile unsigned int*)(0x942020328UL))
#define bM4_EXMC_SMC_BACR_ADVS                          *((volatile unsigned int*)(0x94202032CUL))
#define bM4_EXMC_SMC_BACR_BLSS                          *((volatile unsigned int*)(0x942020330UL))
#define bM4_EXMC_SMC_RFCR_REFPRD0                       *((volatile unsigned int*)(0x942020400UL))
#define bM4_EXMC_SMC_RFCR_REFPRD1                       *((volatile unsigned int*)(0x942020404UL))
#define bM4_EXMC_SMC_RFCR_REFPRD2                       *((volatile unsigned int*)(0x942020408UL))
#define bM4_EXMC_SMC_RFCR_REFPRD3                       *((volatile unsigned int*)(0x94202040CUL))
#define bM4_EXMC_SMC_TMSR0_T_RC00                       *((volatile unsigned int*)(0x942022000UL))
#define bM4_EXMC_SMC_TMSR0_T_RC01                       *((volatile unsigned int*)(0x942022004UL))
#define bM4_EXMC_SMC_TMSR0_T_RC02                       *((volatile unsigned int*)(0x942022008UL))
#define bM4_EXMC_SMC_TMSR0_T_RC03                       *((volatile unsigned int*)(0x94202200CUL))
#define bM4_EXMC_SMC_TMSR0_T_WC00                       *((volatile unsigned int*)(0x942022010UL))
#define bM4_EXMC_SMC_TMSR0_T_WC01                       *((volatile unsigned int*)(0x942022014UL))
#define bM4_EXMC_SMC_TMSR0_T_WC02                       *((volatile unsigned int*)(0x942022018UL))
#define bM4_EXMC_SMC_TMSR0_T_WC03                       *((volatile unsigned int*)(0x94202201CUL))
#define bM4_EXMC_SMC_TMSR0_T_CEOE00                     *((volatile unsigned int*)(0x942022020UL))
#define bM4_EXMC_SMC_TMSR0_T_CEOE01                     *((volatile unsigned int*)(0x942022024UL))
#define bM4_EXMC_SMC_TMSR0_T_CEOE02                     *((volatile unsigned int*)(0x942022028UL))
#define bM4_EXMC_SMC_TMSR0_T_WP00                       *((volatile unsigned int*)(0x94202202CUL))
#define bM4_EXMC_SMC_TMSR0_T_WP01                       *((volatile unsigned int*)(0x942022030UL))
#define bM4_EXMC_SMC_TMSR0_T_WP02                       *((volatile unsigned int*)(0x942022034UL))
#define bM4_EXMC_SMC_TMSR0_T_PC00                       *((volatile unsigned int*)(0x942022038UL))
#define bM4_EXMC_SMC_TMSR0_T_PC01                       *((volatile unsigned int*)(0x94202203CUL))
#define bM4_EXMC_SMC_TMSR0_T_PC02                       *((volatile unsigned int*)(0x942022040UL))
#define bM4_EXMC_SMC_TMSR0_T_TR00                       *((volatile unsigned int*)(0x942022044UL))
#define bM4_EXMC_SMC_TMSR0_T_TR01                       *((volatile unsigned int*)(0x942022048UL))
#define bM4_EXMC_SMC_TMSR0_T_TR02                       *((volatile unsigned int*)(0x94202204CUL))
#define bM4_EXMC_SMC_TMSR0_RESV1                        *((volatile unsigned int*)(0x942022060UL))
#define bM4_EXMC_SMC_BASR0_MW00                         *((volatile unsigned int*)(0x942022080UL))
#define bM4_EXMC_SMC_BASR0_MW01                         *((volatile unsigned int*)(0x942022084UL))
#define bM4_EXMC_SMC_BASR0_RSYN0                        *((volatile unsigned int*)(0x942022088UL))
#define bM4_EXMC_SMC_BASR0_RBL00                        *((volatile unsigned int*)(0x94202208CUL))
#define bM4_EXMC_SMC_BASR0_RBL01                        *((volatile unsigned int*)(0x942022090UL))
#define bM4_EXMC_SMC_BASR0_RBL02                        *((volatile unsigned int*)(0x942022094UL))
#define bM4_EXMC_SMC_BASR0_WSYN0                        *((volatile unsigned int*)(0x942022098UL))
#define bM4_EXMC_SMC_BASR0_WBL00                        *((volatile unsigned int*)(0x94202209CUL))
#define bM4_EXMC_SMC_BASR0_WBL01                        *((volatile unsigned int*)(0x9420220A0UL))
#define bM4_EXMC_SMC_BASR0_WBL02                        *((volatile unsigned int*)(0x9420220A4UL))
#define bM4_EXMC_SMC_BASR0_BAAS0                        *((volatile unsigned int*)(0x9420220A8UL))
#define bM4_EXMC_SMC_BASR0_ADVS0                        *((volatile unsigned int*)(0x9420220ACUL))
#define bM4_EXMC_SMC_BASR0_BLSS0                        *((volatile unsigned int*)(0x9420220B0UL))
#define bM4_EXMC_SMC_BASR0_ADDMSK00                     *((volatile unsigned int*)(0x9420220C0UL))
#define bM4_EXMC_SMC_BASR0_ADDMSK01                     *((volatile unsigned int*)(0x9420220C4UL))
#define bM4_EXMC_SMC_BASR0_ADDMSK02                     *((volatile unsigned int*)(0x9420220C8UL))
#define bM4_EXMC_SMC_BASR0_ADDMSK03                     *((volatile unsigned int*)(0x9420220CCUL))
#define bM4_EXMC_SMC_BASR0_ADDMSK04                     *((volatile unsigned int*)(0x9420220D0UL))
#define bM4_EXMC_SMC_BASR0_ADDMSK05                     *((volatile unsigned int*)(0x9420220D4UL))
#define bM4_EXMC_SMC_BASR0_ADDMSK06                     *((volatile unsigned int*)(0x9420220D8UL))
#define bM4_EXMC_SMC_BASR0_ADDMSK07                     *((volatile unsigned int*)(0x9420220DCUL))
#define bM4_EXMC_SMC_BASR0_ADDMAT00                     *((volatile unsigned int*)(0x9420220E0UL))
#define bM4_EXMC_SMC_BASR0_ADDMAT01                     *((volatile unsigned int*)(0x9420220E4UL))
#define bM4_EXMC_SMC_BASR0_ADDMAT02                     *((volatile unsigned int*)(0x9420220E8UL))
#define bM4_EXMC_SMC_BASR0_ADDMAT03                     *((volatile unsigned int*)(0x9420220ECUL))
#define bM4_EXMC_SMC_BASR0_ADDMAT04                     *((volatile unsigned int*)(0x9420220F0UL))
#define bM4_EXMC_SMC_BASR0_ADDMAT05                     *((volatile unsigned int*)(0x9420220F4UL))
#define bM4_EXMC_SMC_BASR0_ADDMAT06                     *((volatile unsigned int*)(0x9420220F8UL))
#define bM4_EXMC_SMC_BASR0_ADDMAT07                     *((volatile unsigned int*)(0x9420220FCUL))
#define bM4_EXMC_SMC_TMSR1_T_RC10                       *((volatile unsigned int*)(0x942022400UL))
#define bM4_EXMC_SMC_TMSR1_T_RC11                       *((volatile unsigned int*)(0x942022404UL))
#define bM4_EXMC_SMC_TMSR1_T_RC12                       *((volatile unsigned int*)(0x942022408UL))
#define bM4_EXMC_SMC_TMSR1_T_RC13                       *((volatile unsigned int*)(0x94202240CUL))
#define bM4_EXMC_SMC_TMSR1_T_WC10                       *((volatile unsigned int*)(0x942022410UL))
#define bM4_EXMC_SMC_TMSR1_T_WC11                       *((volatile unsigned int*)(0x942022414UL))
#define bM4_EXMC_SMC_TMSR1_T_WC12                       *((volatile unsigned int*)(0x942022418UL))
#define bM4_EXMC_SMC_TMSR1_T_WC13                       *((volatile unsigned int*)(0x94202241CUL))
#define bM4_EXMC_SMC_TMSR1_T_CEOE10                     *((volatile unsigned int*)(0x942022420UL))
#define bM4_EXMC_SMC_TMSR1_T_CEOE11                     *((volatile unsigned int*)(0x942022424UL))
#define bM4_EXMC_SMC_TMSR1_T_CEOE12                     *((volatile unsigned int*)(0x942022428UL))
#define bM4_EXMC_SMC_TMSR1_T_WP10                       *((volatile unsigned int*)(0x94202242CUL))
#define bM4_EXMC_SMC_TMSR1_T_WP11                       *((volatile unsigned int*)(0x942022430UL))
#define bM4_EXMC_SMC_TMSR1_T_WP12                       *((volatile unsigned int*)(0x942022434UL))
#define bM4_EXMC_SMC_TMSR1_T_PC10                       *((volatile unsigned int*)(0x942022438UL))
#define bM4_EXMC_SMC_TMSR1_T_PC11                       *((volatile unsigned int*)(0x94202243CUL))
#define bM4_EXMC_SMC_TMSR1_T_PC12                       *((volatile unsigned int*)(0x942022440UL))
#define bM4_EXMC_SMC_TMSR1_T_TR10                       *((volatile unsigned int*)(0x942022444UL))
#define bM4_EXMC_SMC_TMSR1_T_TR11                       *((volatile unsigned int*)(0x942022448UL))
#define bM4_EXMC_SMC_TMSR1_T_TR12                       *((volatile unsigned int*)(0x94202244CUL))
#define bM4_EXMC_SMC_TMSR1_RESV2                        *((volatile unsigned int*)(0x942022460UL))
#define bM4_EXMC_SMC_BASR1_MW10                         *((volatile unsigned int*)(0x942022480UL))
#define bM4_EXMC_SMC_BASR1_MW11                         *((volatile unsigned int*)(0x942022484UL))
#define bM4_EXMC_SMC_BASR1_RSYN1                        *((volatile unsigned int*)(0x942022488UL))
#define bM4_EXMC_SMC_BASR1_RBL10                        *((volatile unsigned int*)(0x94202248CUL))
#define bM4_EXMC_SMC_BASR1_RBL11                        *((volatile unsigned int*)(0x942022490UL))
#define bM4_EXMC_SMC_BASR1_RBL12                        *((volatile unsigned int*)(0x942022494UL))
#define bM4_EXMC_SMC_BASR1_WSYN1                        *((volatile unsigned int*)(0x942022498UL))
#define bM4_EXMC_SMC_BASR1_WBL10                        *((volatile unsigned int*)(0x94202249CUL))
#define bM4_EXMC_SMC_BASR1_WBL11                        *((volatile unsigned int*)(0x9420224A0UL))
#define bM4_EXMC_SMC_BASR1_WBL12                        *((volatile unsigned int*)(0x9420224A4UL))
#define bM4_EXMC_SMC_BASR1_BAAS1                        *((volatile unsigned int*)(0x9420224A8UL))
#define bM4_EXMC_SMC_BASR1_ADVS1                        *((volatile unsigned int*)(0x9420224ACUL))
#define bM4_EXMC_SMC_BASR1_BLSS1                        *((volatile unsigned int*)(0x9420224B0UL))
#define bM4_EXMC_SMC_BASR1_ADDMSK10                     *((volatile unsigned int*)(0x9420224C0UL))
#define bM4_EXMC_SMC_BASR1_ADDMSK11                     *((volatile unsigned int*)(0x9420224C4UL))
#define bM4_EXMC_SMC_BASR1_ADDMSK12                     *((volatile unsigned int*)(0x9420224C8UL))
#define bM4_EXMC_SMC_BASR1_ADDMSK13                     *((volatile unsigned int*)(0x9420224CCUL))
#define bM4_EXMC_SMC_BASR1_ADDMSK14                     *((volatile unsigned int*)(0x9420224D0UL))
#define bM4_EXMC_SMC_BASR1_ADDMSK15                     *((volatile unsigned int*)(0x9420224D4UL))
#define bM4_EXMC_SMC_BASR1_ADDMSK16                     *((volatile unsigned int*)(0x9420224D8UL))
#define bM4_EXMC_SMC_BASR1_ADDMSK17                     *((volatile unsigned int*)(0x9420224DCUL))
#define bM4_EXMC_SMC_BASR1_ADDMAT10                     *((volatile unsigned int*)(0x9420224E0UL))
#define bM4_EXMC_SMC_BASR1_ADDMAT11                     *((volatile unsigned int*)(0x9420224E4UL))
#define bM4_EXMC_SMC_BASR1_ADDMAT12                     *((volatile unsigned int*)(0x9420224E8UL))
#define bM4_EXMC_SMC_BASR1_ADDMAT13                     *((volatile unsigned int*)(0x9420224ECUL))
#define bM4_EXMC_SMC_BASR1_ADDMAT14                     *((volatile unsigned int*)(0x9420224F0UL))
#define bM4_EXMC_SMC_BASR1_ADDMAT15                     *((volatile unsigned int*)(0x9420224F4UL))
#define bM4_EXMC_SMC_BASR1_ADDMAT16                     *((volatile unsigned int*)(0x9420224F8UL))
#define bM4_EXMC_SMC_BASR1_ADDMAT17                     *((volatile unsigned int*)(0x9420224FCUL))
#define bM4_EXMC_SMC_TMSR2_T_RC20                       *((volatile unsigned int*)(0x942022800UL))
#define bM4_EXMC_SMC_TMSR2_T_RC21                       *((volatile unsigned int*)(0x942022804UL))
#define bM4_EXMC_SMC_TMSR2_T_RC22                       *((volatile unsigned int*)(0x942022808UL))
#define bM4_EXMC_SMC_TMSR2_T_RC23                       *((volatile unsigned int*)(0x94202280CUL))
#define bM4_EXMC_SMC_TMSR2_T_WC20                       *((volatile unsigned int*)(0x942022810UL))
#define bM4_EXMC_SMC_TMSR2_T_WC21                       *((volatile unsigned int*)(0x942022814UL))
#define bM4_EXMC_SMC_TMSR2_T_WC22                       *((volatile unsigned int*)(0x942022818UL))
#define bM4_EXMC_SMC_TMSR2_T_WC23                       *((volatile unsigned int*)(0x94202281CUL))
#define bM4_EXMC_SMC_TMSR2_T_CEOE20                     *((volatile unsigned int*)(0x942022820UL))
#define bM4_EXMC_SMC_TMSR2_T_CEOE21                     *((volatile unsigned int*)(0x942022824UL))
#define bM4_EXMC_SMC_TMSR2_T_CEOE22                     *((volatile unsigned int*)(0x942022828UL))
#define bM4_EXMC_SMC_TMSR2_T_WP20                       *((volatile unsigned int*)(0x94202282CUL))
#define bM4_EXMC_SMC_TMSR2_T_WP21                       *((volatile unsigned int*)(0x942022830UL))
#define bM4_EXMC_SMC_TMSR2_T_WP22                       *((volatile unsigned int*)(0x942022834UL))
#define bM4_EXMC_SMC_TMSR2_T_PC20                       *((volatile unsigned int*)(0x942022838UL))
#define bM4_EXMC_SMC_TMSR2_T_PC21                       *((volatile unsigned int*)(0x94202283CUL))
#define bM4_EXMC_SMC_TMSR2_T_PC22                       *((volatile unsigned int*)(0x942022840UL))
#define bM4_EXMC_SMC_TMSR2_T_TR20                       *((volatile unsigned int*)(0x942022844UL))
#define bM4_EXMC_SMC_TMSR2_T_TR21                       *((volatile unsigned int*)(0x942022848UL))
#define bM4_EXMC_SMC_TMSR2_T_TR22                       *((volatile unsigned int*)(0x94202284CUL))
#define bM4_EXMC_SMC_TMSR2_RESV3                        *((volatile unsigned int*)(0x942022860UL))
