RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EXMC_SMC_BASR2_MW20                         *((volatile unsigned int*)(0x942022880UL))
#define bM4_EXMC_SMC_BASR2_MW21                         *((volatile unsigned int*)(0x942022884UL))
#define bM4_EXMC_SMC_BASR2_RSYN2                        *((volatile unsigned int*)(0x942022888UL))
#define bM4_EXMC_SMC_BASR2_RBL20                        *((volatile unsigned int*)(0x94202288CUL))
#define bM4_EXMC_SMC_BASR2_RBL21                        *((volatile unsigned int*)(0x942022890UL))
#define bM4_EXMC_SMC_BASR2_RBL22                        *((volatile unsigned int*)(0x942022894UL))
#define bM4_EXMC_SMC_BASR2_WSYN2                        *((volatile unsigned int*)(0x942022898UL))
#define bM4_EXMC_SMC_BASR2_WBL20                        *((volatile unsigned int*)(0x94202289CUL))
#define bM4_EXMC_SMC_BASR2_WBL21                        *((volatile unsigned int*)(0x9420228A0UL))
#define bM4_EXMC_SMC_BASR2_WBL22                        *((volatile unsigned int*)(0x9420228A4UL))
#define bM4_EXMC_SMC_BASR2_BAAS2                        *((volatile unsigned int*)(0x9420228A8UL))
#define bM4_EXMC_SMC_BASR2_ADVS2                        *((volatile unsigned int*)(0x9420228ACUL))
#define bM4_EXMC_SMC_BASR2_BLSS2                        *((volatile unsigned int*)(0x9420228B0UL))
#define bM4_EXMC_SMC_BASR2_ADDMSK20                     *((volatile unsigned int*)(0x9420228C0UL))
#define bM4_EXMC_SMC_BASR2_ADDMSK21                     *((volatile unsigned int*)(0x9420228C4UL))
#define bM4_EXMC_SMC_BASR2_ADDMSK22                     *((volatile unsigned int*)(0x9420228C8UL))
#define bM4_EXMC_SMC_BASR2_ADDMSK23                     *((volatile unsigned int*)(0x9420228CCUL))
#define bM4_EXMC_SMC_BASR2_ADDMSK24                     *((volatile unsigned int*)(0x9420228D0UL))
#define bM4_EXMC_SMC_BASR2_ADDMSK25                     *((volatile unsigned int*)(0x9420228D4UL))
#define bM4_EXMC_SMC_BASR2_ADDMSK26                     *((volatile unsigned int*)(0x9420228D8UL))
#define bM4_EXMC_SMC_BASR2_ADDMSK27                     *((volatile unsigned int*)(0x9420228DCUL))
#define bM4_EXMC_SMC_BASR2_ADDMAT20                     *((volatile unsigned int*)(0x9420228E0UL))
#define bM4_EXMC_SMC_BASR2_ADDMAT21                     *((volatile unsigned int*)(0x9420228E4UL))
#define bM4_EXMC_SMC_BASR2_ADDMAT22                     *((volatile unsigned int*)(0x9420228E8UL))
#define bM4_EXMC_SMC_BASR2_ADDMAT23                     *((volatile unsigned int*)(0x9420228ECUL))
#define bM4_EXMC_SMC_BASR2_ADDMAT24                     *((volatile unsigned int*)(0x9420228F0UL))
#define bM4_EXMC_SMC_BASR2_ADDMAT25                     *((volatile unsigned int*)(0x9420228F4UL))
#define bM4_EXMC_SMC_BASR2_ADDMAT26                     *((volatile unsigned int*)(0x9420228F8UL))
#define bM4_EXMC_SMC_BASR2_ADDMAT27                     *((volatile unsigned int*)(0x9420228FCUL))
#define bM4_EXMC_SMC_TMSR3_T_RC30                       *((volatile unsigned int*)(0x942022C00UL))
#define bM4_EXMC_SMC_TMSR3_T_RC31                       *((volatile unsigned int*)(0x942022C04UL))
#define bM4_EXMC_SMC_TMSR3_T_RC32                       *((volatile unsigned int*)(0x942022C08UL))
#define bM4_EXMC_SMC_TMSR3_T_RC33                       *((volatile unsigned int*)(0x942022C0CUL))
#define bM4_EXMC_SMC_TMSR3_T_WC30                       *((volatile unsigned int*)(0x942022C10UL))
#define bM4_EXMC_SMC_TMSR3_T_WC31                       *((volatile unsigned int*)(0x942022C14UL))
#define bM4_EXMC_SMC_TMSR3_T_WC32                       *((volatile unsigned int*)(0x942022C18UL))
#define bM4_EXMC_SMC_TMSR3_T_WC33                       *((volatile unsigned int*)(0x942022C1CUL))
#define bM4_EXMC_SMC_TMSR3_T_CEOE30                     *((volatile unsigned int*)(0x942022C20UL))
#define bM4_EXMC_SMC_TMSR3_T_CEOE31                     *((volatile unsigned int*)(0x942022C24UL))
#define bM4_EXMC_SMC_TMSR3_T_CEOE32                     *((volatile unsigned int*)(0x942022C28UL))
#define bM4_EXMC_SMC_TMSR3_T_WP30                       *((volatile unsigned int*)(0x942022C2CUL))
#define bM4_EXMC_SMC_TMSR3_T_WP31                       *((volatile unsigned int*)(0x942022C30UL))
#define bM4_EXMC_SMC_TMSR3_T_WP32                       *((volatile unsigned int*)(0x942022C34UL))
#define bM4_EXMC_SMC_TMSR3_T_PC30                       *((volatile unsigned int*)(0x942022C38UL))
#define bM4_EXMC_SMC_TMSR3_T_PC31                       *((volatile unsigned int*)(0x942022C3CUL))
#define bM4_EXMC_SMC_TMSR3_T_PC32                       *((volatile unsigned int*)(0x942022C40UL))
#define bM4_EXMC_SMC_TMSR3_T_TR30                       *((volatile unsigned int*)(0x942022C44UL))
#define bM4_EXMC_SMC_TMSR3_T_TR31                       *((volatile unsigned int*)(0x942022C48UL))
#define bM4_EXMC_SMC_TMSR3_T_TR32                       *((volatile unsigned int*)(0x942022C4CUL))
#define bM4_EXMC_SMC_TMSR3_RESV4                        *((volatile unsigned int*)(0x942022C60UL))
#define bM4_EXMC_SMC_BASR3_MW30                         *((volatile unsigned int*)(0x942022C80UL))
#define bM4_EXMC_SMC_BASR3_MW31                         *((volatile unsigned int*)(0x942022C84UL))
#define bM4_EXMC_SMC_BASR3_RSYN3                        *((volatile unsigned int*)(0x942022C88UL))
#define bM4_EXMC_SMC_BASR3_RBL30                        *((volatile unsigned int*)(0x942022C8CUL))
#define bM4_EXMC_SMC_BASR3_RBL31                        *((volatile unsigned int*)(0x942022C90UL))
#define bM4_EXMC_SMC_BASR3_RBL32                        *((volatile unsigned int*)(0x942022C94UL))
#define bM4_EXMC_SMC_BASR3_WSYN3                        *((volatile unsigned int*)(0x942022C98UL))
#define bM4_EXMC_SMC_BASR3_WBL30                        *((volatile unsigned int*)(0x942022C9CUL))
#define bM4_EXMC_SMC_BASR3_WBL31                        *((volatile unsigned int*)(0x942022CA0UL))
#define bM4_EXMC_SMC_BASR3_WBL32                        *((volatile unsigned int*)(0x942022CA4UL))
#define bM4_EXMC_SMC_BASR3_BAAS3                        *((volatile unsigned int*)(0x942022CA8UL))
#define bM4_EXMC_SMC_BASR3_ADVS3                        *((volatile unsigned int*)(0x942022CACUL))
#define bM4_EXMC_SMC_BASR3_BLSS3                        *((volatile unsigned int*)(0x942022CB0UL))
#define bM4_EXMC_SMC_BASR3_ADDMSK30                     *((volatile unsigned int*)(0x942022CC0UL))
#define bM4_EXMC_SMC_BASR3_ADDMSK31                     *((volatile unsigned int*)(0x942022CC4UL))
#define bM4_EXMC_SMC_BASR3_ADDMSK32                     *((volatile unsigned int*)(0x942022CC8UL))
#define bM4_EXMC_SMC_BASR3_ADDMSK33                     *((volatile unsigned int*)(0x942022CCCUL))
#define bM4_EXMC_SMC_BASR3_ADDMSK34                     *((volatile unsigned int*)(0x942022CD0UL))
#define bM4_EXMC_SMC_BASR3_ADDMSK35                     *((volatile unsigned int*)(0x942022CD4UL))
#define bM4_EXMC_SMC_BASR3_ADDMSK36                     *((volatile unsigned int*)(0x942022CD8UL))
#define bM4_EXMC_SMC_BASR3_ADDMSK37                     *((volatile unsigned int*)(0x942022CDCUL))
#define bM4_EXMC_SMC_BASR3_ADDMAT30                     *((volatile unsigned int*)(0x942022CE0UL))
#define bM4_EXMC_SMC_BASR3_ADDMAT31                     *((volatile unsigned int*)(0x942022CE4UL))
#define bM4_EXMC_SMC_BASR3_ADDMAT32                     *((volatile unsigned int*)(0x942022CE8UL))
#define bM4_EXMC_SMC_BASR3_ADDMAT33                     *((volatile unsigned int*)(0x942022CECUL))
#define bM4_EXMC_SMC_BASR3_ADDMAT34                     *((volatile unsigned int*)(0x942022CF0UL))
#define bM4_EXMC_SMC_BASR3_ADDMAT35                     *((volatile unsigned int*)(0x942022CF4UL))
#define bM4_EXMC_SMC_BASR3_ADDMAT36                     *((volatile unsigned int*)(0x942022CF8UL))
#define bM4_EXMC_SMC_BASR3_ADDMAT37                     *((volatile unsigned int*)(0x942022CFCUL))
#define bM4_EXMC_EXMC_EXSR0_ECCBSY                      *((volatile unsigned int*)(0x942024000UL))
#define bM4_EXMC_NFC_CMDR_CMD0                          *((volatile unsigned int*)(0x944100000UL))
#define bM4_EXMC_NFC_CMDR_CMD1                          *((volatile unsigned int*)(0x944100004UL))
#define bM4_EXMC_NFC_CMDR_CMD2                          *((volatile unsigned int*)(0x944100008UL))
#define bM4_EXMC_NFC_CMDR_CMD3                          *((volatile unsigned int*)(0x94410000CUL))
#define bM4_EXMC_NFC_CMDR_CMD4                          *((volatile unsigned int*)(0x944100010UL))
#define bM4_EXMC_NFC_CMDR_CMD5                          *((volatile unsigned int*)(0x944100014UL))
#define bM4_EXMC_NFC_CMDR_CMD6                          *((volatile unsigned int*)(0x944100018UL))
#define bM4_EXMC_NFC_CMDR_CMD7                          *((volatile unsigned int*)(0x94410001CUL))
#define bM4_EXMC_NFC_CMDR_ARG0                          *((volatile unsigned int*)(0x944100020UL))
#define bM4_EXMC_NFC_CMDR_ARG1                          *((volatile unsigned int*)(0x944100024UL))
#define bM4_EXMC_NFC_CMDR_ARG2                          *((volatile unsigned int*)(0x944100028UL))
#define bM4_EXMC_NFC_CMDR_ARG3                          *((volatile unsigned int*)(0x94410002CUL))
#define bM4_EXMC_NFC_CMDR_ARG4                          *((volatile unsigned int*)(0x944100030UL))
#define bM4_EXMC_NFC_CMDR_ARG5                          *((volatile unsigned int*)(0x944100034UL))
#define bM4_EXMC_NFC_CMDR_ARG6                          *((volatile unsigned int*)(0x944100038UL))
#define bM4_EXMC_NFC_CMDR_ARG7                          *((volatile unsigned int*)(0x94410003CUL))
#define bM4_EXMC_NFC_CMDR_ARG8                          *((volatile unsigned int*)(0x944100040UL))
#define bM4_EXMC_NFC_CMDR_ARG9                          *((volatile unsigned int*)(0x944100044UL))
#define bM4_EXMC_NFC_CMDR_ARG10                         *((volatile unsigned int*)(0x944100048UL))
#define bM4_EXMC_NFC_CMDR_ARG11                         *((volatile unsigned int*)(0x94410004CUL))
#define bM4_EXMC_NFC_CMDR_ARG12                         *((volatile unsigned int*)(0x944100050UL))
#define bM4_EXMC_NFC_CMDR_ARG13                         *((volatile unsigned int*)(0x944100054UL))
#define bM4_EXMC_NFC_CMDR_ARG14                         *((volatile unsigned int*)(0x944100058UL))
#define bM4_EXMC_NFC_CMDR_ARG15                         *((volatile unsigned int*)(0x94410005CUL))
#define bM4_EXMC_NFC_CMDR_ARG16                         *((volatile unsigned int*)(0x944100060UL))
#define bM4_EXMC_NFC_CMDR_ARG17                         *((volatile unsigned int*)(0x944100064UL))
#define bM4_EXMC_NFC_CMDR_ARG18                         *((volatile unsigned int*)(0x944100068UL))
#define bM4_EXMC_NFC_CMDR_ARG19                         *((volatile unsigned int*)(0x94410006CUL))
#define bM4_EXMC_NFC_CMDR_ARG20                         *((volatile unsigned int*)(0x944100070UL))
#define bM4_EXMC_NFC_CMDR_ARG21                         *((volatile unsigned int*)(0x944100074UL))
#define bM4_EXMC_NFC_CMDR_ARG22                         *((volatile unsigned int*)(0x944100078UL))
#define bM4_EXMC_NFC_CMDR_ARG23                         *((volatile unsigned int*)(0x94410007CUL))
#define bM4_EXMC_NFC_IENR_ECCEUEN                       *((volatile unsigned int*)(0x944100600UL))
#define bM4_EXMC_NFC_IENR_ECCECEN                       *((volatile unsigned int*)(0x944100604UL))
#define bM4_EXMC_NFC_IENR_ECCCEN                        *((volatile unsigned int*)(0x944100610UL))
#define bM4_EXMC_NFC_IENR_ECCEEN                        *((volatile unsigned int*)(0x944100618UL))
#define bM4_EXMC_NFC_IENR_ECCDIS                        *((volatile unsigned int*)(0x94410061CUL))
#define bM4_EXMC_NFC_IENR_RESV                          *((volatile unsigned int*)(0x94410067CUL))
#define bM4_EXMC_NFC_ISTR_ECCEUST                       *((volatile unsigned int*)(0x944100680UL))
#define bM4_EXMC_NFC_ISTR_ECCECST                       *((volatile unsigned int*)(0x944100684UL))
#define bM4_EXMC_NFC_ISTR_ECCCST                        *((volatile unsigned int*)(0x944100690UL))
#define bM4_EXMC_NFC_ISTR_ECCEST                        *((volatile unsigned int*)(0x944100698UL))
#define bM4_EXMC_NFC_ISTR_RBST0                         *((volatile unsigned int*)(0x9441006A0UL))
#define bM4_EXMC_NFC_ISTR_RBST1                         *((volatile unsigned int*)(0x9441006A4UL))
#define bM4_EXMC_NFC_ISTR_RBST2                         *((volatile unsigned int*)(0x9441006A8UL))
#define bM4_EXMC_NFC_ISTR_RBST3                         *((volatile unsigned int*)(0x9441006ACUL))
#define bM4_EXMC_NFC_ISTR_RBST4                         *((volatile unsigned int*)(0x9441006B0UL))
#define bM4_EXMC_NFC_ISTR_RBST5                         *((volatile unsigned int*)(0x9441006B4UL))
#define bM4_EXMC_NFC_ISTR_RBST6                         *((volatile unsigned int*)(0x9441006B8UL))
#define bM4_EXMC_NFC_ISTR_RBST7                         *((volatile unsigned int*)(0x9441006BCUL))
#define bM4_EXMC_NFC_ISTR_RESV                          *((volatile unsigned int*)(0x9441006FCUL))
#define bM4_EXMC_NFC_IRSR_ECCEURS                       *((volatile unsigned int*)(0x944100700UL))
#define bM4_EXMC_NFC_IRSR_ECCECRS                       *((volatile unsigned int*)(0x944100704UL))
#define bM4_EXMC_NFC_IRSR_ECCCRS                        *((volatile unsigned int*)(0x944100710UL))
#define bM4_EXMC_NFC_IRSR_ECCERS                        *((volatile unsigned int*)(0x944100718UL))
#define bM4_EXMC_NFC_IRSR_RBRS0                         *((volatile unsigned int*)(0x944100720UL))
#define bM4_EXMC_NFC_IRSR_RBRS1                         *((volatile unsigned int*)(0x944100724UL))
#define bM4_EXMC_NFC_IRSR_RBRS2                         *((volatile unsigned int*)(0x944100728UL))
#define bM4_EXMC_NFC_IRSR_RBRS3                         *((volatile unsigned int*)(0x94410072CUL))
#define bM4_EXMC_NFC_IRSR_RBRS4                         *((volatile unsigned int*)(0x944100730UL))
#define bM4_EXMC_NFC_IRSR_RBRS5                         *((volatile unsigned int*)(0x944100734UL))
#define bM4_EXMC_NFC_IRSR_RBRS6                         *((volatile unsigned int*)(0x944100738UL))
#define bM4_EXMC_NFC_IRSR_RBRS7                         *((volatile unsigned int*)(0x94410073CUL))
#define bM4_EXMC_NFC_IRSR_RESV                          *((volatile unsigned int*)(0x94410077CUL))
#define bM4_EXMC_NFC_IDXR1_IDX10                        *((volatile unsigned int*)(0x944100900UL))
#define bM4_EXMC_NFC_IDXR1_IDX11                        *((volatile unsigned int*)(0x944100904UL))
#define bM4_EXMC_NFC_IDXR1_IDX12                        *((volatile unsigned int*)(0x944100908UL))
#define bM4_EXMC_NFC_IDXR1_IDX13                        *((volatile unsigned int*)(0x94410090CUL))
#define bM4_EXMC_NFC_IDXR1_IDX14                        *((volatile unsigned int*)(0x944100910UL))
#define bM4_EXMC_NFC_IDXR1_IDX15                        *((volatile unsigned int*)(0x944100914UL))
#define bM4_EXMC_NFC_IDXR1_IDX16                        *((volatile unsigned int*)(0x944100918UL))
#define bM4_EXMC_NFC_IDXR1_IDX17                        *((volatile unsigned int*)(0x94410091CUL))
#define bM4_EXMC_NFC_IDXR1_RESV                         *((volatile unsigned int*)(0x94410097CUL))
#define bM4_EXMC_NFC_TMCR0_TS0                          *((volatile unsigned int*)(0x944100980UL))
#define bM4_EXMC_NFC_TMCR0_TS1                          *((volatile unsigned int*)(0x944100984UL))
#define bM4_EXMC_NFC_TMCR0_TS2                          *((volatile unsigned int*)(0x944100988UL))
#define bM4_EXMC_NFC_TMCR0_TS3                          *((volatile unsigned int*)(0x94410098CUL))
#define bM4_EXMC_NFC_TMCR0_TS4                          *((volatile unsigned int*)(0x944100990UL))
#define bM4_EXMC_NFC_TMCR0_TS5                          *((volatile unsigned int*)(0x944100994UL))
#define bM4_EXMC_NFC_TMCR0_TS6                          *((volatile unsigned int*)(0x944100998UL))
#define bM4_EXMC_NFC_TMCR0_TS7                          *((volatile unsigned int*)(0x94410099CUL))
#define bM4_EXMC_NFC_TMCR0_TWP0                         *((volatile unsigned int*)(0x9441009A0UL))
#define bM4_EXMC_NFC_TMCR0_TWP1                         *((volatile unsigned int*)(0x9441009A4UL))
#define bM4_EXMC_NFC_TMCR0_TWP2                         *((volatile unsigned int*)(0x9441009A8UL))
#define bM4_EXMC_NFC_TMCR0_TWP3                         *((volatile unsigned int*)(0x9441009ACUL))
#define bM4_EXMC_NFC_TMCR0_TWP4                         *((volatile unsigned int*)(0x9441009B0UL))
#define bM4_EXMC_NFC_TMCR0_TWP5                         *((volatile unsigned int*)(0x9441009B4UL))
#define bM4_EXMC_NFC_TMCR0_TWP6                         *((volatile unsigned int*)(0x9441009B8UL))
#define bM4_EXMC_NFC_TMCR0_TWP7                         *((volatile unsigned int*)(0x9441009BCUL))
#define bM4_EXMC_NFC_TMCR0_TRP0                         *((volatile unsigned int*)(0x9441009C0UL))
#define bM4_EXMC_NFC_TMCR0_TRP1                         *((volatile unsigned int*)(0x9441009C4UL))
#define bM4_EXMC_NFC_TMCR0_TRP2                         *((volatile unsigned int*)(0x9441009C8UL))
#define bM4_EXMC_NFC_TMCR0_TRP3                         *((volatile unsigned int*)(0x9441009CCUL))
#define bM4_EXMC_NFC_TMCR0_TRP4                         *((volatile unsigned int*)(0x9441009D0UL))
#define bM4_EXMC_NFC_TMCR0_TRP5                         *((volatile unsigned int*)(0x9441009D4UL))
#define bM4_EXMC_NFC_TMCR0_TRP6                         *((volatile unsigned int*)(0x9441009D8UL))
#define bM4_EXMC_NFC_TMCR0_TRP7                         *((volatile unsigned int*)(0x9441009DCUL))
#define bM4_EXMC_NFC_TMCR0_TH0                          *((volatile unsigned int*)(0x9441009E0UL))
#define bM4_EXMC_NFC_TMCR0_TH1                          *((volatile unsigned int*)(0x9441009E4UL))
#define bM4_EXMC_NFC_TMCR0_TH2                          *((volatile unsigned int*)(0x9441009E8UL))
#define bM4_EXMC_NFC_TMCR0_TH3                          *((volatile unsigned int*)(0x9441009ECUL))
#define bM4_EXMC_NFC_TMCR0_TH4                          *((volatile unsigned int*)(0x9441009F0UL))
#define bM4_EXMC_NFC_TMCR0_TH5                          *((volatile unsigned int*)(0x9441009F4UL))
#define bM4_EXMC_NFC_TMCR0_TH6                          *((volatile unsigned int*)(0x9441009F8UL))
#define bM4_EXMC_NFC_TMCR0_TH7                          *((volatile unsigned int*)(0x9441009FCUL))
#define bM4_EXMC_NFC_TMCR1_TWH0                         *((volatile unsigned int*)(0x944100A00UL))
#define bM4_EXMC_NFC_TMCR1_TWH1                         *((volatile unsigned int*)(0x944100A04UL))
#define bM4_EXMC_NFC_TMCR1_TWH2                         *((volatile unsigned int*)(0x944100A08UL))
#define bM4_EXMC_NFC_TMCR1_TWH3                         *((volatile unsigned int*)(0x944100A0CUL))
#define bM4_EXMC_NFC_TMCR1_TWH4                         *((volatile unsigned int*)(0x944100A10UL))
#define bM4_EXMC_NFC_TMCR1_TWH5                         *((volatile unsigned int*)(0x944100A14UL))
#define bM4_EXMC_NFC_TMCR1_TWH6                         *((volatile unsigned int*)(0x944100A18UL))
#define bM4_EXMC_NFC_TMCR1_TWH7                         *((volatile unsigned int*)(0x944100A1CUL))
#define bM4_EXMC_NFC_TMCR1_TRH0                         *((volatile unsigned int*)(0x944100A20UL))
#define bM4_EXMC_NFC_TMCR1_TRH1                         *((volatile unsigned int*)(0x944100A24UL))
#define bM4_EXMC_NFC_TMCR1_TRH2                         *((volatile unsigned int*)(0x944100A28UL))
#define bM4_EXMC_NFC_TMCR1_TRH3                         *((volatile unsigned int*)(0x944100A2CUL))
#define bM4_EXMC_NFC_TMCR1_TRH4                         *((volatile unsigned int*)(0x944100A30UL))
#define bM4_EXMC_NFC_TMCR1_TRH5                         *((volatile unsigned int*)(0x944100A34UL))
#define bM4_EXMC_NFC_TMCR1_TRH6                         *((volatile unsigned int*)(0x944100A38UL))
#define bM4_EXMC_NFC_TMCR1_TRH7                         *((volatile unsigned int*)(0x944100A3CUL))
#define bM4_EXMC_NFC_TMCR1_TRR0                         *((volatile unsigned int*)(0x944100A40UL))
#define bM4_EXMC_NFC_TMCR1_TRR1                         *((volatile unsigned int*)(0x944100A44UL))
#define bM4_EXMC_NFC_TMCR1_TRR2                         *((volatile unsigned int*)(0x944100A48UL))
#define bM4_EXMC_NFC_TMCR1_TRR3                         *((volatile unsigned int*)(0x944100A4CUL))
#define bM4_EXMC_NFC_TMCR1_TRR4                         *((volatile unsigned int*)(0x944100A50UL))
#define bM4_EXMC_NFC_TMCR1_TRR5                         *((volatile unsigned int*)(0x944100A54UL))
#define bM4_EXMC_NFC_TMCR1_TRR6                         *((volatile unsigned int*)(0x944100A58UL))
#define bM4_EXMC_NFC_TMCR1_TRR7                         *((volatile unsigned int*)(0x944100A5CUL))
#define bM4_EXMC_NFC_TMCR1_TWB0                         *((volatile unsigned int*)(0x944100A60UL))
#define bM4_EXMC_NFC_TMCR1_TWB1                         *((volatile unsigned int*)(0x944100A64UL))
#define bM4_EXMC_NFC_TMCR1_TWB2                         *((volatile unsigned int*)(0x944100A68UL))
#define bM4_EXMC_NFC_TMCR1_TWB3                         *((volatile unsigned int*)(0x944100A6CUL))
#define bM4_EXMC_NFC_TMCR1_TWB4                         *((volatile unsigned int*)(0x944100A70UL))
#define bM4_EXMC_NFC_TMCR1_TWB5                         *((volatile unsigned int*)(0x944100A74UL))
#define bM4_EXMC_NFC_TMCR1_TWB6                         *((volatile unsigned int*)(0x944100A78UL))
#define bM4_EXMC_NFC_TMCR1_TWB7                         *((volatile unsigned int*)(0x944100A7CUL))
#define bM4_EXMC_NFC_BACR_SIZE0                         *((volatile unsigned int*)(0x944100A80UL))
#define bM4_EXMC_NFC_BACR_SIZE1                         *((volatile unsigned int*)(0x944100A84UL))
#define bM4_EXMC_NFC_BACR_SIZE2                         *((volatile unsigned int*)(0x944100A88UL))
#define bM4_EXMC_NFC_BACR_B16BIT                        *((volatile unsigned int*)(0x944100A8CUL))
#define bM4_EXMC_NFC_BACR_BANK0                         *((volatile unsigned int*)(0x944100A98UL))
#define bM4_EXMC_NFC_BACR_BANK1                         *((volatile unsigned int*)(0x944100A9CUL))
#define bM4_EXMC_NFC_BACR_PAGE0                         *((volatile unsigned int*)(0x944100AA0UL))
#define bM4_EXMC_NFC_BACR_PAGE1                         *((volatile unsigned int*)(0x944100AA4UL))
#define bM4_EXMC_NFC_BACR_WP                            *((volatile unsigned int*)(0x944100AA8UL))
#define bM4_EXMC_NFC_BACR_ECCM0                         *((volatile unsigned int*)(0x944100AACUL))
#define bM4_EXMC_NFC_BACR_ECCM1                         *((volatile unsigned int*)(0x944100AB0UL))
#define bM4_EXMC_NFC_BACR_RAC                           *((volatile unsigned int*)(0x944100AB4UL))
#define bM4_EXMC_NFC_BACR_SCS0                          *((volatile unsigned int*)(0x944100AC0UL))
#define bM4_EXMC_NFC_BACR_SCS1                          *((volatile unsigned int*)(0x944100AC4UL))
#define bM4_EXMC_NFC_BACR_SCS2                          *((volatile unsigned int*)(0x944100AC8UL))
#define bM4_EXMC_NFC_BACR_SCS3                          *((volatile unsigned int*)(0x944100ACCUL))
#define bM4_EXMC_NFC_BACR_SCS4                          *((volatile unsigned int*)(0x944100AD0UL))
#define bM4_EXMC_NFC_BACR_SCS5                          *((volatile unsigned int*)(0x944100AD4UL))
#define bM4_EXMC_NFC_BACR_SCS6                          *((volatile unsigned int*)(0x944100AD8UL))
#define bM4_EXMC_NFC_BACR_SCS7                          *((volatile unsigned int*)(0x944100ADCUL))
#define bM4_EXMC_NFC_BACR_RESV7                         *((volatile unsigned int*)(0x944100AE0UL))
#define bM4_EXMC_NFC_BACR_RESV                          *((volatile unsigned int*)(0x944100AFCUL))
#define bM4_EXMC_NFC_TMCR2_TCCS0                        *((volatile unsigned int*)(0x944100B80UL))
#define bM4_EXMC_NFC_TMCR2_TCCS1                        *((volatile unsigned int*)(0x944100B84UL))
#define bM4_EXMC_NFC_TMCR2_TCCS2                        *((volatile unsigned int*)(0x944100B88UL))
