RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EXMC_NFC_TMCR2_TCCS3                        *((volatile unsigned int*)(0x944100B8CUL))
#define bM4_EXMC_NFC_TMCR2_TCCS4                        *((volatile unsigned int*)(0x944100B90UL))
#define bM4_EXMC_NFC_TMCR2_TCCS5                        *((volatile unsigned int*)(0x944100B94UL))
#define bM4_EXMC_NFC_TMCR2_TCCS6                        *((volatile unsigned int*)(0x944100B98UL))
#define bM4_EXMC_NFC_TMCR2_TCCS7                        *((volatile unsigned int*)(0x944100B9CUL))
#define bM4_EXMC_NFC_TMCR2_TWTR0                        *((volatile unsigned int*)(0x944100BA0UL))
#define bM4_EXMC_NFC_TMCR2_TWTR1                        *((volatile unsigned int*)(0x944100BA4UL))
#define bM4_EXMC_NFC_TMCR2_TWTR2                        *((volatile unsigned int*)(0x944100BA8UL))
#define bM4_EXMC_NFC_TMCR2_TWTR3                        *((volatile unsigned int*)(0x944100BACUL))
#define bM4_EXMC_NFC_TMCR2_TWTR4                        *((volatile unsigned int*)(0x944100BB0UL))
#define bM4_EXMC_NFC_TMCR2_TWTR5                        *((volatile unsigned int*)(0x944100BB4UL))
#define bM4_EXMC_NFC_TMCR2_TWTR6                        *((volatile unsigned int*)(0x944100BB8UL))
#define bM4_EXMC_NFC_TMCR2_TWTR7                        *((volatile unsigned int*)(0x944100BBCUL))
#define bM4_EXMC_NFC_TMCR2_TRTW0                        *((volatile unsigned int*)(0x944100BC0UL))
#define bM4_EXMC_NFC_TMCR2_TRTW1                        *((volatile unsigned int*)(0x944100BC4UL))
#define bM4_EXMC_NFC_TMCR2_TRTW2                        *((volatile unsigned int*)(0x944100BC8UL))
#define bM4_EXMC_NFC_TMCR2_TRTW3                        *((volatile unsigned int*)(0x944100BCCUL))
#define bM4_EXMC_NFC_TMCR2_TRTW4                        *((volatile unsigned int*)(0x944100BD0UL))
#define bM4_EXMC_NFC_TMCR2_TRTW5                        *((volatile unsigned int*)(0x944100BD4UL))
#define bM4_EXMC_NFC_TMCR2_TRTW6                        *((volatile unsigned int*)(0x944100BD8UL))
#define bM4_EXMC_NFC_TMCR2_TRTW7                        *((volatile unsigned int*)(0x944100BDCUL))
#define bM4_EXMC_NFC_TMCR2_TADL0                        *((volatile unsigned int*)(0x944100BE0UL))
#define bM4_EXMC_NFC_TMCR2_TADL1                        *((volatile unsigned int*)(0x944100BE4UL))
#define bM4_EXMC_NFC_TMCR2_TADL2                        *((volatile unsigned int*)(0x944100BE8UL))
#define bM4_EXMC_NFC_TMCR2_TADL3                        *((volatile unsigned int*)(0x944100BECUL))
#define bM4_EXMC_NFC_TMCR2_TADL4                        *((volatile unsigned int*)(0x944100BF0UL))
#define bM4_EXMC_NFC_TMCR2_TADL5                        *((volatile unsigned int*)(0x944100BF4UL))
#define bM4_EXMC_NFC_TMCR2_TADL6                        *((volatile unsigned int*)(0x944100BF8UL))
#define bM4_EXMC_NFC_TMCR2_TADL7                        *((volatile unsigned int*)(0x944100BFCUL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC0                      *((volatile unsigned int*)(0x944100C00UL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC1                      *((volatile unsigned int*)(0x944100C04UL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC2                      *((volatile unsigned int*)(0x944100C08UL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC3                      *((volatile unsigned int*)(0x944100C0CUL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC4                      *((volatile unsigned int*)(0x944100C10UL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC5                      *((volatile unsigned int*)(0x944100C14UL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC6                      *((volatile unsigned int*)(0x944100C18UL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC7                      *((volatile unsigned int*)(0x944100C1CUL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC8                      *((volatile unsigned int*)(0x944100C20UL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC9                      *((volatile unsigned int*)(0x944100C24UL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC10                     *((volatile unsigned int*)(0x944100C28UL))
#define bM4_EXMC_NFC_ECCR0_ERRLOC11                     *((volatile unsigned int*)(0x944100C2CUL))
#define bM4_EXMC_NFC_ECCR0_SE                           *((volatile unsigned int*)(0x944100C30UL))
#define bM4_EXMC_NFC_ECCR0_ME                           *((volatile unsigned int*)(0x944100C34UL))
#define bM4_EXMC_NFC_ECCR0_RESV                         *((volatile unsigned int*)(0x944100C7CUL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC0                      *((volatile unsigned int*)(0x944100C80UL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC1                      *((volatile unsigned int*)(0x944100C84UL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC2                      *((volatile unsigned int*)(0x944100C88UL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC3                      *((volatile unsigned int*)(0x944100C8CUL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC4                      *((volatile unsigned int*)(0x944100C90UL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC5                      *((volatile unsigned int*)(0x944100C94UL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC6                      *((volatile unsigned int*)(0x944100C98UL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC7                      *((volatile unsigned int*)(0x944100C9CUL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC8                      *((volatile unsigned int*)(0x944100CA0UL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC9                      *((volatile unsigned int*)(0x944100CA4UL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC10                     *((volatile unsigned int*)(0x944100CA8UL))
#define bM4_EXMC_NFC_ECCR1_ERRLOC11                     *((volatile unsigned int*)(0x944100CACUL))
#define bM4_EXMC_NFC_ECCR1_SE                           *((volatile unsigned int*)(0x944100CB0UL))
#define bM4_EXMC_NFC_ECCR1_ME                           *((volatile unsigned int*)(0x944100CB4UL))
#define bM4_EXMC_NFC_ECCR1_RESV                         *((volatile unsigned int*)(0x944100CFCUL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC0                      *((volatile unsigned int*)(0x944100D00UL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC1                      *((volatile unsigned int*)(0x944100D04UL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC2                      *((volatile unsigned int*)(0x944100D08UL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC3                      *((volatile unsigned int*)(0x944100D0CUL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC4                      *((volatile unsigned int*)(0x944100D10UL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC5                      *((volatile unsigned int*)(0x944100D14UL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC6                      *((volatile unsigned int*)(0x944100D18UL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC7                      *((volatile unsigned int*)(0x944100D1CUL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC8                      *((volatile unsigned int*)(0x944100D20UL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC9                      *((volatile unsigned int*)(0x944100D24UL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC10                     *((volatile unsigned int*)(0x944100D28UL))
#define bM4_EXMC_NFC_ECCR2_ERRLOC11                     *((volatile unsigned int*)(0x944100D2CUL))
#define bM4_EXMC_NFC_ECCR2_SE                           *((volatile unsigned int*)(0x944100D30UL))
#define bM4_EXMC_NFC_ECCR2_ME                           *((volatile unsigned int*)(0x944100D34UL))
#define bM4_EXMC_NFC_ECCR2_RESV                         *((volatile unsigned int*)(0x944100D7CUL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC0                      *((volatile unsigned int*)(0x944100D80UL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC1                      *((volatile unsigned int*)(0x944100D84UL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC2                      *((volatile unsigned int*)(0x944100D88UL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC3                      *((volatile unsigned int*)(0x944100D8CUL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC4                      *((volatile unsigned int*)(0x944100D90UL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC5                      *((volatile unsigned int*)(0x944100D94UL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC6                      *((volatile unsigned int*)(0x944100D98UL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC7                      *((volatile unsigned int*)(0x944100D9CUL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC8                      *((volatile unsigned int*)(0x944100DA0UL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC9                      *((volatile unsigned int*)(0x944100DA4UL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC10                     *((volatile unsigned int*)(0x944100DA8UL))
#define bM4_EXMC_NFC_ECCR3_ERRLOC11                     *((volatile unsigned int*)(0x944100DACUL))
#define bM4_EXMC_NFC_ECCR3_SE                           *((volatile unsigned int*)(0x944100DB0UL))
#define bM4_EXMC_NFC_ECCR3_ME                           *((volatile unsigned int*)(0x944100DB4UL))
#define bM4_EXMC_NFC_ECCR3_RESV                         *((volatile unsigned int*)(0x944100DFCUL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC0                      *((volatile unsigned int*)(0x944100E00UL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC1                      *((volatile unsigned int*)(0x944100E04UL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC2                      *((volatile unsigned int*)(0x944100E08UL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC3                      *((volatile unsigned int*)(0x944100E0CUL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC4                      *((volatile unsigned int*)(0x944100E10UL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC5                      *((volatile unsigned int*)(0x944100E14UL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC6                      *((volatile unsigned int*)(0x944100E18UL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC7                      *((volatile unsigned int*)(0x944100E1CUL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC8                      *((volatile unsigned int*)(0x944100E20UL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC9                      *((volatile unsigned int*)(0x944100E24UL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC10                     *((volatile unsigned int*)(0x944100E28UL))
#define bM4_EXMC_NFC_ECCR4_ERRLOC11                     *((volatile unsigned int*)(0x944100E2CUL))
#define bM4_EXMC_NFC_ECCR4_SE                           *((volatile unsigned int*)(0x944100E30UL))
#define bM4_EXMC_NFC_ECCR4_ME                           *((volatile unsigned int*)(0x944100E34UL))
#define bM4_EXMC_NFC_ECCR4_RESV                         *((volatile unsigned int*)(0x944100E7CUL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC0                      *((volatile unsigned int*)(0x944100E80UL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC1                      *((volatile unsigned int*)(0x944100E84UL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC2                      *((volatile unsigned int*)(0x944100E88UL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC3                      *((volatile unsigned int*)(0x944100E8CUL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC4                      *((volatile unsigned int*)(0x944100E90UL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC5                      *((volatile unsigned int*)(0x944100E94UL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC6                      *((volatile unsigned int*)(0x944100E98UL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC7                      *((volatile unsigned int*)(0x944100E9CUL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC8                      *((volatile unsigned int*)(0x944100EA0UL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC9                      *((volatile unsigned int*)(0x944100EA4UL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC10                     *((volatile unsigned int*)(0x944100EA8UL))
#define bM4_EXMC_NFC_ECCR5_ERRLOC11                     *((volatile unsigned int*)(0x944100EACUL))
#define bM4_EXMC_NFC_ECCR5_SE                           *((volatile unsigned int*)(0x944100EB0UL))
#define bM4_EXMC_NFC_ECCR5_ME                           *((volatile unsigned int*)(0x944100EB4UL))
#define bM4_EXMC_NFC_ECCR5_RESV                         *((volatile unsigned int*)(0x944100EFCUL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC0                      *((volatile unsigned int*)(0x944100F00UL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC1                      *((volatile unsigned int*)(0x944100F04UL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC2                      *((volatile unsigned int*)(0x944100F08UL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC3                      *((volatile unsigned int*)(0x944100F0CUL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC4                      *((volatile unsigned int*)(0x944100F10UL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC5                      *((volatile unsigned int*)(0x944100F14UL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC6                      *((volatile unsigned int*)(0x944100F18UL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC7                      *((volatile unsigned int*)(0x944100F1CUL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC8                      *((volatile unsigned int*)(0x944100F20UL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC9                      *((volatile unsigned int*)(0x944100F24UL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC10                     *((volatile unsigned int*)(0x944100F28UL))
#define bM4_EXMC_NFC_ECCR6_ERRLOC11                     *((volatile unsigned int*)(0x944100F2CUL))
#define bM4_EXMC_NFC_ECCR6_SE                           *((volatile unsigned int*)(0x944100F30UL))
#define bM4_EXMC_NFC_ECCR6_ME                           *((volatile unsigned int*)(0x944100F34UL))
#define bM4_EXMC_NFC_ECCR6_RESV                         *((volatile unsigned int*)(0x944100F7CUL))
#define bM4_EXMC_ECC_STAT_ERRSEC0                       *((volatile unsigned int*)(0x944100F80UL))
#define bM4_EXMC_ECC_STAT_ERRSEC1                       *((volatile unsigned int*)(0x944100F84UL))
#define bM4_EXMC_ECC_STAT_ERRSEC2                       *((volatile unsigned int*)(0x944100F88UL))
#define bM4_EXMC_ECC_STAT_ERRSEC3                       *((volatile unsigned int*)(0x944100F8CUL))
#define bM4_EXMC_ECC_STAT_ERRSEC4                       *((volatile unsigned int*)(0x944100F90UL))
#define bM4_EXMC_ECC_STAT_ERRSEC5                       *((volatile unsigned int*)(0x944100F94UL))
#define bM4_EXMC_ECC_STAT_ERRSEC6                       *((volatile unsigned int*)(0x944100F98UL))
#define bM4_EXMC_ECC_STAT_ERRSEC7                       *((volatile unsigned int*)(0x944100F9CUL))
#define bM4_EXMC_ECC_STAT_ERRSEC8                       *((volatile unsigned int*)(0x944100FA0UL))
#define bM4_EXMC_ECC_STAT_ERRSEC9                       *((volatile unsigned int*)(0x944100FA4UL))
#define bM4_EXMC_ECC_STAT_ERRSEC10                      *((volatile unsigned int*)(0x944100FA8UL))
#define bM4_EXMC_ECC_STAT_ERRSEC11                      *((volatile unsigned int*)(0x944100FACUL))
#define bM4_EXMC_ECC_STAT_ERRSEC12                      *((volatile unsigned int*)(0x944100FB0UL))
#define bM4_EXMC_ECC_STAT_ERRSEC13                      *((volatile unsigned int*)(0x944100FB4UL))
#define bM4_EXMC_ECC_STAT_ERRSEC14                      *((volatile unsigned int*)(0x944100FB8UL))
#define bM4_EXMC_ECC_STAT_ERRSEC15                      *((volatile unsigned int*)(0x944100FBCUL))
#define bM4_EXMC_ECC_STAT_RESV                          *((volatile unsigned int*)(0x944100FFCUL))
#define bM4_EXMC_ECC_SYND0_0_S10                        *((volatile unsigned int*)(0x944101000UL))
#define bM4_EXMC_ECC_SYND0_0_S11                        *((volatile unsigned int*)(0x944101004UL))
#define bM4_EXMC_ECC_SYND0_0_S12                        *((volatile unsigned int*)(0x944101008UL))
#define bM4_EXMC_ECC_SYND0_0_S13                        *((volatile unsigned int*)(0x94410100CUL))
#define bM4_EXMC_ECC_SYND0_0_S14                        *((volatile unsigned int*)(0x944101010UL))
#define bM4_EXMC_ECC_SYND0_0_S15                        *((volatile unsigned int*)(0x944101014UL))
#define bM4_EXMC_ECC_SYND0_0_S16                        *((volatile unsigned int*)(0x944101018UL))
#define bM4_EXMC_ECC_SYND0_0_S17                        *((volatile unsigned int*)(0x94410101CUL))
#define bM4_EXMC_ECC_SYND0_0_S18                        *((volatile unsigned int*)(0x944101020UL))
#define bM4_EXMC_ECC_SYND0_0_S19                        *((volatile unsigned int*)(0x944101024UL))
#define bM4_EXMC_ECC_SYND0_0_S110                       *((volatile unsigned int*)(0x944101028UL))
#define bM4_EXMC_ECC_SYND0_0_S111                       *((volatile unsigned int*)(0x94410102CUL))
#define bM4_EXMC_ECC_SYND0_0_S112                       *((volatile unsigned int*)(0x944101030UL))
#define bM4_EXMC_ECC_SYND0_0_S20                        *((volatile unsigned int*)(0x944101040UL))
#define bM4_EXMC_ECC_SYND0_0_S21                        *((volatile unsigned int*)(0x944101044UL))
#define bM4_EXMC_ECC_SYND0_0_S22                        *((volatile unsigned int*)(0x944101048UL))
#define bM4_EXMC_ECC_SYND0_0_S23                        *((volatile unsigned int*)(0x94410104CUL))
#define bM4_EXMC_ECC_SYND0_0_S24                        *((volatile unsigned int*)(0x944101050UL))
#define bM4_EXMC_ECC_SYND0_0_S25                        *((volatile unsigned int*)(0x944101054UL))
#define bM4_EXMC_ECC_SYND0_0_S26                        *((volatile unsigned int*)(0x944101058UL))
#define bM4_EXMC_ECC_SYND0_0_S27                        *((volatile unsigned int*)(0x94410105CUL))
#define bM4_EXMC_ECC_SYND0_0_S28                        *((volatile unsigned int*)(0x944101060UL))
#define bM4_EXMC_ECC_SYND0_0_S29                        *((volatile unsigned int*)(0x944101064UL))
#define bM4_EXMC_ECC_SYND0_0_S210                       *((volatile unsigned int*)(0x944101068UL))
#define bM4_EXMC_ECC_SYND0_0_S211                       *((volatile unsigned int*)(0x94410106CUL))
#define bM4_EXMC_ECC_SYND0_0_S212                       *((volatile unsigned int*)(0x944101070UL))
#define bM4_EXMC_ECC_SYND0_0_RESV                       *((volatile unsigned int*)(0x94410107CUL))
#define bM4_EXMC_ECC_SYND0_1_S30                        *((volatile unsigned int*)(0x944101080UL))
#define bM4_EXMC_ECC_SYND0_1_S31                        *((volatile unsigned int*)(0x944101084UL))
#define bM4_EXMC_ECC_SYND0_1_S32                        *((volatile unsigned int*)(0x944101088UL))
#define bM4_EXMC_ECC_SYND0_1_S33                        *((volatile unsigned int*)(0x94410108CUL))
#define bM4_EXMC_ECC_SYND0_1_S34                        *((volatile unsigned int*)(0x944101090UL))
#define bM4_EXMC_ECC_SYND0_1_S35                        *((volatile unsigned int*)(0x944101094UL))
#define bM4_EXMC_ECC_SYND0_1_S36                        *((volatile unsigned int*)(0x944101098UL))
#define bM4_EXMC_ECC_SYND0_1_S37                        *((volatile unsigned int*)(0x94410109CUL))
#define bM4_EXMC_ECC_SYND0_1_S38                        *((volatile unsigned int*)(0x9441010A0UL))
#define bM4_EXMC_ECC_SYND0_1_S39                        *((volatile unsigned int*)(0x9441010A4UL))
#define bM4_EXMC_ECC_SYND0_1_S310                       *((volatile unsigned int*)(0x9441010A8UL))
#define bM4_EXMC_ECC_SYND0_1_S311                       *((volatile unsigned int*)(0x9441010ACUL))
#define bM4_EXMC_ECC_SYND0_1_S312                       *((volatile unsigned int*)(0x9441010B0UL))
#define bM4_EXMC_ECC_SYND0_1_S40                        *((volatile unsigned int*)(0x9441010C0UL))
#define bM4_EXMC_ECC_SYND0_1_S41                        *((volatile unsigned int*)(0x9441010C4UL))
#define bM4_EXMC_ECC_SYND0_1_S42                        *((volatile unsigned int*)(0x9441010C8UL))
#define bM4_EXMC_ECC_SYND0_1_S43                        *((volatile unsigned int*)(0x9441010CCUL))
#define bM4_EXMC_ECC_SYND0_1_S44                        *((volatile unsigned int*)(0x9441010D0UL))
#define bM4_EXMC_ECC_SYND0_1_S45                        *((volatile unsigned int*)(0x9441010D4UL))
#define bM4_EXMC_ECC_SYND0_1_S46                        *((volatile unsigned int*)(0x9441010D8UL))
#define bM4_EXMC_ECC_SYND0_1_S47                        *((volatile unsigned int*)(0x9441010DCUL))
#define bM4_EXMC_ECC_SYND0_1_S48                        *((volatile unsigned int*)(0x9441010E0UL))
#define bM4_EXMC_ECC_SYND0_1_S49                        *((volatile unsigned int*)(0x9441010E4UL))
#define bM4_EXMC_ECC_SYND0_1_S410                       *((volatile unsigned int*)(0x9441010E8UL))
#define bM4_EXMC_ECC_SYND0_1_S411                       *((volatile unsigned int*)(0x9441010ECUL))
#define bM4_EXMC_ECC_SYND0_1_S412                       *((volatile unsigned int*)(0x9441010F0UL))
#define bM4_EXMC_ECC_SYND0_1_RESV                       *((volatile unsigned int*)(0x9441010FCUL))
#define bM4_EXMC_ECC_SYND0_2_S50                        *((volatile unsigned int*)(0x944101100UL))
#define bM4_EXMC_ECC_SYND0_2_S51                        *((volatile unsigned int*)(0x944101104UL))
#define bM4_EXMC_ECC_SYND0_2_S52                        *((volatile unsigned int*)(0x944101108UL))
#define bM4_EXMC_ECC_SYND0_2_S53                        *((volatile unsigned int*)(0x94410110CUL))
#define bM4_EXMC_ECC_SYND0_2_S54                        *((volatile unsigned int*)(0x944101110UL))
#define bM4_EXMC_ECC_SYND0_2_S55                        *((volatile unsigned int*)(0x944101114UL))
#define bM4_EXMC_ECC_SYND0_2_S56                        *((volatile unsigned int*)(0x944101118UL))
#define bM4_EXMC_ECC_SYND0_2_S57                        *((volatile unsigned int*)(0x94410111CUL))
#define bM4_EXMC_ECC_SYND0_2_S58                        *((volatile unsigned int*)(0x944101120UL))
#define bM4_EXMC_ECC_SYND0_2_S59                        *((volatile unsigned int*)(0x944101124UL))
#define bM4_EXMC_ECC_SYND0_2_S510                       *((volatile unsigned int*)(0x944101128UL))
#define bM4_EXMC_ECC_SYND0_2_S511                       *((volatile unsigned int*)(0x94410112CUL))
#define bM4_EXMC_ECC_SYND0_2_S512                       *((volatile unsigned int*)(0x944101130UL))
#define bM4_EXMC_ECC_SYND0_2_S60                        *((volatile unsigned int*)(0x944101140UL))
#define bM4_EXMC_ECC_SYND0_2_S61                        *((volatile unsigned int*)(0x944101144UL))
#define bM4_EXMC_ECC_SYND0_2_S62                        *((volatile unsigned int*)(0x944101148UL))
#define bM4_EXMC_ECC_SYND0_2_S63                        *((volatile unsigned int*)(0x94410114CUL))
#define bM4_EXMC_ECC_SYND0_2_S64                        *((volatile unsigned int*)(0x944101150UL))
#define bM4_EXMC_ECC_SYND0_2_S65                        *((volatile unsigned int*)(0x944101154UL))
#define bM4_EXMC_ECC_SYND0_2_S66                        *((volatile unsigned int*)(0x944101158UL))
#define bM4_EXMC_ECC_SYND0_2_S67                        *((volatile unsigned int*)(0x94410115CUL))
#define bM4_EXMC_ECC_SYND0_2_S68                        *((volatile unsigned int*)(0x944101160UL))
#define bM4_EXMC_ECC_SYND0_2_S69                        *((volatile unsigned int*)(0x944101164UL))
#define bM4_EXMC_ECC_SYND0_2_S610                       *((volatile unsigned int*)(0x944101168UL))
#define bM4_EXMC_ECC_SYND0_2_S611                       *((volatile unsigned int*)(0x94410116CUL))
#define bM4_EXMC_ECC_SYND0_2_S612                       *((volatile unsigned int*)(0x944101170UL))
#define bM4_EXMC_ECC_SYND0_2_RESV                       *((volatile unsigned int*)(0x94410117CUL))
#define bM4_EXMC_ECC_SYND0_3_S70                        *((volatile unsigned int*)(0x944101180UL))
#define bM4_EXMC_ECC_SYND0_3_S71                        *((volatile unsigned int*)(0x944101184UL))
#define bM4_EXMC_ECC_SYND0_3_S72                        *((volatile unsigned int*)(0x944101188UL))
#define bM4_EXMC_ECC_SYND0_3_S73                        *((volatile unsigned int*)(0x94410118CUL))
#define bM4_EXMC_ECC_SYND0_3_S74                        *((volatile unsigned int*)(0x944101190UL))
#define bM4_EXMC_ECC_SYND0_3_S75                        *((volatile unsigned int*)(0x944101194UL))
#define bM4_EXMC_ECC_SYND0_3_S76                        *((volatile unsigned int*)(0x944101198UL))
#define bM4_EXMC_ECC_SYND0_3_S77                        *((volatile unsigned int*)(0x94410119CUL))
#define bM4_EXMC_ECC_SYND0_3_S78                        *((volatile unsigned int*)(0x9441011A0UL))
#define bM4_EXMC_ECC_SYND0_3_S79                        *((volatile unsigned int*)(0x9441011A4UL))
