RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EXMC_ECC_SYND0_3_S710                       *((volatile unsigned int*)(0x9441011A8UL))
#define bM4_EXMC_ECC_SYND0_3_S711                       *((volatile unsigned int*)(0x9441011ACUL))
#define bM4_EXMC_ECC_SYND0_3_S712                       *((volatile unsigned int*)(0x9441011B0UL))
#define bM4_EXMC_ECC_SYND0_3_S80                        *((volatile unsigned int*)(0x9441011C0UL))
#define bM4_EXMC_ECC_SYND0_3_S81                        *((volatile unsigned int*)(0x9441011C4UL))
#define bM4_EXMC_ECC_SYND0_3_S82                        *((volatile unsigned int*)(0x9441011C8UL))
#define bM4_EXMC_ECC_SYND0_3_S83                        *((volatile unsigned int*)(0x9441011CCUL))
#define bM4_EXMC_ECC_SYND0_3_S84                        *((volatile unsigned int*)(0x9441011D0UL))
#define bM4_EXMC_ECC_SYND0_3_S85                        *((volatile unsigned int*)(0x9441011D4UL))
#define bM4_EXMC_ECC_SYND0_3_S86                        *((volatile unsigned int*)(0x9441011D8UL))
#define bM4_EXMC_ECC_SYND0_3_S87                        *((volatile unsigned int*)(0x9441011DCUL))
#define bM4_EXMC_ECC_SYND0_3_S88                        *((volatile unsigned int*)(0x9441011E0UL))
#define bM4_EXMC_ECC_SYND0_3_S89                        *((volatile unsigned int*)(0x9441011E4UL))
#define bM4_EXMC_ECC_SYND0_3_S810                       *((volatile unsigned int*)(0x9441011E8UL))
#define bM4_EXMC_ECC_SYND0_3_S811                       *((volatile unsigned int*)(0x9441011ECUL))
#define bM4_EXMC_ECC_SYND0_3_S812                       *((volatile unsigned int*)(0x9441011F0UL))
#define bM4_EXMC_ECC_SYND0_3_RESV                       *((volatile unsigned int*)(0x9441011FCUL))
#define bM4_EXMC_ECC_SYND1_0_S10                        *((volatile unsigned int*)(0x944101200UL))
#define bM4_EXMC_ECC_SYND1_0_S11                        *((volatile unsigned int*)(0x944101204UL))
#define bM4_EXMC_ECC_SYND1_0_S12                        *((volatile unsigned int*)(0x944101208UL))
#define bM4_EXMC_ECC_SYND1_0_S13                        *((volatile unsigned int*)(0x94410120CUL))
#define bM4_EXMC_ECC_SYND1_0_S14                        *((volatile unsigned int*)(0x944101210UL))
#define bM4_EXMC_ECC_SYND1_0_S15                        *((volatile unsigned int*)(0x944101214UL))
#define bM4_EXMC_ECC_SYND1_0_S16                        *((volatile unsigned int*)(0x944101218UL))
#define bM4_EXMC_ECC_SYND1_0_S17                        *((volatile unsigned int*)(0x94410121CUL))
#define bM4_EXMC_ECC_SYND1_0_S18                        *((volatile unsigned int*)(0x944101220UL))
#define bM4_EXMC_ECC_SYND1_0_S19                        *((volatile unsigned int*)(0x944101224UL))
#define bM4_EXMC_ECC_SYND1_0_S110                       *((volatile unsigned int*)(0x944101228UL))
#define bM4_EXMC_ECC_SYND1_0_S111                       *((volatile unsigned int*)(0x94410122CUL))
#define bM4_EXMC_ECC_SYND1_0_S112                       *((volatile unsigned int*)(0x944101230UL))
#define bM4_EXMC_ECC_SYND1_0_S20                        *((volatile unsigned int*)(0x944101240UL))
#define bM4_EXMC_ECC_SYND1_0_S21                        *((volatile unsigned int*)(0x944101244UL))
#define bM4_EXMC_ECC_SYND1_0_S22                        *((volatile unsigned int*)(0x944101248UL))
#define bM4_EXMC_ECC_SYND1_0_S23                        *((volatile unsigned int*)(0x94410124CUL))
#define bM4_EXMC_ECC_SYND1_0_S24                        *((volatile unsigned int*)(0x944101250UL))
#define bM4_EXMC_ECC_SYND1_0_S25                        *((volatile unsigned int*)(0x944101254UL))
#define bM4_EXMC_ECC_SYND1_0_S26                        *((volatile unsigned int*)(0x944101258UL))
#define bM4_EXMC_ECC_SYND1_0_S27                        *((volatile unsigned int*)(0x94410125CUL))
#define bM4_EXMC_ECC_SYND1_0_S28                        *((volatile unsigned int*)(0x944101260UL))
#define bM4_EXMC_ECC_SYND1_0_S29                        *((volatile unsigned int*)(0x944101264UL))
#define bM4_EXMC_ECC_SYND1_0_S210                       *((volatile unsigned int*)(0x944101268UL))
#define bM4_EXMC_ECC_SYND1_0_S211                       *((volatile unsigned int*)(0x94410126CUL))
#define bM4_EXMC_ECC_SYND1_0_S212                       *((volatile unsigned int*)(0x944101270UL))
#define bM4_EXMC_ECC_SYND1_0_RESV                       *((volatile unsigned int*)(0x94410127CUL))
#define bM4_EXMC_ECC_SYND1_1_S30                        *((volatile unsigned int*)(0x944101280UL))
#define bM4_EXMC_ECC_SYND1_1_S31                        *((volatile unsigned int*)(0x944101284UL))
#define bM4_EXMC_ECC_SYND1_1_S32                        *((volatile unsigned int*)(0x944101288UL))
#define bM4_EXMC_ECC_SYND1_1_S33                        *((volatile unsigned int*)(0x94410128CUL))
#define bM4_EXMC_ECC_SYND1_1_S34                        *((volatile unsigned int*)(0x944101290UL))
#define bM4_EXMC_ECC_SYND1_1_S35                        *((volatile unsigned int*)(0x944101294UL))
#define bM4_EXMC_ECC_SYND1_1_S36                        *((volatile unsigned int*)(0x944101298UL))
#define bM4_EXMC_ECC_SYND1_1_S37                        *((volatile unsigned int*)(0x94410129CUL))
#define bM4_EXMC_ECC_SYND1_1_S38                        *((volatile unsigned int*)(0x9441012A0UL))
#define bM4_EXMC_ECC_SYND1_1_S39                        *((volatile unsigned int*)(0x9441012A4UL))
#define bM4_EXMC_ECC_SYND1_1_S310                       *((volatile unsigned int*)(0x9441012A8UL))
#define bM4_EXMC_ECC_SYND1_1_S311                       *((volatile unsigned int*)(0x9441012ACUL))
#define bM4_EXMC_ECC_SYND1_1_S312                       *((volatile unsigned int*)(0x9441012B0UL))
#define bM4_EXMC_ECC_SYND1_1_S40                        *((volatile unsigned int*)(0x9441012C0UL))
#define bM4_EXMC_ECC_SYND1_1_S41                        *((volatile unsigned int*)(0x9441012C4UL))
#define bM4_EXMC_ECC_SYND1_1_S42                        *((volatile unsigned int*)(0x9441012C8UL))
#define bM4_EXMC_ECC_SYND1_1_S43                        *((volatile unsigned int*)(0x9441012CCUL))
#define bM4_EXMC_ECC_SYND1_1_S44                        *((volatile unsigned int*)(0x9441012D0UL))
#define bM4_EXMC_ECC_SYND1_1_S45                        *((volatile unsigned int*)(0x9441012D4UL))
#define bM4_EXMC_ECC_SYND1_1_S46                        *((volatile unsigned int*)(0x9441012D8UL))
#define bM4_EXMC_ECC_SYND1_1_S47                        *((volatile unsigned int*)(0x9441012DCUL))
#define bM4_EXMC_ECC_SYND1_1_S48                        *((volatile unsigned int*)(0x9441012E0UL))
#define bM4_EXMC_ECC_SYND1_1_S49                        *((volatile unsigned int*)(0x9441012E4UL))
#define bM4_EXMC_ECC_SYND1_1_S410                       *((volatile unsigned int*)(0x9441012E8UL))
#define bM4_EXMC_ECC_SYND1_1_S411                       *((volatile unsigned int*)(0x9441012ECUL))
#define bM4_EXMC_ECC_SYND1_1_S412                       *((volatile unsigned int*)(0x9441012F0UL))
#define bM4_EXMC_ECC_SYND1_1_RESV                       *((volatile unsigned int*)(0x9441012FCUL))
#define bM4_EXMC_ECC_SYND1_2_S50                        *((volatile unsigned int*)(0x944101300UL))
#define bM4_EXMC_ECC_SYND1_2_S51                        *((volatile unsigned int*)(0x944101304UL))
#define bM4_EXMC_ECC_SYND1_2_S52                        *((volatile unsigned int*)(0x944101308UL))
#define bM4_EXMC_ECC_SYND1_2_S53                        *((volatile unsigned int*)(0x94410130CUL))
#define bM4_EXMC_ECC_SYND1_2_S54                        *((volatile unsigned int*)(0x944101310UL))
#define bM4_EXMC_ECC_SYND1_2_S55                        *((volatile unsigned int*)(0x944101314UL))
#define bM4_EXMC_ECC_SYND1_2_S56                        *((volatile unsigned int*)(0x944101318UL))
#define bM4_EXMC_ECC_SYND1_2_S57                        *((volatile unsigned int*)(0x94410131CUL))
#define bM4_EXMC_ECC_SYND1_2_S58                        *((volatile unsigned int*)(0x944101320UL))
#define bM4_EXMC_ECC_SYND1_2_S59                        *((volatile unsigned int*)(0x944101324UL))
#define bM4_EXMC_ECC_SYND1_2_S510                       *((volatile unsigned int*)(0x944101328UL))
#define bM4_EXMC_ECC_SYND1_2_S511                       *((volatile unsigned int*)(0x94410132CUL))
#define bM4_EXMC_ECC_SYND1_2_S512                       *((volatile unsigned int*)(0x944101330UL))
#define bM4_EXMC_ECC_SYND1_2_S60                        *((volatile unsigned int*)(0x944101340UL))
#define bM4_EXMC_ECC_SYND1_2_S61                        *((volatile unsigned int*)(0x944101344UL))
#define bM4_EXMC_ECC_SYND1_2_S62                        *((volatile unsigned int*)(0x944101348UL))
#define bM4_EXMC_ECC_SYND1_2_S63                        *((volatile unsigned int*)(0x94410134CUL))
#define bM4_EXMC_ECC_SYND1_2_S64                        *((volatile unsigned int*)(0x944101350UL))
#define bM4_EXMC_ECC_SYND1_2_S65                        *((volatile unsigned int*)(0x944101354UL))
#define bM4_EXMC_ECC_SYND1_2_S66                        *((volatile unsigned int*)(0x944101358UL))
#define bM4_EXMC_ECC_SYND1_2_S67                        *((volatile unsigned int*)(0x94410135CUL))
#define bM4_EXMC_ECC_SYND1_2_S68                        *((volatile unsigned int*)(0x944101360UL))
#define bM4_EXMC_ECC_SYND1_2_S69                        *((volatile unsigned int*)(0x944101364UL))
#define bM4_EXMC_ECC_SYND1_2_S610                       *((volatile unsigned int*)(0x944101368UL))
#define bM4_EXMC_ECC_SYND1_2_S611                       *((volatile unsigned int*)(0x94410136CUL))
#define bM4_EXMC_ECC_SYND1_2_S612                       *((volatile unsigned int*)(0x944101370UL))
#define bM4_EXMC_ECC_SYND1_2_RESV                       *((volatile unsigned int*)(0x94410137CUL))
#define bM4_EXMC_ECC_SYND1_3_S70                        *((volatile unsigned int*)(0x944101380UL))
#define bM4_EXMC_ECC_SYND1_3_S71                        *((volatile unsigned int*)(0x944101384UL))
#define bM4_EXMC_ECC_SYND1_3_S72                        *((volatile unsigned int*)(0x944101388UL))
#define bM4_EXMC_ECC_SYND1_3_S73                        *((volatile unsigned int*)(0x94410138CUL))
#define bM4_EXMC_ECC_SYND1_3_S74                        *((volatile unsigned int*)(0x944101390UL))
#define bM4_EXMC_ECC_SYND1_3_S75                        *((volatile unsigned int*)(0x944101394UL))
#define bM4_EXMC_ECC_SYND1_3_S76                        *((volatile unsigned int*)(0x944101398UL))
#define bM4_EXMC_ECC_SYND1_3_S77                        *((volatile unsigned int*)(0x94410139CUL))
#define bM4_EXMC_ECC_SYND1_3_S78                        *((volatile unsigned int*)(0x9441013A0UL))
#define bM4_EXMC_ECC_SYND1_3_S79                        *((volatile unsigned int*)(0x9441013A4UL))
#define bM4_EXMC_ECC_SYND1_3_S710                       *((volatile unsigned int*)(0x9441013A8UL))
#define bM4_EXMC_ECC_SYND1_3_S711                       *((volatile unsigned int*)(0x9441013ACUL))
#define bM4_EXMC_ECC_SYND1_3_S712                       *((volatile unsigned int*)(0x9441013B0UL))
#define bM4_EXMC_ECC_SYND1_3_S80                        *((volatile unsigned int*)(0x9441013C0UL))
#define bM4_EXMC_ECC_SYND1_3_S81                        *((volatile unsigned int*)(0x9441013C4UL))
#define bM4_EXMC_ECC_SYND1_3_S82                        *((volatile unsigned int*)(0x9441013C8UL))
#define bM4_EXMC_ECC_SYND1_3_S83                        *((volatile unsigned int*)(0x9441013CCUL))
#define bM4_EXMC_ECC_SYND1_3_S84                        *((volatile unsigned int*)(0x9441013D0UL))
#define bM4_EXMC_ECC_SYND1_3_S85                        *((volatile unsigned int*)(0x9441013D4UL))
#define bM4_EXMC_ECC_SYND1_3_S86                        *((volatile unsigned int*)(0x9441013D8UL))
#define bM4_EXMC_ECC_SYND1_3_S87                        *((volatile unsigned int*)(0x9441013DCUL))
#define bM4_EXMC_ECC_SYND1_3_S88                        *((volatile unsigned int*)(0x9441013E0UL))
#define bM4_EXMC_ECC_SYND1_3_S89                        *((volatile unsigned int*)(0x9441013E4UL))
#define bM4_EXMC_ECC_SYND1_3_S810                       *((volatile unsigned int*)(0x9441013E8UL))
#define bM4_EXMC_ECC_SYND1_3_S811                       *((volatile unsigned int*)(0x9441013ECUL))
#define bM4_EXMC_ECC_SYND1_3_S812                       *((volatile unsigned int*)(0x9441013F0UL))
#define bM4_EXMC_ECC_SYND1_3_RESV                       *((volatile unsigned int*)(0x9441013FCUL))
#define bM4_EXMC_ECC_SYND2_0_S10                        *((volatile unsigned int*)(0x944101400UL))
#define bM4_EXMC_ECC_SYND2_0_S11                        *((volatile unsigned int*)(0x944101404UL))
#define bM4_EXMC_ECC_SYND2_0_S12                        *((volatile unsigned int*)(0x944101408UL))
#define bM4_EXMC_ECC_SYND2_0_S13                        *((volatile unsigned int*)(0x94410140CUL))
#define bM4_EXMC_ECC_SYND2_0_S14                        *((volatile unsigned int*)(0x944101410UL))
#define bM4_EXMC_ECC_SYND2_0_S15                        *((volatile unsigned int*)(0x944101414UL))
#define bM4_EXMC_ECC_SYND2_0_S16                        *((volatile unsigned int*)(0x944101418UL))
#define bM4_EXMC_ECC_SYND2_0_S17                        *((volatile unsigned int*)(0x94410141CUL))
#define bM4_EXMC_ECC_SYND2_0_S18                        *((volatile unsigned int*)(0x944101420UL))
#define bM4_EXMC_ECC_SYND2_0_S19                        *((volatile unsigned int*)(0x944101424UL))
#define bM4_EXMC_ECC_SYND2_0_S110                       *((volatile unsigned int*)(0x944101428UL))
#define bM4_EXMC_ECC_SYND2_0_S111                       *((volatile unsigned int*)(0x94410142CUL))
#define bM4_EXMC_ECC_SYND2_0_S112                       *((volatile unsigned int*)(0x944101430UL))
#define bM4_EXMC_ECC_SYND2_0_S20                        *((volatile unsigned int*)(0x944101440UL))
#define bM4_EXMC_ECC_SYND2_0_S21                        *((volatile unsigned int*)(0x944101444UL))
#define bM4_EXMC_ECC_SYND2_0_S22                        *((volatile unsigned int*)(0x944101448UL))
#define bM4_EXMC_ECC_SYND2_0_S23                        *((volatile unsigned int*)(0x94410144CUL))
#define bM4_EXMC_ECC_SYND2_0_S24                        *((volatile unsigned int*)(0x944101450UL))
#define bM4_EXMC_ECC_SYND2_0_S25                        *((volatile unsigned int*)(0x944101454UL))
#define bM4_EXMC_ECC_SYND2_0_S26                        *((volatile unsigned int*)(0x944101458UL))
#define bM4_EXMC_ECC_SYND2_0_S27                        *((volatile unsigned int*)(0x94410145CUL))
#define bM4_EXMC_ECC_SYND2_0_S28                        *((volatile unsigned int*)(0x944101460UL))
#define bM4_EXMC_ECC_SYND2_0_S29                        *((volatile unsigned int*)(0x944101464UL))
#define bM4_EXMC_ECC_SYND2_0_S210                       *((volatile unsigned int*)(0x944101468UL))
#define bM4_EXMC_ECC_SYND2_0_S211                       *((volatile unsigned int*)(0x94410146CUL))
#define bM4_EXMC_ECC_SYND2_0_S212                       *((volatile unsigned int*)(0x944101470UL))
#define bM4_EXMC_ECC_SYND2_0_RESV                       *((volatile unsigned int*)(0x94410147CUL))
#define bM4_EXMC_ECC_SYND2_1_S30                        *((volatile unsigned int*)(0x944101480UL))
#define bM4_EXMC_ECC_SYND2_1_S31                        *((volatile unsigned int*)(0x944101484UL))
#define bM4_EXMC_ECC_SYND2_1_S32                        *((volatile unsigned int*)(0x944101488UL))
#define bM4_EXMC_ECC_SYND2_1_S33                        *((volatile unsigned int*)(0x94410148CUL))
#define bM4_EXMC_ECC_SYND2_1_S34                        *((volatile unsigned int*)(0x944101490UL))
#define bM4_EXMC_ECC_SYND2_1_S35                        *((volatile unsigned int*)(0x944101494UL))
#define bM4_EXMC_ECC_SYND2_1_S36                        *((volatile unsigned int*)(0x944101498UL))
#define bM4_EXMC_ECC_SYND2_1_S37                        *((volatile unsigned int*)(0x94410149CUL))
#define bM4_EXMC_ECC_SYND2_1_S38                        *((volatile unsigned int*)(0x9441014A0UL))
#define bM4_EXMC_ECC_SYND2_1_S39                        *((volatile unsigned int*)(0x9441014A4UL))
#define bM4_EXMC_ECC_SYND2_1_S310                       *((volatile unsigned int*)(0x9441014A8UL))
#define bM4_EXMC_ECC_SYND2_1_S311                       *((volatile unsigned int*)(0x9441014ACUL))
#define bM4_EXMC_ECC_SYND2_1_S312                       *((volatile unsigned int*)(0x9441014B0UL))
#define bM4_EXMC_ECC_SYND2_1_S40                        *((volatile unsigned int*)(0x9441014C0UL))
#define bM4_EXMC_ECC_SYND2_1_S41                        *((volatile unsigned int*)(0x9441014C4UL))
#define bM4_EXMC_ECC_SYND2_1_S42                        *((volatile unsigned int*)(0x9441014C8UL))
#define bM4_EXMC_ECC_SYND2_1_S43                        *((volatile unsigned int*)(0x9441014CCUL))
#define bM4_EXMC_ECC_SYND2_1_S44                        *((volatile unsigned int*)(0x9441014D0UL))
#define bM4_EXMC_ECC_SYND2_1_S45                        *((volatile unsigned int*)(0x9441014D4UL))
#define bM4_EXMC_ECC_SYND2_1_S46                        *((volatile unsigned int*)(0x9441014D8UL))
#define bM4_EXMC_ECC_SYND2_1_S47                        *((volatile unsigned int*)(0x9441014DCUL))
#define bM4_EXMC_ECC_SYND2_1_S48                        *((volatile unsigned int*)(0x9441014E0UL))
#define bM4_EXMC_ECC_SYND2_1_S49                        *((volatile unsigned int*)(0x9441014E4UL))
#define bM4_EXMC_ECC_SYND2_1_S410                       *((volatile unsigned int*)(0x9441014E8UL))
#define bM4_EXMC_ECC_SYND2_1_S411                       *((volatile unsigned int*)(0x9441014ECUL))
#define bM4_EXMC_ECC_SYND2_1_S412                       *((volatile unsigned int*)(0x9441014F0UL))
#define bM4_EXMC_ECC_SYND2_1_RESV                       *((volatile unsigned int*)(0x9441014FCUL))
#define bM4_EXMC_ECC_SYND2_2_S50                        *((volatile unsigned int*)(0x944101500UL))
#define bM4_EXMC_ECC_SYND2_2_S51                        *((volatile unsigned int*)(0x944101504UL))
#define bM4_EXMC_ECC_SYND2_2_S52                        *((volatile unsigned int*)(0x944101508UL))
#define bM4_EXMC_ECC_SYND2_2_S53                        *((volatile unsigned int*)(0x94410150CUL))
#define bM4_EXMC_ECC_SYND2_2_S54                        *((volatile unsigned int*)(0x944101510UL))
#define bM4_EXMC_ECC_SYND2_2_S55                        *((volatile unsigned int*)(0x944101514UL))
#define bM4_EXMC_ECC_SYND2_2_S56                        *((volatile unsigned int*)(0x944101518UL))
#define bM4_EXMC_ECC_SYND2_2_S57                        *((volatile unsigned int*)(0x94410151CUL))
#define bM4_EXMC_ECC_SYND2_2_S58                        *((volatile unsigned int*)(0x944101520UL))
#define bM4_EXMC_ECC_SYND2_2_S59                        *((volatile unsigned int*)(0x944101524UL))
#define bM4_EXMC_ECC_SYND2_2_S510                       *((volatile unsigned int*)(0x944101528UL))
#define bM4_EXMC_ECC_SYND2_2_S511                       *((volatile unsigned int*)(0x94410152CUL))
#define bM4_EXMC_ECC_SYND2_2_S512                       *((volatile unsigned int*)(0x944101530UL))
#define bM4_EXMC_ECC_SYND2_2_S60                        *((volatile unsigned int*)(0x944101540UL))
#define bM4_EXMC_ECC_SYND2_2_S61                        *((volatile unsigned int*)(0x944101544UL))
#define bM4_EXMC_ECC_SYND2_2_S62                        *((volatile unsigned int*)(0x944101548UL))
#define bM4_EXMC_ECC_SYND2_2_S63                        *((volatile unsigned int*)(0x94410154CUL))
#define bM4_EXMC_ECC_SYND2_2_S64                        *((volatile unsigned int*)(0x944101550UL))
#define bM4_EXMC_ECC_SYND2_2_S65                        *((volatile unsigned int*)(0x944101554UL))
#define bM4_EXMC_ECC_SYND2_2_S66                        *((volatile unsigned int*)(0x944101558UL))
#define bM4_EXMC_ECC_SYND2_2_S67                        *((volatile unsigned int*)(0x94410155CUL))
#define bM4_EXMC_ECC_SYND2_2_S68                        *((volatile unsigned int*)(0x944101560UL))
#define bM4_EXMC_ECC_SYND2_2_S69                        *((volatile unsigned int*)(0x944101564UL))
#define bM4_EXMC_ECC_SYND2_2_S610                       *((volatile unsigned int*)(0x944101568UL))
#define bM4_EXMC_ECC_SYND2_2_S611                       *((volatile unsigned int*)(0x94410156CUL))
#define bM4_EXMC_ECC_SYND2_2_S612                       *((volatile unsigned int*)(0x944101570UL))
#define bM4_EXMC_ECC_SYND2_2_RESV                       *((volatile unsigned int*)(0x94410157CUL))
#define bM4_EXMC_ECC_SYND2_3_S70                        *((volatile unsigned int*)(0x944101580UL))
#define bM4_EXMC_ECC_SYND2_3_S71                        *((volatile unsigned int*)(0x944101584UL))
#define bM4_EXMC_ECC_SYND2_3_S72                        *((volatile unsigned int*)(0x944101588UL))
#define bM4_EXMC_ECC_SYND2_3_S73                        *((volatile unsigned int*)(0x94410158CUL))
#define bM4_EXMC_ECC_SYND2_3_S74                        *((volatile unsigned int*)(0x944101590UL))
#define bM4_EXMC_ECC_SYND2_3_S75                        *((volatile unsigned int*)(0x944101594UL))
#define bM4_EXMC_ECC_SYND2_3_S76                        *((volatile unsigned int*)(0x944101598UL))
#define bM4_EXMC_ECC_SYND2_3_S77                        *((volatile unsigned int*)(0x94410159CUL))
#define bM4_EXMC_ECC_SYND2_3_S78                        *((volatile unsigned int*)(0x9441015A0UL))
#define bM4_EXMC_ECC_SYND2_3_S79                        *((volatile unsigned int*)(0x9441015A4UL))
#define bM4_EXMC_ECC_SYND2_3_S710                       *((volatile unsigned int*)(0x9441015A8UL))
#define bM4_EXMC_ECC_SYND2_3_S711                       *((volatile unsigned int*)(0x9441015ACUL))
#define bM4_EXMC_ECC_SYND2_3_S712                       *((volatile unsigned int*)(0x9441015B0UL))
#define bM4_EXMC_ECC_SYND2_3_S80                        *((volatile unsigned int*)(0x9441015C0UL))
#define bM4_EXMC_ECC_SYND2_3_S81                        *((volatile unsigned int*)(0x9441015C4UL))
#define bM4_EXMC_ECC_SYND2_3_S82                        *((volatile unsigned int*)(0x9441015C8UL))
#define bM4_EXMC_ECC_SYND2_3_S83                        *((volatile unsigned int*)(0x9441015CCUL))
#define bM4_EXMC_ECC_SYND2_3_S84                        *((volatile unsigned int*)(0x9441015D0UL))
#define bM4_EXMC_ECC_SYND2_3_S85                        *((volatile unsigned int*)(0x9441015D4UL))
#define bM4_EXMC_ECC_SYND2_3_S86                        *((volatile unsigned int*)(0x9441015D8UL))
#define bM4_EXMC_ECC_SYND2_3_S87                        *((volatile unsigned int*)(0x9441015DCUL))
#define bM4_EXMC_ECC_SYND2_3_S88                        *((volatile unsigned int*)(0x9441015E0UL))
#define bM4_EXMC_ECC_SYND2_3_S89                        *((volatile unsigned int*)(0x9441015E4UL))
#define bM4_EXMC_ECC_SYND2_3_S810                       *((volatile unsigned int*)(0x9441015E8UL))
#define bM4_EXMC_ECC_SYND2_3_S811                       *((volatile unsigned int*)(0x9441015ECUL))
#define bM4_EXMC_ECC_SYND2_3_S812                       *((volatile unsigned int*)(0x9441015F0UL))
#define bM4_EXMC_ECC_SYND2_3_RESV                       *((volatile unsigned int*)(0x9441015FCUL))
#define bM4_EXMC_ECC_SYND3_0_S10                        *((volatile unsigned int*)(0x944101600UL))
#define bM4_EXMC_ECC_SYND3_0_S11                        *((volatile unsigned int*)(0x944101604UL))
#define bM4_EXMC_ECC_SYND3_0_S12                        *((volatile unsigned int*)(0x944101608UL))
#define bM4_EXMC_ECC_SYND3_0_S13                        *((volatile unsigned int*)(0x94410160CUL))
#define bM4_EXMC_ECC_SYND3_0_S14                        *((volatile unsigned int*)(0x944101610UL))
#define bM4_EXMC_ECC_SYND3_0_S15                        *((volatile unsigned int*)(0x944101614UL))
#define bM4_EXMC_ECC_SYND3_0_S16                        *((volatile unsigned int*)(0x944101618UL))
#define bM4_EXMC_ECC_SYND3_0_S17                        *((volatile unsigned int*)(0x94410161CUL))
#define bM4_EXMC_ECC_SYND3_0_S18                        *((volatile unsigned int*)(0x944101620UL))
