RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EXMC_ECC_SYND3_0_S19                        *((volatile unsigned int*)(0x944101624UL))
#define bM4_EXMC_ECC_SYND3_0_S110                       *((volatile unsigned int*)(0x944101628UL))
#define bM4_EXMC_ECC_SYND3_0_S111                       *((volatile unsigned int*)(0x94410162CUL))
#define bM4_EXMC_ECC_SYND3_0_S112                       *((volatile unsigned int*)(0x944101630UL))
#define bM4_EXMC_ECC_SYND3_0_S20                        *((volatile unsigned int*)(0x944101640UL))
#define bM4_EXMC_ECC_SYND3_0_S21                        *((volatile unsigned int*)(0x944101644UL))
#define bM4_EXMC_ECC_SYND3_0_S22                        *((volatile unsigned int*)(0x944101648UL))
#define bM4_EXMC_ECC_SYND3_0_S23                        *((volatile unsigned int*)(0x94410164CUL))
#define bM4_EXMC_ECC_SYND3_0_S24                        *((volatile unsigned int*)(0x944101650UL))
#define bM4_EXMC_ECC_SYND3_0_S25                        *((volatile unsigned int*)(0x944101654UL))
#define bM4_EXMC_ECC_SYND3_0_S26                        *((volatile unsigned int*)(0x944101658UL))
#define bM4_EXMC_ECC_SYND3_0_S27                        *((volatile unsigned int*)(0x94410165CUL))
#define bM4_EXMC_ECC_SYND3_0_S28                        *((volatile unsigned int*)(0x944101660UL))
#define bM4_EXMC_ECC_SYND3_0_S29                        *((volatile unsigned int*)(0x944101664UL))
#define bM4_EXMC_ECC_SYND3_0_S210                       *((volatile unsigned int*)(0x944101668UL))
#define bM4_EXMC_ECC_SYND3_0_S211                       *((volatile unsigned int*)(0x94410166CUL))
#define bM4_EXMC_ECC_SYND3_0_S212                       *((volatile unsigned int*)(0x944101670UL))
#define bM4_EXMC_ECC_SYND3_0_RESV                       *((volatile unsigned int*)(0x94410167CUL))
#define bM4_EXMC_ECC_SYND3_1_S30                        *((volatile unsigned int*)(0x944101680UL))
#define bM4_EXMC_ECC_SYND3_1_S31                        *((volatile unsigned int*)(0x944101684UL))
#define bM4_EXMC_ECC_SYND3_1_S32                        *((volatile unsigned int*)(0x944101688UL))
#define bM4_EXMC_ECC_SYND3_1_S33                        *((volatile unsigned int*)(0x94410168CUL))
#define bM4_EXMC_ECC_SYND3_1_S34                        *((volatile unsigned int*)(0x944101690UL))
#define bM4_EXMC_ECC_SYND3_1_S35                        *((volatile unsigned int*)(0x944101694UL))
#define bM4_EXMC_ECC_SYND3_1_S36                        *((volatile unsigned int*)(0x944101698UL))
#define bM4_EXMC_ECC_SYND3_1_S37                        *((volatile unsigned int*)(0x94410169CUL))
#define bM4_EXMC_ECC_SYND3_1_S38                        *((volatile unsigned int*)(0x9441016A0UL))
#define bM4_EXMC_ECC_SYND3_1_S39                        *((volatile unsigned int*)(0x9441016A4UL))
#define bM4_EXMC_ECC_SYND3_1_S310                       *((volatile unsigned int*)(0x9441016A8UL))
#define bM4_EXMC_ECC_SYND3_1_S311                       *((volatile unsigned int*)(0x9441016ACUL))
#define bM4_EXMC_ECC_SYND3_1_S312                       *((volatile unsigned int*)(0x9441016B0UL))
#define bM4_EXMC_ECC_SYND3_1_S40                        *((volatile unsigned int*)(0x9441016C0UL))
#define bM4_EXMC_ECC_SYND3_1_S41                        *((volatile unsigned int*)(0x9441016C4UL))
#define bM4_EXMC_ECC_SYND3_1_S42                        *((volatile unsigned int*)(0x9441016C8UL))
#define bM4_EXMC_ECC_SYND3_1_S43                        *((volatile unsigned int*)(0x9441016CCUL))
#define bM4_EXMC_ECC_SYND3_1_S44                        *((volatile unsigned int*)(0x9441016D0UL))
#define bM4_EXMC_ECC_SYND3_1_S45                        *((volatile unsigned int*)(0x9441016D4UL))
#define bM4_EXMC_ECC_SYND3_1_S46                        *((volatile unsigned int*)(0x9441016D8UL))
#define bM4_EXMC_ECC_SYND3_1_S47                        *((volatile unsigned int*)(0x9441016DCUL))
#define bM4_EXMC_ECC_SYND3_1_S48                        *((volatile unsigned int*)(0x9441016E0UL))
#define bM4_EXMC_ECC_SYND3_1_S49                        *((volatile unsigned int*)(0x9441016E4UL))
#define bM4_EXMC_ECC_SYND3_1_S410                       *((volatile unsigned int*)(0x9441016E8UL))
#define bM4_EXMC_ECC_SYND3_1_S411                       *((volatile unsigned int*)(0x9441016ECUL))
#define bM4_EXMC_ECC_SYND3_1_S412                       *((volatile unsigned int*)(0x9441016F0UL))
#define bM4_EXMC_ECC_SYND3_1_RESV                       *((volatile unsigned int*)(0x9441016FCUL))
#define bM4_EXMC_ECC_SYND3_2_S50                        *((volatile unsigned int*)(0x944101700UL))
#define bM4_EXMC_ECC_SYND3_2_S51                        *((volatile unsigned int*)(0x944101704UL))
#define bM4_EXMC_ECC_SYND3_2_S52                        *((volatile unsigned int*)(0x944101708UL))
#define bM4_EXMC_ECC_SYND3_2_S53                        *((volatile unsigned int*)(0x94410170CUL))
#define bM4_EXMC_ECC_SYND3_2_S54                        *((volatile unsigned int*)(0x944101710UL))
#define bM4_EXMC_ECC_SYND3_2_S55                        *((volatile unsigned int*)(0x944101714UL))
#define bM4_EXMC_ECC_SYND3_2_S56                        *((volatile unsigned int*)(0x944101718UL))
#define bM4_EXMC_ECC_SYND3_2_S57                        *((volatile unsigned int*)(0x94410171CUL))
#define bM4_EXMC_ECC_SYND3_2_S58                        *((volatile unsigned int*)(0x944101720UL))
#define bM4_EXMC_ECC_SYND3_2_S59                        *((volatile unsigned int*)(0x944101724UL))
#define bM4_EXMC_ECC_SYND3_2_S510                       *((volatile unsigned int*)(0x944101728UL))
#define bM4_EXMC_ECC_SYND3_2_S511                       *((volatile unsigned int*)(0x94410172CUL))
#define bM4_EXMC_ECC_SYND3_2_S512                       *((volatile unsigned int*)(0x944101730UL))
#define bM4_EXMC_ECC_SYND3_2_S60                        *((volatile unsigned int*)(0x944101740UL))
#define bM4_EXMC_ECC_SYND3_2_S61                        *((volatile unsigned int*)(0x944101744UL))
#define bM4_EXMC_ECC_SYND3_2_S62                        *((volatile unsigned int*)(0x944101748UL))
#define bM4_EXMC_ECC_SYND3_2_S63                        *((volatile unsigned int*)(0x94410174CUL))
#define bM4_EXMC_ECC_SYND3_2_S64                        *((volatile unsigned int*)(0x944101750UL))
#define bM4_EXMC_ECC_SYND3_2_S65                        *((volatile unsigned int*)(0x944101754UL))
#define bM4_EXMC_ECC_SYND3_2_S66                        *((volatile unsigned int*)(0x944101758UL))
#define bM4_EXMC_ECC_SYND3_2_S67                        *((volatile unsigned int*)(0x94410175CUL))
#define bM4_EXMC_ECC_SYND3_2_S68                        *((volatile unsigned int*)(0x944101760UL))
#define bM4_EXMC_ECC_SYND3_2_S69                        *((volatile unsigned int*)(0x944101764UL))
#define bM4_EXMC_ECC_SYND3_2_S610                       *((volatile unsigned int*)(0x944101768UL))
#define bM4_EXMC_ECC_SYND3_2_S611                       *((volatile unsigned int*)(0x94410176CUL))
#define bM4_EXMC_ECC_SYND3_2_S612                       *((volatile unsigned int*)(0x944101770UL))
#define bM4_EXMC_ECC_SYND3_2_RESV                       *((volatile unsigned int*)(0x94410177CUL))
#define bM4_EXMC_ECC_SYND3_3_S70                        *((volatile unsigned int*)(0x944101780UL))
#define bM4_EXMC_ECC_SYND3_3_S71                        *((volatile unsigned int*)(0x944101784UL))
#define bM4_EXMC_ECC_SYND3_3_S72                        *((volatile unsigned int*)(0x944101788UL))
#define bM4_EXMC_ECC_SYND3_3_S73                        *((volatile unsigned int*)(0x94410178CUL))
#define bM4_EXMC_ECC_SYND3_3_S74                        *((volatile unsigned int*)(0x944101790UL))
#define bM4_EXMC_ECC_SYND3_3_S75                        *((volatile unsigned int*)(0x944101794UL))
#define bM4_EXMC_ECC_SYND3_3_S76                        *((volatile unsigned int*)(0x944101798UL))
#define bM4_EXMC_ECC_SYND3_3_S77                        *((volatile unsigned int*)(0x94410179CUL))
#define bM4_EXMC_ECC_SYND3_3_S78                        *((volatile unsigned int*)(0x9441017A0UL))
#define bM4_EXMC_ECC_SYND3_3_S79                        *((volatile unsigned int*)(0x9441017A4UL))
#define bM4_EXMC_ECC_SYND3_3_S710                       *((volatile unsigned int*)(0x9441017A8UL))
#define bM4_EXMC_ECC_SYND3_3_S711                       *((volatile unsigned int*)(0x9441017ACUL))
#define bM4_EXMC_ECC_SYND3_3_S712                       *((volatile unsigned int*)(0x9441017B0UL))
#define bM4_EXMC_ECC_SYND3_3_S80                        *((volatile unsigned int*)(0x9441017C0UL))
#define bM4_EXMC_ECC_SYND3_3_S81                        *((volatile unsigned int*)(0x9441017C4UL))
#define bM4_EXMC_ECC_SYND3_3_S82                        *((volatile unsigned int*)(0x9441017C8UL))
#define bM4_EXMC_ECC_SYND3_3_S83                        *((volatile unsigned int*)(0x9441017CCUL))
#define bM4_EXMC_ECC_SYND3_3_S84                        *((volatile unsigned int*)(0x9441017D0UL))
#define bM4_EXMC_ECC_SYND3_3_S85                        *((volatile unsigned int*)(0x9441017D4UL))
#define bM4_EXMC_ECC_SYND3_3_S86                        *((volatile unsigned int*)(0x9441017D8UL))
#define bM4_EXMC_ECC_SYND3_3_S87                        *((volatile unsigned int*)(0x9441017DCUL))
#define bM4_EXMC_ECC_SYND3_3_S88                        *((volatile unsigned int*)(0x9441017E0UL))
#define bM4_EXMC_ECC_SYND3_3_S89                        *((volatile unsigned int*)(0x9441017E4UL))
#define bM4_EXMC_ECC_SYND3_3_S810                       *((volatile unsigned int*)(0x9441017E8UL))
#define bM4_EXMC_ECC_SYND3_3_S811                       *((volatile unsigned int*)(0x9441017ECUL))
#define bM4_EXMC_ECC_SYND3_3_S812                       *((volatile unsigned int*)(0x9441017F0UL))
#define bM4_EXMC_ECC_SYND3_3_RESV                       *((volatile unsigned int*)(0x9441017FCUL))
#define bM4_EXMC_ECC_SYND4_0_S10                        *((volatile unsigned int*)(0x944101800UL))
#define bM4_EXMC_ECC_SYND4_0_S11                        *((volatile unsigned int*)(0x944101804UL))
#define bM4_EXMC_ECC_SYND4_0_S12                        *((volatile unsigned int*)(0x944101808UL))
#define bM4_EXMC_ECC_SYND4_0_S13                        *((volatile unsigned int*)(0x94410180CUL))
#define bM4_EXMC_ECC_SYND4_0_S14                        *((volatile unsigned int*)(0x944101810UL))
#define bM4_EXMC_ECC_SYND4_0_S15                        *((volatile unsigned int*)(0x944101814UL))
#define bM4_EXMC_ECC_SYND4_0_S16                        *((volatile unsigned int*)(0x944101818UL))
#define bM4_EXMC_ECC_SYND4_0_S17                        *((volatile unsigned int*)(0x94410181CUL))
#define bM4_EXMC_ECC_SYND4_0_S18                        *((volatile unsigned int*)(0x944101820UL))
#define bM4_EXMC_ECC_SYND4_0_S19                        *((volatile unsigned int*)(0x944101824UL))
#define bM4_EXMC_ECC_SYND4_0_S110                       *((volatile unsigned int*)(0x944101828UL))
#define bM4_EXMC_ECC_SYND4_0_S111                       *((volatile unsigned int*)(0x94410182CUL))
#define bM4_EXMC_ECC_SYND4_0_S112                       *((volatile unsigned int*)(0x944101830UL))
#define bM4_EXMC_ECC_SYND4_0_S20                        *((volatile unsigned int*)(0x944101840UL))
#define bM4_EXMC_ECC_SYND4_0_S21                        *((volatile unsigned int*)(0x944101844UL))
#define bM4_EXMC_ECC_SYND4_0_S22                        *((volatile unsigned int*)(0x944101848UL))
#define bM4_EXMC_ECC_SYND4_0_S23                        *((volatile unsigned int*)(0x94410184CUL))
#define bM4_EXMC_ECC_SYND4_0_S24                        *((volatile unsigned int*)(0x944101850UL))
#define bM4_EXMC_ECC_SYND4_0_S25                        *((volatile unsigned int*)(0x944101854UL))
#define bM4_EXMC_ECC_SYND4_0_S26                        *((volatile unsigned int*)(0x944101858UL))
#define bM4_EXMC_ECC_SYND4_0_S27                        *((volatile unsigned int*)(0x94410185CUL))
#define bM4_EXMC_ECC_SYND4_0_S28                        *((volatile unsigned int*)(0x944101860UL))
#define bM4_EXMC_ECC_SYND4_0_S29                        *((volatile unsigned int*)(0x944101864UL))
#define bM4_EXMC_ECC_SYND4_0_S210                       *((volatile unsigned int*)(0x944101868UL))
#define bM4_EXMC_ECC_SYND4_0_S211                       *((volatile unsigned int*)(0x94410186CUL))
#define bM4_EXMC_ECC_SYND4_0_S212                       *((volatile unsigned int*)(0x944101870UL))
#define bM4_EXMC_ECC_SYND4_0_RESV                       *((volatile unsigned int*)(0x94410187CUL))
#define bM4_EXMC_ECC_SYND4_1_S30                        *((volatile unsigned int*)(0x944101880UL))
#define bM4_EXMC_ECC_SYND4_1_S31                        *((volatile unsigned int*)(0x944101884UL))
#define bM4_EXMC_ECC_SYND4_1_S32                        *((volatile unsigned int*)(0x944101888UL))
#define bM4_EXMC_ECC_SYND4_1_S33                        *((volatile unsigned int*)(0x94410188CUL))
#define bM4_EXMC_ECC_SYND4_1_S34                        *((volatile unsigned int*)(0x944101890UL))
#define bM4_EXMC_ECC_SYND4_1_S35                        *((volatile unsigned int*)(0x944101894UL))
#define bM4_EXMC_ECC_SYND4_1_S36                        *((volatile unsigned int*)(0x944101898UL))
#define bM4_EXMC_ECC_SYND4_1_S37                        *((volatile unsigned int*)(0x94410189CUL))
#define bM4_EXMC_ECC_SYND4_1_S38                        *((volatile unsigned int*)(0x9441018A0UL))
#define bM4_EXMC_ECC_SYND4_1_S39                        *((volatile unsigned int*)(0x9441018A4UL))
#define bM4_EXMC_ECC_SYND4_1_S310                       *((volatile unsigned int*)(0x9441018A8UL))
#define bM4_EXMC_ECC_SYND4_1_S311                       *((volatile unsigned int*)(0x9441018ACUL))
#define bM4_EXMC_ECC_SYND4_1_S312                       *((volatile unsigned int*)(0x9441018B0UL))
#define bM4_EXMC_ECC_SYND4_1_S40                        *((volatile unsigned int*)(0x9441018C0UL))
#define bM4_EXMC_ECC_SYND4_1_S41                        *((volatile unsigned int*)(0x9441018C4UL))
#define bM4_EXMC_ECC_SYND4_1_S42                        *((volatile unsigned int*)(0x9441018C8UL))
#define bM4_EXMC_ECC_SYND4_1_S43                        *((volatile unsigned int*)(0x9441018CCUL))
#define bM4_EXMC_ECC_SYND4_1_S44                        *((volatile unsigned int*)(0x9441018D0UL))
#define bM4_EXMC_ECC_SYND4_1_S45                        *((volatile unsigned int*)(0x9441018D4UL))
#define bM4_EXMC_ECC_SYND4_1_S46                        *((volatile unsigned int*)(0x9441018D8UL))
#define bM4_EXMC_ECC_SYND4_1_S47                        *((volatile unsigned int*)(0x9441018DCUL))
#define bM4_EXMC_ECC_SYND4_1_S48                        *((volatile unsigned int*)(0x9441018E0UL))
#define bM4_EXMC_ECC_SYND4_1_S49                        *((volatile unsigned int*)(0x9441018E4UL))
#define bM4_EXMC_ECC_SYND4_1_S410                       *((volatile unsigned int*)(0x9441018E8UL))
#define bM4_EXMC_ECC_SYND4_1_S411                       *((volatile unsigned int*)(0x9441018ECUL))
#define bM4_EXMC_ECC_SYND4_1_S412                       *((volatile unsigned int*)(0x9441018F0UL))
#define bM4_EXMC_ECC_SYND4_1_RESV                       *((volatile unsigned int*)(0x9441018FCUL))
#define bM4_EXMC_ECC_SYND4_2_S50                        *((volatile unsigned int*)(0x944101900UL))
#define bM4_EXMC_ECC_SYND4_2_S51                        *((volatile unsigned int*)(0x944101904UL))
#define bM4_EXMC_ECC_SYND4_2_S52                        *((volatile unsigned int*)(0x944101908UL))
#define bM4_EXMC_ECC_SYND4_2_S53                        *((volatile unsigned int*)(0x94410190CUL))
#define bM4_EXMC_ECC_SYND4_2_S54                        *((volatile unsigned int*)(0x944101910UL))
#define bM4_EXMC_ECC_SYND4_2_S55                        *((volatile unsigned int*)(0x944101914UL))
#define bM4_EXMC_ECC_SYND4_2_S56                        *((volatile unsigned int*)(0x944101918UL))
#define bM4_EXMC_ECC_SYND4_2_S57                        *((volatile unsigned int*)(0x94410191CUL))
#define bM4_EXMC_ECC_SYND4_2_S58                        *((volatile unsigned int*)(0x944101920UL))
#define bM4_EXMC_ECC_SYND4_2_S59                        *((volatile unsigned int*)(0x944101924UL))
#define bM4_EXMC_ECC_SYND4_2_S510                       *((volatile unsigned int*)(0x944101928UL))
#define bM4_EXMC_ECC_SYND4_2_S511                       *((volatile unsigned int*)(0x94410192CUL))
#define bM4_EXMC_ECC_SYND4_2_S512                       *((volatile unsigned int*)(0x944101930UL))
#define bM4_EXMC_ECC_SYND4_2_S60                        *((volatile unsigned int*)(0x944101940UL))
#define bM4_EXMC_ECC_SYND4_2_S61                        *((volatile unsigned int*)(0x944101944UL))
#define bM4_EXMC_ECC_SYND4_2_S62                        *((volatile unsigned int*)(0x944101948UL))
#define bM4_EXMC_ECC_SYND4_2_S63                        *((volatile unsigned int*)(0x94410194CUL))
#define bM4_EXMC_ECC_SYND4_2_S64                        *((volatile unsigned int*)(0x944101950UL))
#define bM4_EXMC_ECC_SYND4_2_S65                        *((volatile unsigned int*)(0x944101954UL))
#define bM4_EXMC_ECC_SYND4_2_S66                        *((volatile unsigned int*)(0x944101958UL))
#define bM4_EXMC_ECC_SYND4_2_S67                        *((volatile unsigned int*)(0x94410195CUL))
#define bM4_EXMC_ECC_SYND4_2_S68                        *((volatile unsigned int*)(0x944101960UL))
#define bM4_EXMC_ECC_SYND4_2_S69                        *((volatile unsigned int*)(0x944101964UL))
#define bM4_EXMC_ECC_SYND4_2_S610                       *((volatile unsigned int*)(0x944101968UL))
#define bM4_EXMC_ECC_SYND4_2_S611                       *((volatile unsigned int*)(0x94410196CUL))
#define bM4_EXMC_ECC_SYND4_2_S612                       *((volatile unsigned int*)(0x944101970UL))
#define bM4_EXMC_ECC_SYND4_2_RESV                       *((volatile unsigned int*)(0x94410197CUL))
#define bM4_EXMC_ECC_SYND4_3_S70                        *((volatile unsigned int*)(0x944101980UL))
#define bM4_EXMC_ECC_SYND4_3_S71                        *((volatile unsigned int*)(0x944101984UL))
#define bM4_EXMC_ECC_SYND4_3_S72                        *((volatile unsigned int*)(0x944101988UL))
#define bM4_EXMC_ECC_SYND4_3_S73                        *((volatile unsigned int*)(0x94410198CUL))
#define bM4_EXMC_ECC_SYND4_3_S74                        *((volatile unsigned int*)(0x944101990UL))
#define bM4_EXMC_ECC_SYND4_3_S75                        *((volatile unsigned int*)(0x944101994UL))
#define bM4_EXMC_ECC_SYND4_3_S76                        *((volatile unsigned int*)(0x944101998UL))
#define bM4_EXMC_ECC_SYND4_3_S77                        *((volatile unsigned int*)(0x94410199CUL))
#define bM4_EXMC_ECC_SYND4_3_S78                        *((volatile unsigned int*)(0x9441019A0UL))
#define bM4_EXMC_ECC_SYND4_3_S79                        *((volatile unsigned int*)(0x9441019A4UL))
#define bM4_EXMC_ECC_SYND4_3_S710                       *((volatile unsigned int*)(0x9441019A8UL))
#define bM4_EXMC_ECC_SYND4_3_S711                       *((volatile unsigned int*)(0x9441019ACUL))
#define bM4_EXMC_ECC_SYND4_3_S712                       *((volatile unsigned int*)(0x9441019B0UL))
#define bM4_EXMC_ECC_SYND4_3_S80                        *((volatile unsigned int*)(0x9441019C0UL))
#define bM4_EXMC_ECC_SYND4_3_S81                        *((volatile unsigned int*)(0x9441019C4UL))
#define bM4_EXMC_ECC_SYND4_3_S82                        *((volatile unsigned int*)(0x9441019C8UL))
#define bM4_EXMC_ECC_SYND4_3_S83                        *((volatile unsigned int*)(0x9441019CCUL))
#define bM4_EXMC_ECC_SYND4_3_S84                        *((volatile unsigned int*)(0x9441019D0UL))
#define bM4_EXMC_ECC_SYND4_3_S85                        *((volatile unsigned int*)(0x9441019D4UL))
#define bM4_EXMC_ECC_SYND4_3_S86                        *((volatile unsigned int*)(0x9441019D8UL))
#define bM4_EXMC_ECC_SYND4_3_S87                        *((volatile unsigned int*)(0x9441019DCUL))
#define bM4_EXMC_ECC_SYND4_3_S88                        *((volatile unsigned int*)(0x9441019E0UL))
#define bM4_EXMC_ECC_SYND4_3_S89                        *((volatile unsigned int*)(0x9441019E4UL))
#define bM4_EXMC_ECC_SYND4_3_S810                       *((volatile unsigned int*)(0x9441019E8UL))
#define bM4_EXMC_ECC_SYND4_3_S811                       *((volatile unsigned int*)(0x9441019ECUL))
#define bM4_EXMC_ECC_SYND4_3_S812                       *((volatile unsigned int*)(0x9441019F0UL))
#define bM4_EXMC_ECC_SYND4_3_RESV                       *((volatile unsigned int*)(0x9441019FCUL))
#define bM4_EXMC_ECC_SYND5_0_S10                        *((volatile unsigned int*)(0x944101A00UL))
#define bM4_EXMC_ECC_SYND5_0_S11                        *((volatile unsigned int*)(0x944101A04UL))
#define bM4_EXMC_ECC_SYND5_0_S12                        *((volatile unsigned int*)(0x944101A08UL))
#define bM4_EXMC_ECC_SYND5_0_S13                        *((volatile unsigned int*)(0x944101A0CUL))
#define bM4_EXMC_ECC_SYND5_0_S14                        *((volatile unsigned int*)(0x944101A10UL))
#define bM4_EXMC_ECC_SYND5_0_S15                        *((volatile unsigned int*)(0x944101A14UL))
#define bM4_EXMC_ECC_SYND5_0_S16                        *((volatile unsigned int*)(0x944101A18UL))
#define bM4_EXMC_ECC_SYND5_0_S17                        *((volatile unsigned int*)(0x944101A1CUL))
#define bM4_EXMC_ECC_SYND5_0_S18                        *((volatile unsigned int*)(0x944101A20UL))
#define bM4_EXMC_ECC_SYND5_0_S19                        *((volatile unsigned int*)(0x944101A24UL))
#define bM4_EXMC_ECC_SYND5_0_S110                       *((volatile unsigned int*)(0x944101A28UL))
#define bM4_EXMC_ECC_SYND5_0_S111                       *((volatile unsigned int*)(0x944101A2CUL))
#define bM4_EXMC_ECC_SYND5_0_S112                       *((volatile unsigned int*)(0x944101A30UL))
#define bM4_EXMC_ECC_SYND5_0_S20                        *((volatile unsigned int*)(0x944101A40UL))
#define bM4_EXMC_ECC_SYND5_0_S21                        *((volatile unsigned int*)(0x944101A44UL))
#define bM4_EXMC_ECC_SYND5_0_S22                        *((volatile unsigned int*)(0x944101A48UL))
#define bM4_EXMC_ECC_SYND5_0_S23                        *((volatile unsigned int*)(0x944101A4CUL))
#define bM4_EXMC_ECC_SYND5_0_S24                        *((volatile unsigned int*)(0x944101A50UL))
#define bM4_EXMC_ECC_SYND5_0_S25                        *((volatile unsigned int*)(0x944101A54UL))
#define bM4_EXMC_ECC_SYND5_0_S26                        *((volatile unsigned int*)(0x944101A58UL))
#define bM4_EXMC_ECC_SYND5_0_S27                        *((volatile unsigned int*)(0x944101A5CUL))
#define bM4_EXMC_ECC_SYND5_0_S28                        *((volatile unsigned int*)(0x944101A60UL))
#define bM4_EXMC_ECC_SYND5_0_S29                        *((volatile unsigned int*)(0x944101A64UL))
#define bM4_EXMC_ECC_SYND5_0_S210                       *((volatile unsigned int*)(0x944101A68UL))
#define bM4_EXMC_ECC_SYND5_0_S211                       *((volatile unsigned int*)(0x944101A6CUL))
#define bM4_EXMC_ECC_SYND5_0_S212                       *((volatile unsigned int*)(0x944101A70UL))
#define bM4_EXMC_ECC_SYND5_0_RESV                       *((volatile unsigned int*)(0x944101A7CUL))
#define bM4_EXMC_ECC_SYND5_1_S30                        *((volatile unsigned int*)(0x944101A80UL))
#define bM4_EXMC_ECC_SYND5_1_S31                        *((volatile unsigned int*)(0x944101A84UL))
#define bM4_EXMC_ECC_SYND5_1_S32                        *((volatile unsigned int*)(0x944101A88UL))
#define bM4_EXMC_ECC_SYND5_1_S33                        *((volatile unsigned int*)(0x944101A8CUL))
#define bM4_EXMC_ECC_SYND5_1_S34                        *((volatile unsigned int*)(0x944101A90UL))
#define bM4_EXMC_ECC_SYND5_1_S35                        *((volatile unsigned int*)(0x944101A94UL))
#define bM4_EXMC_ECC_SYND5_1_S36                        *((volatile unsigned int*)(0x944101A98UL))
#define bM4_EXMC_ECC_SYND5_1_S37                        *((volatile unsigned int*)(0x944101A9CUL))
