RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EXMC_ECC_SYND5_1_S38                        *((volatile unsigned int*)(0x944101AA0UL))
#define bM4_EXMC_ECC_SYND5_1_S39                        *((volatile unsigned int*)(0x944101AA4UL))
#define bM4_EXMC_ECC_SYND5_1_S310                       *((volatile unsigned int*)(0x944101AA8UL))
#define bM4_EXMC_ECC_SYND5_1_S311                       *((volatile unsigned int*)(0x944101AACUL))
#define bM4_EXMC_ECC_SYND5_1_S312                       *((volatile unsigned int*)(0x944101AB0UL))
#define bM4_EXMC_ECC_SYND5_1_S40                        *((volatile unsigned int*)(0x944101AC0UL))
#define bM4_EXMC_ECC_SYND5_1_S41                        *((volatile unsigned int*)(0x944101AC4UL))
#define bM4_EXMC_ECC_SYND5_1_S42                        *((volatile unsigned int*)(0x944101AC8UL))
#define bM4_EXMC_ECC_SYND5_1_S43                        *((volatile unsigned int*)(0x944101ACCUL))
#define bM4_EXMC_ECC_SYND5_1_S44                        *((volatile unsigned int*)(0x944101AD0UL))
#define bM4_EXMC_ECC_SYND5_1_S45                        *((volatile unsigned int*)(0x944101AD4UL))
#define bM4_EXMC_ECC_SYND5_1_S46                        *((volatile unsigned int*)(0x944101AD8UL))
#define bM4_EXMC_ECC_SYND5_1_S47                        *((volatile unsigned int*)(0x944101ADCUL))
#define bM4_EXMC_ECC_SYND5_1_S48                        *((volatile unsigned int*)(0x944101AE0UL))
#define bM4_EXMC_ECC_SYND5_1_S49                        *((volatile unsigned int*)(0x944101AE4UL))
#define bM4_EXMC_ECC_SYND5_1_S410                       *((volatile unsigned int*)(0x944101AE8UL))
#define bM4_EXMC_ECC_SYND5_1_S411                       *((volatile unsigned int*)(0x944101AECUL))
#define bM4_EXMC_ECC_SYND5_1_S412                       *((volatile unsigned int*)(0x944101AF0UL))
#define bM4_EXMC_ECC_SYND5_1_RESV                       *((volatile unsigned int*)(0x944101AFCUL))
#define bM4_EXMC_ECC_SYND5_2_S50                        *((volatile unsigned int*)(0x944101B00UL))
#define bM4_EXMC_ECC_SYND5_2_S51                        *((volatile unsigned int*)(0x944101B04UL))
#define bM4_EXMC_ECC_SYND5_2_S52                        *((volatile unsigned int*)(0x944101B08UL))
#define bM4_EXMC_ECC_SYND5_2_S53                        *((volatile unsigned int*)(0x944101B0CUL))
#define bM4_EXMC_ECC_SYND5_2_S54                        *((volatile unsigned int*)(0x944101B10UL))
#define bM4_EXMC_ECC_SYND5_2_S55                        *((volatile unsigned int*)(0x944101B14UL))
#define bM4_EXMC_ECC_SYND5_2_S56                        *((volatile unsigned int*)(0x944101B18UL))
#define bM4_EXMC_ECC_SYND5_2_S57                        *((volatile unsigned int*)(0x944101B1CUL))
#define bM4_EXMC_ECC_SYND5_2_S58                        *((volatile unsigned int*)(0x944101B20UL))
#define bM4_EXMC_ECC_SYND5_2_S59                        *((volatile unsigned int*)(0x944101B24UL))
#define bM4_EXMC_ECC_SYND5_2_S510                       *((volatile unsigned int*)(0x944101B28UL))
#define bM4_EXMC_ECC_SYND5_2_S511                       *((volatile unsigned int*)(0x944101B2CUL))
#define bM4_EXMC_ECC_SYND5_2_S512                       *((volatile unsigned int*)(0x944101B30UL))
#define bM4_EXMC_ECC_SYND5_2_S60                        *((volatile unsigned int*)(0x944101B40UL))
#define bM4_EXMC_ECC_SYND5_2_S61                        *((volatile unsigned int*)(0x944101B44UL))
#define bM4_EXMC_ECC_SYND5_2_S62                        *((volatile unsigned int*)(0x944101B48UL))
#define bM4_EXMC_ECC_SYND5_2_S63                        *((volatile unsigned int*)(0x944101B4CUL))
#define bM4_EXMC_ECC_SYND5_2_S64                        *((volatile unsigned int*)(0x944101B50UL))
#define bM4_EXMC_ECC_SYND5_2_S65                        *((volatile unsigned int*)(0x944101B54UL))
#define bM4_EXMC_ECC_SYND5_2_S66                        *((volatile unsigned int*)(0x944101B58UL))
#define bM4_EXMC_ECC_SYND5_2_S67                        *((volatile unsigned int*)(0x944101B5CUL))
#define bM4_EXMC_ECC_SYND5_2_S68                        *((volatile unsigned int*)(0x944101B60UL))
#define bM4_EXMC_ECC_SYND5_2_S69                        *((volatile unsigned int*)(0x944101B64UL))
#define bM4_EXMC_ECC_SYND5_2_S610                       *((volatile unsigned int*)(0x944101B68UL))
#define bM4_EXMC_ECC_SYND5_2_S611                       *((volatile unsigned int*)(0x944101B6CUL))
#define bM4_EXMC_ECC_SYND5_2_S612                       *((volatile unsigned int*)(0x944101B70UL))
#define bM4_EXMC_ECC_SYND5_2_RESV                       *((volatile unsigned int*)(0x944101B7CUL))
#define bM4_EXMC_ECC_SYND5_3_S70                        *((volatile unsigned int*)(0x944101B80UL))
#define bM4_EXMC_ECC_SYND5_3_S71                        *((volatile unsigned int*)(0x944101B84UL))
#define bM4_EXMC_ECC_SYND5_3_S72                        *((volatile unsigned int*)(0x944101B88UL))
#define bM4_EXMC_ECC_SYND5_3_S73                        *((volatile unsigned int*)(0x944101B8CUL))
#define bM4_EXMC_ECC_SYND5_3_S74                        *((volatile unsigned int*)(0x944101B90UL))
#define bM4_EXMC_ECC_SYND5_3_S75                        *((volatile unsigned int*)(0x944101B94UL))
#define bM4_EXMC_ECC_SYND5_3_S76                        *((volatile unsigned int*)(0x944101B98UL))
#define bM4_EXMC_ECC_SYND5_3_S77                        *((volatile unsigned int*)(0x944101B9CUL))
#define bM4_EXMC_ECC_SYND5_3_S78                        *((volatile unsigned int*)(0x944101BA0UL))
#define bM4_EXMC_ECC_SYND5_3_S79                        *((volatile unsigned int*)(0x944101BA4UL))
#define bM4_EXMC_ECC_SYND5_3_S710                       *((volatile unsigned int*)(0x944101BA8UL))
#define bM4_EXMC_ECC_SYND5_3_S711                       *((volatile unsigned int*)(0x944101BACUL))
#define bM4_EXMC_ECC_SYND5_3_S712                       *((volatile unsigned int*)(0x944101BB0UL))
#define bM4_EXMC_ECC_SYND5_3_S80                        *((volatile unsigned int*)(0x944101BC0UL))
#define bM4_EXMC_ECC_SYND5_3_S81                        *((volatile unsigned int*)(0x944101BC4UL))
#define bM4_EXMC_ECC_SYND5_3_S82                        *((volatile unsigned int*)(0x944101BC8UL))
#define bM4_EXMC_ECC_SYND5_3_S83                        *((volatile unsigned int*)(0x944101BCCUL))
#define bM4_EXMC_ECC_SYND5_3_S84                        *((volatile unsigned int*)(0x944101BD0UL))
#define bM4_EXMC_ECC_SYND5_3_S85                        *((volatile unsigned int*)(0x944101BD4UL))
#define bM4_EXMC_ECC_SYND5_3_S86                        *((volatile unsigned int*)(0x944101BD8UL))
#define bM4_EXMC_ECC_SYND5_3_S87                        *((volatile unsigned int*)(0x944101BDCUL))
#define bM4_EXMC_ECC_SYND5_3_S88                        *((volatile unsigned int*)(0x944101BE0UL))
#define bM4_EXMC_ECC_SYND5_3_S89                        *((volatile unsigned int*)(0x944101BE4UL))
#define bM4_EXMC_ECC_SYND5_3_S810                       *((volatile unsigned int*)(0x944101BE8UL))
#define bM4_EXMC_ECC_SYND5_3_S811                       *((volatile unsigned int*)(0x944101BECUL))
#define bM4_EXMC_ECC_SYND5_3_S812                       *((volatile unsigned int*)(0x944101BF0UL))
#define bM4_EXMC_ECC_SYND5_3_RESV                       *((volatile unsigned int*)(0x944101BFCUL))
#define bM4_EXMC_ECC_SYND6_0_S10                        *((volatile unsigned int*)(0x944101C00UL))
#define bM4_EXMC_ECC_SYND6_0_S11                        *((volatile unsigned int*)(0x944101C04UL))
#define bM4_EXMC_ECC_SYND6_0_S12                        *((volatile unsigned int*)(0x944101C08UL))
#define bM4_EXMC_ECC_SYND6_0_S13                        *((volatile unsigned int*)(0x944101C0CUL))
#define bM4_EXMC_ECC_SYND6_0_S14                        *((volatile unsigned int*)(0x944101C10UL))
#define bM4_EXMC_ECC_SYND6_0_S15                        *((volatile unsigned int*)(0x944101C14UL))
#define bM4_EXMC_ECC_SYND6_0_S16                        *((volatile unsigned int*)(0x944101C18UL))
#define bM4_EXMC_ECC_SYND6_0_S17                        *((volatile unsigned int*)(0x944101C1CUL))
#define bM4_EXMC_ECC_SYND6_0_S18                        *((volatile unsigned int*)(0x944101C20UL))
#define bM4_EXMC_ECC_SYND6_0_S19                        *((volatile unsigned int*)(0x944101C24UL))
#define bM4_EXMC_ECC_SYND6_0_S110                       *((volatile unsigned int*)(0x944101C28UL))
#define bM4_EXMC_ECC_SYND6_0_S111                       *((volatile unsigned int*)(0x944101C2CUL))
#define bM4_EXMC_ECC_SYND6_0_S112                       *((volatile unsigned int*)(0x944101C30UL))
#define bM4_EXMC_ECC_SYND6_0_S20                        *((volatile unsigned int*)(0x944101C40UL))
#define bM4_EXMC_ECC_SYND6_0_S21                        *((volatile unsigned int*)(0x944101C44UL))
#define bM4_EXMC_ECC_SYND6_0_S22                        *((volatile unsigned int*)(0x944101C48UL))
#define bM4_EXMC_ECC_SYND6_0_S23                        *((volatile unsigned int*)(0x944101C4CUL))
#define bM4_EXMC_ECC_SYND6_0_S24                        *((volatile unsigned int*)(0x944101C50UL))
#define bM4_EXMC_ECC_SYND6_0_S25                        *((volatile unsigned int*)(0x944101C54UL))
#define bM4_EXMC_ECC_SYND6_0_S26                        *((volatile unsigned int*)(0x944101C58UL))
#define bM4_EXMC_ECC_SYND6_0_S27                        *((volatile unsigned int*)(0x944101C5CUL))
#define bM4_EXMC_ECC_SYND6_0_S28                        *((volatile unsigned int*)(0x944101C60UL))
#define bM4_EXMC_ECC_SYND6_0_S29                        *((volatile unsigned int*)(0x944101C64UL))
#define bM4_EXMC_ECC_SYND6_0_S210                       *((volatile unsigned int*)(0x944101C68UL))
#define bM4_EXMC_ECC_SYND6_0_S211                       *((volatile unsigned int*)(0x944101C6CUL))
#define bM4_EXMC_ECC_SYND6_0_S212                       *((volatile unsigned int*)(0x944101C70UL))
#define bM4_EXMC_ECC_SYND6_0_RESV                       *((volatile unsigned int*)(0x944101C7CUL))
#define bM4_EXMC_ECC_SYND6_1_S30                        *((volatile unsigned int*)(0x944101C80UL))
#define bM4_EXMC_ECC_SYND6_1_S31                        *((volatile unsigned int*)(0x944101C84UL))
#define bM4_EXMC_ECC_SYND6_1_S32                        *((volatile unsigned int*)(0x944101C88UL))
#define bM4_EXMC_ECC_SYND6_1_S33                        *((volatile unsigned int*)(0x944101C8CUL))
#define bM4_EXMC_ECC_SYND6_1_S34                        *((volatile unsigned int*)(0x944101C90UL))
#define bM4_EXMC_ECC_SYND6_1_S35                        *((volatile unsigned int*)(0x944101C94UL))
#define bM4_EXMC_ECC_SYND6_1_S36                        *((volatile unsigned int*)(0x944101C98UL))
#define bM4_EXMC_ECC_SYND6_1_S37                        *((volatile unsigned int*)(0x944101C9CUL))
#define bM4_EXMC_ECC_SYND6_1_S38                        *((volatile unsigned int*)(0x944101CA0UL))
#define bM4_EXMC_ECC_SYND6_1_S39                        *((volatile unsigned int*)(0x944101CA4UL))
#define bM4_EXMC_ECC_SYND6_1_S310                       *((volatile unsigned int*)(0x944101CA8UL))
#define bM4_EXMC_ECC_SYND6_1_S311                       *((volatile unsigned int*)(0x944101CACUL))
#define bM4_EXMC_ECC_SYND6_1_S312                       *((volatile unsigned int*)(0x944101CB0UL))
#define bM4_EXMC_ECC_SYND6_1_S40                        *((volatile unsigned int*)(0x944101CC0UL))
#define bM4_EXMC_ECC_SYND6_1_S41                        *((volatile unsigned int*)(0x944101CC4UL))
#define bM4_EXMC_ECC_SYND6_1_S42                        *((volatile unsigned int*)(0x944101CC8UL))
#define bM4_EXMC_ECC_SYND6_1_S43                        *((volatile unsigned int*)(0x944101CCCUL))
#define bM4_EXMC_ECC_SYND6_1_S44                        *((volatile unsigned int*)(0x944101CD0UL))
#define bM4_EXMC_ECC_SYND6_1_S45                        *((volatile unsigned int*)(0x944101CD4UL))
#define bM4_EXMC_ECC_SYND6_1_S46                        *((volatile unsigned int*)(0x944101CD8UL))
#define bM4_EXMC_ECC_SYND6_1_S47                        *((volatile unsigned int*)(0x944101CDCUL))
#define bM4_EXMC_ECC_SYND6_1_S48                        *((volatile unsigned int*)(0x944101CE0UL))
#define bM4_EXMC_ECC_SYND6_1_S49                        *((volatile unsigned int*)(0x944101CE4UL))
#define bM4_EXMC_ECC_SYND6_1_S410                       *((volatile unsigned int*)(0x944101CE8UL))
#define bM4_EXMC_ECC_SYND6_1_S411                       *((volatile unsigned int*)(0x944101CECUL))
#define bM4_EXMC_ECC_SYND6_1_S412                       *((volatile unsigned int*)(0x944101CF0UL))
#define bM4_EXMC_ECC_SYND6_1_RESV                       *((volatile unsigned int*)(0x944101CFCUL))
#define bM4_EXMC_ECC_SYND6_2_S50                        *((volatile unsigned int*)(0x944101D00UL))
#define bM4_EXMC_ECC_SYND6_2_S51                        *((volatile unsigned int*)(0x944101D04UL))
#define bM4_EXMC_ECC_SYND6_2_S52                        *((volatile unsigned int*)(0x944101D08UL))
#define bM4_EXMC_ECC_SYND6_2_S53                        *((volatile unsigned int*)(0x944101D0CUL))
#define bM4_EXMC_ECC_SYND6_2_S54                        *((volatile unsigned int*)(0x944101D10UL))
#define bM4_EXMC_ECC_SYND6_2_S55                        *((volatile unsigned int*)(0x944101D14UL))
#define bM4_EXMC_ECC_SYND6_2_S56                        *((volatile unsigned int*)(0x944101D18UL))
#define bM4_EXMC_ECC_SYND6_2_S57                        *((volatile unsigned int*)(0x944101D1CUL))
#define bM4_EXMC_ECC_SYND6_2_S58                        *((volatile unsigned int*)(0x944101D20UL))
#define bM4_EXMC_ECC_SYND6_2_S59                        *((volatile unsigned int*)(0x944101D24UL))
#define bM4_EXMC_ECC_SYND6_2_S510                       *((volatile unsigned int*)(0x944101D28UL))
#define bM4_EXMC_ECC_SYND6_2_S511                       *((volatile unsigned int*)(0x944101D2CUL))
#define bM4_EXMC_ECC_SYND6_2_S512                       *((volatile unsigned int*)(0x944101D30UL))
#define bM4_EXMC_ECC_SYND6_2_S60                        *((volatile unsigned int*)(0x944101D40UL))
#define bM4_EXMC_ECC_SYND6_2_S61                        *((volatile unsigned int*)(0x944101D44UL))
#define bM4_EXMC_ECC_SYND6_2_S62                        *((volatile unsigned int*)(0x944101D48UL))
#define bM4_EXMC_ECC_SYND6_2_S63                        *((volatile unsigned int*)(0x944101D4CUL))
#define bM4_EXMC_ECC_SYND6_2_S64                        *((volatile unsigned int*)(0x944101D50UL))
#define bM4_EXMC_ECC_SYND6_2_S65                        *((volatile unsigned int*)(0x944101D54UL))
#define bM4_EXMC_ECC_SYND6_2_S66                        *((volatile unsigned int*)(0x944101D58UL))
#define bM4_EXMC_ECC_SYND6_2_S67                        *((volatile unsigned int*)(0x944101D5CUL))
#define bM4_EXMC_ECC_SYND6_2_S68                        *((volatile unsigned int*)(0x944101D60UL))
#define bM4_EXMC_ECC_SYND6_2_S69                        *((volatile unsigned int*)(0x944101D64UL))
#define bM4_EXMC_ECC_SYND6_2_S610                       *((volatile unsigned int*)(0x944101D68UL))
#define bM4_EXMC_ECC_SYND6_2_S611                       *((volatile unsigned int*)(0x944101D6CUL))
#define bM4_EXMC_ECC_SYND6_2_S612                       *((volatile unsigned int*)(0x944101D70UL))
#define bM4_EXMC_ECC_SYND6_2_RESV                       *((volatile unsigned int*)(0x944101D7CUL))
#define bM4_EXMC_ECC_SYND6_3_S70                        *((volatile unsigned int*)(0x944101D80UL))
#define bM4_EXMC_ECC_SYND6_3_S71                        *((volatile unsigned int*)(0x944101D84UL))
#define bM4_EXMC_ECC_SYND6_3_S72                        *((volatile unsigned int*)(0x944101D88UL))
#define bM4_EXMC_ECC_SYND6_3_S73                        *((volatile unsigned int*)(0x944101D8CUL))
#define bM4_EXMC_ECC_SYND6_3_S74                        *((volatile unsigned int*)(0x944101D90UL))
#define bM4_EXMC_ECC_SYND6_3_S75                        *((volatile unsigned int*)(0x944101D94UL))
#define bM4_EXMC_ECC_SYND6_3_S76                        *((volatile unsigned int*)(0x944101D98UL))
#define bM4_EXMC_ECC_SYND6_3_S77                        *((volatile unsigned int*)(0x944101D9CUL))
#define bM4_EXMC_ECC_SYND6_3_S78                        *((volatile unsigned int*)(0x944101DA0UL))
#define bM4_EXMC_ECC_SYND6_3_S79                        *((volatile unsigned int*)(0x944101DA4UL))
#define bM4_EXMC_ECC_SYND6_3_S710                       *((volatile unsigned int*)(0x944101DA8UL))
#define bM4_EXMC_ECC_SYND6_3_S711                       *((volatile unsigned int*)(0x944101DACUL))
#define bM4_EXMC_ECC_SYND6_3_S712                       *((volatile unsigned int*)(0x944101DB0UL))
#define bM4_EXMC_ECC_SYND6_3_S80                        *((volatile unsigned int*)(0x944101DC0UL))
#define bM4_EXMC_ECC_SYND6_3_S81                        *((volatile unsigned int*)(0x944101DC4UL))
#define bM4_EXMC_ECC_SYND6_3_S82                        *((volatile unsigned int*)(0x944101DC8UL))
#define bM4_EXMC_ECC_SYND6_3_S83                        *((volatile unsigned int*)(0x944101DCCUL))
#define bM4_EXMC_ECC_SYND6_3_S84                        *((volatile unsigned int*)(0x944101DD0UL))
#define bM4_EXMC_ECC_SYND6_3_S85                        *((volatile unsigned int*)(0x944101DD4UL))
#define bM4_EXMC_ECC_SYND6_3_S86                        *((volatile unsigned int*)(0x944101DD8UL))
#define bM4_EXMC_ECC_SYND6_3_S87                        *((volatile unsigned int*)(0x944101DDCUL))
#define bM4_EXMC_ECC_SYND6_3_S88                        *((volatile unsigned int*)(0x944101DE0UL))
#define bM4_EXMC_ECC_SYND6_3_S89                        *((volatile unsigned int*)(0x944101DE4UL))
#define bM4_EXMC_ECC_SYND6_3_S810                       *((volatile unsigned int*)(0x944101DE8UL))
#define bM4_EXMC_ECC_SYND6_3_S811                       *((volatile unsigned int*)(0x944101DECUL))
#define bM4_EXMC_ECC_SYND6_3_S812                       *((volatile unsigned int*)(0x944101DF0UL))
#define bM4_EXMC_ECC_SYND6_3_RESV                       *((volatile unsigned int*)(0x944101DFCUL))
#define bM4_EXMC_ECC_SYND7_0_S10                        *((volatile unsigned int*)(0x944101E00UL))
#define bM4_EXMC_ECC_SYND7_0_S11                        *((volatile unsigned int*)(0x944101E04UL))
#define bM4_EXMC_ECC_SYND7_0_S12                        *((volatile unsigned int*)(0x944101E08UL))
#define bM4_EXMC_ECC_SYND7_0_S13                        *((volatile unsigned int*)(0x944101E0CUL))
#define bM4_EXMC_ECC_SYND7_0_S14                        *((volatile unsigned int*)(0x944101E10UL))
#define bM4_EXMC_ECC_SYND7_0_S15                        *((volatile unsigned int*)(0x944101E14UL))
#define bM4_EXMC_ECC_SYND7_0_S16                        *((volatile unsigned int*)(0x944101E18UL))
#define bM4_EXMC_ECC_SYND7_0_S17                        *((volatile unsigned int*)(0x944101E1CUL))
#define bM4_EXMC_ECC_SYND7_0_S18                        *((volatile unsigned int*)(0x944101E20UL))
#define bM4_EXMC_ECC_SYND7_0_S19                        *((volatile unsigned int*)(0x944101E24UL))
#define bM4_EXMC_ECC_SYND7_0_S110                       *((volatile unsigned int*)(0x944101E28UL))
#define bM4_EXMC_ECC_SYND7_0_S111                       *((volatile unsigned int*)(0x944101E2CUL))
#define bM4_EXMC_ECC_SYND7_0_S112                       *((volatile unsigned int*)(0x944101E30UL))
#define bM4_EXMC_ECC_SYND7_0_S20                        *((volatile unsigned int*)(0x944101E40UL))
#define bM4_EXMC_ECC_SYND7_0_S21                        *((volatile unsigned int*)(0x944101E44UL))
#define bM4_EXMC_ECC_SYND7_0_S22                        *((volatile unsigned int*)(0x944101E48UL))
#define bM4_EXMC_ECC_SYND7_0_S23                        *((volatile unsigned int*)(0x944101E4CUL))
#define bM4_EXMC_ECC_SYND7_0_S24                        *((volatile unsigned int*)(0x944101E50UL))
#define bM4_EXMC_ECC_SYND7_0_S25                        *((volatile unsigned int*)(0x944101E54UL))
#define bM4_EXMC_ECC_SYND7_0_S26                        *((volatile unsigned int*)(0x944101E58UL))
#define bM4_EXMC_ECC_SYND7_0_S27                        *((volatile unsigned int*)(0x944101E5CUL))
#define bM4_EXMC_ECC_SYND7_0_S28                        *((volatile unsigned int*)(0x944101E60UL))
#define bM4_EXMC_ECC_SYND7_0_S29                        *((volatile unsigned int*)(0x944101E64UL))
#define bM4_EXMC_ECC_SYND7_0_S210                       *((volatile unsigned int*)(0x944101E68UL))
#define bM4_EXMC_ECC_SYND7_0_S211                       *((volatile unsigned int*)(0x944101E6CUL))
#define bM4_EXMC_ECC_SYND7_0_S212                       *((volatile unsigned int*)(0x944101E70UL))
#define bM4_EXMC_ECC_SYND7_0_RESV                       *((volatile unsigned int*)(0x944101E7CUL))
#define bM4_EXMC_ECC_SYND7_1_S30                        *((volatile unsigned int*)(0x944101E80UL))
#define bM4_EXMC_ECC_SYND7_1_S31                        *((volatile unsigned int*)(0x944101E84UL))
#define bM4_EXMC_ECC_SYND7_1_S32                        *((volatile unsigned int*)(0x944101E88UL))
#define bM4_EXMC_ECC_SYND7_1_S33                        *((volatile unsigned int*)(0x944101E8CUL))
#define bM4_EXMC_ECC_SYND7_1_S34                        *((volatile unsigned int*)(0x944101E90UL))
#define bM4_EXMC_ECC_SYND7_1_S35                        *((volatile unsigned int*)(0x944101E94UL))
#define bM4_EXMC_ECC_SYND7_1_S36                        *((volatile unsigned int*)(0x944101E98UL))
#define bM4_EXMC_ECC_SYND7_1_S37                        *((volatile unsigned int*)(0x944101E9CUL))
#define bM4_EXMC_ECC_SYND7_1_S38                        *((volatile unsigned int*)(0x944101EA0UL))
#define bM4_EXMC_ECC_SYND7_1_S39                        *((volatile unsigned int*)(0x944101EA4UL))
#define bM4_EXMC_ECC_SYND7_1_S310                       *((volatile unsigned int*)(0x944101EA8UL))
#define bM4_EXMC_ECC_SYND7_1_S311                       *((volatile unsigned int*)(0x944101EACUL))
#define bM4_EXMC_ECC_SYND7_1_S312                       *((volatile unsigned int*)(0x944101EB0UL))
#define bM4_EXMC_ECC_SYND7_1_S40                        *((volatile unsigned int*)(0x944101EC0UL))
#define bM4_EXMC_ECC_SYND7_1_S41                        *((volatile unsigned int*)(0x944101EC4UL))
#define bM4_EXMC_ECC_SYND7_1_S42                        *((volatile unsigned int*)(0x944101EC8UL))
#define bM4_EXMC_ECC_SYND7_1_S43                        *((volatile unsigned int*)(0x944101ECCUL))
#define bM4_EXMC_ECC_SYND7_1_S44                        *((volatile unsigned int*)(0x944101ED0UL))
#define bM4_EXMC_ECC_SYND7_1_S45                        *((volatile unsigned int*)(0x944101ED4UL))
#define bM4_EXMC_ECC_SYND7_1_S46                        *((volatile unsigned int*)(0x944101ED8UL))
#define bM4_EXMC_ECC_SYND7_1_S47                        *((volatile unsigned int*)(0x944101EDCUL))
#define bM4_EXMC_ECC_SYND7_1_S48                        *((volatile unsigned int*)(0x944101EE0UL))
#define bM4_EXMC_ECC_SYND7_1_S49                        *((volatile unsigned int*)(0x944101EE4UL))
#define bM4_EXMC_ECC_SYND7_1_S410                       *((volatile unsigned int*)(0x944101EE8UL))
#define bM4_EXMC_ECC_SYND7_1_S411                       *((volatile unsigned int*)(0x944101EECUL))
#define bM4_EXMC_ECC_SYND7_1_S412                       *((volatile unsigned int*)(0x944101EF0UL))
#define bM4_EXMC_ECC_SYND7_1_RESV                       *((volatile unsigned int*)(0x944101EFCUL))
#define bM4_EXMC_ECC_SYND7_2_S50                        *((volatile unsigned int*)(0x944101F00UL))
#define bM4_EXMC_ECC_SYND7_2_S51                        *((volatile unsigned int*)(0x944101F04UL))
#define bM4_EXMC_ECC_SYND7_2_S52                        *((volatile unsigned int*)(0x944101F08UL))
#define bM4_EXMC_ECC_SYND7_2_S53                        *((volatile unsigned int*)(0x944101F0CUL))
#define bM4_EXMC_ECC_SYND7_2_S54                        *((volatile unsigned int*)(0x944101F10UL))
#define bM4_EXMC_ECC_SYND7_2_S55                        *((volatile unsigned int*)(0x944101F14UL))
#define bM4_EXMC_ECC_SYND7_2_S56                        *((volatile unsigned int*)(0x944101F18UL))
