RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EXMC_ECC_SYND7_2_S57                        *((volatile unsigned int*)(0x944101F1CUL))
#define bM4_EXMC_ECC_SYND7_2_S58                        *((volatile unsigned int*)(0x944101F20UL))
#define bM4_EXMC_ECC_SYND7_2_S59                        *((volatile unsigned int*)(0x944101F24UL))
#define bM4_EXMC_ECC_SYND7_2_S510                       *((volatile unsigned int*)(0x944101F28UL))
#define bM4_EXMC_ECC_SYND7_2_S511                       *((volatile unsigned int*)(0x944101F2CUL))
#define bM4_EXMC_ECC_SYND7_2_S512                       *((volatile unsigned int*)(0x944101F30UL))
#define bM4_EXMC_ECC_SYND7_2_S60                        *((volatile unsigned int*)(0x944101F40UL))
#define bM4_EXMC_ECC_SYND7_2_S61                        *((volatile unsigned int*)(0x944101F44UL))
#define bM4_EXMC_ECC_SYND7_2_S62                        *((volatile unsigned int*)(0x944101F48UL))
#define bM4_EXMC_ECC_SYND7_2_S63                        *((volatile unsigned int*)(0x944101F4CUL))
#define bM4_EXMC_ECC_SYND7_2_S64                        *((volatile unsigned int*)(0x944101F50UL))
#define bM4_EXMC_ECC_SYND7_2_S65                        *((volatile unsigned int*)(0x944101F54UL))
#define bM4_EXMC_ECC_SYND7_2_S66                        *((volatile unsigned int*)(0x944101F58UL))
#define bM4_EXMC_ECC_SYND7_2_S67                        *((volatile unsigned int*)(0x944101F5CUL))
#define bM4_EXMC_ECC_SYND7_2_S68                        *((volatile unsigned int*)(0x944101F60UL))
#define bM4_EXMC_ECC_SYND7_2_S69                        *((volatile unsigned int*)(0x944101F64UL))
#define bM4_EXMC_ECC_SYND7_2_S610                       *((volatile unsigned int*)(0x944101F68UL))
#define bM4_EXMC_ECC_SYND7_2_S611                       *((volatile unsigned int*)(0x944101F6CUL))
#define bM4_EXMC_ECC_SYND7_2_S612                       *((volatile unsigned int*)(0x944101F70UL))
#define bM4_EXMC_ECC_SYND7_2_RESV                       *((volatile unsigned int*)(0x944101F7CUL))
#define bM4_EXMC_ECC_SYND7_3_S70                        *((volatile unsigned int*)(0x944101F80UL))
#define bM4_EXMC_ECC_SYND7_3_S71                        *((volatile unsigned int*)(0x944101F84UL))
#define bM4_EXMC_ECC_SYND7_3_S72                        *((volatile unsigned int*)(0x944101F88UL))
#define bM4_EXMC_ECC_SYND7_3_S73                        *((volatile unsigned int*)(0x944101F8CUL))
#define bM4_EXMC_ECC_SYND7_3_S74                        *((volatile unsigned int*)(0x944101F90UL))
#define bM4_EXMC_ECC_SYND7_3_S75                        *((volatile unsigned int*)(0x944101F94UL))
#define bM4_EXMC_ECC_SYND7_3_S76                        *((volatile unsigned int*)(0x944101F98UL))
#define bM4_EXMC_ECC_SYND7_3_S77                        *((volatile unsigned int*)(0x944101F9CUL))
#define bM4_EXMC_ECC_SYND7_3_S78                        *((volatile unsigned int*)(0x944101FA0UL))
#define bM4_EXMC_ECC_SYND7_3_S79                        *((volatile unsigned int*)(0x944101FA4UL))
#define bM4_EXMC_ECC_SYND7_3_S710                       *((volatile unsigned int*)(0x944101FA8UL))
#define bM4_EXMC_ECC_SYND7_3_S711                       *((volatile unsigned int*)(0x944101FACUL))
#define bM4_EXMC_ECC_SYND7_3_S712                       *((volatile unsigned int*)(0x944101FB0UL))
#define bM4_EXMC_ECC_SYND7_3_S80                        *((volatile unsigned int*)(0x944101FC0UL))
#define bM4_EXMC_ECC_SYND7_3_S81                        *((volatile unsigned int*)(0x944101FC4UL))
#define bM4_EXMC_ECC_SYND7_3_S82                        *((volatile unsigned int*)(0x944101FC8UL))
#define bM4_EXMC_ECC_SYND7_3_S83                        *((volatile unsigned int*)(0x944101FCCUL))
#define bM4_EXMC_ECC_SYND7_3_S84                        *((volatile unsigned int*)(0x944101FD0UL))
#define bM4_EXMC_ECC_SYND7_3_S85                        *((volatile unsigned int*)(0x944101FD4UL))
#define bM4_EXMC_ECC_SYND7_3_S86                        *((volatile unsigned int*)(0x944101FD8UL))
#define bM4_EXMC_ECC_SYND7_3_S87                        *((volatile unsigned int*)(0x944101FDCUL))
#define bM4_EXMC_ECC_SYND7_3_S88                        *((volatile unsigned int*)(0x944101FE0UL))
#define bM4_EXMC_ECC_SYND7_3_S89                        *((volatile unsigned int*)(0x944101FE4UL))
#define bM4_EXMC_ECC_SYND7_3_S810                       *((volatile unsigned int*)(0x944101FE8UL))
#define bM4_EXMC_ECC_SYND7_3_S811                       *((volatile unsigned int*)(0x944101FECUL))
#define bM4_EXMC_ECC_SYND7_3_S812                       *((volatile unsigned int*)(0x944101FF0UL))
#define bM4_EXMC_ECC_SYND7_3_RESV                       *((volatile unsigned int*)(0x944101FFCUL))
#define bM4_EXMC_ECC_SYND8_0_S10                        *((volatile unsigned int*)(0x944102000UL))
#define bM4_EXMC_ECC_SYND8_0_S11                        *((volatile unsigned int*)(0x944102004UL))
#define bM4_EXMC_ECC_SYND8_0_S12                        *((volatile unsigned int*)(0x944102008UL))
#define bM4_EXMC_ECC_SYND8_0_S13                        *((volatile unsigned int*)(0x94410200CUL))
#define bM4_EXMC_ECC_SYND8_0_S14                        *((volatile unsigned int*)(0x944102010UL))
#define bM4_EXMC_ECC_SYND8_0_S15                        *((volatile unsigned int*)(0x944102014UL))
#define bM4_EXMC_ECC_SYND8_0_S16                        *((volatile unsigned int*)(0x944102018UL))
#define bM4_EXMC_ECC_SYND8_0_S17                        *((volatile unsigned int*)(0x94410201CUL))
#define bM4_EXMC_ECC_SYND8_0_S18                        *((volatile unsigned int*)(0x944102020UL))
#define bM4_EXMC_ECC_SYND8_0_S19                        *((volatile unsigned int*)(0x944102024UL))
#define bM4_EXMC_ECC_SYND8_0_S110                       *((volatile unsigned int*)(0x944102028UL))
#define bM4_EXMC_ECC_SYND8_0_S111                       *((volatile unsigned int*)(0x94410202CUL))
#define bM4_EXMC_ECC_SYND8_0_S112                       *((volatile unsigned int*)(0x944102030UL))
#define bM4_EXMC_ECC_SYND8_0_S20                        *((volatile unsigned int*)(0x944102040UL))
#define bM4_EXMC_ECC_SYND8_0_S21                        *((volatile unsigned int*)(0x944102044UL))
#define bM4_EXMC_ECC_SYND8_0_S22                        *((volatile unsigned int*)(0x944102048UL))
#define bM4_EXMC_ECC_SYND8_0_S23                        *((volatile unsigned int*)(0x94410204CUL))
#define bM4_EXMC_ECC_SYND8_0_S24                        *((volatile unsigned int*)(0x944102050UL))
#define bM4_EXMC_ECC_SYND8_0_S25                        *((volatile unsigned int*)(0x944102054UL))
#define bM4_EXMC_ECC_SYND8_0_S26                        *((volatile unsigned int*)(0x944102058UL))
#define bM4_EXMC_ECC_SYND8_0_S27                        *((volatile unsigned int*)(0x94410205CUL))
#define bM4_EXMC_ECC_SYND8_0_S28                        *((volatile unsigned int*)(0x944102060UL))
#define bM4_EXMC_ECC_SYND8_0_S29                        *((volatile unsigned int*)(0x944102064UL))
#define bM4_EXMC_ECC_SYND8_0_S210                       *((volatile unsigned int*)(0x944102068UL))
#define bM4_EXMC_ECC_SYND8_0_S211                       *((volatile unsigned int*)(0x94410206CUL))
#define bM4_EXMC_ECC_SYND8_0_S212                       *((volatile unsigned int*)(0x944102070UL))
#define bM4_EXMC_ECC_SYND8_0_RESV                       *((volatile unsigned int*)(0x94410207CUL))
#define bM4_EXMC_ECC_SYND8_1_S30                        *((volatile unsigned int*)(0x944102080UL))
#define bM4_EXMC_ECC_SYND8_1_S31                        *((volatile unsigned int*)(0x944102084UL))
#define bM4_EXMC_ECC_SYND8_1_S32                        *((volatile unsigned int*)(0x944102088UL))
#define bM4_EXMC_ECC_SYND8_1_S33                        *((volatile unsigned int*)(0x94410208CUL))
#define bM4_EXMC_ECC_SYND8_1_S34                        *((volatile unsigned int*)(0x944102090UL))
#define bM4_EXMC_ECC_SYND8_1_S35                        *((volatile unsigned int*)(0x944102094UL))
#define bM4_EXMC_ECC_SYND8_1_S36                        *((volatile unsigned int*)(0x944102098UL))
#define bM4_EXMC_ECC_SYND8_1_S37                        *((volatile unsigned int*)(0x94410209CUL))
#define bM4_EXMC_ECC_SYND8_1_S38                        *((volatile unsigned int*)(0x9441020A0UL))
#define bM4_EXMC_ECC_SYND8_1_S39                        *((volatile unsigned int*)(0x9441020A4UL))
#define bM4_EXMC_ECC_SYND8_1_S310                       *((volatile unsigned int*)(0x9441020A8UL))
#define bM4_EXMC_ECC_SYND8_1_S311                       *((volatile unsigned int*)(0x9441020ACUL))
#define bM4_EXMC_ECC_SYND8_1_S312                       *((volatile unsigned int*)(0x9441020B0UL))
#define bM4_EXMC_ECC_SYND8_1_S40                        *((volatile unsigned int*)(0x9441020C0UL))
#define bM4_EXMC_ECC_SYND8_1_S41                        *((volatile unsigned int*)(0x9441020C4UL))
#define bM4_EXMC_ECC_SYND8_1_S42                        *((volatile unsigned int*)(0x9441020C8UL))
#define bM4_EXMC_ECC_SYND8_1_S43                        *((volatile unsigned int*)(0x9441020CCUL))
#define bM4_EXMC_ECC_SYND8_1_S44                        *((volatile unsigned int*)(0x9441020D0UL))
#define bM4_EXMC_ECC_SYND8_1_S45                        *((volatile unsigned int*)(0x9441020D4UL))
#define bM4_EXMC_ECC_SYND8_1_S46                        *((volatile unsigned int*)(0x9441020D8UL))
#define bM4_EXMC_ECC_SYND8_1_S47                        *((volatile unsigned int*)(0x9441020DCUL))
#define bM4_EXMC_ECC_SYND8_1_S48                        *((volatile unsigned int*)(0x9441020E0UL))
#define bM4_EXMC_ECC_SYND8_1_S49                        *((volatile unsigned int*)(0x9441020E4UL))
#define bM4_EXMC_ECC_SYND8_1_S410                       *((volatile unsigned int*)(0x9441020E8UL))
#define bM4_EXMC_ECC_SYND8_1_S411                       *((volatile unsigned int*)(0x9441020ECUL))
#define bM4_EXMC_ECC_SYND8_1_S412                       *((volatile unsigned int*)(0x9441020F0UL))
#define bM4_EXMC_ECC_SYND8_1_RESV                       *((volatile unsigned int*)(0x9441020FCUL))
#define bM4_EXMC_ECC_SYND8_2_S50                        *((volatile unsigned int*)(0x944102100UL))
#define bM4_EXMC_ECC_SYND8_2_S51                        *((volatile unsigned int*)(0x944102104UL))
#define bM4_EXMC_ECC_SYND8_2_S52                        *((volatile unsigned int*)(0x944102108UL))
#define bM4_EXMC_ECC_SYND8_2_S53                        *((volatile unsigned int*)(0x94410210CUL))
#define bM4_EXMC_ECC_SYND8_2_S54                        *((volatile unsigned int*)(0x944102110UL))
#define bM4_EXMC_ECC_SYND8_2_S55                        *((volatile unsigned int*)(0x944102114UL))
#define bM4_EXMC_ECC_SYND8_2_S56                        *((volatile unsigned int*)(0x944102118UL))
#define bM4_EXMC_ECC_SYND8_2_S57                        *((volatile unsigned int*)(0x94410211CUL))
#define bM4_EXMC_ECC_SYND8_2_S58                        *((volatile unsigned int*)(0x944102120UL))
#define bM4_EXMC_ECC_SYND8_2_S59                        *((volatile unsigned int*)(0x944102124UL))
#define bM4_EXMC_ECC_SYND8_2_S510                       *((volatile unsigned int*)(0x944102128UL))
#define bM4_EXMC_ECC_SYND8_2_S511                       *((volatile unsigned int*)(0x94410212CUL))
#define bM4_EXMC_ECC_SYND8_2_S512                       *((volatile unsigned int*)(0x944102130UL))
#define bM4_EXMC_ECC_SYND8_2_S60                        *((volatile unsigned int*)(0x944102140UL))
#define bM4_EXMC_ECC_SYND8_2_S61                        *((volatile unsigned int*)(0x944102144UL))
#define bM4_EXMC_ECC_SYND8_2_S62                        *((volatile unsigned int*)(0x944102148UL))
#define bM4_EXMC_ECC_SYND8_2_S63                        *((volatile unsigned int*)(0x94410214CUL))
#define bM4_EXMC_ECC_SYND8_2_S64                        *((volatile unsigned int*)(0x944102150UL))
#define bM4_EXMC_ECC_SYND8_2_S65                        *((volatile unsigned int*)(0x944102154UL))
#define bM4_EXMC_ECC_SYND8_2_S66                        *((volatile unsigned int*)(0x944102158UL))
#define bM4_EXMC_ECC_SYND8_2_S67                        *((volatile unsigned int*)(0x94410215CUL))
#define bM4_EXMC_ECC_SYND8_2_S68                        *((volatile unsigned int*)(0x944102160UL))
#define bM4_EXMC_ECC_SYND8_2_S69                        *((volatile unsigned int*)(0x944102164UL))
#define bM4_EXMC_ECC_SYND8_2_S610                       *((volatile unsigned int*)(0x944102168UL))
#define bM4_EXMC_ECC_SYND8_2_S611                       *((volatile unsigned int*)(0x94410216CUL))
#define bM4_EXMC_ECC_SYND8_2_S612                       *((volatile unsigned int*)(0x944102170UL))
#define bM4_EXMC_ECC_SYND8_2_RESV                       *((volatile unsigned int*)(0x94410217CUL))
#define bM4_EXMC_ECC_SYND8_3_S70                        *((volatile unsigned int*)(0x944102180UL))
#define bM4_EXMC_ECC_SYND8_3_S71                        *((volatile unsigned int*)(0x944102184UL))
#define bM4_EXMC_ECC_SYND8_3_S72                        *((volatile unsigned int*)(0x944102188UL))
#define bM4_EXMC_ECC_SYND8_3_S73                        *((volatile unsigned int*)(0x94410218CUL))
#define bM4_EXMC_ECC_SYND8_3_S74                        *((volatile unsigned int*)(0x944102190UL))
#define bM4_EXMC_ECC_SYND8_3_S75                        *((volatile unsigned int*)(0x944102194UL))
#define bM4_EXMC_ECC_SYND8_3_S76                        *((volatile unsigned int*)(0x944102198UL))
#define bM4_EXMC_ECC_SYND8_3_S77                        *((volatile unsigned int*)(0x94410219CUL))
#define bM4_EXMC_ECC_SYND8_3_S78                        *((volatile unsigned int*)(0x9441021A0UL))
#define bM4_EXMC_ECC_SYND8_3_S79                        *((volatile unsigned int*)(0x9441021A4UL))
#define bM4_EXMC_ECC_SYND8_3_S710                       *((volatile unsigned int*)(0x9441021A8UL))
#define bM4_EXMC_ECC_SYND8_3_S711                       *((volatile unsigned int*)(0x9441021ACUL))
#define bM4_EXMC_ECC_SYND8_3_S712                       *((volatile unsigned int*)(0x9441021B0UL))
#define bM4_EXMC_ECC_SYND8_3_S80                        *((volatile unsigned int*)(0x9441021C0UL))
#define bM4_EXMC_ECC_SYND8_3_S81                        *((volatile unsigned int*)(0x9441021C4UL))
#define bM4_EXMC_ECC_SYND8_3_S82                        *((volatile unsigned int*)(0x9441021C8UL))
#define bM4_EXMC_ECC_SYND8_3_S83                        *((volatile unsigned int*)(0x9441021CCUL))
#define bM4_EXMC_ECC_SYND8_3_S84                        *((volatile unsigned int*)(0x9441021D0UL))
#define bM4_EXMC_ECC_SYND8_3_S85                        *((volatile unsigned int*)(0x9441021D4UL))
#define bM4_EXMC_ECC_SYND8_3_S86                        *((volatile unsigned int*)(0x9441021D8UL))
#define bM4_EXMC_ECC_SYND8_3_S87                        *((volatile unsigned int*)(0x9441021DCUL))
#define bM4_EXMC_ECC_SYND8_3_S88                        *((volatile unsigned int*)(0x9441021E0UL))
#define bM4_EXMC_ECC_SYND8_3_S89                        *((volatile unsigned int*)(0x9441021E4UL))
#define bM4_EXMC_ECC_SYND8_3_S810                       *((volatile unsigned int*)(0x9441021E8UL))
#define bM4_EXMC_ECC_SYND8_3_S811                       *((volatile unsigned int*)(0x9441021ECUL))
#define bM4_EXMC_ECC_SYND8_3_S812                       *((volatile unsigned int*)(0x9441021F0UL))
#define bM4_EXMC_ECC_SYND8_3_RESV                       *((volatile unsigned int*)(0x9441021FCUL))
#define bM4_EXMC_ECC_SYND9_0_S10                        *((volatile unsigned int*)(0x944102200UL))
#define bM4_EXMC_ECC_SYND9_0_S11                        *((volatile unsigned int*)(0x944102204UL))
#define bM4_EXMC_ECC_SYND9_0_S12                        *((volatile unsigned int*)(0x944102208UL))
#define bM4_EXMC_ECC_SYND9_0_S13                        *((volatile unsigned int*)(0x94410220CUL))
#define bM4_EXMC_ECC_SYND9_0_S14                        *((volatile unsigned int*)(0x944102210UL))
#define bM4_EXMC_ECC_SYND9_0_S15                        *((volatile unsigned int*)(0x944102214UL))
#define bM4_EXMC_ECC_SYND9_0_S16                        *((volatile unsigned int*)(0x944102218UL))
#define bM4_EXMC_ECC_SYND9_0_S17                        *((volatile unsigned int*)(0x94410221CUL))
#define bM4_EXMC_ECC_SYND9_0_S18                        *((volatile unsigned int*)(0x944102220UL))
#define bM4_EXMC_ECC_SYND9_0_S19                        *((volatile unsigned int*)(0x944102224UL))
#define bM4_EXMC_ECC_SYND9_0_S110                       *((volatile unsigned int*)(0x944102228UL))
#define bM4_EXMC_ECC_SYND9_0_S111                       *((volatile unsigned int*)(0x94410222CUL))
#define bM4_EXMC_ECC_SYND9_0_S112                       *((volatile unsigned int*)(0x944102230UL))
#define bM4_EXMC_ECC_SYND9_0_S20                        *((volatile unsigned int*)(0x944102240UL))
#define bM4_EXMC_ECC_SYND9_0_S21                        *((volatile unsigned int*)(0x944102244UL))
#define bM4_EXMC_ECC_SYND9_0_S22                        *((volatile unsigned int*)(0x944102248UL))
#define bM4_EXMC_ECC_SYND9_0_S23                        *((volatile unsigned int*)(0x94410224CUL))
#define bM4_EXMC_ECC_SYND9_0_S24                        *((volatile unsigned int*)(0x944102250UL))
#define bM4_EXMC_ECC_SYND9_0_S25                        *((volatile unsigned int*)(0x944102254UL))
#define bM4_EXMC_ECC_SYND9_0_S26                        *((volatile unsigned int*)(0x944102258UL))
#define bM4_EXMC_ECC_SYND9_0_S27                        *((volatile unsigned int*)(0x94410225CUL))
#define bM4_EXMC_ECC_SYND9_0_S28                        *((volatile unsigned int*)(0x944102260UL))
#define bM4_EXMC_ECC_SYND9_0_S29                        *((volatile unsigned int*)(0x944102264UL))
#define bM4_EXMC_ECC_SYND9_0_S210                       *((volatile unsigned int*)(0x944102268UL))
#define bM4_EXMC_ECC_SYND9_0_S211                       *((volatile unsigned int*)(0x94410226CUL))
#define bM4_EXMC_ECC_SYND9_0_S212                       *((volatile unsigned int*)(0x944102270UL))
#define bM4_EXMC_ECC_SYND9_0_RESV                       *((volatile unsigned int*)(0x94410227CUL))
#define bM4_EXMC_ECC_SYND9_1_S30                        *((volatile unsigned int*)(0x944102280UL))
#define bM4_EXMC_ECC_SYND9_1_S31                        *((volatile unsigned int*)(0x944102284UL))
#define bM4_EXMC_ECC_SYND9_1_S32                        *((volatile unsigned int*)(0x944102288UL))
#define bM4_EXMC_ECC_SYND9_1_S33                        *((volatile unsigned int*)(0x94410228CUL))
#define bM4_EXMC_ECC_SYND9_1_S34                        *((volatile unsigned int*)(0x944102290UL))
#define bM4_EXMC_ECC_SYND9_1_S35                        *((volatile unsigned int*)(0x944102294UL))
#define bM4_EXMC_ECC_SYND9_1_S36                        *((volatile unsigned int*)(0x944102298UL))
#define bM4_EXMC_ECC_SYND9_1_S37                        *((volatile unsigned int*)(0x94410229CUL))
#define bM4_EXMC_ECC_SYND9_1_S38                        *((volatile unsigned int*)(0x9441022A0UL))
#define bM4_EXMC_ECC_SYND9_1_S39                        *((volatile unsigned int*)(0x9441022A4UL))
#define bM4_EXMC_ECC_SYND9_1_S310                       *((volatile unsigned int*)(0x9441022A8UL))
#define bM4_EXMC_ECC_SYND9_1_S311                       *((volatile unsigned int*)(0x9441022ACUL))
#define bM4_EXMC_ECC_SYND9_1_S312                       *((volatile unsigned int*)(0x9441022B0UL))
#define bM4_EXMC_ECC_SYND9_1_S40                        *((volatile unsigned int*)(0x9441022C0UL))
#define bM4_EXMC_ECC_SYND9_1_S41                        *((volatile unsigned int*)(0x9441022C4UL))
#define bM4_EXMC_ECC_SYND9_1_S42                        *((volatile unsigned int*)(0x9441022C8UL))
#define bM4_EXMC_ECC_SYND9_1_S43                        *((volatile unsigned int*)(0x9441022CCUL))
#define bM4_EXMC_ECC_SYND9_1_S44                        *((volatile unsigned int*)(0x9441022D0UL))
#define bM4_EXMC_ECC_SYND9_1_S45                        *((volatile unsigned int*)(0x9441022D4UL))
#define bM4_EXMC_ECC_SYND9_1_S46                        *((volatile unsigned int*)(0x9441022D8UL))
#define bM4_EXMC_ECC_SYND9_1_S47                        *((volatile unsigned int*)(0x9441022DCUL))
#define bM4_EXMC_ECC_SYND9_1_S48                        *((volatile unsigned int*)(0x9441022E0UL))
#define bM4_EXMC_ECC_SYND9_1_S49                        *((volatile unsigned int*)(0x9441022E4UL))
#define bM4_EXMC_ECC_SYND9_1_S410                       *((volatile unsigned int*)(0x9441022E8UL))
#define bM4_EXMC_ECC_SYND9_1_S411                       *((volatile unsigned int*)(0x9441022ECUL))
#define bM4_EXMC_ECC_SYND9_1_S412                       *((volatile unsigned int*)(0x9441022F0UL))
#define bM4_EXMC_ECC_SYND9_1_RESV                       *((volatile unsigned int*)(0x9441022FCUL))
#define bM4_EXMC_ECC_SYND9_2_S50                        *((volatile unsigned int*)(0x944102300UL))
#define bM4_EXMC_ECC_SYND9_2_S51                        *((volatile unsigned int*)(0x944102304UL))
#define bM4_EXMC_ECC_SYND9_2_S52                        *((volatile unsigned int*)(0x944102308UL))
#define bM4_EXMC_ECC_SYND9_2_S53                        *((volatile unsigned int*)(0x94410230CUL))
#define bM4_EXMC_ECC_SYND9_2_S54                        *((volatile unsigned int*)(0x944102310UL))
#define bM4_EXMC_ECC_SYND9_2_S55                        *((volatile unsigned int*)(0x944102314UL))
#define bM4_EXMC_ECC_SYND9_2_S56                        *((volatile unsigned int*)(0x944102318UL))
#define bM4_EXMC_ECC_SYND9_2_S57                        *((volatile unsigned int*)(0x94410231CUL))
#define bM4_EXMC_ECC_SYND9_2_S58                        *((volatile unsigned int*)(0x944102320UL))
#define bM4_EXMC_ECC_SYND9_2_S59                        *((volatile unsigned int*)(0x944102324UL))
#define bM4_EXMC_ECC_SYND9_2_S510                       *((volatile unsigned int*)(0x944102328UL))
#define bM4_EXMC_ECC_SYND9_2_S511                       *((volatile unsigned int*)(0x94410232CUL))
#define bM4_EXMC_ECC_SYND9_2_S512                       *((volatile unsigned int*)(0x944102330UL))
#define bM4_EXMC_ECC_SYND9_2_S60                        *((volatile unsigned int*)(0x944102340UL))
#define bM4_EXMC_ECC_SYND9_2_S61                        *((volatile unsigned int*)(0x944102344UL))
#define bM4_EXMC_ECC_SYND9_2_S62                        *((volatile unsigned int*)(0x944102348UL))
#define bM4_EXMC_ECC_SYND9_2_S63                        *((volatile unsigned int*)(0x94410234CUL))
#define bM4_EXMC_ECC_SYND9_2_S64                        *((volatile unsigned int*)(0x944102350UL))
#define bM4_EXMC_ECC_SYND9_2_S65                        *((volatile unsigned int*)(0x944102354UL))
#define bM4_EXMC_ECC_SYND9_2_S66                        *((volatile unsigned int*)(0x944102358UL))
#define bM4_EXMC_ECC_SYND9_2_S67                        *((volatile unsigned int*)(0x94410235CUL))
#define bM4_EXMC_ECC_SYND9_2_S68                        *((volatile unsigned int*)(0x944102360UL))
#define bM4_EXMC_ECC_SYND9_2_S69                        *((volatile unsigned int*)(0x944102364UL))
#define bM4_EXMC_ECC_SYND9_2_S610                       *((volatile unsigned int*)(0x944102368UL))
#define bM4_EXMC_ECC_SYND9_2_S611                       *((volatile unsigned int*)(0x94410236CUL))
#define bM4_EXMC_ECC_SYND9_2_S612                       *((volatile unsigned int*)(0x944102370UL))
#define bM4_EXMC_ECC_SYND9_2_RESV                       *((volatile unsigned int*)(0x94410237CUL))
#define bM4_EXMC_ECC_SYND9_3_S70                        *((volatile unsigned int*)(0x944102380UL))
#define bM4_EXMC_ECC_SYND9_3_S71                        *((volatile unsigned int*)(0x944102384UL))
#define bM4_EXMC_ECC_SYND9_3_S72                        *((volatile unsigned int*)(0x944102388UL))
#define bM4_EXMC_ECC_SYND9_3_S73                        *((volatile unsigned int*)(0x94410238CUL))
#define bM4_EXMC_ECC_SYND9_3_S74                        *((volatile unsigned int*)(0x944102390UL))
#define bM4_EXMC_ECC_SYND9_3_S75                        *((volatile unsigned int*)(0x944102394UL))
