RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EXMC_ECC_SYND9_3_S76                        *((volatile unsigned int*)(0x944102398UL))
#define bM4_EXMC_ECC_SYND9_3_S77                        *((volatile unsigned int*)(0x94410239CUL))
#define bM4_EXMC_ECC_SYND9_3_S78                        *((volatile unsigned int*)(0x9441023A0UL))
#define bM4_EXMC_ECC_SYND9_3_S79                        *((volatile unsigned int*)(0x9441023A4UL))
#define bM4_EXMC_ECC_SYND9_3_S710                       *((volatile unsigned int*)(0x9441023A8UL))
#define bM4_EXMC_ECC_SYND9_3_S711                       *((volatile unsigned int*)(0x9441023ACUL))
#define bM4_EXMC_ECC_SYND9_3_S712                       *((volatile unsigned int*)(0x9441023B0UL))
#define bM4_EXMC_ECC_SYND9_3_S80                        *((volatile unsigned int*)(0x9441023C0UL))
#define bM4_EXMC_ECC_SYND9_3_S81                        *((volatile unsigned int*)(0x9441023C4UL))
#define bM4_EXMC_ECC_SYND9_3_S82                        *((volatile unsigned int*)(0x9441023C8UL))
#define bM4_EXMC_ECC_SYND9_3_S83                        *((volatile unsigned int*)(0x9441023CCUL))
#define bM4_EXMC_ECC_SYND9_3_S84                        *((volatile unsigned int*)(0x9441023D0UL))
#define bM4_EXMC_ECC_SYND9_3_S85                        *((volatile unsigned int*)(0x9441023D4UL))
#define bM4_EXMC_ECC_SYND9_3_S86                        *((volatile unsigned int*)(0x9441023D8UL))
#define bM4_EXMC_ECC_SYND9_3_S87                        *((volatile unsigned int*)(0x9441023DCUL))
#define bM4_EXMC_ECC_SYND9_3_S88                        *((volatile unsigned int*)(0x9441023E0UL))
#define bM4_EXMC_ECC_SYND9_3_S89                        *((volatile unsigned int*)(0x9441023E4UL))
#define bM4_EXMC_ECC_SYND9_3_S810                       *((volatile unsigned int*)(0x9441023E8UL))
#define bM4_EXMC_ECC_SYND9_3_S811                       *((volatile unsigned int*)(0x9441023ECUL))
#define bM4_EXMC_ECC_SYND9_3_S812                       *((volatile unsigned int*)(0x9441023F0UL))
#define bM4_EXMC_ECC_SYND9_3_RESV                       *((volatile unsigned int*)(0x9441023FCUL))
#define bM4_EXMC_ECC_SYND10_0_S10                       *((volatile unsigned int*)(0x944102400UL))
#define bM4_EXMC_ECC_SYND10_0_S11                       *((volatile unsigned int*)(0x944102404UL))
#define bM4_EXMC_ECC_SYND10_0_S12                       *((volatile unsigned int*)(0x944102408UL))
#define bM4_EXMC_ECC_SYND10_0_S13                       *((volatile unsigned int*)(0x94410240CUL))
#define bM4_EXMC_ECC_SYND10_0_S14                       *((volatile unsigned int*)(0x944102410UL))
#define bM4_EXMC_ECC_SYND10_0_S15                       *((volatile unsigned int*)(0x944102414UL))
#define bM4_EXMC_ECC_SYND10_0_S16                       *((volatile unsigned int*)(0x944102418UL))
#define bM4_EXMC_ECC_SYND10_0_S17                       *((volatile unsigned int*)(0x94410241CUL))
#define bM4_EXMC_ECC_SYND10_0_S18                       *((volatile unsigned int*)(0x944102420UL))
#define bM4_EXMC_ECC_SYND10_0_S19                       *((volatile unsigned int*)(0x944102424UL))
#define bM4_EXMC_ECC_SYND10_0_S110                      *((volatile unsigned int*)(0x944102428UL))
#define bM4_EXMC_ECC_SYND10_0_S111                      *((volatile unsigned int*)(0x94410242CUL))
#define bM4_EXMC_ECC_SYND10_0_S112                      *((volatile unsigned int*)(0x944102430UL))
#define bM4_EXMC_ECC_SYND10_0_S20                       *((volatile unsigned int*)(0x944102440UL))
#define bM4_EXMC_ECC_SYND10_0_S21                       *((volatile unsigned int*)(0x944102444UL))
#define bM4_EXMC_ECC_SYND10_0_S22                       *((volatile unsigned int*)(0x944102448UL))
#define bM4_EXMC_ECC_SYND10_0_S23                       *((volatile unsigned int*)(0x94410244CUL))
#define bM4_EXMC_ECC_SYND10_0_S24                       *((volatile unsigned int*)(0x944102450UL))
#define bM4_EXMC_ECC_SYND10_0_S25                       *((volatile unsigned int*)(0x944102454UL))
#define bM4_EXMC_ECC_SYND10_0_S26                       *((volatile unsigned int*)(0x944102458UL))
#define bM4_EXMC_ECC_SYND10_0_S27                       *((volatile unsigned int*)(0x94410245CUL))
#define bM4_EXMC_ECC_SYND10_0_S28                       *((volatile unsigned int*)(0x944102460UL))
#define bM4_EXMC_ECC_SYND10_0_S29                       *((volatile unsigned int*)(0x944102464UL))
#define bM4_EXMC_ECC_SYND10_0_S210                      *((volatile unsigned int*)(0x944102468UL))
#define bM4_EXMC_ECC_SYND10_0_S211                      *((volatile unsigned int*)(0x94410246CUL))
#define bM4_EXMC_ECC_SYND10_0_S212                      *((volatile unsigned int*)(0x944102470UL))
#define bM4_EXMC_ECC_SYND10_0_RESV                      *((volatile unsigned int*)(0x94410247CUL))
#define bM4_EXMC_ECC_SYND10_1_S30                       *((volatile unsigned int*)(0x944102480UL))
#define bM4_EXMC_ECC_SYND10_1_S31                       *((volatile unsigned int*)(0x944102484UL))
#define bM4_EXMC_ECC_SYND10_1_S32                       *((volatile unsigned int*)(0x944102488UL))
#define bM4_EXMC_ECC_SYND10_1_S33                       *((volatile unsigned int*)(0x94410248CUL))
#define bM4_EXMC_ECC_SYND10_1_S34                       *((volatile unsigned int*)(0x944102490UL))
#define bM4_EXMC_ECC_SYND10_1_S35                       *((volatile unsigned int*)(0x944102494UL))
#define bM4_EXMC_ECC_SYND10_1_S36                       *((volatile unsigned int*)(0x944102498UL))
#define bM4_EXMC_ECC_SYND10_1_S37                       *((volatile unsigned int*)(0x94410249CUL))
#define bM4_EXMC_ECC_SYND10_1_S38                       *((volatile unsigned int*)(0x9441024A0UL))
#define bM4_EXMC_ECC_SYND10_1_S39                       *((volatile unsigned int*)(0x9441024A4UL))
#define bM4_EXMC_ECC_SYND10_1_S310                      *((volatile unsigned int*)(0x9441024A8UL))
#define bM4_EXMC_ECC_SYND10_1_S311                      *((volatile unsigned int*)(0x9441024ACUL))
#define bM4_EXMC_ECC_SYND10_1_S312                      *((volatile unsigned int*)(0x9441024B0UL))
#define bM4_EXMC_ECC_SYND10_1_S40                       *((volatile unsigned int*)(0x9441024C0UL))
#define bM4_EXMC_ECC_SYND10_1_S41                       *((volatile unsigned int*)(0x9441024C4UL))
#define bM4_EXMC_ECC_SYND10_1_S42                       *((volatile unsigned int*)(0x9441024C8UL))
#define bM4_EXMC_ECC_SYND10_1_S43                       *((volatile unsigned int*)(0x9441024CCUL))
#define bM4_EXMC_ECC_SYND10_1_S44                       *((volatile unsigned int*)(0x9441024D0UL))
#define bM4_EXMC_ECC_SYND10_1_S45                       *((volatile unsigned int*)(0x9441024D4UL))
#define bM4_EXMC_ECC_SYND10_1_S46                       *((volatile unsigned int*)(0x9441024D8UL))
#define bM4_EXMC_ECC_SYND10_1_S47                       *((volatile unsigned int*)(0x9441024DCUL))
#define bM4_EXMC_ECC_SYND10_1_S48                       *((volatile unsigned int*)(0x9441024E0UL))
#define bM4_EXMC_ECC_SYND10_1_S49                       *((volatile unsigned int*)(0x9441024E4UL))
#define bM4_EXMC_ECC_SYND10_1_S410                      *((volatile unsigned int*)(0x9441024E8UL))
#define bM4_EXMC_ECC_SYND10_1_S411                      *((volatile unsigned int*)(0x9441024ECUL))
#define bM4_EXMC_ECC_SYND10_1_S412                      *((volatile unsigned int*)(0x9441024F0UL))
#define bM4_EXMC_ECC_SYND10_1_RESV                      *((volatile unsigned int*)(0x9441024FCUL))
#define bM4_EXMC_ECC_SYND10_2_S50                       *((volatile unsigned int*)(0x944102500UL))
#define bM4_EXMC_ECC_SYND10_2_S51                       *((volatile unsigned int*)(0x944102504UL))
#define bM4_EXMC_ECC_SYND10_2_S52                       *((volatile unsigned int*)(0x944102508UL))
#define bM4_EXMC_ECC_SYND10_2_S53                       *((volatile unsigned int*)(0x94410250CUL))
#define bM4_EXMC_ECC_SYND10_2_S54                       *((volatile unsigned int*)(0x944102510UL))
#define bM4_EXMC_ECC_SYND10_2_S55                       *((volatile unsigned int*)(0x944102514UL))
#define bM4_EXMC_ECC_SYND10_2_S56                       *((volatile unsigned int*)(0x944102518UL))
#define bM4_EXMC_ECC_SYND10_2_S57                       *((volatile unsigned int*)(0x94410251CUL))
#define bM4_EXMC_ECC_SYND10_2_S58                       *((volatile unsigned int*)(0x944102520UL))
#define bM4_EXMC_ECC_SYND10_2_S59                       *((volatile unsigned int*)(0x944102524UL))
#define bM4_EXMC_ECC_SYND10_2_S510                      *((volatile unsigned int*)(0x944102528UL))
#define bM4_EXMC_ECC_SYND10_2_S511                      *((volatile unsigned int*)(0x94410252CUL))
#define bM4_EXMC_ECC_SYND10_2_S512                      *((volatile unsigned int*)(0x944102530UL))
#define bM4_EXMC_ECC_SYND10_2_S60                       *((volatile unsigned int*)(0x944102540UL))
#define bM4_EXMC_ECC_SYND10_2_S61                       *((volatile unsigned int*)(0x944102544UL))
#define bM4_EXMC_ECC_SYND10_2_S62                       *((volatile unsigned int*)(0x944102548UL))
#define bM4_EXMC_ECC_SYND10_2_S63                       *((volatile unsigned int*)(0x94410254CUL))
#define bM4_EXMC_ECC_SYND10_2_S64                       *((volatile unsigned int*)(0x944102550UL))
#define bM4_EXMC_ECC_SYND10_2_S65                       *((volatile unsigned int*)(0x944102554UL))
#define bM4_EXMC_ECC_SYND10_2_S66                       *((volatile unsigned int*)(0x944102558UL))
#define bM4_EXMC_ECC_SYND10_2_S67                       *((volatile unsigned int*)(0x94410255CUL))
#define bM4_EXMC_ECC_SYND10_2_S68                       *((volatile unsigned int*)(0x944102560UL))
#define bM4_EXMC_ECC_SYND10_2_S69                       *((volatile unsigned int*)(0x944102564UL))
#define bM4_EXMC_ECC_SYND10_2_S610                      *((volatile unsigned int*)(0x944102568UL))
#define bM4_EXMC_ECC_SYND10_2_S611                      *((volatile unsigned int*)(0x94410256CUL))
#define bM4_EXMC_ECC_SYND10_2_S612                      *((volatile unsigned int*)(0x944102570UL))
#define bM4_EXMC_ECC_SYND10_2_RESV                      *((volatile unsigned int*)(0x94410257CUL))
#define bM4_EXMC_ECC_SYND10_3_S70                       *((volatile unsigned int*)(0x944102580UL))
#define bM4_EXMC_ECC_SYND10_3_S71                       *((volatile unsigned int*)(0x944102584UL))
#define bM4_EXMC_ECC_SYND10_3_S72                       *((volatile unsigned int*)(0x944102588UL))
#define bM4_EXMC_ECC_SYND10_3_S73                       *((volatile unsigned int*)(0x94410258CUL))
#define bM4_EXMC_ECC_SYND10_3_S74                       *((volatile unsigned int*)(0x944102590UL))
#define bM4_EXMC_ECC_SYND10_3_S75                       *((volatile unsigned int*)(0x944102594UL))
#define bM4_EXMC_ECC_SYND10_3_S76                       *((volatile unsigned int*)(0x944102598UL))
#define bM4_EXMC_ECC_SYND10_3_S77                       *((volatile unsigned int*)(0x94410259CUL))
#define bM4_EXMC_ECC_SYND10_3_S78                       *((volatile unsigned int*)(0x9441025A0UL))
#define bM4_EXMC_ECC_SYND10_3_S79                       *((volatile unsigned int*)(0x9441025A4UL))
#define bM4_EXMC_ECC_SYND10_3_S710                      *((volatile unsigned int*)(0x9441025A8UL))
#define bM4_EXMC_ECC_SYND10_3_S711                      *((volatile unsigned int*)(0x9441025ACUL))
#define bM4_EXMC_ECC_SYND10_3_S712                      *((volatile unsigned int*)(0x9441025B0UL))
#define bM4_EXMC_ECC_SYND10_3_S80                       *((volatile unsigned int*)(0x9441025C0UL))
#define bM4_EXMC_ECC_SYND10_3_S81                       *((volatile unsigned int*)(0x9441025C4UL))
#define bM4_EXMC_ECC_SYND10_3_S82                       *((volatile unsigned int*)(0x9441025C8UL))
#define bM4_EXMC_ECC_SYND10_3_S83                       *((volatile unsigned int*)(0x9441025CCUL))
#define bM4_EXMC_ECC_SYND10_3_S84                       *((volatile unsigned int*)(0x9441025D0UL))
#define bM4_EXMC_ECC_SYND10_3_S85                       *((volatile unsigned int*)(0x9441025D4UL))
#define bM4_EXMC_ECC_SYND10_3_S86                       *((volatile unsigned int*)(0x9441025D8UL))
#define bM4_EXMC_ECC_SYND10_3_S87                       *((volatile unsigned int*)(0x9441025DCUL))
#define bM4_EXMC_ECC_SYND10_3_S88                       *((volatile unsigned int*)(0x9441025E0UL))
#define bM4_EXMC_ECC_SYND10_3_S89                       *((volatile unsigned int*)(0x9441025E4UL))
#define bM4_EXMC_ECC_SYND10_3_S810                      *((volatile unsigned int*)(0x9441025E8UL))
#define bM4_EXMC_ECC_SYND10_3_S811                      *((volatile unsigned int*)(0x9441025ECUL))
#define bM4_EXMC_ECC_SYND10_3_S812                      *((volatile unsigned int*)(0x9441025F0UL))
#define bM4_EXMC_ECC_SYND10_3_RESV                      *((volatile unsigned int*)(0x9441025FCUL))
#define bM4_EXMC_ECC_SYND11_0_S10                       *((volatile unsigned int*)(0x944102600UL))
#define bM4_EXMC_ECC_SYND11_0_S11                       *((volatile unsigned int*)(0x944102604UL))
#define bM4_EXMC_ECC_SYND11_0_S12                       *((volatile unsigned int*)(0x944102608UL))
#define bM4_EXMC_ECC_SYND11_0_S13                       *((volatile unsigned int*)(0x94410260CUL))
#define bM4_EXMC_ECC_SYND11_0_S14                       *((volatile unsigned int*)(0x944102610UL))
#define bM4_EXMC_ECC_SYND11_0_S15                       *((volatile unsigned int*)(0x944102614UL))
#define bM4_EXMC_ECC_SYND11_0_S16                       *((volatile unsigned int*)(0x944102618UL))
#define bM4_EXMC_ECC_SYND11_0_S17                       *((volatile unsigned int*)(0x94410261CUL))
#define bM4_EXMC_ECC_SYND11_0_S18                       *((volatile unsigned int*)(0x944102620UL))
#define bM4_EXMC_ECC_SYND11_0_S19                       *((volatile unsigned int*)(0x944102624UL))
#define bM4_EXMC_ECC_SYND11_0_S110                      *((volatile unsigned int*)(0x944102628UL))
#define bM4_EXMC_ECC_SYND11_0_S111                      *((volatile unsigned int*)(0x94410262CUL))
#define bM4_EXMC_ECC_SYND11_0_S112                      *((volatile unsigned int*)(0x944102630UL))
#define bM4_EXMC_ECC_SYND11_0_S20                       *((volatile unsigned int*)(0x944102640UL))
#define bM4_EXMC_ECC_SYND11_0_S21                       *((volatile unsigned int*)(0x944102644UL))
#define bM4_EXMC_ECC_SYND11_0_S22                       *((volatile unsigned int*)(0x944102648UL))
#define bM4_EXMC_ECC_SYND11_0_S23                       *((volatile unsigned int*)(0x94410264CUL))
#define bM4_EXMC_ECC_SYND11_0_S24                       *((volatile unsigned int*)(0x944102650UL))
#define bM4_EXMC_ECC_SYND11_0_S25                       *((volatile unsigned int*)(0x944102654UL))
#define bM4_EXMC_ECC_SYND11_0_S26                       *((volatile unsigned int*)(0x944102658UL))
#define bM4_EXMC_ECC_SYND11_0_S27                       *((volatile unsigned int*)(0x94410265CUL))
#define bM4_EXMC_ECC_SYND11_0_S28                       *((volatile unsigned int*)(0x944102660UL))
#define bM4_EXMC_ECC_SYND11_0_S29                       *((volatile unsigned int*)(0x944102664UL))
#define bM4_EXMC_ECC_SYND11_0_S210                      *((volatile unsigned int*)(0x944102668UL))
#define bM4_EXMC_ECC_SYND11_0_S211                      *((volatile unsigned int*)(0x94410266CUL))
#define bM4_EXMC_ECC_SYND11_0_S212                      *((volatile unsigned int*)(0x944102670UL))
#define bM4_EXMC_ECC_SYND11_0_RESV                      *((volatile unsigned int*)(0x94410267CUL))
#define bM4_EXMC_ECC_SYND11_1_S30                       *((volatile unsigned int*)(0x944102680UL))
#define bM4_EXMC_ECC_SYND11_1_S31                       *((volatile unsigned int*)(0x944102684UL))
#define bM4_EXMC_ECC_SYND11_1_S32                       *((volatile unsigned int*)(0x944102688UL))
#define bM4_EXMC_ECC_SYND11_1_S33                       *((volatile unsigned int*)(0x94410268CUL))
#define bM4_EXMC_ECC_SYND11_1_S34                       *((volatile unsigned int*)(0x944102690UL))
#define bM4_EXMC_ECC_SYND11_1_S35                       *((volatile unsigned int*)(0x944102694UL))
#define bM4_EXMC_ECC_SYND11_1_S36                       *((volatile unsigned int*)(0x944102698UL))
#define bM4_EXMC_ECC_SYND11_1_S37                       *((volatile unsigned int*)(0x94410269CUL))
#define bM4_EXMC_ECC_SYND11_1_S38                       *((volatile unsigned int*)(0x9441026A0UL))
#define bM4_EXMC_ECC_SYND11_1_S39                       *((volatile unsigned int*)(0x9441026A4UL))
#define bM4_EXMC_ECC_SYND11_1_S310                      *((volatile unsigned int*)(0x9441026A8UL))
#define bM4_EXMC_ECC_SYND11_1_S311                      *((volatile unsigned int*)(0x9441026ACUL))
#define bM4_EXMC_ECC_SYND11_1_S312                      *((volatile unsigned int*)(0x9441026B0UL))
#define bM4_EXMC_ECC_SYND11_1_S40                       *((volatile unsigned int*)(0x9441026C0UL))
#define bM4_EXMC_ECC_SYND11_1_S41                       *((volatile unsigned int*)(0x9441026C4UL))
#define bM4_EXMC_ECC_SYND11_1_S42                       *((volatile unsigned int*)(0x9441026C8UL))
#define bM4_EXMC_ECC_SYND11_1_S43                       *((volatile unsigned int*)(0x9441026CCUL))
#define bM4_EXMC_ECC_SYND11_1_S44                       *((volatile unsigned int*)(0x9441026D0UL))
#define bM4_EXMC_ECC_SYND11_1_S45                       *((volatile unsigned int*)(0x9441026D4UL))
#define bM4_EXMC_ECC_SYND11_1_S46                       *((volatile unsigned int*)(0x9441026D8UL))
#define bM4_EXMC_ECC_SYND11_1_S47                       *((volatile unsigned int*)(0x9441026DCUL))
#define bM4_EXMC_ECC_SYND11_1_S48                       *((volatile unsigned int*)(0x9441026E0UL))
#define bM4_EXMC_ECC_SYND11_1_S49                       *((volatile unsigned int*)(0x9441026E4UL))
#define bM4_EXMC_ECC_SYND11_1_S410                      *((volatile unsigned int*)(0x9441026E8UL))
#define bM4_EXMC_ECC_SYND11_1_S411                      *((volatile unsigned int*)(0x9441026ECUL))
#define bM4_EXMC_ECC_SYND11_1_S412                      *((volatile unsigned int*)(0x9441026F0UL))
#define bM4_EXMC_ECC_SYND11_1_RESV                      *((volatile unsigned int*)(0x9441026FCUL))
#define bM4_EXMC_ECC_SYND11_2_S50                       *((volatile unsigned int*)(0x944102700UL))
#define bM4_EXMC_ECC_SYND11_2_S51                       *((volatile unsigned int*)(0x944102704UL))
#define bM4_EXMC_ECC_SYND11_2_S52                       *((volatile unsigned int*)(0x944102708UL))
#define bM4_EXMC_ECC_SYND11_2_S53                       *((volatile unsigned int*)(0x94410270CUL))
#define bM4_EXMC_ECC_SYND11_2_S54                       *((volatile unsigned int*)(0x944102710UL))
#define bM4_EXMC_ECC_SYND11_2_S55                       *((volatile unsigned int*)(0x944102714UL))
#define bM4_EXMC_ECC_SYND11_2_S56                       *((volatile unsigned int*)(0x944102718UL))
#define bM4_EXMC_ECC_SYND11_2_S57                       *((volatile unsigned int*)(0x94410271CUL))
#define bM4_EXMC_ECC_SYND11_2_S58                       *((volatile unsigned int*)(0x944102720UL))
#define bM4_EXMC_ECC_SYND11_2_S59                       *((volatile unsigned int*)(0x944102724UL))
#define bM4_EXMC_ECC_SYND11_2_S510                      *((volatile unsigned int*)(0x944102728UL))
#define bM4_EXMC_ECC_SYND11_2_S511                      *((volatile unsigned int*)(0x94410272CUL))
#define bM4_EXMC_ECC_SYND11_2_S512                      *((volatile unsigned int*)(0x944102730UL))
#define bM4_EXMC_ECC_SYND11_2_S60                       *((volatile unsigned int*)(0x944102740UL))
#define bM4_EXMC_ECC_SYND11_2_S61                       *((volatile unsigned int*)(0x944102744UL))
#define bM4_EXMC_ECC_SYND11_2_S62                       *((volatile unsigned int*)(0x944102748UL))
#define bM4_EXMC_ECC_SYND11_2_S63                       *((volatile unsigned int*)(0x94410274CUL))
#define bM4_EXMC_ECC_SYND11_2_S64                       *((volatile unsigned int*)(0x944102750UL))
#define bM4_EXMC_ECC_SYND11_2_S65                       *((volatile unsigned int*)(0x944102754UL))
#define bM4_EXMC_ECC_SYND11_2_S66                       *((volatile unsigned int*)(0x944102758UL))
#define bM4_EXMC_ECC_SYND11_2_S67                       *((volatile unsigned int*)(0x94410275CUL))
#define bM4_EXMC_ECC_SYND11_2_S68                       *((volatile unsigned int*)(0x944102760UL))
#define bM4_EXMC_ECC_SYND11_2_S69                       *((volatile unsigned int*)(0x944102764UL))
#define bM4_EXMC_ECC_SYND11_2_S610                      *((volatile unsigned int*)(0x944102768UL))
#define bM4_EXMC_ECC_SYND11_2_S611                      *((volatile unsigned int*)(0x94410276CUL))
#define bM4_EXMC_ECC_SYND11_2_S612                      *((volatile unsigned int*)(0x944102770UL))
#define bM4_EXMC_ECC_SYND11_2_RESV                      *((volatile unsigned int*)(0x94410277CUL))
#define bM4_EXMC_ECC_SYND11_3_S70                       *((volatile unsigned int*)(0x944102780UL))
#define bM4_EXMC_ECC_SYND11_3_S71                       *((volatile unsigned int*)(0x944102784UL))
#define bM4_EXMC_ECC_SYND11_3_S72                       *((volatile unsigned int*)(0x944102788UL))
#define bM4_EXMC_ECC_SYND11_3_S73                       *((volatile unsigned int*)(0x94410278CUL))
#define bM4_EXMC_ECC_SYND11_3_S74                       *((volatile unsigned int*)(0x944102790UL))
#define bM4_EXMC_ECC_SYND11_3_S75                       *((volatile unsigned int*)(0x944102794UL))
#define bM4_EXMC_ECC_SYND11_3_S76                       *((volatile unsigned int*)(0x944102798UL))
#define bM4_EXMC_ECC_SYND11_3_S77                       *((volatile unsigned int*)(0x94410279CUL))
#define bM4_EXMC_ECC_SYND11_3_S78                       *((volatile unsigned int*)(0x9441027A0UL))
#define bM4_EXMC_ECC_SYND11_3_S79                       *((volatile unsigned int*)(0x9441027A4UL))
#define bM4_EXMC_ECC_SYND11_3_S710                      *((volatile unsigned int*)(0x9441027A8UL))
#define bM4_EXMC_ECC_SYND11_3_S711                      *((volatile unsigned int*)(0x9441027ACUL))
#define bM4_EXMC_ECC_SYND11_3_S712                      *((volatile unsigned int*)(0x9441027B0UL))
#define bM4_EXMC_ECC_SYND11_3_S80                       *((volatile unsigned int*)(0x9441027C0UL))
#define bM4_EXMC_ECC_SYND11_3_S81                       *((volatile unsigned int*)(0x9441027C4UL))
#define bM4_EXMC_ECC_SYND11_3_S82                       *((volatile unsigned int*)(0x9441027C8UL))
#define bM4_EXMC_ECC_SYND11_3_S83                       *((volatile unsigned int*)(0x9441027CCUL))
#define bM4_EXMC_ECC_SYND11_3_S84                       *((volatile unsigned int*)(0x9441027D0UL))
#define bM4_EXMC_ECC_SYND11_3_S85                       *((volatile unsigned int*)(0x9441027D4UL))
#define bM4_EXMC_ECC_SYND11_3_S86                       *((volatile unsigned int*)(0x9441027D8UL))
#define bM4_EXMC_ECC_SYND11_3_S87                       *((volatile unsigned int*)(0x9441027DCUL))
#define bM4_EXMC_ECC_SYND11_3_S88                       *((volatile unsigned int*)(0x9441027E0UL))
#define bM4_EXMC_ECC_SYND11_3_S89                       *((volatile unsigned int*)(0x9441027E4UL))
#define bM4_EXMC_ECC_SYND11_3_S810                      *((volatile unsigned int*)(0x9441027E8UL))
#define bM4_EXMC_ECC_SYND11_3_S811                      *((volatile unsigned int*)(0x9441027ECUL))
#define bM4_EXMC_ECC_SYND11_3_S812                      *((volatile unsigned int*)(0x9441027F0UL))
#define bM4_EXMC_ECC_SYND11_3_RESV                      *((volatile unsigned int*)(0x9441027FCUL))
#define bM4_EXMC_ECC_SYND12_0_S10                       *((volatile unsigned int*)(0x944102800UL))
#define bM4_EXMC_ECC_SYND12_0_S11                       *((volatile unsigned int*)(0x944102804UL))
#define bM4_EXMC_ECC_SYND12_0_S12                       *((volatile unsigned int*)(0x944102808UL))
#define bM4_EXMC_ECC_SYND12_0_S13                       *((volatile unsigned int*)(0x94410280CUL))
#define bM4_EXMC_ECC_SYND12_0_S14                       *((volatile unsigned int*)(0x944102810UL))
