RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EXMC_ECC_SYND12_0_S15                       *((volatile unsigned int*)(0x944102814UL))
#define bM4_EXMC_ECC_SYND12_0_S16                       *((volatile unsigned int*)(0x944102818UL))
#define bM4_EXMC_ECC_SYND12_0_S17                       *((volatile unsigned int*)(0x94410281CUL))
#define bM4_EXMC_ECC_SYND12_0_S18                       *((volatile unsigned int*)(0x944102820UL))
#define bM4_EXMC_ECC_SYND12_0_S19                       *((volatile unsigned int*)(0x944102824UL))
#define bM4_EXMC_ECC_SYND12_0_S110                      *((volatile unsigned int*)(0x944102828UL))
#define bM4_EXMC_ECC_SYND12_0_S111                      *((volatile unsigned int*)(0x94410282CUL))
#define bM4_EXMC_ECC_SYND12_0_S112                      *((volatile unsigned int*)(0x944102830UL))
#define bM4_EXMC_ECC_SYND12_0_S20                       *((volatile unsigned int*)(0x944102840UL))
#define bM4_EXMC_ECC_SYND12_0_S21                       *((volatile unsigned int*)(0x944102844UL))
#define bM4_EXMC_ECC_SYND12_0_S22                       *((volatile unsigned int*)(0x944102848UL))
#define bM4_EXMC_ECC_SYND12_0_S23                       *((volatile unsigned int*)(0x94410284CUL))
#define bM4_EXMC_ECC_SYND12_0_S24                       *((volatile unsigned int*)(0x944102850UL))
#define bM4_EXMC_ECC_SYND12_0_S25                       *((volatile unsigned int*)(0x944102854UL))
#define bM4_EXMC_ECC_SYND12_0_S26                       *((volatile unsigned int*)(0x944102858UL))
#define bM4_EXMC_ECC_SYND12_0_S27                       *((volatile unsigned int*)(0x94410285CUL))
#define bM4_EXMC_ECC_SYND12_0_S28                       *((volatile unsigned int*)(0x944102860UL))
#define bM4_EXMC_ECC_SYND12_0_S29                       *((volatile unsigned int*)(0x944102864UL))
#define bM4_EXMC_ECC_SYND12_0_S210                      *((volatile unsigned int*)(0x944102868UL))
#define bM4_EXMC_ECC_SYND12_0_S211                      *((volatile unsigned int*)(0x94410286CUL))
#define bM4_EXMC_ECC_SYND12_0_S212                      *((volatile unsigned int*)(0x944102870UL))
#define bM4_EXMC_ECC_SYND12_0_RESV                      *((volatile unsigned int*)(0x94410287CUL))
#define bM4_EXMC_ECC_SYND12_1_S30                       *((volatile unsigned int*)(0x944102880UL))
#define bM4_EXMC_ECC_SYND12_1_S31                       *((volatile unsigned int*)(0x944102884UL))
#define bM4_EXMC_ECC_SYND12_1_S32                       *((volatile unsigned int*)(0x944102888UL))
#define bM4_EXMC_ECC_SYND12_1_S33                       *((volatile unsigned int*)(0x94410288CUL))
#define bM4_EXMC_ECC_SYND12_1_S34                       *((volatile unsigned int*)(0x944102890UL))
#define bM4_EXMC_ECC_SYND12_1_S35                       *((volatile unsigned int*)(0x944102894UL))
#define bM4_EXMC_ECC_SYND12_1_S36                       *((volatile unsigned int*)(0x944102898UL))
#define bM4_EXMC_ECC_SYND12_1_S37                       *((volatile unsigned int*)(0x94410289CUL))
#define bM4_EXMC_ECC_SYND12_1_S38                       *((volatile unsigned int*)(0x9441028A0UL))
#define bM4_EXMC_ECC_SYND12_1_S39                       *((volatile unsigned int*)(0x9441028A4UL))
#define bM4_EXMC_ECC_SYND12_1_S310                      *((volatile unsigned int*)(0x9441028A8UL))
#define bM4_EXMC_ECC_SYND12_1_S311                      *((volatile unsigned int*)(0x9441028ACUL))
#define bM4_EXMC_ECC_SYND12_1_S312                      *((volatile unsigned int*)(0x9441028B0UL))
#define bM4_EXMC_ECC_SYND12_1_S40                       *((volatile unsigned int*)(0x9441028C0UL))
#define bM4_EXMC_ECC_SYND12_1_S41                       *((volatile unsigned int*)(0x9441028C4UL))
#define bM4_EXMC_ECC_SYND12_1_S42                       *((volatile unsigned int*)(0x9441028C8UL))
#define bM4_EXMC_ECC_SYND12_1_S43                       *((volatile unsigned int*)(0x9441028CCUL))
#define bM4_EXMC_ECC_SYND12_1_S44                       *((volatile unsigned int*)(0x9441028D0UL))
#define bM4_EXMC_ECC_SYND12_1_S45                       *((volatile unsigned int*)(0x9441028D4UL))
#define bM4_EXMC_ECC_SYND12_1_S46                       *((volatile unsigned int*)(0x9441028D8UL))
#define bM4_EXMC_ECC_SYND12_1_S47                       *((volatile unsigned int*)(0x9441028DCUL))
#define bM4_EXMC_ECC_SYND12_1_S48                       *((volatile unsigned int*)(0x9441028E0UL))
#define bM4_EXMC_ECC_SYND12_1_S49                       *((volatile unsigned int*)(0x9441028E4UL))
#define bM4_EXMC_ECC_SYND12_1_S410                      *((volatile unsigned int*)(0x9441028E8UL))
#define bM4_EXMC_ECC_SYND12_1_S411                      *((volatile unsigned int*)(0x9441028ECUL))
#define bM4_EXMC_ECC_SYND12_1_S412                      *((volatile unsigned int*)(0x9441028F0UL))
#define bM4_EXMC_ECC_SYND12_1_RESV                      *((volatile unsigned int*)(0x9441028FCUL))
#define bM4_EXMC_ECC_SYND12_2_S50                       *((volatile unsigned int*)(0x944102900UL))
#define bM4_EXMC_ECC_SYND12_2_S51                       *((volatile unsigned int*)(0x944102904UL))
#define bM4_EXMC_ECC_SYND12_2_S52                       *((volatile unsigned int*)(0x944102908UL))
#define bM4_EXMC_ECC_SYND12_2_S53                       *((volatile unsigned int*)(0x94410290CUL))
#define bM4_EXMC_ECC_SYND12_2_S54                       *((volatile unsigned int*)(0x944102910UL))
#define bM4_EXMC_ECC_SYND12_2_S55                       *((volatile unsigned int*)(0x944102914UL))
#define bM4_EXMC_ECC_SYND12_2_S56                       *((volatile unsigned int*)(0x944102918UL))
#define bM4_EXMC_ECC_SYND12_2_S57                       *((volatile unsigned int*)(0x94410291CUL))
#define bM4_EXMC_ECC_SYND12_2_S58                       *((volatile unsigned int*)(0x944102920UL))
#define bM4_EXMC_ECC_SYND12_2_S59                       *((volatile unsigned int*)(0x944102924UL))
#define bM4_EXMC_ECC_SYND12_2_S510                      *((volatile unsigned int*)(0x944102928UL))
#define bM4_EXMC_ECC_SYND12_2_S511                      *((volatile unsigned int*)(0x94410292CUL))
#define bM4_EXMC_ECC_SYND12_2_S512                      *((volatile unsigned int*)(0x944102930UL))
#define bM4_EXMC_ECC_SYND12_2_S60                       *((volatile unsigned int*)(0x944102940UL))
#define bM4_EXMC_ECC_SYND12_2_S61                       *((volatile unsigned int*)(0x944102944UL))
#define bM4_EXMC_ECC_SYND12_2_S62                       *((volatile unsigned int*)(0x944102948UL))
#define bM4_EXMC_ECC_SYND12_2_S63                       *((volatile unsigned int*)(0x94410294CUL))
#define bM4_EXMC_ECC_SYND12_2_S64                       *((volatile unsigned int*)(0x944102950UL))
#define bM4_EXMC_ECC_SYND12_2_S65                       *((volatile unsigned int*)(0x944102954UL))
#define bM4_EXMC_ECC_SYND12_2_S66                       *((volatile unsigned int*)(0x944102958UL))
#define bM4_EXMC_ECC_SYND12_2_S67                       *((volatile unsigned int*)(0x94410295CUL))
#define bM4_EXMC_ECC_SYND12_2_S68                       *((volatile unsigned int*)(0x944102960UL))
#define bM4_EXMC_ECC_SYND12_2_S69                       *((volatile unsigned int*)(0x944102964UL))
#define bM4_EXMC_ECC_SYND12_2_S610                      *((volatile unsigned int*)(0x944102968UL))
#define bM4_EXMC_ECC_SYND12_2_S611                      *((volatile unsigned int*)(0x94410296CUL))
#define bM4_EXMC_ECC_SYND12_2_S612                      *((volatile unsigned int*)(0x944102970UL))
#define bM4_EXMC_ECC_SYND12_2_RESV                      *((volatile unsigned int*)(0x94410297CUL))
#define bM4_EXMC_ECC_SYND12_3_S70                       *((volatile unsigned int*)(0x944102980UL))
#define bM4_EXMC_ECC_SYND12_3_S71                       *((volatile unsigned int*)(0x944102984UL))
#define bM4_EXMC_ECC_SYND12_3_S72                       *((volatile unsigned int*)(0x944102988UL))
#define bM4_EXMC_ECC_SYND12_3_S73                       *((volatile unsigned int*)(0x94410298CUL))
#define bM4_EXMC_ECC_SYND12_3_S74                       *((volatile unsigned int*)(0x944102990UL))
#define bM4_EXMC_ECC_SYND12_3_S75                       *((volatile unsigned int*)(0x944102994UL))
#define bM4_EXMC_ECC_SYND12_3_S76                       *((volatile unsigned int*)(0x944102998UL))
#define bM4_EXMC_ECC_SYND12_3_S77                       *((volatile unsigned int*)(0x94410299CUL))
#define bM4_EXMC_ECC_SYND12_3_S78                       *((volatile unsigned int*)(0x9441029A0UL))
#define bM4_EXMC_ECC_SYND12_3_S79                       *((volatile unsigned int*)(0x9441029A4UL))
#define bM4_EXMC_ECC_SYND12_3_S710                      *((volatile unsigned int*)(0x9441029A8UL))
#define bM4_EXMC_ECC_SYND12_3_S711                      *((volatile unsigned int*)(0x9441029ACUL))
#define bM4_EXMC_ECC_SYND12_3_S712                      *((volatile unsigned int*)(0x9441029B0UL))
#define bM4_EXMC_ECC_SYND12_3_S80                       *((volatile unsigned int*)(0x9441029C0UL))
#define bM4_EXMC_ECC_SYND12_3_S81                       *((volatile unsigned int*)(0x9441029C4UL))
#define bM4_EXMC_ECC_SYND12_3_S82                       *((volatile unsigned int*)(0x9441029C8UL))
#define bM4_EXMC_ECC_SYND12_3_S83                       *((volatile unsigned int*)(0x9441029CCUL))
#define bM4_EXMC_ECC_SYND12_3_S84                       *((volatile unsigned int*)(0x9441029D0UL))
#define bM4_EXMC_ECC_SYND12_3_S85                       *((volatile unsigned int*)(0x9441029D4UL))
#define bM4_EXMC_ECC_SYND12_3_S86                       *((volatile unsigned int*)(0x9441029D8UL))
#define bM4_EXMC_ECC_SYND12_3_S87                       *((volatile unsigned int*)(0x9441029DCUL))
#define bM4_EXMC_ECC_SYND12_3_S88                       *((volatile unsigned int*)(0x9441029E0UL))
#define bM4_EXMC_ECC_SYND12_3_S89                       *((volatile unsigned int*)(0x9441029E4UL))
#define bM4_EXMC_ECC_SYND12_3_S810                      *((volatile unsigned int*)(0x9441029E8UL))
#define bM4_EXMC_ECC_SYND12_3_S811                      *((volatile unsigned int*)(0x9441029ECUL))
#define bM4_EXMC_ECC_SYND12_3_S812                      *((volatile unsigned int*)(0x9441029F0UL))
#define bM4_EXMC_ECC_SYND12_3_RESV                      *((volatile unsigned int*)(0x9441029FCUL))
#define bM4_EXMC_ECC_SYND13_0_S10                       *((volatile unsigned int*)(0x944102A00UL))
#define bM4_EXMC_ECC_SYND13_0_S11                       *((volatile unsigned int*)(0x944102A04UL))
#define bM4_EXMC_ECC_SYND13_0_S12                       *((volatile unsigned int*)(0x944102A08UL))
#define bM4_EXMC_ECC_SYND13_0_S13                       *((volatile unsigned int*)(0x944102A0CUL))
#define bM4_EXMC_ECC_SYND13_0_S14                       *((volatile unsigned int*)(0x944102A10UL))
#define bM4_EXMC_ECC_SYND13_0_S15                       *((volatile unsigned int*)(0x944102A14UL))
#define bM4_EXMC_ECC_SYND13_0_S16                       *((volatile unsigned int*)(0x944102A18UL))
#define bM4_EXMC_ECC_SYND13_0_S17                       *((volatile unsigned int*)(0x944102A1CUL))
#define bM4_EXMC_ECC_SYND13_0_S18                       *((volatile unsigned int*)(0x944102A20UL))
#define bM4_EXMC_ECC_SYND13_0_S19                       *((volatile unsigned int*)(0x944102A24UL))
#define bM4_EXMC_ECC_SYND13_0_S110                      *((volatile unsigned int*)(0x944102A28UL))
#define bM4_EXMC_ECC_SYND13_0_S111                      *((volatile unsigned int*)(0x944102A2CUL))
#define bM4_EXMC_ECC_SYND13_0_S112                      *((volatile unsigned int*)(0x944102A30UL))
#define bM4_EXMC_ECC_SYND13_0_S20                       *((volatile unsigned int*)(0x944102A40UL))
#define bM4_EXMC_ECC_SYND13_0_S21                       *((volatile unsigned int*)(0x944102A44UL))
#define bM4_EXMC_ECC_SYND13_0_S22                       *((volatile unsigned int*)(0x944102A48UL))
#define bM4_EXMC_ECC_SYND13_0_S23                       *((volatile unsigned int*)(0x944102A4CUL))
#define bM4_EXMC_ECC_SYND13_0_S24                       *((volatile unsigned int*)(0x944102A50UL))
#define bM4_EXMC_ECC_SYND13_0_S25                       *((volatile unsigned int*)(0x944102A54UL))
#define bM4_EXMC_ECC_SYND13_0_S26                       *((volatile unsigned int*)(0x944102A58UL))
#define bM4_EXMC_ECC_SYND13_0_S27                       *((volatile unsigned int*)(0x944102A5CUL))
#define bM4_EXMC_ECC_SYND13_0_S28                       *((volatile unsigned int*)(0x944102A60UL))
#define bM4_EXMC_ECC_SYND13_0_S29                       *((volatile unsigned int*)(0x944102A64UL))
#define bM4_EXMC_ECC_SYND13_0_S210                      *((volatile unsigned int*)(0x944102A68UL))
#define bM4_EXMC_ECC_SYND13_0_S211                      *((volatile unsigned int*)(0x944102A6CUL))
#define bM4_EXMC_ECC_SYND13_0_S212                      *((volatile unsigned int*)(0x944102A70UL))
#define bM4_EXMC_ECC_SYND13_0_RESV                      *((volatile unsigned int*)(0x944102A7CUL))
#define bM4_EXMC_ECC_SYND13_1_S30                       *((volatile unsigned int*)(0x944102A80UL))
#define bM4_EXMC_ECC_SYND13_1_S31                       *((volatile unsigned int*)(0x944102A84UL))
#define bM4_EXMC_ECC_SYND13_1_S32                       *((volatile unsigned int*)(0x944102A88UL))
#define bM4_EXMC_ECC_SYND13_1_S33                       *((volatile unsigned int*)(0x944102A8CUL))
#define bM4_EXMC_ECC_SYND13_1_S34                       *((volatile unsigned int*)(0x944102A90UL))
#define bM4_EXMC_ECC_SYND13_1_S35                       *((volatile unsigned int*)(0x944102A94UL))
#define bM4_EXMC_ECC_SYND13_1_S36                       *((volatile unsigned int*)(0x944102A98UL))
#define bM4_EXMC_ECC_SYND13_1_S37                       *((volatile unsigned int*)(0x944102A9CUL))
#define bM4_EXMC_ECC_SYND13_1_S38                       *((volatile unsigned int*)(0x944102AA0UL))
#define bM4_EXMC_ECC_SYND13_1_S39                       *((volatile unsigned int*)(0x944102AA4UL))
#define bM4_EXMC_ECC_SYND13_1_S310                      *((volatile unsigned int*)(0x944102AA8UL))
#define bM4_EXMC_ECC_SYND13_1_S311                      *((volatile unsigned int*)(0x944102AACUL))
#define bM4_EXMC_ECC_SYND13_1_S312                      *((volatile unsigned int*)(0x944102AB0UL))
#define bM4_EXMC_ECC_SYND13_1_S40                       *((volatile unsigned int*)(0x944102AC0UL))
#define bM4_EXMC_ECC_SYND13_1_S41                       *((volatile unsigned int*)(0x944102AC4UL))
#define bM4_EXMC_ECC_SYND13_1_S42                       *((volatile unsigned int*)(0x944102AC8UL))
#define bM4_EXMC_ECC_SYND13_1_S43                       *((volatile unsigned int*)(0x944102ACCUL))
#define bM4_EXMC_ECC_SYND13_1_S44                       *((volatile unsigned int*)(0x944102AD0UL))
#define bM4_EXMC_ECC_SYND13_1_S45                       *((volatile unsigned int*)(0x944102AD4UL))
#define bM4_EXMC_ECC_SYND13_1_S46                       *((volatile unsigned int*)(0x944102AD8UL))
#define bM4_EXMC_ECC_SYND13_1_S47                       *((volatile unsigned int*)(0x944102ADCUL))
#define bM4_EXMC_ECC_SYND13_1_S48                       *((volatile unsigned int*)(0x944102AE0UL))
#define bM4_EXMC_ECC_SYND13_1_S49                       *((volatile unsigned int*)(0x944102AE4UL))
#define bM4_EXMC_ECC_SYND13_1_S410                      *((volatile unsigned int*)(0x944102AE8UL))
#define bM4_EXMC_ECC_SYND13_1_S411                      *((volatile unsigned int*)(0x944102AECUL))
#define bM4_EXMC_ECC_SYND13_1_S412                      *((volatile unsigned int*)(0x944102AF0UL))
#define bM4_EXMC_ECC_SYND13_1_RESV                      *((volatile unsigned int*)(0x944102AFCUL))
#define bM4_EXMC_ECC_SYND13_2_S50                       *((volatile unsigned int*)(0x944102B00UL))
#define bM4_EXMC_ECC_SYND13_2_S51                       *((volatile unsigned int*)(0x944102B04UL))
#define bM4_EXMC_ECC_SYND13_2_S52                       *((volatile unsigned int*)(0x944102B08UL))
#define bM4_EXMC_ECC_SYND13_2_S53                       *((volatile unsigned int*)(0x944102B0CUL))
#define bM4_EXMC_ECC_SYND13_2_S54                       *((volatile unsigned int*)(0x944102B10UL))
#define bM4_EXMC_ECC_SYND13_2_S55                       *((volatile unsigned int*)(0x944102B14UL))
#define bM4_EXMC_ECC_SYND13_2_S56                       *((volatile unsigned int*)(0x944102B18UL))
#define bM4_EXMC_ECC_SYND13_2_S57                       *((volatile unsigned int*)(0x944102B1CUL))
#define bM4_EXMC_ECC_SYND13_2_S58                       *((volatile unsigned int*)(0x944102B20UL))
#define bM4_EXMC_ECC_SYND13_2_S59                       *((volatile unsigned int*)(0x944102B24UL))
#define bM4_EXMC_ECC_SYND13_2_S510                      *((volatile unsigned int*)(0x944102B28UL))
#define bM4_EXMC_ECC_SYND13_2_S511                      *((volatile unsigned int*)(0x944102B2CUL))
#define bM4_EXMC_ECC_SYND13_2_S512                      *((volatile unsigned int*)(0x944102B30UL))
#define bM4_EXMC_ECC_SYND13_2_S60                       *((volatile unsigned int*)(0x944102B40UL))
#define bM4_EXMC_ECC_SYND13_2_S61                       *((volatile unsigned int*)(0x944102B44UL))
#define bM4_EXMC_ECC_SYND13_2_S62                       *((volatile unsigned int*)(0x944102B48UL))
#define bM4_EXMC_ECC_SYND13_2_S63                       *((volatile unsigned int*)(0x944102B4CUL))
#define bM4_EXMC_ECC_SYND13_2_S64                       *((volatile unsigned int*)(0x944102B50UL))
#define bM4_EXMC_ECC_SYND13_2_S65                       *((volatile unsigned int*)(0x944102B54UL))
#define bM4_EXMC_ECC_SYND13_2_S66                       *((volatile unsigned int*)(0x944102B58UL))
#define bM4_EXMC_ECC_SYND13_2_S67                       *((volatile unsigned int*)(0x944102B5CUL))
#define bM4_EXMC_ECC_SYND13_2_S68                       *((volatile unsigned int*)(0x944102B60UL))
#define bM4_EXMC_ECC_SYND13_2_S69                       *((volatile unsigned int*)(0x944102B64UL))
#define bM4_EXMC_ECC_SYND13_2_S610                      *((volatile unsigned int*)(0x944102B68UL))
#define bM4_EXMC_ECC_SYND13_2_S611                      *((volatile unsigned int*)(0x944102B6CUL))
#define bM4_EXMC_ECC_SYND13_2_S612                      *((volatile unsigned int*)(0x944102B70UL))
#define bM4_EXMC_ECC_SYND13_2_RESV                      *((volatile unsigned int*)(0x944102B7CUL))
#define bM4_EXMC_ECC_SYND13_3_S70                       *((volatile unsigned int*)(0x944102B80UL))
#define bM4_EXMC_ECC_SYND13_3_S71                       *((volatile unsigned int*)(0x944102B84UL))
#define bM4_EXMC_ECC_SYND13_3_S72                       *((volatile unsigned int*)(0x944102B88UL))
#define bM4_EXMC_ECC_SYND13_3_S73                       *((volatile unsigned int*)(0x944102B8CUL))
#define bM4_EXMC_ECC_SYND13_3_S74                       *((volatile unsigned int*)(0x944102B90UL))
#define bM4_EXMC_ECC_SYND13_3_S75                       *((volatile unsigned int*)(0x944102B94UL))
#define bM4_EXMC_ECC_SYND13_3_S76                       *((volatile unsigned int*)(0x944102B98UL))
#define bM4_EXMC_ECC_SYND13_3_S77                       *((volatile unsigned int*)(0x944102B9CUL))
#define bM4_EXMC_ECC_SYND13_3_S78                       *((volatile unsigned int*)(0x944102BA0UL))
#define bM4_EXMC_ECC_SYND13_3_S79                       *((volatile unsigned int*)(0x944102BA4UL))
#define bM4_EXMC_ECC_SYND13_3_S710                      *((volatile unsigned int*)(0x944102BA8UL))
#define bM4_EXMC_ECC_SYND13_3_S711                      *((volatile unsigned int*)(0x944102BACUL))
#define bM4_EXMC_ECC_SYND13_3_S712                      *((volatile unsigned int*)(0x944102BB0UL))
#define bM4_EXMC_ECC_SYND13_3_S80                       *((volatile unsigned int*)(0x944102BC0UL))
#define bM4_EXMC_ECC_SYND13_3_S81                       *((volatile unsigned int*)(0x944102BC4UL))
#define bM4_EXMC_ECC_SYND13_3_S82                       *((volatile unsigned int*)(0x944102BC8UL))
#define bM4_EXMC_ECC_SYND13_3_S83                       *((volatile unsigned int*)(0x944102BCCUL))
#define bM4_EXMC_ECC_SYND13_3_S84                       *((volatile unsigned int*)(0x944102BD0UL))
#define bM4_EXMC_ECC_SYND13_3_S85                       *((volatile unsigned int*)(0x944102BD4UL))
#define bM4_EXMC_ECC_SYND13_3_S86                       *((volatile unsigned int*)(0x944102BD8UL))
#define bM4_EXMC_ECC_SYND13_3_S87                       *((volatile unsigned int*)(0x944102BDCUL))
#define bM4_EXMC_ECC_SYND13_3_S88                       *((volatile unsigned int*)(0x944102BE0UL))
#define bM4_EXMC_ECC_SYND13_3_S89                       *((volatile unsigned int*)(0x944102BE4UL))
#define bM4_EXMC_ECC_SYND13_3_S810                      *((volatile unsigned int*)(0x944102BE8UL))
#define bM4_EXMC_ECC_SYND13_3_S811                      *((volatile unsigned int*)(0x944102BECUL))
#define bM4_EXMC_ECC_SYND13_3_S812                      *((volatile unsigned int*)(0x944102BF0UL))
#define bM4_EXMC_ECC_SYND13_3_RESV                      *((volatile unsigned int*)(0x944102BFCUL))
#define bM4_EXMC_ECC_SYND14_0_S10                       *((volatile unsigned int*)(0x944102C00UL))
#define bM4_EXMC_ECC_SYND14_0_S11                       *((volatile unsigned int*)(0x944102C04UL))
#define bM4_EXMC_ECC_SYND14_0_S12                       *((volatile unsigned int*)(0x944102C08UL))
#define bM4_EXMC_ECC_SYND14_0_S13                       *((volatile unsigned int*)(0x944102C0CUL))
#define bM4_EXMC_ECC_SYND14_0_S14                       *((volatile unsigned int*)(0x944102C10UL))
#define bM4_EXMC_ECC_SYND14_0_S15                       *((volatile unsigned int*)(0x944102C14UL))
#define bM4_EXMC_ECC_SYND14_0_S16                       *((volatile unsigned int*)(0x944102C18UL))
#define bM4_EXMC_ECC_SYND14_0_S17                       *((volatile unsigned int*)(0x944102C1CUL))
#define bM4_EXMC_ECC_SYND14_0_S18                       *((volatile unsigned int*)(0x944102C20UL))
#define bM4_EXMC_ECC_SYND14_0_S19                       *((volatile unsigned int*)(0x944102C24UL))
#define bM4_EXMC_ECC_SYND14_0_S110                      *((volatile unsigned int*)(0x944102C28UL))
#define bM4_EXMC_ECC_SYND14_0_S111                      *((volatile unsigned int*)(0x944102C2CUL))
#define bM4_EXMC_ECC_SYND14_0_S112                      *((volatile unsigned int*)(0x944102C30UL))
#define bM4_EXMC_ECC_SYND14_0_S20                       *((volatile unsigned int*)(0x944102C40UL))
#define bM4_EXMC_ECC_SYND14_0_S21                       *((volatile unsigned int*)(0x944102C44UL))
#define bM4_EXMC_ECC_SYND14_0_S22                       *((volatile unsigned int*)(0x944102C48UL))
#define bM4_EXMC_ECC_SYND14_0_S23                       *((volatile unsigned int*)(0x944102C4CUL))
#define bM4_EXMC_ECC_SYND14_0_S24                       *((volatile unsigned int*)(0x944102C50UL))
#define bM4_EXMC_ECC_SYND14_0_S25                       *((volatile unsigned int*)(0x944102C54UL))
#define bM4_EXMC_ECC_SYND14_0_S26                       *((volatile unsigned int*)(0x944102C58UL))
#define bM4_EXMC_ECC_SYND14_0_S27                       *((volatile unsigned int*)(0x944102C5CUL))
#define bM4_EXMC_ECC_SYND14_0_S28                       *((volatile unsigned int*)(0x944102C60UL))
#define bM4_EXMC_ECC_SYND14_0_S29                       *((volatile unsigned int*)(0x944102C64UL))
#define bM4_EXMC_ECC_SYND14_0_S210                      *((volatile unsigned int*)(0x944102C68UL))
#define bM4_EXMC_ECC_SYND14_0_S211                      *((volatile unsigned int*)(0x944102C6CUL))
#define bM4_EXMC_ECC_SYND14_0_S212                      *((volatile unsigned int*)(0x944102C70UL))
#define bM4_EXMC_ECC_SYND14_0_RESV                      *((volatile unsigned int*)(0x944102C7CUL))
#define bM4_EXMC_ECC_SYND14_1_S30                       *((volatile unsigned int*)(0x944102C80UL))
#define bM4_EXMC_ECC_SYND14_1_S31                       *((volatile unsigned int*)(0x944102C84UL))
#define bM4_EXMC_ECC_SYND14_1_S32                       *((volatile unsigned int*)(0x944102C88UL))
#define bM4_EXMC_ECC_SYND14_1_S33                       *((volatile unsigned int*)(0x944102C8CUL))
