RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_EXMC_ECC_SYND14_1_S34                       *((volatile unsigned int*)(0x944102C90UL))
#define bM4_EXMC_ECC_SYND14_1_S35                       *((volatile unsigned int*)(0x944102C94UL))
#define bM4_EXMC_ECC_SYND14_1_S36                       *((volatile unsigned int*)(0x944102C98UL))
#define bM4_EXMC_ECC_SYND14_1_S37                       *((volatile unsigned int*)(0x944102C9CUL))
#define bM4_EXMC_ECC_SYND14_1_S38                       *((volatile unsigned int*)(0x944102CA0UL))
#define bM4_EXMC_ECC_SYND14_1_S39                       *((volatile unsigned int*)(0x944102CA4UL))
#define bM4_EXMC_ECC_SYND14_1_S310                      *((volatile unsigned int*)(0x944102CA8UL))
#define bM4_EXMC_ECC_SYND14_1_S311                      *((volatile unsigned int*)(0x944102CACUL))
#define bM4_EXMC_ECC_SYND14_1_S312                      *((volatile unsigned int*)(0x944102CB0UL))
#define bM4_EXMC_ECC_SYND14_1_S40                       *((volatile unsigned int*)(0x944102CC0UL))
#define bM4_EXMC_ECC_SYND14_1_S41                       *((volatile unsigned int*)(0x944102CC4UL))
#define bM4_EXMC_ECC_SYND14_1_S42                       *((volatile unsigned int*)(0x944102CC8UL))
#define bM4_EXMC_ECC_SYND14_1_S43                       *((volatile unsigned int*)(0x944102CCCUL))
#define bM4_EXMC_ECC_SYND14_1_S44                       *((volatile unsigned int*)(0x944102CD0UL))
#define bM4_EXMC_ECC_SYND14_1_S45                       *((volatile unsigned int*)(0x944102CD4UL))
#define bM4_EXMC_ECC_SYND14_1_S46                       *((volatile unsigned int*)(0x944102CD8UL))
#define bM4_EXMC_ECC_SYND14_1_S47                       *((volatile unsigned int*)(0x944102CDCUL))
#define bM4_EXMC_ECC_SYND14_1_S48                       *((volatile unsigned int*)(0x944102CE0UL))
#define bM4_EXMC_ECC_SYND14_1_S49                       *((volatile unsigned int*)(0x944102CE4UL))
#define bM4_EXMC_ECC_SYND14_1_S410                      *((volatile unsigned int*)(0x944102CE8UL))
#define bM4_EXMC_ECC_SYND14_1_S411                      *((volatile unsigned int*)(0x944102CECUL))
#define bM4_EXMC_ECC_SYND14_1_S412                      *((volatile unsigned int*)(0x944102CF0UL))
#define bM4_EXMC_ECC_SYND14_1_RESV                      *((volatile unsigned int*)(0x944102CFCUL))
#define bM4_EXMC_ECC_SYND14_2_S50                       *((volatile unsigned int*)(0x944102D00UL))
#define bM4_EXMC_ECC_SYND14_2_S51                       *((volatile unsigned int*)(0x944102D04UL))
#define bM4_EXMC_ECC_SYND14_2_S52                       *((volatile unsigned int*)(0x944102D08UL))
#define bM4_EXMC_ECC_SYND14_2_S53                       *((volatile unsigned int*)(0x944102D0CUL))
#define bM4_EXMC_ECC_SYND14_2_S54                       *((volatile unsigned int*)(0x944102D10UL))
#define bM4_EXMC_ECC_SYND14_2_S55                       *((volatile unsigned int*)(0x944102D14UL))
#define bM4_EXMC_ECC_SYND14_2_S56                       *((volatile unsigned int*)(0x944102D18UL))
#define bM4_EXMC_ECC_SYND14_2_S57                       *((volatile unsigned int*)(0x944102D1CUL))
#define bM4_EXMC_ECC_SYND14_2_S58                       *((volatile unsigned int*)(0x944102D20UL))
#define bM4_EXMC_ECC_SYND14_2_S59                       *((volatile unsigned int*)(0x944102D24UL))
#define bM4_EXMC_ECC_SYND14_2_S510                      *((volatile unsigned int*)(0x944102D28UL))
#define bM4_EXMC_ECC_SYND14_2_S511                      *((volatile unsigned int*)(0x944102D2CUL))
#define bM4_EXMC_ECC_SYND14_2_S512                      *((volatile unsigned int*)(0x944102D30UL))
#define bM4_EXMC_ECC_SYND14_2_S60                       *((volatile unsigned int*)(0x944102D40UL))
#define bM4_EXMC_ECC_SYND14_2_S61                       *((volatile unsigned int*)(0x944102D44UL))
#define bM4_EXMC_ECC_SYND14_2_S62                       *((volatile unsigned int*)(0x944102D48UL))
#define bM4_EXMC_ECC_SYND14_2_S63                       *((volatile unsigned int*)(0x944102D4CUL))
#define bM4_EXMC_ECC_SYND14_2_S64                       *((volatile unsigned int*)(0x944102D50UL))
#define bM4_EXMC_ECC_SYND14_2_S65                       *((volatile unsigned int*)(0x944102D54UL))
#define bM4_EXMC_ECC_SYND14_2_S66                       *((volatile unsigned int*)(0x944102D58UL))
#define bM4_EXMC_ECC_SYND14_2_S67                       *((volatile unsigned int*)(0x944102D5CUL))
#define bM4_EXMC_ECC_SYND14_2_S68                       *((volatile unsigned int*)(0x944102D60UL))
#define bM4_EXMC_ECC_SYND14_2_S69                       *((volatile unsigned int*)(0x944102D64UL))
#define bM4_EXMC_ECC_SYND14_2_S610                      *((volatile unsigned int*)(0x944102D68UL))
#define bM4_EXMC_ECC_SYND14_2_S611                      *((volatile unsigned int*)(0x944102D6CUL))
#define bM4_EXMC_ECC_SYND14_2_S612                      *((volatile unsigned int*)(0x944102D70UL))
#define bM4_EXMC_ECC_SYND14_2_RESV                      *((volatile unsigned int*)(0x944102D7CUL))
#define bM4_EXMC_ECC_SYND14_3_S70                       *((volatile unsigned int*)(0x944102D80UL))
#define bM4_EXMC_ECC_SYND14_3_S71                       *((volatile unsigned int*)(0x944102D84UL))
#define bM4_EXMC_ECC_SYND14_3_S72                       *((volatile unsigned int*)(0x944102D88UL))
#define bM4_EXMC_ECC_SYND14_3_S73                       *((volatile unsigned int*)(0x944102D8CUL))
#define bM4_EXMC_ECC_SYND14_3_S74                       *((volatile unsigned int*)(0x944102D90UL))
#define bM4_EXMC_ECC_SYND14_3_S75                       *((volatile unsigned int*)(0x944102D94UL))
#define bM4_EXMC_ECC_SYND14_3_S76                       *((volatile unsigned int*)(0x944102D98UL))
#define bM4_EXMC_ECC_SYND14_3_S77                       *((volatile unsigned int*)(0x944102D9CUL))
#define bM4_EXMC_ECC_SYND14_3_S78                       *((volatile unsigned int*)(0x944102DA0UL))
#define bM4_EXMC_ECC_SYND14_3_S79                       *((volatile unsigned int*)(0x944102DA4UL))
#define bM4_EXMC_ECC_SYND14_3_S710                      *((volatile unsigned int*)(0x944102DA8UL))
#define bM4_EXMC_ECC_SYND14_3_S711                      *((volatile unsigned int*)(0x944102DACUL))
#define bM4_EXMC_ECC_SYND14_3_S712                      *((volatile unsigned int*)(0x944102DB0UL))
#define bM4_EXMC_ECC_SYND14_3_S80                       *((volatile unsigned int*)(0x944102DC0UL))
#define bM4_EXMC_ECC_SYND14_3_S81                       *((volatile unsigned int*)(0x944102DC4UL))
#define bM4_EXMC_ECC_SYND14_3_S82                       *((volatile unsigned int*)(0x944102DC8UL))
#define bM4_EXMC_ECC_SYND14_3_S83                       *((volatile unsigned int*)(0x944102DCCUL))
#define bM4_EXMC_ECC_SYND14_3_S84                       *((volatile unsigned int*)(0x944102DD0UL))
#define bM4_EXMC_ECC_SYND14_3_S85                       *((volatile unsigned int*)(0x944102DD4UL))
#define bM4_EXMC_ECC_SYND14_3_S86                       *((volatile unsigned int*)(0x944102DD8UL))
#define bM4_EXMC_ECC_SYND14_3_S87                       *((volatile unsigned int*)(0x944102DDCUL))
#define bM4_EXMC_ECC_SYND14_3_S88                       *((volatile unsigned int*)(0x944102DE0UL))
#define bM4_EXMC_ECC_SYND14_3_S89                       *((volatile unsigned int*)(0x944102DE4UL))
#define bM4_EXMC_ECC_SYND14_3_S810                      *((volatile unsigned int*)(0x944102DE8UL))
#define bM4_EXMC_ECC_SYND14_3_S811                      *((volatile unsigned int*)(0x944102DECUL))
#define bM4_EXMC_ECC_SYND14_3_S812                      *((volatile unsigned int*)(0x944102DF0UL))
#define bM4_EXMC_ECC_SYND14_3_RESV                      *((volatile unsigned int*)(0x944102DFCUL))
#define bM4_EXMC_ECC_SYND15_0_S10                       *((volatile unsigned int*)(0x944102E00UL))
#define bM4_EXMC_ECC_SYND15_0_S11                       *((volatile unsigned int*)(0x944102E04UL))
#define bM4_EXMC_ECC_SYND15_0_S12                       *((volatile unsigned int*)(0x944102E08UL))
#define bM4_EXMC_ECC_SYND15_0_S13                       *((volatile unsigned int*)(0x944102E0CUL))
#define bM4_EXMC_ECC_SYND15_0_S14                       *((volatile unsigned int*)(0x944102E10UL))
#define bM4_EXMC_ECC_SYND15_0_S15                       *((volatile unsigned int*)(0x944102E14UL))
#define bM4_EXMC_ECC_SYND15_0_S16                       *((volatile unsigned int*)(0x944102E18UL))
#define bM4_EXMC_ECC_SYND15_0_S17                       *((volatile unsigned int*)(0x944102E1CUL))
#define bM4_EXMC_ECC_SYND15_0_S18                       *((volatile unsigned int*)(0x944102E20UL))
#define bM4_EXMC_ECC_SYND15_0_S19                       *((volatile unsigned int*)(0x944102E24UL))
#define bM4_EXMC_ECC_SYND15_0_S110                      *((volatile unsigned int*)(0x944102E28UL))
#define bM4_EXMC_ECC_SYND15_0_S111                      *((volatile unsigned int*)(0x944102E2CUL))
#define bM4_EXMC_ECC_SYND15_0_S112                      *((volatile unsigned int*)(0x944102E30UL))
#define bM4_EXMC_ECC_SYND15_0_S20                       *((volatile unsigned int*)(0x944102E40UL))
#define bM4_EXMC_ECC_SYND15_0_S21                       *((volatile unsigned int*)(0x944102E44UL))
#define bM4_EXMC_ECC_SYND15_0_S22                       *((volatile unsigned int*)(0x944102E48UL))
#define bM4_EXMC_ECC_SYND15_0_S23                       *((volatile unsigned int*)(0x944102E4CUL))
#define bM4_EXMC_ECC_SYND15_0_S24                       *((volatile unsigned int*)(0x944102E50UL))
#define bM4_EXMC_ECC_SYND15_0_S25                       *((volatile unsigned int*)(0x944102E54UL))
#define bM4_EXMC_ECC_SYND15_0_S26                       *((volatile unsigned int*)(0x944102E58UL))
#define bM4_EXMC_ECC_SYND15_0_S27                       *((volatile unsigned int*)(0x944102E5CUL))
#define bM4_EXMC_ECC_SYND15_0_S28                       *((volatile unsigned int*)(0x944102E60UL))
#define bM4_EXMC_ECC_SYND15_0_S29                       *((volatile unsigned int*)(0x944102E64UL))
#define bM4_EXMC_ECC_SYND15_0_S210                      *((volatile unsigned int*)(0x944102E68UL))
#define bM4_EXMC_ECC_SYND15_0_S211                      *((volatile unsigned int*)(0x944102E6CUL))
#define bM4_EXMC_ECC_SYND15_0_S212                      *((volatile unsigned int*)(0x944102E70UL))
#define bM4_EXMC_ECC_SYND15_0_RESV                      *((volatile unsigned int*)(0x944102E7CUL))
#define bM4_EXMC_ECC_SYND15_1_S30                       *((volatile unsigned int*)(0x944102E80UL))
#define bM4_EXMC_ECC_SYND15_1_S31                       *((volatile unsigned int*)(0x944102E84UL))
#define bM4_EXMC_ECC_SYND15_1_S32                       *((volatile unsigned int*)(0x944102E88UL))
#define bM4_EXMC_ECC_SYND15_1_S33                       *((volatile unsigned int*)(0x944102E8CUL))
#define bM4_EXMC_ECC_SYND15_1_S34                       *((volatile unsigned int*)(0x944102E90UL))
#define bM4_EXMC_ECC_SYND15_1_S35                       *((volatile unsigned int*)(0x944102E94UL))
#define bM4_EXMC_ECC_SYND15_1_S36                       *((volatile unsigned int*)(0x944102E98UL))
#define bM4_EXMC_ECC_SYND15_1_S37                       *((volatile unsigned int*)(0x944102E9CUL))
#define bM4_EXMC_ECC_SYND15_1_S38                       *((volatile unsigned int*)(0x944102EA0UL))
#define bM4_EXMC_ECC_SYND15_1_S39                       *((volatile unsigned int*)(0x944102EA4UL))
#define bM4_EXMC_ECC_SYND15_1_S310                      *((volatile unsigned int*)(0x944102EA8UL))
#define bM4_EXMC_ECC_SYND15_1_S311                      *((volatile unsigned int*)(0x944102EACUL))
#define bM4_EXMC_ECC_SYND15_1_S312                      *((volatile unsigned int*)(0x944102EB0UL))
#define bM4_EXMC_ECC_SYND15_1_S40                       *((volatile unsigned int*)(0x944102EC0UL))
#define bM4_EXMC_ECC_SYND15_1_S41                       *((volatile unsigned int*)(0x944102EC4UL))
#define bM4_EXMC_ECC_SYND15_1_S42                       *((volatile unsigned int*)(0x944102EC8UL))
#define bM4_EXMC_ECC_SYND15_1_S43                       *((volatile unsigned int*)(0x944102ECCUL))
#define bM4_EXMC_ECC_SYND15_1_S44                       *((volatile unsigned int*)(0x944102ED0UL))
#define bM4_EXMC_ECC_SYND15_1_S45                       *((volatile unsigned int*)(0x944102ED4UL))
#define bM4_EXMC_ECC_SYND15_1_S46                       *((volatile unsigned int*)(0x944102ED8UL))
#define bM4_EXMC_ECC_SYND15_1_S47                       *((volatile unsigned int*)(0x944102EDCUL))
#define bM4_EXMC_ECC_SYND15_1_S48                       *((volatile unsigned int*)(0x944102EE0UL))
#define bM4_EXMC_ECC_SYND15_1_S49                       *((volatile unsigned int*)(0x944102EE4UL))
#define bM4_EXMC_ECC_SYND15_1_S410                      *((volatile unsigned int*)(0x944102EE8UL))
#define bM4_EXMC_ECC_SYND15_1_S411                      *((volatile unsigned int*)(0x944102EECUL))
#define bM4_EXMC_ECC_SYND15_1_S412                      *((volatile unsigned int*)(0x944102EF0UL))
#define bM4_EXMC_ECC_SYND15_1_RESV                      *((volatile unsigned int*)(0x944102EFCUL))
#define bM4_EXMC_ECC_SYND15_2_S50                       *((volatile unsigned int*)(0x944102F00UL))
#define bM4_EXMC_ECC_SYND15_2_S51                       *((volatile unsigned int*)(0x944102F04UL))
#define bM4_EXMC_ECC_SYND15_2_S52                       *((volatile unsigned int*)(0x944102F08UL))
#define bM4_EXMC_ECC_SYND15_2_S53                       *((volatile unsigned int*)(0x944102F0CUL))
#define bM4_EXMC_ECC_SYND15_2_S54                       *((volatile unsigned int*)(0x944102F10UL))
#define bM4_EXMC_ECC_SYND15_2_S55                       *((volatile unsigned int*)(0x944102F14UL))
#define bM4_EXMC_ECC_SYND15_2_S56                       *((volatile unsigned int*)(0x944102F18UL))
#define bM4_EXMC_ECC_SYND15_2_S57                       *((volatile unsigned int*)(0x944102F1CUL))
#define bM4_EXMC_ECC_SYND15_2_S58                       *((volatile unsigned int*)(0x944102F20UL))
#define bM4_EXMC_ECC_SYND15_2_S59                       *((volatile unsigned int*)(0x944102F24UL))
#define bM4_EXMC_ECC_SYND15_2_S510                      *((volatile unsigned int*)(0x944102F28UL))
#define bM4_EXMC_ECC_SYND15_2_S511                      *((volatile unsigned int*)(0x944102F2CUL))
#define bM4_EXMC_ECC_SYND15_2_S512                      *((volatile unsigned int*)(0x944102F30UL))
#define bM4_EXMC_ECC_SYND15_2_S60                       *((volatile unsigned int*)(0x944102F40UL))
#define bM4_EXMC_ECC_SYND15_2_S61                       *((volatile unsigned int*)(0x944102F44UL))
#define bM4_EXMC_ECC_SYND15_2_S62                       *((volatile unsigned int*)(0x944102F48UL))
#define bM4_EXMC_ECC_SYND15_2_S63                       *((volatile unsigned int*)(0x944102F4CUL))
#define bM4_EXMC_ECC_SYND15_2_S64                       *((volatile unsigned int*)(0x944102F50UL))
#define bM4_EXMC_ECC_SYND15_2_S65                       *((volatile unsigned int*)(0x944102F54UL))
#define bM4_EXMC_ECC_SYND15_2_S66                       *((volatile unsigned int*)(0x944102F58UL))
#define bM4_EXMC_ECC_SYND15_2_S67                       *((volatile unsigned int*)(0x944102F5CUL))
#define bM4_EXMC_ECC_SYND15_2_S68                       *((volatile unsigned int*)(0x944102F60UL))
#define bM4_EXMC_ECC_SYND15_2_S69                       *((volatile unsigned int*)(0x944102F64UL))
#define bM4_EXMC_ECC_SYND15_2_S610                      *((volatile unsigned int*)(0x944102F68UL))
#define bM4_EXMC_ECC_SYND15_2_S611                      *((volatile unsigned int*)(0x944102F6CUL))
#define bM4_EXMC_ECC_SYND15_2_S612                      *((volatile unsigned int*)(0x944102F70UL))
#define bM4_EXMC_ECC_SYND15_2_RESV                      *((volatile unsigned int*)(0x944102F7CUL))
#define bM4_EXMC_ECC_SYND15_3_S70                       *((volatile unsigned int*)(0x944102F80UL))
#define bM4_EXMC_ECC_SYND15_3_S71                       *((volatile unsigned int*)(0x944102F84UL))
#define bM4_EXMC_ECC_SYND15_3_S72                       *((volatile unsigned int*)(0x944102F88UL))
#define bM4_EXMC_ECC_SYND15_3_S73                       *((volatile unsigned int*)(0x944102F8CUL))
#define bM4_EXMC_ECC_SYND15_3_S74                       *((volatile unsigned int*)(0x944102F90UL))
#define bM4_EXMC_ECC_SYND15_3_S75                       *((volatile unsigned int*)(0x944102F94UL))
#define bM4_EXMC_ECC_SYND15_3_S76                       *((volatile unsigned int*)(0x944102F98UL))
#define bM4_EXMC_ECC_SYND15_3_S77                       *((volatile unsigned int*)(0x944102F9CUL))
#define bM4_EXMC_ECC_SYND15_3_S78                       *((volatile unsigned int*)(0x944102FA0UL))
#define bM4_EXMC_ECC_SYND15_3_S79                       *((volatile unsigned int*)(0x944102FA4UL))
#define bM4_EXMC_ECC_SYND15_3_S710                      *((volatile unsigned int*)(0x944102FA8UL))
#define bM4_EXMC_ECC_SYND15_3_S711                      *((volatile unsigned int*)(0x944102FACUL))
#define bM4_EXMC_ECC_SYND15_3_S712                      *((volatile unsigned int*)(0x944102FB0UL))
#define bM4_EXMC_ECC_SYND15_3_S80                       *((volatile unsigned int*)(0x944102FC0UL))
#define bM4_EXMC_ECC_SYND15_3_S81                       *((volatile unsigned int*)(0x944102FC4UL))
#define bM4_EXMC_ECC_SYND15_3_S82                       *((volatile unsigned int*)(0x944102FC8UL))
#define bM4_EXMC_ECC_SYND15_3_S83                       *((volatile unsigned int*)(0x944102FCCUL))
#define bM4_EXMC_ECC_SYND15_3_S84                       *((volatile unsigned int*)(0x944102FD0UL))
#define bM4_EXMC_ECC_SYND15_3_S85                       *((volatile unsigned int*)(0x944102FD4UL))
#define bM4_EXMC_ECC_SYND15_3_S86                       *((volatile unsigned int*)(0x944102FD8UL))
#define bM4_EXMC_ECC_SYND15_3_S87                       *((volatile unsigned int*)(0x944102FDCUL))
#define bM4_EXMC_ECC_SYND15_3_S88                       *((volatile unsigned int*)(0x944102FE0UL))
#define bM4_EXMC_ECC_SYND15_3_S89                       *((volatile unsigned int*)(0x944102FE4UL))
#define bM4_EXMC_ECC_SYND15_3_S810                      *((volatile unsigned int*)(0x944102FE8UL))
#define bM4_EXMC_ECC_SYND15_3_S811                      *((volatile unsigned int*)(0x944102FECUL))
#define bM4_EXMC_ECC_SYND15_3_S812                      *((volatile unsigned int*)(0x944102FF0UL))
#define bM4_EXMC_ECC_SYND15_3_RESV                      *((volatile unsigned int*)(0x944102FFCUL))
#define bM4_FCM_STR_START                               *((volatile unsigned int*)(0x42908180UL))
#define bM4_FCM_MCCR_MDIVS0                             *((volatile unsigned int*)(0x42908200UL))
#define bM4_FCM_MCCR_MDIVS1                             *((volatile unsigned int*)(0x42908204UL))
#define bM4_FCM_MCCR_MCKS0                              *((volatile unsigned int*)(0x42908210UL))
#define bM4_FCM_MCCR_MCKS1                              *((volatile unsigned int*)(0x42908214UL))
#define bM4_FCM_MCCR_MCKS2                              *((volatile unsigned int*)(0x42908218UL))
#define bM4_FCM_MCCR_MCKS3                              *((volatile unsigned int*)(0x4290821CUL))
#define bM4_FCM_RCCR_RDIVS0                             *((volatile unsigned int*)(0x42908280UL))
#define bM4_FCM_RCCR_RDIVS1                             *((volatile unsigned int*)(0x42908284UL))
#define bM4_FCM_RCCR_RCKS0                              *((volatile unsigned int*)(0x4290828CUL))
#define bM4_FCM_RCCR_RCKS1                              *((volatile unsigned int*)(0x42908290UL))
#define bM4_FCM_RCCR_RCKS2                              *((volatile unsigned int*)(0x42908294UL))
#define bM4_FCM_RCCR_RCKS3                              *((volatile unsigned int*)(0x42908298UL))
#define bM4_FCM_RCCR_INEXS                              *((volatile unsigned int*)(0x4290829CUL))
#define bM4_FCM_RCCR_DNFS0                              *((volatile unsigned int*)(0x429082A0UL))
#define bM4_FCM_RCCR_DNFS1                              *((volatile unsigned int*)(0x429082A4UL))
#define bM4_FCM_RCCR_EDGES0                             *((volatile unsigned int*)(0x429082B0UL))
#define bM4_FCM_RCCR_EDGES1                             *((volatile unsigned int*)(0x429082B4UL))
#define bM4_FCM_RCCR_EXREFE                             *((volatile unsigned int*)(0x429082BCUL))
#define bM4_FCM_RIER_ERRIE                              *((volatile unsigned int*)(0x42908300UL))
#define bM4_FCM_RIER_MENDIE                             *((volatile unsigned int*)(0x42908304UL))
#define bM4_FCM_RIER_OVFIE                              *((volatile unsigned int*)(0x42908308UL))
#define bM4_FCM_RIER_ERRINTRS                           *((volatile unsigned int*)(0x42908310UL))
#define bM4_FCM_RIER_ERRE                               *((volatile unsigned int*)(0x4290831CUL))
#define bM4_FCM_SR_ERRF                                 *((volatile unsigned int*)(0x42908380UL))
#define bM4_FCM_SR_MENDF                                *((volatile unsigned int*)(0x42908384UL))
#define bM4_FCM_SR_OVF                                  *((volatile unsigned int*)(0x42908388UL))
#define bM4_FCM_CLR_ERRFCLR                             *((volatile unsigned int*)(0x42908400UL))
#define bM4_FCM_CLR_MENDFCLR                            *((volatile unsigned int*)(0x42908404UL))
#define bM4_FCM_CLR_OVFCLR                              *((volatile unsigned int*)(0x42908408UL))
#define bM4_HASH_CR_START                               *((volatile unsigned int*)(0x42108000UL))
#define bM4_HASH_CR_FST_GRP                             *((volatile unsigned int*)(0x42108004UL))
#define bM4_I2C_I2CCR1_SDAM                             *((volatile unsigned int*)(0x42968000UL))
#define bM4_I2C_I2CCR1_SCLM                             *((volatile unsigned int*)(0x42968004UL))
#define bM4_I2C_I2CCR1_SWRST                            *((volatile unsigned int*)(0x42968018UL))
#define bM4_I2C_I2CCR1_PE                               *((volatile unsigned int*)(0x4296801CUL))
#define bM4_I2C_I2CCR1_START                            *((volatile unsigned int*)(0x42968024UL))
#define bM4_I2C_I2CCR1_RESTART                          *((volatile unsigned int*)(0x42968028UL))
#define bM4_I2C_I2CCR1_STOP                             *((volatile unsigned int*)(0x4296802CUL))
#define bM4_I2C_I2CCR1_TRA                              *((volatile unsigned int*)(0x42968034UL))
#define bM4_I2C_I2CCR1_MSL                              *((volatile unsigned int*)(0x42968038UL))
#define bM4_I2C_I2CCR1_BUSY                             *((volatile unsigned int*)(0x4296803CUL))
#define bM4_I2C_I2CCR2_CKDIV0                           *((volatile unsigned int*)(0x42968090UL))
#define bM4_I2C_I2CCR2_CKDIV1                           *((volatile unsigned int*)(0x42968094UL))
#define bM4_I2C_I2CCR2_CKDIV2                           *((volatile unsigned int*)(0x42968098UL))
#define bM4_I2C_I2CCR2_MSLWE                            *((volatile unsigned int*)(0x4296809CUL))
#define bM4_I2C_I2CCR2_TMOUTM                           *((volatile unsigned int*)(0x429680A0UL))
#define bM4_I2C_I2CCR2_LTMOUT                           *((volatile unsigned int*)(0x429680A4UL))
#define bM4_I2C_I2CCR2_HTMOUT                           *((volatile unsigned int*)(0x429680A8UL))
#define bM4_I2C_I2CCR2_DNF0                             *((volatile unsigned int*)(0x429680C0UL))
#define bM4_I2C_I2CCR2_DNF1                             *((volatile unsigned int*)(0x429680C4UL))
#define bM4_I2C_I2CCR2_ACKRF                            *((volatile unsigned int*)(0x429680C8UL))
#define bM4_I2C_I2CCR2_ACK                              *((volatile unsigned int*)(0x429680CCUL))
#define bM4_I2C_I2CCR2_ACKWEN                           *((volatile unsigned int*)(0x429680D0UL))
#define bM4_I2C_I2CCR2_RESV                             *((volatile unsigned int*)(0x429680E0UL))
#define bM4_I2C_I2CCR3_TMOUTEN                          *((volatile unsigned int*)(0x42968100UL))
#define bM4_I2C_I2CCR3_MARLOEN                          *((volatile unsigned int*)(0x42968104UL))
#define bM4_I2C_I2CCR3_NACKAREN                         *((volatile unsigned int*)(0x42968108UL))
