RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_I2C_I2CCR3_DNFEN                            *((volatile unsigned int*)(0x42968114UL))
#define bM4_I2C_I2CCR3_SLADDR0EN                        *((volatile unsigned int*)(0x42968120UL))
#define bM4_I2C_I2CCR3_SLADDR1EN                        *((volatile unsigned int*)(0x42968124UL))
#define bM4_I2C_I2CCR3_SLADDR2EN                        *((volatile unsigned int*)(0x42968128UL))
#define bM4_I2C_I2CCR3_GCEN                             *((volatile unsigned int*)(0x4296812CUL))
#define bM4_I2C_I2CCR3_TMOUTIE                          *((volatile unsigned int*)(0x42968140UL))
#define bM4_I2C_I2CCR3_ARLOIE                           *((volatile unsigned int*)(0x42968144UL))
#define bM4_I2C_I2CCR3_STARTIE                          *((volatile unsigned int*)(0x42968148UL))
#define bM4_I2C_I2CCR3_STOPIE                           *((volatile unsigned int*)(0x4296814CUL))
#define bM4_I2C_I2CCR3_NACKIE                           *((volatile unsigned int*)(0x42968150UL))
#define bM4_I2C_I2CCR3_RFULLIE                          *((volatile unsigned int*)(0x42968154UL))
#define bM4_I2C_I2CCR3_TENDIE                           *((volatile unsigned int*)(0x42968158UL))
#define bM4_I2C_I2CCR3_TEMPTYIE                         *((volatile unsigned int*)(0x4296815CUL))
#define bM4_I2C_I2CCR3_RESV                             *((volatile unsigned int*)(0x42968160UL))
#define bM4_I2C_I2CSR0_SLADDR0F                         *((volatile unsigned int*)(0x42968180UL))
#define bM4_I2C_I2CSR0_SLADDR1F                         *((volatile unsigned int*)(0x42968184UL))
#define bM4_I2C_I2CSR0_SLADDR2F                         *((volatile unsigned int*)(0x42968188UL))
#define bM4_I2C_I2CSR0_GCF                              *((volatile unsigned int*)(0x4296818CUL))
#define bM4_I2C_I2CSLR0_SLADDR0700                      *((volatile unsigned int*)(0x42968200UL))
#define bM4_I2C_I2CSLR0_SLADDR0701                      *((volatile unsigned int*)(0x42968204UL))
#define bM4_I2C_I2CSLR0_SLADDR0702                      *((volatile unsigned int*)(0x42968208UL))
#define bM4_I2C_I2CSLR0_SLADDR0703                      *((volatile unsigned int*)(0x4296820CUL))
#define bM4_I2C_I2CSLR0_SLADDR0704                      *((volatile unsigned int*)(0x42968210UL))
#define bM4_I2C_I2CSLR0_SLADDR0705                      *((volatile unsigned int*)(0x42968214UL))
#define bM4_I2C_I2CSLR0_SLADDR0706                      *((volatile unsigned int*)(0x42968218UL))
#define bM4_I2C_I2CSLR0_SLADDR0707                      *((volatile unsigned int*)(0x4296821CUL))
#define bM4_I2C_I2CSLR0_ADDRMOD0                        *((volatile unsigned int*)(0x42968220UL))
#define bM4_I2C_I2CSLR0_SLADDR01090                     *((volatile unsigned int*)(0x42968224UL))
#define bM4_I2C_I2CSLR0_SLADDR01091                     *((volatile unsigned int*)(0x42968228UL))
#define bM4_I2C_I2CSLR1_SLADDR1700                      *((volatile unsigned int*)(0x42968280UL))
#define bM4_I2C_I2CSLR1_SLADDR1701                      *((volatile unsigned int*)(0x42968284UL))
#define bM4_I2C_I2CSLR1_SLADDR1702                      *((volatile unsigned int*)(0x42968288UL))
#define bM4_I2C_I2CSLR1_SLADDR1703                      *((volatile unsigned int*)(0x4296828CUL))
#define bM4_I2C_I2CSLR1_SLADDR1704                      *((volatile unsigned int*)(0x42968290UL))
#define bM4_I2C_I2CSLR1_SLADDR1705                      *((volatile unsigned int*)(0x42968294UL))
#define bM4_I2C_I2CSLR1_SLADDR1706                      *((volatile unsigned int*)(0x42968298UL))
#define bM4_I2C_I2CSLR1_SLADDR1707                      *((volatile unsigned int*)(0x4296829CUL))
#define bM4_I2C_I2CSLR1_ADDRMOD1                        *((volatile unsigned int*)(0x429682A0UL))
#define bM4_I2C_I2CSLR1_SLADDR11090                     *((volatile unsigned int*)(0x429682A4UL))
#define bM4_I2C_I2CSLR1_SLADDR11091                     *((volatile unsigned int*)(0x429682A8UL))
#define bM4_I2C_I2CSLR2_SLADDR2700                      *((volatile unsigned int*)(0x42968300UL))
#define bM4_I2C_I2CSLR2_SLADDR2701                      *((volatile unsigned int*)(0x42968304UL))
#define bM4_I2C_I2CSLR2_SLADDR2702                      *((volatile unsigned int*)(0x42968308UL))
#define bM4_I2C_I2CSLR2_SLADDR2703                      *((volatile unsigned int*)(0x4296830CUL))
#define bM4_I2C_I2CSLR2_SLADDR2704                      *((volatile unsigned int*)(0x42968310UL))
#define bM4_I2C_I2CSLR2_SLADDR2705                      *((volatile unsigned int*)(0x42968314UL))
#define bM4_I2C_I2CSLR2_SLADDR2706                      *((volatile unsigned int*)(0x42968318UL))
#define bM4_I2C_I2CSLR2_SLADDR2707                      *((volatile unsigned int*)(0x4296831CUL))
#define bM4_I2C_I2CSLR2_ADDRMOD2                        *((volatile unsigned int*)(0x42968320UL))
#define bM4_I2C_I2CSLR2_SLADDR21090                     *((volatile unsigned int*)(0x42968324UL))
#define bM4_I2C_I2CSLR2_SLADDR21091                     *((volatile unsigned int*)(0x42968328UL))
#define bM4_I2C_I2CBR_SLOWW0                            *((volatile unsigned int*)(0x42968380UL))
#define bM4_I2C_I2CBR_SLOWW1                            *((volatile unsigned int*)(0x42968384UL))
#define bM4_I2C_I2CBR_SLOWW2                            *((volatile unsigned int*)(0x42968388UL))
#define bM4_I2C_I2CBR_SLOWW3                            *((volatile unsigned int*)(0x4296838CUL))
#define bM4_I2C_I2CBR_SLOWW4                            *((volatile unsigned int*)(0x42968390UL))
#define bM4_I2C_I2CBR_SHIGHW0                           *((volatile unsigned int*)(0x429683A0UL))
#define bM4_I2C_I2CBR_SHIGHW1                           *((volatile unsigned int*)(0x429683A4UL))
#define bM4_I2C_I2CBR_SHIGHW2                           *((volatile unsigned int*)(0x429683A8UL))
#define bM4_I2C_I2CBR_SHIGHW3                           *((volatile unsigned int*)(0x429683ACUL))
#define bM4_I2C_I2CBR_SHIGHW4                           *((volatile unsigned int*)(0x429683B0UL))
#define bM4_I2C_I2CSR1_TMOUTF                           *((volatile unsigned int*)(0x42968700UL))
#define bM4_I2C_I2CSR1_ARLOF                            *((volatile unsigned int*)(0x42968704UL))
#define bM4_I2C_I2CSR1_STARTF                           *((volatile unsigned int*)(0x42968708UL))
#define bM4_I2C_I2CSR1_STOPF                            *((volatile unsigned int*)(0x4296870CUL))
#define bM4_I2C_I2CSR1_NACKF                            *((volatile unsigned int*)(0x42968710UL))
#define bM4_I2C_I2CSR1_RFULLF                           *((volatile unsigned int*)(0x42968714UL))
#define bM4_I2C_I2CSR1_TENDF                            *((volatile unsigned int*)(0x42968718UL))
#define bM4_I2C_I2CSR1_TEMPTYF                          *((volatile unsigned int*)(0x4296871CUL))
#define bM4_INTC_NMICR_NMITRG                           *((volatile unsigned int*)(0x42A20000UL))
#define bM4_INTC_NMICR_NSMPCLK0                         *((volatile unsigned int*)(0x42A20010UL))
#define bM4_INTC_NMICR_NSMPCLK1                         *((volatile unsigned int*)(0x42A20014UL))
#define bM4_INTC_NMICR_NFEN                             *((volatile unsigned int*)(0x42A2001CUL))
#define bM4_INTC_NMIMR_SWDTMR                           *((volatile unsigned int*)(0x42A20080UL))
#define bM4_INTC_NMIMR_WDTMR                            *((volatile unsigned int*)(0x42A20084UL))
#define bM4_INTC_NMIMR_VDU1MR                           *((volatile unsigned int*)(0x42A20088UL))
#define bM4_INTC_NMIMR_VDU2MR                           *((volatile unsigned int*)(0x42A2008CUL))
#define bM4_INTC_NMIMR_SRCSTMR                          *((volatile unsigned int*)(0x42A20094UL))
#define bM4_INTC_NMIMR_MRCSTMR                          *((volatile unsigned int*)(0x42A20098UL))
#define bM4_INTC_NMIMR_NMIMR                            *((volatile unsigned int*)(0x42A2009CUL))
#define bM4_INTC_NMIMR_RPEMR                            *((volatile unsigned int*)(0x42A200A0UL))
#define bM4_INTC_NMIMR_RDEDMR                           *((volatile unsigned int*)(0x42A200A4UL))
#define bM4_INTC_NMIMR_BUSMMR                           *((volatile unsigned int*)(0x42A200ACUL))
#define bM4_INTC_NMIPR_SWDTPR                           *((volatile unsigned int*)(0x42A20100UL))
#define bM4_INTC_NMIPR_WDTPR                            *((volatile unsigned int*)(0x42A20104UL))
#define bM4_INTC_NMIPR_VDU1PR                           *((volatile unsigned int*)(0x42A20108UL))
#define bM4_INTC_NMIPR_VDU2PR                           *((volatile unsigned int*)(0x42A2010CUL))
#define bM4_INTC_NMIPR_SRCSTPR                          *((volatile unsigned int*)(0x42A20114UL))
#define bM4_INTC_NMIPR_MRCSTPR                          *((volatile unsigned int*)(0x42A20118UL))
#define bM4_INTC_NMIPR_NMIPR                            *((volatile unsigned int*)(0x42A2011CUL))
#define bM4_INTC_NMIPR_RPEPR                            *((volatile unsigned int*)(0x42A20120UL))
#define bM4_INTC_NMIPR_RDEDPR                           *((volatile unsigned int*)(0x42A20124UL))
#define bM4_INTC_NMIPR_BUSMPR                           *((volatile unsigned int*)(0x42A2012CUL))
#define bM4_INTC_NMICPR_SWDTCPR                         *((volatile unsigned int*)(0x42A20180UL))
#define bM4_INTC_NMICPR_WDTCPR                          *((volatile unsigned int*)(0x42A20184UL))
#define bM4_INTC_NMICPR_VDU1CPR                         *((volatile unsigned int*)(0x42A20188UL))
#define bM4_INTC_NMICPR_VDU2CPR                         *((volatile unsigned int*)(0x42A2018CUL))
#define bM4_INTC_NMICPR_SRCSTCPR                        *((volatile unsigned int*)(0x42A20194UL))
#define bM4_INTC_NMICPR_MRCSTCPR                        *((volatile unsigned int*)(0x42A20198UL))
#define bM4_INTC_NMICPR_NMICPR                          *((volatile unsigned int*)(0x42A2019CUL))
#define bM4_INTC_NMICPR_RPECPR                          *((volatile unsigned int*)(0x42A201A0UL))
#define bM4_INTC_NMICPR_RDEDCPR                         *((volatile unsigned int*)(0x42A201A4UL))
#define bM4_INTC_NMICPR_BUSMCPR                         *((volatile unsigned int*)(0x42A201ACUL))
#define bM4_INTC_EIRQCR0_EIRQTRG0                       *((volatile unsigned int*)(0x42A20200UL))
#define bM4_INTC_EIRQCR0_EIRQTRG1                       *((volatile unsigned int*)(0x42A20204UL))
#define bM4_INTC_EIRQCR0_EISMPCLK0                      *((volatile unsigned int*)(0x42A20210UL))
#define bM4_INTC_EIRQCR0_EISMPCLK1                      *((volatile unsigned int*)(0x42A20214UL))
#define bM4_INTC_EIRQCR0_EFEN                           *((volatile unsigned int*)(0x42A2021CUL))
#define bM4_INTC_EIRQCR1_EIRQTRG0                       *((volatile unsigned int*)(0x42A20280UL))
#define bM4_INTC_EIRQCR1_EIRQTRG1                       *((volatile unsigned int*)(0x42A20284UL))
#define bM4_INTC_EIRQCR1_EISMPCLK0                      *((volatile unsigned int*)(0x42A20290UL))
#define bM4_INTC_EIRQCR1_EISMPCLK1                      *((volatile unsigned int*)(0x42A20294UL))
#define bM4_INTC_EIRQCR1_EFEN                           *((volatile unsigned int*)(0x42A2029CUL))
#define bM4_INTC_EIRQCR2_EIRQTRG0                       *((volatile unsigned int*)(0x42A20300UL))
#define bM4_INTC_EIRQCR2_EIRQTRG1                       *((volatile unsigned int*)(0x42A20304UL))
#define bM4_INTC_EIRQCR2_EISMPCLK0                      *((volatile unsigned int*)(0x42A20310UL))
#define bM4_INTC_EIRQCR2_EISMPCLK1                      *((volatile unsigned int*)(0x42A20314UL))
#define bM4_INTC_EIRQCR2_EFEN                           *((volatile unsigned int*)(0x42A2031CUL))
#define bM4_INTC_EIRQCR3_EIRQTRG0                       *((volatile unsigned int*)(0x42A20380UL))
#define bM4_INTC_EIRQCR3_EIRQTRG1                       *((volatile unsigned int*)(0x42A20384UL))
#define bM4_INTC_EIRQCR3_EISMPCLK0                      *((volatile unsigned int*)(0x42A20390UL))
#define bM4_INTC_EIRQCR3_EISMPCLK1                      *((volatile unsigned int*)(0x42A20394UL))
#define bM4_INTC_EIRQCR3_EFEN                           *((volatile unsigned int*)(0x42A2039CUL))
#define bM4_INTC_EIRQCR4_EIRQTRG0                       *((volatile unsigned int*)(0x42A20400UL))
#define bM4_INTC_EIRQCR4_EIRQTRG1                       *((volatile unsigned int*)(0x42A20404UL))
#define bM4_INTC_EIRQCR4_EISMPCLK0                      *((volatile unsigned int*)(0x42A20410UL))
#define bM4_INTC_EIRQCR4_EISMPCLK1                      *((volatile unsigned int*)(0x42A20414UL))
#define bM4_INTC_EIRQCR4_EFEN                           *((volatile unsigned int*)(0x42A2041CUL))
#define bM4_INTC_EIRQCR5_EIRQTRG0                       *((volatile unsigned int*)(0x42A20480UL))
#define bM4_INTC_EIRQCR5_EIRQTRG1                       *((volatile unsigned int*)(0x42A20484UL))
#define bM4_INTC_EIRQCR5_EISMPCLK0                      *((volatile unsigned int*)(0x42A20490UL))
#define bM4_INTC_EIRQCR5_EISMPCLK1                      *((volatile unsigned int*)(0x42A20494UL))
#define bM4_INTC_EIRQCR5_EFEN                           *((volatile unsigned int*)(0x42A2049CUL))
#define bM4_INTC_EIRQCR6_EIRQTRG0                       *((volatile unsigned int*)(0x42A20500UL))
#define bM4_INTC_EIRQCR6_EIRQTRG1                       *((volatile unsigned int*)(0x42A20504UL))
#define bM4_INTC_EIRQCR6_EISMPCLK0                      *((volatile unsigned int*)(0x42A20510UL))
#define bM4_INTC_EIRQCR6_EISMPCLK1                      *((volatile unsigned int*)(0x42A20514UL))
#define bM4_INTC_EIRQCR6_EFEN                           *((volatile unsigned int*)(0x42A2051CUL))
#define bM4_INTC_EIRQCR7_EIRQTRG0                       *((volatile unsigned int*)(0x42A20580UL))
#define bM4_INTC_EIRQCR7_EIRQTRG1                       *((volatile unsigned int*)(0x42A20584UL))
#define bM4_INTC_EIRQCR7_EISMPCLK0                      *((volatile unsigned int*)(0x42A20590UL))
#define bM4_INTC_EIRQCR7_EISMPCLK1                      *((volatile unsigned int*)(0x42A20594UL))
#define bM4_INTC_EIRQCR7_EFEN                           *((volatile unsigned int*)(0x42A2059CUL))
#define bM4_INTC_EIRQCR8_EIRQTRG0                       *((volatile unsigned int*)(0x42A20600UL))
#define bM4_INTC_EIRQCR8_EIRQTRG1                       *((volatile unsigned int*)(0x42A20604UL))
#define bM4_INTC_EIRQCR8_EISMPCLK0                      *((volatile unsigned int*)(0x42A20610UL))
#define bM4_INTC_EIRQCR8_EISMPCLK1                      *((volatile unsigned int*)(0x42A20614UL))
#define bM4_INTC_EIRQCR8_EFEN                           *((volatile unsigned int*)(0x42A2061CUL))
#define bM4_INTC_EIRQCR9_EIRQTRG0                       *((volatile unsigned int*)(0x42A20680UL))
#define bM4_INTC_EIRQCR9_EIRQTRG1                       *((volatile unsigned int*)(0x42A20684UL))
#define bM4_INTC_EIRQCR9_EISMPCLK0                      *((volatile unsigned int*)(0x42A20690UL))
#define bM4_INTC_EIRQCR9_EISMPCLK1                      *((volatile unsigned int*)(0x42A20694UL))
#define bM4_INTC_EIRQCR9_EFEN                           *((volatile unsigned int*)(0x42A2069CUL))
#define bM4_INTC_EIRQCR10_EIRQTRG0                      *((volatile unsigned int*)(0x42A20700UL))
#define bM4_INTC_EIRQCR10_EIRQTRG1                      *((volatile unsigned int*)(0x42A20704UL))
#define bM4_INTC_EIRQCR10_EISMPCLK0                     *((volatile unsigned int*)(0x42A20710UL))
#define bM4_INTC_EIRQCR10_EISMPCLK1                     *((volatile unsigned int*)(0x42A20714UL))
#define bM4_INTC_EIRQCR10_EFEN                          *((volatile unsigned int*)(0x42A2071CUL))
#define bM4_INTC_EIRQCR11_EIRQTRG0                      *((volatile unsigned int*)(0x42A20780UL))
#define bM4_INTC_EIRQCR11_EIRQTRG1                      *((volatile unsigned int*)(0x42A20784UL))
#define bM4_INTC_EIRQCR11_EISMPCLK0                     *((volatile unsigned int*)(0x42A20790UL))
#define bM4_INTC_EIRQCR11_EISMPCLK1                     *((volatile unsigned int*)(0x42A20794UL))
#define bM4_INTC_EIRQCR11_EFEN                          *((volatile unsigned int*)(0x42A2079CUL))
#define bM4_INTC_EIRQCR12_EIRQTRG0                      *((volatile unsigned int*)(0x42A20800UL))
#define bM4_INTC_EIRQCR12_EIRQTRG1                      *((volatile unsigned int*)(0x42A20804UL))
#define bM4_INTC_EIRQCR12_EISMPCLK0                     *((volatile unsigned int*)(0x42A20810UL))
#define bM4_INTC_EIRQCR12_EISMPCLK1                     *((volatile unsigned int*)(0x42A20814UL))
#define bM4_INTC_EIRQCR12_EFEN                          *((volatile unsigned int*)(0x42A2081CUL))
#define bM4_INTC_EIRQCR13_EIRQTRG0                      *((volatile unsigned int*)(0x42A20880UL))
#define bM4_INTC_EIRQCR13_EIRQTRG1                      *((volatile unsigned int*)(0x42A20884UL))
#define bM4_INTC_EIRQCR13_EISMPCLK0                     *((volatile unsigned int*)(0x42A20890UL))
#define bM4_INTC_EIRQCR13_EISMPCLK1                     *((volatile unsigned int*)(0x42A20894UL))
#define bM4_INTC_EIRQCR13_EFEN                          *((volatile unsigned int*)(0x42A2089CUL))
#define bM4_INTC_EIRQCR14_EIRQTRG0                      *((volatile unsigned int*)(0x42A20900UL))
#define bM4_INTC_EIRQCR14_EIRQTRG1                      *((volatile unsigned int*)(0x42A20904UL))
#define bM4_INTC_EIRQCR14_EISMPCLK0                     *((volatile unsigned int*)(0x42A20910UL))
#define bM4_INTC_EIRQCR14_EISMPCLK1                     *((volatile unsigned int*)(0x42A20914UL))
#define bM4_INTC_EIRQCR14_EFEN                          *((volatile unsigned int*)(0x42A2091CUL))
#define bM4_INTC_EIRQCR15_EIRQTRG0                      *((volatile unsigned int*)(0x42A20980UL))
#define bM4_INTC_EIRQCR15_EIRQTRG1                      *((volatile unsigned int*)(0x42A20984UL))
#define bM4_INTC_EIRQCR15_EISMPCLK0                     *((volatile unsigned int*)(0x42A20990UL))
#define bM4_INTC_EIRQCR15_EISMPCLK1                     *((volatile unsigned int*)(0x42A20994UL))
#define bM4_INTC_EIRQCR15_EFEN                          *((volatile unsigned int*)(0x42A2099CUL))
#define bM4_INTC_WUPEN_EIRQWUEN0                        *((volatile unsigned int*)(0x42A20A00UL))
#define bM4_INTC_WUPEN_EIRQWUEN1                        *((volatile unsigned int*)(0x42A20A04UL))
#define bM4_INTC_WUPEN_EIRQWUEN2                        *((volatile unsigned int*)(0x42A20A08UL))
#define bM4_INTC_WUPEN_EIRQWUEN3                        *((volatile unsigned int*)(0x42A20A0CUL))
#define bM4_INTC_WUPEN_EIRQWUEN4                        *((volatile unsigned int*)(0x42A20A10UL))
#define bM4_INTC_WUPEN_EIRQWUEN5                        *((volatile unsigned int*)(0x42A20A14UL))
#define bM4_INTC_WUPEN_EIRQWUEN6                        *((volatile unsigned int*)(0x42A20A18UL))
#define bM4_INTC_WUPEN_EIRQWUEN7                        *((volatile unsigned int*)(0x42A20A1CUL))
#define bM4_INTC_WUPEN_EIRQWUEN8                        *((volatile unsigned int*)(0x42A20A20UL))
#define bM4_INTC_WUPEN_EIRQWUEN9                        *((volatile unsigned int*)(0x42A20A24UL))
#define bM4_INTC_WUPEN_EIRQWUEN10                       *((volatile unsigned int*)(0x42A20A28UL))
#define bM4_INTC_WUPEN_EIRQWUEN11                       *((volatile unsigned int*)(0x42A20A2CUL))
#define bM4_INTC_WUPEN_EIRQWUEN12                       *((volatile unsigned int*)(0x42A20A30UL))
#define bM4_INTC_WUPEN_EIRQWUEN13                       *((volatile unsigned int*)(0x42A20A34UL))
#define bM4_INTC_WUPEN_EIRQWUEN14                       *((volatile unsigned int*)(0x42A20A38UL))
#define bM4_INTC_WUPEN_EIRQWUEN15                       *((volatile unsigned int*)(0x42A20A3CUL))
#define bM4_INTC_WUPEN_SWDTWUEN                         *((volatile unsigned int*)(0x42A20A40UL))
#define bM4_INTC_WUPEN_VDU1WUEN                         *((volatile unsigned int*)(0x42A20A48UL))
#define bM4_INTC_WUPEN_VDU2WUEN                         *((volatile unsigned int*)(0x42A20A4CUL))
#define bM4_INTC_WUPEN_CMPI0WUEN                        *((volatile unsigned int*)(0x42A20A58UL))
#define bM4_INTC_WUPEN_WKTMWUEN                         *((volatile unsigned int*)(0x42A20A5CUL))
#define bM4_INTC_WUPEN_RTCALMWUEN                       *((volatile unsigned int*)(0x42A20A60UL))
#define bM4_INTC_WUPEN_RTCPRDWUEN                       *((volatile unsigned int*)(0x42A20A64UL))
#define bM4_INTC_WUPEN_TMR0WUEN                         *((volatile unsigned int*)(0x42A20A70UL))
#define bM4_INTC_WUPEN_TMR2WUEN                         *((volatile unsigned int*)(0x42A20A74UL))
#define bM4_INTC_WUPEN_SCIWUEN                          *((volatile unsigned int*)(0x42A20A78UL))
#define bM4_INTC_WUPEN_IICWUEN                          *((volatile unsigned int*)(0x42A20A7CUL))
#define bM4_INTC_INTSEL0_INTSEL0                        *((volatile unsigned int*)(0x42A20B80UL))
#define bM4_INTC_INTSEL0_INTSEL1                        *((volatile unsigned int*)(0x42A20B84UL))
#define bM4_INTC_INTSEL0_INTSEL2                        *((volatile unsigned int*)(0x42A20B88UL))
#define bM4_INTC_INTSEL0_INTSEL3                        *((volatile unsigned int*)(0x42A20B8CUL))
#define bM4_INTC_INTSEL0_INTSEL4                        *((volatile unsigned int*)(0x42A20B90UL))
#define bM4_INTC_INTSEL0_INTSEL5                        *((volatile unsigned int*)(0x42A20B94UL))
#define bM4_INTC_INTSEL0_INTSEL6                        *((volatile unsigned int*)(0x42A20B98UL))
#define bM4_INTC_INTSEL0_INTSEL7                        *((volatile unsigned int*)(0x42A20B9CUL))
#define bM4_INTC_INTSEL0_INTSEL8                        *((volatile unsigned int*)(0x42A20BA0UL))
#define bM4_INTC_INTSEL1_INTSEL0                        *((volatile unsigned int*)(0x42A20C00UL))
#define bM4_INTC_INTSEL1_INTSEL1                        *((volatile unsigned int*)(0x42A20C04UL))
#define bM4_INTC_INTSEL1_INTSEL2                        *((volatile unsigned int*)(0x42A20C08UL))
#define bM4_INTC_INTSEL1_INTSEL3                        *((volatile unsigned int*)(0x42A20C0CUL))
#define bM4_INTC_INTSEL1_INTSEL4                        *((volatile unsigned int*)(0x42A20C10UL))
#define bM4_INTC_INTSEL1_INTSEL5                        *((volatile unsigned int*)(0x42A20C14UL))
#define bM4_INTC_INTSEL1_INTSEL6                        *((volatile unsigned int*)(0x42A20C18UL))
#define bM4_INTC_INTSEL1_INTSEL7                        *((volatile unsigned int*)(0x42A20C1CUL))
#define bM4_INTC_INTSEL1_INTSEL8                        *((volatile unsigned int*)(0x42A20C20UL))
#define bM4_INTC_INTSEL2_INTSEL0                        *((volatile unsigned int*)(0x42A20C80UL))
#define bM4_INTC_INTSEL2_INTSEL1                        *((volatile unsigned int*)(0x42A20C84UL))
#define bM4_INTC_INTSEL2_INTSEL2                        *((volatile unsigned int*)(0x42A20C88UL))
#define bM4_INTC_INTSEL2_INTSEL3                        *((volatile unsigned int*)(0x42A20C8CUL))
#define bM4_INTC_INTSEL2_INTSEL4                        *((volatile unsigned int*)(0x42A20C90UL))
#define bM4_INTC_INTSEL2_INTSEL5                        *((volatile unsigned int*)(0x42A20C94UL))
#define bM4_INTC_INTSEL2_INTSEL6                        *((volatile unsigned int*)(0x42A20C98UL))
#define bM4_INTC_INTSEL2_INTSEL7                        *((volatile unsigned int*)(0x42A20C9CUL))
#define bM4_INTC_INTSEL2_INTSEL8                        *((volatile unsigned int*)(0x42A20CA0UL))
#define bM4_INTC_INTSEL3_INTSEL0                        *((volatile unsigned int*)(0x42A20D00UL))
#define bM4_INTC_INTSEL3_INTSEL1                        *((volatile unsigned int*)(0x42A20D04UL))
#define bM4_INTC_INTSEL3_INTSEL2                        *((volatile unsigned int*)(0x42A20D08UL))
#define bM4_INTC_INTSEL3_INTSEL3                        *((volatile unsigned int*)(0x42A20D0CUL))
#define bM4_INTC_INTSEL3_INTSEL4                        *((volatile unsigned int*)(0x42A20D10UL))
#define bM4_INTC_INTSEL3_INTSEL5                        *((volatile unsigned int*)(0x42A20D14UL))
#define bM4_INTC_INTSEL3_INTSEL6                        *((volatile unsigned int*)(0x42A20D18UL))
