RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_INTC_INTSEL3_INTSEL7                        *((volatile unsigned int*)(0x42A20D1CUL))
#define bM4_INTC_INTSEL3_INTSEL8                        *((volatile unsigned int*)(0x42A20D20UL))
#define bM4_INTC_INTSEL4_INTSEL0                        *((volatile unsigned int*)(0x42A20D80UL))
#define bM4_INTC_INTSEL4_INTSEL1                        *((volatile unsigned int*)(0x42A20D84UL))
#define bM4_INTC_INTSEL4_INTSEL2                        *((volatile unsigned int*)(0x42A20D88UL))
#define bM4_INTC_INTSEL4_INTSEL3                        *((volatile unsigned int*)(0x42A20D8CUL))
#define bM4_INTC_INTSEL4_INTSEL4                        *((volatile unsigned int*)(0x42A20D90UL))
#define bM4_INTC_INTSEL4_INTSEL5                        *((volatile unsigned int*)(0x42A20D94UL))
#define bM4_INTC_INTSEL4_INTSEL6                        *((volatile unsigned int*)(0x42A20D98UL))
#define bM4_INTC_INTSEL4_INTSEL7                        *((volatile unsigned int*)(0x42A20D9CUL))
#define bM4_INTC_INTSEL4_INTSEL8                        *((volatile unsigned int*)(0x42A20DA0UL))
#define bM4_INTC_INTSEL5_INTSEL0                        *((volatile unsigned int*)(0x42A20E00UL))
#define bM4_INTC_INTSEL5_INTSEL1                        *((volatile unsigned int*)(0x42A20E04UL))
#define bM4_INTC_INTSEL5_INTSEL2                        *((volatile unsigned int*)(0x42A20E08UL))
#define bM4_INTC_INTSEL5_INTSEL3                        *((volatile unsigned int*)(0x42A20E0CUL))
#define bM4_INTC_INTSEL5_INTSEL4                        *((volatile unsigned int*)(0x42A20E10UL))
#define bM4_INTC_INTSEL5_INTSEL5                        *((volatile unsigned int*)(0x42A20E14UL))
#define bM4_INTC_INTSEL5_INTSEL6                        *((volatile unsigned int*)(0x42A20E18UL))
#define bM4_INTC_INTSEL5_INTSEL7                        *((volatile unsigned int*)(0x42A20E1CUL))
#define bM4_INTC_INTSEL5_INTSEL8                        *((volatile unsigned int*)(0x42A20E20UL))
#define bM4_INTC_INTSEL6_INTSEL0                        *((volatile unsigned int*)(0x42A20E80UL))
#define bM4_INTC_INTSEL6_INTSEL1                        *((volatile unsigned int*)(0x42A20E84UL))
#define bM4_INTC_INTSEL6_INTSEL2                        *((volatile unsigned int*)(0x42A20E88UL))
#define bM4_INTC_INTSEL6_INTSEL3                        *((volatile unsigned int*)(0x42A20E8CUL))
#define bM4_INTC_INTSEL6_INTSEL4                        *((volatile unsigned int*)(0x42A20E90UL))
#define bM4_INTC_INTSEL6_INTSEL5                        *((volatile unsigned int*)(0x42A20E94UL))
#define bM4_INTC_INTSEL6_INTSEL6                        *((volatile unsigned int*)(0x42A20E98UL))
#define bM4_INTC_INTSEL6_INTSEL7                        *((volatile unsigned int*)(0x42A20E9CUL))
#define bM4_INTC_INTSEL6_INTSEL8                        *((volatile unsigned int*)(0x42A20EA0UL))
#define bM4_INTC_INTSEL7_INTSEL0                        *((volatile unsigned int*)(0x42A20F00UL))
#define bM4_INTC_INTSEL7_INTSEL1                        *((volatile unsigned int*)(0x42A20F04UL))
#define bM4_INTC_INTSEL7_INTSEL2                        *((volatile unsigned int*)(0x42A20F08UL))
#define bM4_INTC_INTSEL7_INTSEL3                        *((volatile unsigned int*)(0x42A20F0CUL))
#define bM4_INTC_INTSEL7_INTSEL4                        *((volatile unsigned int*)(0x42A20F10UL))
#define bM4_INTC_INTSEL7_INTSEL5                        *((volatile unsigned int*)(0x42A20F14UL))
#define bM4_INTC_INTSEL7_INTSEL6                        *((volatile unsigned int*)(0x42A20F18UL))
#define bM4_INTC_INTSEL7_INTSEL7                        *((volatile unsigned int*)(0x42A20F1CUL))
#define bM4_INTC_INTSEL7_INTSEL8                        *((volatile unsigned int*)(0x42A20F20UL))
#define bM4_INTC_INTSEL8_INTSEL0                        *((volatile unsigned int*)(0x42A20F80UL))
#define bM4_INTC_INTSEL8_INTSEL1                        *((volatile unsigned int*)(0x42A20F84UL))
#define bM4_INTC_INTSEL8_INTSEL2                        *((volatile unsigned int*)(0x42A20F88UL))
#define bM4_INTC_INTSEL8_INTSEL3                        *((volatile unsigned int*)(0x42A20F8CUL))
#define bM4_INTC_INTSEL8_INTSEL4                        *((volatile unsigned int*)(0x42A20F90UL))
#define bM4_INTC_INTSEL8_INTSEL5                        *((volatile unsigned int*)(0x42A20F94UL))
#define bM4_INTC_INTSEL8_INTSEL6                        *((volatile unsigned int*)(0x42A20F98UL))
#define bM4_INTC_INTSEL8_INTSEL7                        *((volatile unsigned int*)(0x42A20F9CUL))
#define bM4_INTC_INTSEL8_INTSEL8                        *((volatile unsigned int*)(0x42A20FA0UL))
#define bM4_INTC_INTSEL9_INTSEL0                        *((volatile unsigned int*)(0x42A21000UL))
#define bM4_INTC_INTSEL9_INTSEL1                        *((volatile unsigned int*)(0x42A21004UL))
#define bM4_INTC_INTSEL9_INTSEL2                        *((volatile unsigned int*)(0x42A21008UL))
#define bM4_INTC_INTSEL9_INTSEL3                        *((volatile unsigned int*)(0x42A2100CUL))
#define bM4_INTC_INTSEL9_INTSEL4                        *((volatile unsigned int*)(0x42A21010UL))
#define bM4_INTC_INTSEL9_INTSEL5                        *((volatile unsigned int*)(0x42A21014UL))
#define bM4_INTC_INTSEL9_INTSEL6                        *((volatile unsigned int*)(0x42A21018UL))
#define bM4_INTC_INTSEL9_INTSEL7                        *((volatile unsigned int*)(0x42A2101CUL))
#define bM4_INTC_INTSEL9_INTSEL8                        *((volatile unsigned int*)(0x42A21020UL))
#define bM4_INTC_INTSEL10_INTSEL0                       *((volatile unsigned int*)(0x42A21080UL))
#define bM4_INTC_INTSEL10_INTSEL1                       *((volatile unsigned int*)(0x42A21084UL))
#define bM4_INTC_INTSEL10_INTSEL2                       *((volatile unsigned int*)(0x42A21088UL))
#define bM4_INTC_INTSEL10_INTSEL3                       *((volatile unsigned int*)(0x42A2108CUL))
#define bM4_INTC_INTSEL10_INTSEL4                       *((volatile unsigned int*)(0x42A21090UL))
#define bM4_INTC_INTSEL10_INTSEL5                       *((volatile unsigned int*)(0x42A21094UL))
#define bM4_INTC_INTSEL10_INTSEL6                       *((volatile unsigned int*)(0x42A21098UL))
#define bM4_INTC_INTSEL10_INTSEL7                       *((volatile unsigned int*)(0x42A2109CUL))
#define bM4_INTC_INTSEL10_INTSEL8                       *((volatile unsigned int*)(0x42A210A0UL))
#define bM4_INTC_INTSEL11_INTSEL0                       *((volatile unsigned int*)(0x42A21100UL))
#define bM4_INTC_INTSEL11_INTSEL1                       *((volatile unsigned int*)(0x42A21104UL))
#define bM4_INTC_INTSEL11_INTSEL2                       *((volatile unsigned int*)(0x42A21108UL))
#define bM4_INTC_INTSEL11_INTSEL3                       *((volatile unsigned int*)(0x42A2110CUL))
#define bM4_INTC_INTSEL11_INTSEL4                       *((volatile unsigned int*)(0x42A21110UL))
#define bM4_INTC_INTSEL11_INTSEL5                       *((volatile unsigned int*)(0x42A21114UL))
#define bM4_INTC_INTSEL11_INTSEL6                       *((volatile unsigned int*)(0x42A21118UL))
#define bM4_INTC_INTSEL11_INTSEL7                       *((volatile unsigned int*)(0x42A2111CUL))
#define bM4_INTC_INTSEL11_INTSEL8                       *((volatile unsigned int*)(0x42A21120UL))
#define bM4_INTC_INTSEL12_INTSEL0                       *((volatile unsigned int*)(0x42A21180UL))
#define bM4_INTC_INTSEL12_INTSEL1                       *((volatile unsigned int*)(0x42A21184UL))
#define bM4_INTC_INTSEL12_INTSEL2                       *((volatile unsigned int*)(0x42A21188UL))
#define bM4_INTC_INTSEL12_INTSEL3                       *((volatile unsigned int*)(0x42A2118CUL))
#define bM4_INTC_INTSEL12_INTSEL4                       *((volatile unsigned int*)(0x42A21190UL))
#define bM4_INTC_INTSEL12_INTSEL5                       *((volatile unsigned int*)(0x42A21194UL))
#define bM4_INTC_INTSEL12_INTSEL6                       *((volatile unsigned int*)(0x42A21198UL))
#define bM4_INTC_INTSEL12_INTSEL7                       *((volatile unsigned int*)(0x42A2119CUL))
#define bM4_INTC_INTSEL12_INTSEL8                       *((volatile unsigned int*)(0x42A211A0UL))
#define bM4_INTC_INTSEL13_INTSEL0                       *((volatile unsigned int*)(0x42A21200UL))
#define bM4_INTC_INTSEL13_INTSEL1                       *((volatile unsigned int*)(0x42A21204UL))
#define bM4_INTC_INTSEL13_INTSEL2                       *((volatile unsigned int*)(0x42A21208UL))
#define bM4_INTC_INTSEL13_INTSEL3                       *((volatile unsigned int*)(0x42A2120CUL))
#define bM4_INTC_INTSEL13_INTSEL4                       *((volatile unsigned int*)(0x42A21210UL))
#define bM4_INTC_INTSEL13_INTSEL5                       *((volatile unsigned int*)(0x42A21214UL))
#define bM4_INTC_INTSEL13_INTSEL6                       *((volatile unsigned int*)(0x42A21218UL))
#define bM4_INTC_INTSEL13_INTSEL7                       *((volatile unsigned int*)(0x42A2121CUL))
#define bM4_INTC_INTSEL13_INTSEL8                       *((volatile unsigned int*)(0x42A21220UL))
#define bM4_INTC_INTSEL14_INTSEL0                       *((volatile unsigned int*)(0x42A21280UL))
#define bM4_INTC_INTSEL14_INTSEL1                       *((volatile unsigned int*)(0x42A21284UL))
#define bM4_INTC_INTSEL14_INTSEL2                       *((volatile unsigned int*)(0x42A21288UL))
#define bM4_INTC_INTSEL14_INTSEL3                       *((volatile unsigned int*)(0x42A2128CUL))
#define bM4_INTC_INTSEL14_INTSEL4                       *((volatile unsigned int*)(0x42A21290UL))
#define bM4_INTC_INTSEL14_INTSEL5                       *((volatile unsigned int*)(0x42A21294UL))
#define bM4_INTC_INTSEL14_INTSEL6                       *((volatile unsigned int*)(0x42A21298UL))
#define bM4_INTC_INTSEL14_INTSEL7                       *((volatile unsigned int*)(0x42A2129CUL))
#define bM4_INTC_INTSEL14_INTSEL8                       *((volatile unsigned int*)(0x42A212A0UL))
#define bM4_INTC_INTSEL15_INTSEL0                       *((volatile unsigned int*)(0x42A21300UL))
#define bM4_INTC_INTSEL15_INTSEL1                       *((volatile unsigned int*)(0x42A21304UL))
#define bM4_INTC_INTSEL15_INTSEL2                       *((volatile unsigned int*)(0x42A21308UL))
#define bM4_INTC_INTSEL15_INTSEL3                       *((volatile unsigned int*)(0x42A2130CUL))
#define bM4_INTC_INTSEL15_INTSEL4                       *((volatile unsigned int*)(0x42A21310UL))
#define bM4_INTC_INTSEL15_INTSEL5                       *((volatile unsigned int*)(0x42A21314UL))
#define bM4_INTC_INTSEL15_INTSEL6                       *((volatile unsigned int*)(0x42A21318UL))
#define bM4_INTC_INTSEL15_INTSEL7                       *((volatile unsigned int*)(0x42A2131CUL))
#define bM4_INTC_INTSEL15_INTSEL8                       *((volatile unsigned int*)(0x42A21320UL))
#define bM4_INTC_INTSEL16_INTSEL0                       *((volatile unsigned int*)(0x42A21380UL))
#define bM4_INTC_INTSEL16_INTSEL1                       *((volatile unsigned int*)(0x42A21384UL))
#define bM4_INTC_INTSEL16_INTSEL2                       *((volatile unsigned int*)(0x42A21388UL))
#define bM4_INTC_INTSEL16_INTSEL3                       *((volatile unsigned int*)(0x42A2138CUL))
#define bM4_INTC_INTSEL16_INTSEL4                       *((volatile unsigned int*)(0x42A21390UL))
#define bM4_INTC_INTSEL16_INTSEL5                       *((volatile unsigned int*)(0x42A21394UL))
#define bM4_INTC_INTSEL16_INTSEL6                       *((volatile unsigned int*)(0x42A21398UL))
#define bM4_INTC_INTSEL16_INTSEL7                       *((volatile unsigned int*)(0x42A2139CUL))
#define bM4_INTC_INTSEL16_INTSEL8                       *((volatile unsigned int*)(0x42A213A0UL))
#define bM4_INTC_INTSEL17_INTSEL0                       *((volatile unsigned int*)(0x42A21400UL))
#define bM4_INTC_INTSEL17_INTSEL1                       *((volatile unsigned int*)(0x42A21404UL))
#define bM4_INTC_INTSEL17_INTSEL2                       *((volatile unsigned int*)(0x42A21408UL))
#define bM4_INTC_INTSEL17_INTSEL3                       *((volatile unsigned int*)(0x42A2140CUL))
#define bM4_INTC_INTSEL17_INTSEL4                       *((volatile unsigned int*)(0x42A21410UL))
#define bM4_INTC_INTSEL17_INTSEL5                       *((volatile unsigned int*)(0x42A21414UL))
#define bM4_INTC_INTSEL17_INTSEL6                       *((volatile unsigned int*)(0x42A21418UL))
#define bM4_INTC_INTSEL17_INTSEL7                       *((volatile unsigned int*)(0x42A2141CUL))
#define bM4_INTC_INTSEL17_INTSEL8                       *((volatile unsigned int*)(0x42A21420UL))
#define bM4_INTC_INTSEL18_INTSEL0                       *((volatile unsigned int*)(0x42A21480UL))
#define bM4_INTC_INTSEL18_INTSEL1                       *((volatile unsigned int*)(0x42A21484UL))
#define bM4_INTC_INTSEL18_INTSEL2                       *((volatile unsigned int*)(0x42A21488UL))
#define bM4_INTC_INTSEL18_INTSEL3                       *((volatile unsigned int*)(0x42A2148CUL))
#define bM4_INTC_INTSEL18_INTSEL4                       *((volatile unsigned int*)(0x42A21490UL))
#define bM4_INTC_INTSEL18_INTSEL5                       *((volatile unsigned int*)(0x42A21494UL))
#define bM4_INTC_INTSEL18_INTSEL6                       *((volatile unsigned int*)(0x42A21498UL))
#define bM4_INTC_INTSEL18_INTSEL7                       *((volatile unsigned int*)(0x42A2149CUL))
#define bM4_INTC_INTSEL18_INTSEL8                       *((volatile unsigned int*)(0x42A214A0UL))
#define bM4_INTC_INTSEL19_INTSEL0                       *((volatile unsigned int*)(0x42A21500UL))
#define bM4_INTC_INTSEL19_INTSEL1                       *((volatile unsigned int*)(0x42A21504UL))
#define bM4_INTC_INTSEL19_INTSEL2                       *((volatile unsigned int*)(0x42A21508UL))
#define bM4_INTC_INTSEL19_INTSEL3                       *((volatile unsigned int*)(0x42A2150CUL))
#define bM4_INTC_INTSEL19_INTSEL4                       *((volatile unsigned int*)(0x42A21510UL))
#define bM4_INTC_INTSEL19_INTSEL5                       *((volatile unsigned int*)(0x42A21514UL))
#define bM4_INTC_INTSEL19_INTSEL6                       *((volatile unsigned int*)(0x42A21518UL))
#define bM4_INTC_INTSEL19_INTSEL7                       *((volatile unsigned int*)(0x42A2151CUL))
#define bM4_INTC_INTSEL19_INTSEL8                       *((volatile unsigned int*)(0x42A21520UL))
#define bM4_INTC_INTSEL20_INTSEL0                       *((volatile unsigned int*)(0x42A21580UL))
#define bM4_INTC_INTSEL20_INTSEL1                       *((volatile unsigned int*)(0x42A21584UL))
#define bM4_INTC_INTSEL20_INTSEL2                       *((volatile unsigned int*)(0x42A21588UL))
#define bM4_INTC_INTSEL20_INTSEL3                       *((volatile unsigned int*)(0x42A2158CUL))
#define bM4_INTC_INTSEL20_INTSEL4                       *((volatile unsigned int*)(0x42A21590UL))
#define bM4_INTC_INTSEL20_INTSEL5                       *((volatile unsigned int*)(0x42A21594UL))
#define bM4_INTC_INTSEL20_INTSEL6                       *((volatile unsigned int*)(0x42A21598UL))
#define bM4_INTC_INTSEL20_INTSEL7                       *((volatile unsigned int*)(0x42A2159CUL))
#define bM4_INTC_INTSEL20_INTSEL8                       *((volatile unsigned int*)(0x42A215A0UL))
#define bM4_INTC_INTSEL21_INTSEL0                       *((volatile unsigned int*)(0x42A21600UL))
#define bM4_INTC_INTSEL21_INTSEL1                       *((volatile unsigned int*)(0x42A21604UL))
#define bM4_INTC_INTSEL21_INTSEL2                       *((volatile unsigned int*)(0x42A21608UL))
#define bM4_INTC_INTSEL21_INTSEL3                       *((volatile unsigned int*)(0x42A2160CUL))
#define bM4_INTC_INTSEL21_INTSEL4                       *((volatile unsigned int*)(0x42A21610UL))
#define bM4_INTC_INTSEL21_INTSEL5                       *((volatile unsigned int*)(0x42A21614UL))
#define bM4_INTC_INTSEL21_INTSEL6                       *((volatile unsigned int*)(0x42A21618UL))
#define bM4_INTC_INTSEL21_INTSEL7                       *((volatile unsigned int*)(0x42A2161CUL))
#define bM4_INTC_INTSEL21_INTSEL8                       *((volatile unsigned int*)(0x42A21620UL))
#define bM4_INTC_INTSEL22_INTSEL0                       *((volatile unsigned int*)(0x42A21680UL))
#define bM4_INTC_INTSEL22_INTSEL1                       *((volatile unsigned int*)(0x42A21684UL))
#define bM4_INTC_INTSEL22_INTSEL2                       *((volatile unsigned int*)(0x42A21688UL))
#define bM4_INTC_INTSEL22_INTSEL3                       *((volatile unsigned int*)(0x42A2168CUL))
#define bM4_INTC_INTSEL22_INTSEL4                       *((volatile unsigned int*)(0x42A21690UL))
#define bM4_INTC_INTSEL22_INTSEL5                       *((volatile unsigned int*)(0x42A21694UL))
#define bM4_INTC_INTSEL22_INTSEL6                       *((volatile unsigned int*)(0x42A21698UL))
#define bM4_INTC_INTSEL22_INTSEL7                       *((volatile unsigned int*)(0x42A2169CUL))
#define bM4_INTC_INTSEL22_INTSEL8                       *((volatile unsigned int*)(0x42A216A0UL))
#define bM4_INTC_INTSEL23_INTSEL0                       *((volatile unsigned int*)(0x42A21700UL))
#define bM4_INTC_INTSEL23_INTSEL1                       *((volatile unsigned int*)(0x42A21704UL))
#define bM4_INTC_INTSEL23_INTSEL2                       *((volatile unsigned int*)(0x42A21708UL))
#define bM4_INTC_INTSEL23_INTSEL3                       *((volatile unsigned int*)(0x42A2170CUL))
#define bM4_INTC_INTSEL23_INTSEL4                       *((volatile unsigned int*)(0x42A21710UL))
#define bM4_INTC_INTSEL23_INTSEL5                       *((volatile unsigned int*)(0x42A21714UL))
#define bM4_INTC_INTSEL23_INTSEL6                       *((volatile unsigned int*)(0x42A21718UL))
#define bM4_INTC_INTSEL23_INTSEL7                       *((volatile unsigned int*)(0x42A2171CUL))
#define bM4_INTC_INTSEL23_INTSEL8                       *((volatile unsigned int*)(0x42A21720UL))
#define bM4_INTC_INTSEL24_INTSEL0                       *((volatile unsigned int*)(0x42A21780UL))
#define bM4_INTC_INTSEL24_INTSEL1                       *((volatile unsigned int*)(0x42A21784UL))
#define bM4_INTC_INTSEL24_INTSEL2                       *((volatile unsigned int*)(0x42A21788UL))
#define bM4_INTC_INTSEL24_INTSEL3                       *((volatile unsigned int*)(0x42A2178CUL))
#define bM4_INTC_INTSEL24_INTSEL4                       *((volatile unsigned int*)(0x42A21790UL))
#define bM4_INTC_INTSEL24_INTSEL5                       *((volatile unsigned int*)(0x42A21794UL))
#define bM4_INTC_INTSEL24_INTSEL6                       *((volatile unsigned int*)(0x42A21798UL))
#define bM4_INTC_INTSEL24_INTSEL7                       *((volatile unsigned int*)(0x42A2179CUL))
#define bM4_INTC_INTSEL24_INTSEL8                       *((volatile unsigned int*)(0x42A217A0UL))
#define bM4_INTC_INTSEL25_INTSEL0                       *((volatile unsigned int*)(0x42A21800UL))
#define bM4_INTC_INTSEL25_INTSEL1                       *((volatile unsigned int*)(0x42A21804UL))
#define bM4_INTC_INTSEL25_INTSEL2                       *((volatile unsigned int*)(0x42A21808UL))
#define bM4_INTC_INTSEL25_INTSEL3                       *((volatile unsigned int*)(0x42A2180CUL))
#define bM4_INTC_INTSEL25_INTSEL4                       *((volatile unsigned int*)(0x42A21810UL))
#define bM4_INTC_INTSEL25_INTSEL5                       *((volatile unsigned int*)(0x42A21814UL))
#define bM4_INTC_INTSEL25_INTSEL6                       *((volatile unsigned int*)(0x42A21818UL))
#define bM4_INTC_INTSEL25_INTSEL7                       *((volatile unsigned int*)(0x42A2181CUL))
#define bM4_INTC_INTSEL25_INTSEL8                       *((volatile unsigned int*)(0x42A21820UL))
#define bM4_INTC_INTSEL26_INTSEL0                       *((volatile unsigned int*)(0x42A21880UL))
#define bM4_INTC_INTSEL26_INTSEL1                       *((volatile unsigned int*)(0x42A21884UL))
#define bM4_INTC_INTSEL26_INTSEL2                       *((volatile unsigned int*)(0x42A21888UL))
#define bM4_INTC_INTSEL26_INTSEL3                       *((volatile unsigned int*)(0x42A2188CUL))
#define bM4_INTC_INTSEL26_INTSEL4                       *((volatile unsigned int*)(0x42A21890UL))
#define bM4_INTC_INTSEL26_INTSEL5                       *((volatile unsigned int*)(0x42A21894UL))
#define bM4_INTC_INTSEL26_INTSEL6                       *((volatile unsigned int*)(0x42A21898UL))
#define bM4_INTC_INTSEL26_INTSEL7                       *((volatile unsigned int*)(0x42A2189CUL))
#define bM4_INTC_INTSEL26_INTSEL8                       *((volatile unsigned int*)(0x42A218A0UL))
#define bM4_INTC_INTSEL27_INTSEL0                       *((volatile unsigned int*)(0x42A21900UL))
#define bM4_INTC_INTSEL27_INTSEL1                       *((volatile unsigned int*)(0x42A21904UL))
#define bM4_INTC_INTSEL27_INTSEL2                       *((volatile unsigned int*)(0x42A21908UL))
#define bM4_INTC_INTSEL27_INTSEL3                       *((volatile unsigned int*)(0x42A2190CUL))
#define bM4_INTC_INTSEL27_INTSEL4                       *((volatile unsigned int*)(0x42A21910UL))
#define bM4_INTC_INTSEL27_INTSEL5                       *((volatile unsigned int*)(0x42A21914UL))
#define bM4_INTC_INTSEL27_INTSEL6                       *((volatile unsigned int*)(0x42A21918UL))
#define bM4_INTC_INTSEL27_INTSEL7                       *((volatile unsigned int*)(0x42A2191CUL))
#define bM4_INTC_INTSEL27_INTSEL8                       *((volatile unsigned int*)(0x42A21920UL))
#define bM4_INTC_INTSEL28_INTSEL0                       *((volatile unsigned int*)(0x42A21980UL))
#define bM4_INTC_INTSEL28_INTSEL1                       *((volatile unsigned int*)(0x42A21984UL))
#define bM4_INTC_INTSEL28_INTSEL2                       *((volatile unsigned int*)(0x42A21988UL))
#define bM4_INTC_INTSEL28_INTSEL3                       *((volatile unsigned int*)(0x42A2198CUL))
#define bM4_INTC_INTSEL28_INTSEL4                       *((volatile unsigned int*)(0x42A21990UL))
#define bM4_INTC_INTSEL28_INTSEL5                       *((volatile unsigned int*)(0x42A21994UL))
#define bM4_INTC_INTSEL28_INTSEL6                       *((volatile unsigned int*)(0x42A21998UL))
#define bM4_INTC_INTSEL28_INTSEL7                       *((volatile unsigned int*)(0x42A2199CUL))
#define bM4_INTC_INTSEL28_INTSEL8                       *((volatile unsigned int*)(0x42A219A0UL))
#define bM4_INTC_INTSEL29_INTSEL0                       *((volatile unsigned int*)(0x42A21A00UL))
#define bM4_INTC_INTSEL29_INTSEL1                       *((volatile unsigned int*)(0x42A21A04UL))
#define bM4_INTC_INTSEL29_INTSEL2                       *((volatile unsigned int*)(0x42A21A08UL))
#define bM4_INTC_INTSEL29_INTSEL3                       *((volatile unsigned int*)(0x42A21A0CUL))
#define bM4_INTC_INTSEL29_INTSEL4                       *((volatile unsigned int*)(0x42A21A10UL))
#define bM4_INTC_INTSEL29_INTSEL5                       *((volatile unsigned int*)(0x42A21A14UL))
#define bM4_INTC_INTSEL29_INTSEL6                       *((volatile unsigned int*)(0x42A21A18UL))
#define bM4_INTC_INTSEL29_INTSEL7                       *((volatile unsigned int*)(0x42A21A1CUL))
#define bM4_INTC_INTSEL29_INTSEL8                       *((volatile unsigned int*)(0x42A21A20UL))
#define bM4_INTC_INTSEL30_INTSEL0                       *((volatile unsigned int*)(0x42A21A80UL))
#define bM4_INTC_INTSEL30_INTSEL1                       *((volatile unsigned int*)(0x42A21A84UL))
#define bM4_INTC_INTSEL30_INTSEL2                       *((volatile unsigned int*)(0x42A21A88UL))
#define bM4_INTC_INTSEL30_INTSEL3                       *((volatile unsigned int*)(0x42A21A8CUL))
#define bM4_INTC_INTSEL30_INTSEL4                       *((volatile unsigned int*)(0x42A21A90UL))
#define bM4_INTC_INTSEL30_INTSEL5                       *((volatile unsigned int*)(0x42A21A94UL))
#define bM4_INTC_INTSEL30_INTSEL6                       *((volatile unsigned int*)(0x42A21A98UL))
#define bM4_INTC_INTSEL30_INTSEL7                       *((volatile unsigned int*)(0x42A21A9CUL))
