RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_INTC_INTSEL30_INTSEL8                       *((volatile unsigned int*)(0x42A21AA0UL))
#define bM4_INTC_INTSEL31_INTSEL0                       *((volatile unsigned int*)(0x42A21B00UL))
#define bM4_INTC_INTSEL31_INTSEL1                       *((volatile unsigned int*)(0x42A21B04UL))
#define bM4_INTC_INTSEL31_INTSEL2                       *((volatile unsigned int*)(0x42A21B08UL))
#define bM4_INTC_INTSEL31_INTSEL3                       *((volatile unsigned int*)(0x42A21B0CUL))
#define bM4_INTC_INTSEL31_INTSEL4                       *((volatile unsigned int*)(0x42A21B10UL))
#define bM4_INTC_INTSEL31_INTSEL5                       *((volatile unsigned int*)(0x42A21B14UL))
#define bM4_INTC_INTSEL31_INTSEL6                       *((volatile unsigned int*)(0x42A21B18UL))
#define bM4_INTC_INTSEL31_INTSEL7                       *((volatile unsigned int*)(0x42A21B1CUL))
#define bM4_INTC_INTSEL31_INTSEL8                       *((volatile unsigned int*)(0x42A21B20UL))
#define bM4_INTC_INTSEL32_INTSEL0                       *((volatile unsigned int*)(0x42A21B80UL))
#define bM4_INTC_INTSEL32_INTSEL1                       *((volatile unsigned int*)(0x42A21B84UL))
#define bM4_INTC_INTSEL32_INTSEL2                       *((volatile unsigned int*)(0x42A21B88UL))
#define bM4_INTC_INTSEL32_INTSEL3                       *((volatile unsigned int*)(0x42A21B8CUL))
#define bM4_INTC_INTSEL32_INTSEL4                       *((volatile unsigned int*)(0x42A21B90UL))
#define bM4_INTC_INTSEL32_INTSEL5                       *((volatile unsigned int*)(0x42A21B94UL))
#define bM4_INTC_INTSEL32_INTSEL6                       *((volatile unsigned int*)(0x42A21B98UL))
#define bM4_INTC_INTSEL32_INTSEL7                       *((volatile unsigned int*)(0x42A21B9CUL))
#define bM4_INTC_INTSEL32_INTSEL8                       *((volatile unsigned int*)(0x42A21BA0UL))
#define bM4_INTC_INTSEL33_INTSEL0                       *((volatile unsigned int*)(0x42A21C00UL))
#define bM4_INTC_INTSEL33_INTSEL1                       *((volatile unsigned int*)(0x42A21C04UL))
#define bM4_INTC_INTSEL33_INTSEL2                       *((volatile unsigned int*)(0x42A21C08UL))
#define bM4_INTC_INTSEL33_INTSEL3                       *((volatile unsigned int*)(0x42A21C0CUL))
#define bM4_INTC_INTSEL33_INTSEL4                       *((volatile unsigned int*)(0x42A21C10UL))
#define bM4_INTC_INTSEL33_INTSEL5                       *((volatile unsigned int*)(0x42A21C14UL))
#define bM4_INTC_INTSEL33_INTSEL6                       *((volatile unsigned int*)(0x42A21C18UL))
#define bM4_INTC_INTSEL33_INTSEL7                       *((volatile unsigned int*)(0x42A21C1CUL))
#define bM4_INTC_INTSEL33_INTSEL8                       *((volatile unsigned int*)(0x42A21C20UL))
#define bM4_INTC_INTSEL34_INTSEL0                       *((volatile unsigned int*)(0x42A21C80UL))
#define bM4_INTC_INTSEL34_INTSEL1                       *((volatile unsigned int*)(0x42A21C84UL))
#define bM4_INTC_INTSEL34_INTSEL2                       *((volatile unsigned int*)(0x42A21C88UL))
#define bM4_INTC_INTSEL34_INTSEL3                       *((volatile unsigned int*)(0x42A21C8CUL))
#define bM4_INTC_INTSEL34_INTSEL4                       *((volatile unsigned int*)(0x42A21C90UL))
#define bM4_INTC_INTSEL34_INTSEL5                       *((volatile unsigned int*)(0x42A21C94UL))
#define bM4_INTC_INTSEL34_INTSEL6                       *((volatile unsigned int*)(0x42A21C98UL))
#define bM4_INTC_INTSEL34_INTSEL7                       *((volatile unsigned int*)(0x42A21C9CUL))
#define bM4_INTC_INTSEL34_INTSEL8                       *((volatile unsigned int*)(0x42A21CA0UL))
#define bM4_INTC_INTSEL35_INTSEL0                       *((volatile unsigned int*)(0x42A21D00UL))
#define bM4_INTC_INTSEL35_INTSEL1                       *((volatile unsigned int*)(0x42A21D04UL))
#define bM4_INTC_INTSEL35_INTSEL2                       *((volatile unsigned int*)(0x42A21D08UL))
#define bM4_INTC_INTSEL35_INTSEL3                       *((volatile unsigned int*)(0x42A21D0CUL))
#define bM4_INTC_INTSEL35_INTSEL4                       *((volatile unsigned int*)(0x42A21D10UL))
#define bM4_INTC_INTSEL35_INTSEL5                       *((volatile unsigned int*)(0x42A21D14UL))
#define bM4_INTC_INTSEL35_INTSEL6                       *((volatile unsigned int*)(0x42A21D18UL))
#define bM4_INTC_INTSEL35_INTSEL7                       *((volatile unsigned int*)(0x42A21D1CUL))
#define bM4_INTC_INTSEL35_INTSEL8                       *((volatile unsigned int*)(0x42A21D20UL))
#define bM4_INTC_INTSEL36_INTSEL0                       *((volatile unsigned int*)(0x42A21D80UL))
#define bM4_INTC_INTSEL36_INTSEL1                       *((volatile unsigned int*)(0x42A21D84UL))
#define bM4_INTC_INTSEL36_INTSEL2                       *((volatile unsigned int*)(0x42A21D88UL))
#define bM4_INTC_INTSEL36_INTSEL3                       *((volatile unsigned int*)(0x42A21D8CUL))
#define bM4_INTC_INTSEL36_INTSEL4                       *((volatile unsigned int*)(0x42A21D90UL))
#define bM4_INTC_INTSEL36_INTSEL5                       *((volatile unsigned int*)(0x42A21D94UL))
#define bM4_INTC_INTSEL36_INTSEL6                       *((volatile unsigned int*)(0x42A21D98UL))
#define bM4_INTC_INTSEL36_INTSEL7                       *((volatile unsigned int*)(0x42A21D9CUL))
#define bM4_INTC_INTSEL36_INTSEL8                       *((volatile unsigned int*)(0x42A21DA0UL))
#define bM4_INTC_INTSEL37_INTSEL0                       *((volatile unsigned int*)(0x42A21E00UL))
#define bM4_INTC_INTSEL37_INTSEL1                       *((volatile unsigned int*)(0x42A21E04UL))
#define bM4_INTC_INTSEL37_INTSEL2                       *((volatile unsigned int*)(0x42A21E08UL))
#define bM4_INTC_INTSEL37_INTSEL3                       *((volatile unsigned int*)(0x42A21E0CUL))
#define bM4_INTC_INTSEL37_INTSEL4                       *((volatile unsigned int*)(0x42A21E10UL))
#define bM4_INTC_INTSEL37_INTSEL5                       *((volatile unsigned int*)(0x42A21E14UL))
#define bM4_INTC_INTSEL37_INTSEL6                       *((volatile unsigned int*)(0x42A21E18UL))
#define bM4_INTC_INTSEL37_INTSEL7                       *((volatile unsigned int*)(0x42A21E1CUL))
#define bM4_INTC_INTSEL37_INTSEL8                       *((volatile unsigned int*)(0x42A21E20UL))
#define bM4_INTC_INTSEL38_INTSEL0                       *((volatile unsigned int*)(0x42A21E80UL))
#define bM4_INTC_INTSEL38_INTSEL1                       *((volatile unsigned int*)(0x42A21E84UL))
#define bM4_INTC_INTSEL38_INTSEL2                       *((volatile unsigned int*)(0x42A21E88UL))
#define bM4_INTC_INTSEL38_INTSEL3                       *((volatile unsigned int*)(0x42A21E8CUL))
#define bM4_INTC_INTSEL38_INTSEL4                       *((volatile unsigned int*)(0x42A21E90UL))
#define bM4_INTC_INTSEL38_INTSEL5                       *((volatile unsigned int*)(0x42A21E94UL))
#define bM4_INTC_INTSEL38_INTSEL6                       *((volatile unsigned int*)(0x42A21E98UL))
#define bM4_INTC_INTSEL38_INTSEL7                       *((volatile unsigned int*)(0x42A21E9CUL))
#define bM4_INTC_INTSEL38_INTSEL8                       *((volatile unsigned int*)(0x42A21EA0UL))
#define bM4_INTC_INTSEL39_INTSEL0                       *((volatile unsigned int*)(0x42A21F00UL))
#define bM4_INTC_INTSEL39_INTSEL1                       *((volatile unsigned int*)(0x42A21F04UL))
#define bM4_INTC_INTSEL39_INTSEL2                       *((volatile unsigned int*)(0x42A21F08UL))
#define bM4_INTC_INTSEL39_INTSEL3                       *((volatile unsigned int*)(0x42A21F0CUL))
#define bM4_INTC_INTSEL39_INTSEL4                       *((volatile unsigned int*)(0x42A21F10UL))
#define bM4_INTC_INTSEL39_INTSEL5                       *((volatile unsigned int*)(0x42A21F14UL))
#define bM4_INTC_INTSEL39_INTSEL6                       *((volatile unsigned int*)(0x42A21F18UL))
#define bM4_INTC_INTSEL39_INTSEL7                       *((volatile unsigned int*)(0x42A21F1CUL))
#define bM4_INTC_INTSEL39_INTSEL8                       *((volatile unsigned int*)(0x42A21F20UL))
#define bM4_INTC_INTSEL40_INTSEL0                       *((volatile unsigned int*)(0x42A21F80UL))
#define bM4_INTC_INTSEL40_INTSEL1                       *((volatile unsigned int*)(0x42A21F84UL))
#define bM4_INTC_INTSEL40_INTSEL2                       *((volatile unsigned int*)(0x42A21F88UL))
#define bM4_INTC_INTSEL40_INTSEL3                       *((volatile unsigned int*)(0x42A21F8CUL))
#define bM4_INTC_INTSEL40_INTSEL4                       *((volatile unsigned int*)(0x42A21F90UL))
#define bM4_INTC_INTSEL40_INTSEL5                       *((volatile unsigned int*)(0x42A21F94UL))
#define bM4_INTC_INTSEL40_INTSEL6                       *((volatile unsigned int*)(0x42A21F98UL))
#define bM4_INTC_INTSEL40_INTSEL7                       *((volatile unsigned int*)(0x42A21F9CUL))
#define bM4_INTC_INTSEL40_INTSEL8                       *((volatile unsigned int*)(0x42A21FA0UL))
#define bM4_INTC_INTSEL41_INTSEL0                       *((volatile unsigned int*)(0x42A22000UL))
#define bM4_INTC_INTSEL41_INTSEL1                       *((volatile unsigned int*)(0x42A22004UL))
#define bM4_INTC_INTSEL41_INTSEL2                       *((volatile unsigned int*)(0x42A22008UL))
#define bM4_INTC_INTSEL41_INTSEL3                       *((volatile unsigned int*)(0x42A2200CUL))
#define bM4_INTC_INTSEL41_INTSEL4                       *((volatile unsigned int*)(0x42A22010UL))
#define bM4_INTC_INTSEL41_INTSEL5                       *((volatile unsigned int*)(0x42A22014UL))
#define bM4_INTC_INTSEL41_INTSEL6                       *((volatile unsigned int*)(0x42A22018UL))
#define bM4_INTC_INTSEL41_INTSEL7                       *((volatile unsigned int*)(0x42A2201CUL))
#define bM4_INTC_INTSEL41_INTSEL8                       *((volatile unsigned int*)(0x42A22020UL))
#define bM4_INTC_INTSEL42_INTSEL0                       *((volatile unsigned int*)(0x42A22080UL))
#define bM4_INTC_INTSEL42_INTSEL1                       *((volatile unsigned int*)(0x42A22084UL))
#define bM4_INTC_INTSEL42_INTSEL2                       *((volatile unsigned int*)(0x42A22088UL))
#define bM4_INTC_INTSEL42_INTSEL3                       *((volatile unsigned int*)(0x42A2208CUL))
#define bM4_INTC_INTSEL42_INTSEL4                       *((volatile unsigned int*)(0x42A22090UL))
#define bM4_INTC_INTSEL42_INTSEL5                       *((volatile unsigned int*)(0x42A22094UL))
#define bM4_INTC_INTSEL42_INTSEL6                       *((volatile unsigned int*)(0x42A22098UL))
#define bM4_INTC_INTSEL42_INTSEL7                       *((volatile unsigned int*)(0x42A2209CUL))
#define bM4_INTC_INTSEL42_INTSEL8                       *((volatile unsigned int*)(0x42A220A0UL))
#define bM4_INTC_INTSEL43_INTSEL0                       *((volatile unsigned int*)(0x42A22100UL))
#define bM4_INTC_INTSEL43_INTSEL1                       *((volatile unsigned int*)(0x42A22104UL))
#define bM4_INTC_INTSEL43_INTSEL2                       *((volatile unsigned int*)(0x42A22108UL))
#define bM4_INTC_INTSEL43_INTSEL3                       *((volatile unsigned int*)(0x42A2210CUL))
#define bM4_INTC_INTSEL43_INTSEL4                       *((volatile unsigned int*)(0x42A22110UL))
#define bM4_INTC_INTSEL43_INTSEL5                       *((volatile unsigned int*)(0x42A22114UL))
#define bM4_INTC_INTSEL43_INTSEL6                       *((volatile unsigned int*)(0x42A22118UL))
#define bM4_INTC_INTSEL43_INTSEL7                       *((volatile unsigned int*)(0x42A2211CUL))
#define bM4_INTC_INTSEL43_INTSEL8                       *((volatile unsigned int*)(0x42A22120UL))
#define bM4_INTC_INTSEL44_INTSEL0                       *((volatile unsigned int*)(0x42A22180UL))
#define bM4_INTC_INTSEL44_INTSEL1                       *((volatile unsigned int*)(0x42A22184UL))
#define bM4_INTC_INTSEL44_INTSEL2                       *((volatile unsigned int*)(0x42A22188UL))
#define bM4_INTC_INTSEL44_INTSEL3                       *((volatile unsigned int*)(0x42A2218CUL))
#define bM4_INTC_INTSEL44_INTSEL4                       *((volatile unsigned int*)(0x42A22190UL))
#define bM4_INTC_INTSEL44_INTSEL5                       *((volatile unsigned int*)(0x42A22194UL))
#define bM4_INTC_INTSEL44_INTSEL6                       *((volatile unsigned int*)(0x42A22198UL))
#define bM4_INTC_INTSEL44_INTSEL7                       *((volatile unsigned int*)(0x42A2219CUL))
#define bM4_INTC_INTSEL44_INTSEL8                       *((volatile unsigned int*)(0x42A221A0UL))
#define bM4_INTC_INTSEL45_INTSEL0                       *((volatile unsigned int*)(0x42A22200UL))
#define bM4_INTC_INTSEL45_INTSEL1                       *((volatile unsigned int*)(0x42A22204UL))
#define bM4_INTC_INTSEL45_INTSEL2                       *((volatile unsigned int*)(0x42A22208UL))
#define bM4_INTC_INTSEL45_INTSEL3                       *((volatile unsigned int*)(0x42A2220CUL))
#define bM4_INTC_INTSEL45_INTSEL4                       *((volatile unsigned int*)(0x42A22210UL))
#define bM4_INTC_INTSEL45_INTSEL5                       *((volatile unsigned int*)(0x42A22214UL))
#define bM4_INTC_INTSEL45_INTSEL6                       *((volatile unsigned int*)(0x42A22218UL))
#define bM4_INTC_INTSEL45_INTSEL7                       *((volatile unsigned int*)(0x42A2221CUL))
#define bM4_INTC_INTSEL45_INTSEL8                       *((volatile unsigned int*)(0x42A22220UL))
#define bM4_INTC_INTSEL46_INTSEL0                       *((volatile unsigned int*)(0x42A22280UL))
#define bM4_INTC_INTSEL46_INTSEL1                       *((volatile unsigned int*)(0x42A22284UL))
#define bM4_INTC_INTSEL46_INTSEL2                       *((volatile unsigned int*)(0x42A22288UL))
#define bM4_INTC_INTSEL46_INTSEL3                       *((volatile unsigned int*)(0x42A2228CUL))
#define bM4_INTC_INTSEL46_INTSEL4                       *((volatile unsigned int*)(0x42A22290UL))
#define bM4_INTC_INTSEL46_INTSEL5                       *((volatile unsigned int*)(0x42A22294UL))
#define bM4_INTC_INTSEL46_INTSEL6                       *((volatile unsigned int*)(0x42A22298UL))
#define bM4_INTC_INTSEL46_INTSEL7                       *((volatile unsigned int*)(0x42A2229CUL))
#define bM4_INTC_INTSEL46_INTSEL8                       *((volatile unsigned int*)(0x42A222A0UL))
#define bM4_INTC_INTSEL47_INTSEL0                       *((volatile unsigned int*)(0x42A22300UL))
#define bM4_INTC_INTSEL47_INTSEL1                       *((volatile unsigned int*)(0x42A22304UL))
#define bM4_INTC_INTSEL47_INTSEL2                       *((volatile unsigned int*)(0x42A22308UL))
#define bM4_INTC_INTSEL47_INTSEL3                       *((volatile unsigned int*)(0x42A2230CUL))
#define bM4_INTC_INTSEL47_INTSEL4                       *((volatile unsigned int*)(0x42A22310UL))
#define bM4_INTC_INTSEL47_INTSEL5                       *((volatile unsigned int*)(0x42A22314UL))
#define bM4_INTC_INTSEL47_INTSEL6                       *((volatile unsigned int*)(0x42A22318UL))
#define bM4_INTC_INTSEL47_INTSEL7                       *((volatile unsigned int*)(0x42A2231CUL))
#define bM4_INTC_INTSEL47_INTSEL8                       *((volatile unsigned int*)(0x42A22320UL))
#define bM4_INTC_INTSEL48_INTSEL0                       *((volatile unsigned int*)(0x42A22380UL))
#define bM4_INTC_INTSEL48_INTSEL1                       *((volatile unsigned int*)(0x42A22384UL))
#define bM4_INTC_INTSEL48_INTSEL2                       *((volatile unsigned int*)(0x42A22388UL))
#define bM4_INTC_INTSEL48_INTSEL3                       *((volatile unsigned int*)(0x42A2238CUL))
#define bM4_INTC_INTSEL48_INTSEL4                       *((volatile unsigned int*)(0x42A22390UL))
#define bM4_INTC_INTSEL48_INTSEL5                       *((volatile unsigned int*)(0x42A22394UL))
#define bM4_INTC_INTSEL48_INTSEL6                       *((volatile unsigned int*)(0x42A22398UL))
#define bM4_INTC_INTSEL48_INTSEL7                       *((volatile unsigned int*)(0x42A2239CUL))
#define bM4_INTC_INTSEL48_INTSEL8                       *((volatile unsigned int*)(0x42A223A0UL))
#define bM4_INTC_INTSEL49_INTSEL0                       *((volatile unsigned int*)(0x42A22400UL))
#define bM4_INTC_INTSEL49_INTSEL1                       *((volatile unsigned int*)(0x42A22404UL))
#define bM4_INTC_INTSEL49_INTSEL2                       *((volatile unsigned int*)(0x42A22408UL))
#define bM4_INTC_INTSEL49_INTSEL3                       *((volatile unsigned int*)(0x42A2240CUL))
#define bM4_INTC_INTSEL49_INTSEL4                       *((volatile unsigned int*)(0x42A22410UL))
#define bM4_INTC_INTSEL49_INTSEL5                       *((volatile unsigned int*)(0x42A22414UL))
#define bM4_INTC_INTSEL49_INTSEL6                       *((volatile unsigned int*)(0x42A22418UL))
#define bM4_INTC_INTSEL49_INTSEL7                       *((volatile unsigned int*)(0x42A2241CUL))
#define bM4_INTC_INTSEL49_INTSEL8                       *((volatile unsigned int*)(0x42A22420UL))
#define bM4_INTC_INTSEL50_INTSEL0                       *((volatile unsigned int*)(0x42A22480UL))
#define bM4_INTC_INTSEL50_INTSEL1                       *((volatile unsigned int*)(0x42A22484UL))
#define bM4_INTC_INTSEL50_INTSEL2                       *((volatile unsigned int*)(0x42A22488UL))
#define bM4_INTC_INTSEL50_INTSEL3                       *((volatile unsigned int*)(0x42A2248CUL))
#define bM4_INTC_INTSEL50_INTSEL4                       *((volatile unsigned int*)(0x42A22490UL))
#define bM4_INTC_INTSEL50_INTSEL5                       *((volatile unsigned int*)(0x42A22494UL))
#define bM4_INTC_INTSEL50_INTSEL6                       *((volatile unsigned int*)(0x42A22498UL))
#define bM4_INTC_INTSEL50_INTSEL7                       *((volatile unsigned int*)(0x42A2249CUL))
#define bM4_INTC_INTSEL50_INTSEL8                       *((volatile unsigned int*)(0x42A224A0UL))
#define bM4_INTC_INTSEL51_INTSEL0                       *((volatile unsigned int*)(0x42A22500UL))
#define bM4_INTC_INTSEL51_INTSEL1                       *((volatile unsigned int*)(0x42A22504UL))
#define bM4_INTC_INTSEL51_INTSEL2                       *((volatile unsigned int*)(0x42A22508UL))
#define bM4_INTC_INTSEL51_INTSEL3                       *((volatile unsigned int*)(0x42A2250CUL))
#define bM4_INTC_INTSEL51_INTSEL4                       *((volatile unsigned int*)(0x42A22510UL))
#define bM4_INTC_INTSEL51_INTSEL5                       *((volatile unsigned int*)(0x42A22514UL))
#define bM4_INTC_INTSEL51_INTSEL6                       *((volatile unsigned int*)(0x42A22518UL))
#define bM4_INTC_INTSEL51_INTSEL7                       *((volatile unsigned int*)(0x42A2251CUL))
#define bM4_INTC_INTSEL51_INTSEL8                       *((volatile unsigned int*)(0x42A22520UL))
#define bM4_INTC_INTSEL52_INTSEL0                       *((volatile unsigned int*)(0x42A22580UL))
#define bM4_INTC_INTSEL52_INTSEL1                       *((volatile unsigned int*)(0x42A22584UL))
#define bM4_INTC_INTSEL52_INTSEL2                       *((volatile unsigned int*)(0x42A22588UL))
#define bM4_INTC_INTSEL52_INTSEL3                       *((volatile unsigned int*)(0x42A2258CUL))
#define bM4_INTC_INTSEL52_INTSEL4                       *((volatile unsigned int*)(0x42A22590UL))
#define bM4_INTC_INTSEL52_INTSEL5                       *((volatile unsigned int*)(0x42A22594UL))
#define bM4_INTC_INTSEL52_INTSEL6                       *((volatile unsigned int*)(0x42A22598UL))
#define bM4_INTC_INTSEL52_INTSEL7                       *((volatile unsigned int*)(0x42A2259CUL))
#define bM4_INTC_INTSEL52_INTSEL8                       *((volatile unsigned int*)(0x42A225A0UL))
#define bM4_INTC_INTSEL53_INTSEL0                       *((volatile unsigned int*)(0x42A22600UL))
#define bM4_INTC_INTSEL53_INTSEL1                       *((volatile unsigned int*)(0x42A22604UL))
#define bM4_INTC_INTSEL53_INTSEL2                       *((volatile unsigned int*)(0x42A22608UL))
#define bM4_INTC_INTSEL53_INTSEL3                       *((volatile unsigned int*)(0x42A2260CUL))
#define bM4_INTC_INTSEL53_INTSEL4                       *((volatile unsigned int*)(0x42A22610UL))
#define bM4_INTC_INTSEL53_INTSEL5                       *((volatile unsigned int*)(0x42A22614UL))
#define bM4_INTC_INTSEL53_INTSEL6                       *((volatile unsigned int*)(0x42A22618UL))
#define bM4_INTC_INTSEL53_INTSEL7                       *((volatile unsigned int*)(0x42A2261CUL))
#define bM4_INTC_INTSEL53_INTSEL8                       *((volatile unsigned int*)(0x42A22620UL))
#define bM4_INTC_INTSEL54_INTSEL0                       *((volatile unsigned int*)(0x42A22680UL))
#define bM4_INTC_INTSEL54_INTSEL1                       *((volatile unsigned int*)(0x42A22684UL))
#define bM4_INTC_INTSEL54_INTSEL2                       *((volatile unsigned int*)(0x42A22688UL))
#define bM4_INTC_INTSEL54_INTSEL3                       *((volatile unsigned int*)(0x42A2268CUL))
#define bM4_INTC_INTSEL54_INTSEL4                       *((volatile unsigned int*)(0x42A22690UL))
#define bM4_INTC_INTSEL54_INTSEL5                       *((volatile unsigned int*)(0x42A22694UL))
#define bM4_INTC_INTSEL54_INTSEL6                       *((volatile unsigned int*)(0x42A22698UL))
#define bM4_INTC_INTSEL54_INTSEL7                       *((volatile unsigned int*)(0x42A2269CUL))
#define bM4_INTC_INTSEL54_INTSEL8                       *((volatile unsigned int*)(0x42A226A0UL))
#define bM4_INTC_INTSEL55_INTSEL0                       *((volatile unsigned int*)(0x42A22700UL))
#define bM4_INTC_INTSEL55_INTSEL1                       *((volatile unsigned int*)(0x42A22704UL))
#define bM4_INTC_INTSEL55_INTSEL2                       *((volatile unsigned int*)(0x42A22708UL))
#define bM4_INTC_INTSEL55_INTSEL3                       *((volatile unsigned int*)(0x42A2270CUL))
#define bM4_INTC_INTSEL55_INTSEL4                       *((volatile unsigned int*)(0x42A22710UL))
#define bM4_INTC_INTSEL55_INTSEL5                       *((volatile unsigned int*)(0x42A22714UL))
#define bM4_INTC_INTSEL55_INTSEL6                       *((volatile unsigned int*)(0x42A22718UL))
#define bM4_INTC_INTSEL55_INTSEL7                       *((volatile unsigned int*)(0x42A2271CUL))
#define bM4_INTC_INTSEL55_INTSEL8                       *((volatile unsigned int*)(0x42A22720UL))
#define bM4_INTC_INTSEL56_INTSEL0                       *((volatile unsigned int*)(0x42A22780UL))
#define bM4_INTC_INTSEL56_INTSEL1                       *((volatile unsigned int*)(0x42A22784UL))
#define bM4_INTC_INTSEL56_INTSEL2                       *((volatile unsigned int*)(0x42A22788UL))
#define bM4_INTC_INTSEL56_INTSEL3                       *((volatile unsigned int*)(0x42A2278CUL))
#define bM4_INTC_INTSEL56_INTSEL4                       *((volatile unsigned int*)(0x42A22790UL))
#define bM4_INTC_INTSEL56_INTSEL5                       *((volatile unsigned int*)(0x42A22794UL))
#define bM4_INTC_INTSEL56_INTSEL6                       *((volatile unsigned int*)(0x42A22798UL))
#define bM4_INTC_INTSEL56_INTSEL7                       *((volatile unsigned int*)(0x42A2279CUL))
#define bM4_INTC_INTSEL56_INTSEL8                       *((volatile unsigned int*)(0x42A227A0UL))
#define bM4_INTC_INTSEL57_INTSEL0                       *((volatile unsigned int*)(0x42A22800UL))
#define bM4_INTC_INTSEL57_INTSEL1                       *((volatile unsigned int*)(0x42A22804UL))
#define bM4_INTC_INTSEL57_INTSEL2                       *((volatile unsigned int*)(0x42A22808UL))
#define bM4_INTC_INTSEL57_INTSEL3                       *((volatile unsigned int*)(0x42A2280CUL))
#define bM4_INTC_INTSEL57_INTSEL4                       *((volatile unsigned int*)(0x42A22810UL))
#define bM4_INTC_INTSEL57_INTSEL5                       *((volatile unsigned int*)(0x42A22814UL))
#define bM4_INTC_INTSEL57_INTSEL6                       *((volatile unsigned int*)(0x42A22818UL))
#define bM4_INTC_INTSEL57_INTSEL7                       *((volatile unsigned int*)(0x42A2281CUL))
#define bM4_INTC_INTSEL57_INTSEL8                       *((volatile unsigned int*)(0x42A22820UL))
