RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_INTC_INTSEL58_INTSEL0                       *((volatile unsigned int*)(0x42A22880UL))
#define bM4_INTC_INTSEL58_INTSEL1                       *((volatile unsigned int*)(0x42A22884UL))
#define bM4_INTC_INTSEL58_INTSEL2                       *((volatile unsigned int*)(0x42A22888UL))
#define bM4_INTC_INTSEL58_INTSEL3                       *((volatile unsigned int*)(0x42A2288CUL))
#define bM4_INTC_INTSEL58_INTSEL4                       *((volatile unsigned int*)(0x42A22890UL))
#define bM4_INTC_INTSEL58_INTSEL5                       *((volatile unsigned int*)(0x42A22894UL))
#define bM4_INTC_INTSEL58_INTSEL6                       *((volatile unsigned int*)(0x42A22898UL))
#define bM4_INTC_INTSEL58_INTSEL7                       *((volatile unsigned int*)(0x42A2289CUL))
#define bM4_INTC_INTSEL58_INTSEL8                       *((volatile unsigned int*)(0x42A228A0UL))
#define bM4_INTC_INTSEL59_INTSEL0                       *((volatile unsigned int*)(0x42A22900UL))
#define bM4_INTC_INTSEL59_INTSEL1                       *((volatile unsigned int*)(0x42A22904UL))
#define bM4_INTC_INTSEL59_INTSEL2                       *((volatile unsigned int*)(0x42A22908UL))
#define bM4_INTC_INTSEL59_INTSEL3                       *((volatile unsigned int*)(0x42A2290CUL))
#define bM4_INTC_INTSEL59_INTSEL4                       *((volatile unsigned int*)(0x42A22910UL))
#define bM4_INTC_INTSEL59_INTSEL5                       *((volatile unsigned int*)(0x42A22914UL))
#define bM4_INTC_INTSEL59_INTSEL6                       *((volatile unsigned int*)(0x42A22918UL))
#define bM4_INTC_INTSEL59_INTSEL7                       *((volatile unsigned int*)(0x42A2291CUL))
#define bM4_INTC_INTSEL59_INTSEL8                       *((volatile unsigned int*)(0x42A22920UL))
#define bM4_INTC_INTSEL60_INTSEL0                       *((volatile unsigned int*)(0x42A22980UL))
#define bM4_INTC_INTSEL60_INTSEL1                       *((volatile unsigned int*)(0x42A22984UL))
#define bM4_INTC_INTSEL60_INTSEL2                       *((volatile unsigned int*)(0x42A22988UL))
#define bM4_INTC_INTSEL60_INTSEL3                       *((volatile unsigned int*)(0x42A2298CUL))
#define bM4_INTC_INTSEL60_INTSEL4                       *((volatile unsigned int*)(0x42A22990UL))
#define bM4_INTC_INTSEL60_INTSEL5                       *((volatile unsigned int*)(0x42A22994UL))
#define bM4_INTC_INTSEL60_INTSEL6                       *((volatile unsigned int*)(0x42A22998UL))
#define bM4_INTC_INTSEL60_INTSEL7                       *((volatile unsigned int*)(0x42A2299CUL))
#define bM4_INTC_INTSEL60_INTSEL8                       *((volatile unsigned int*)(0x42A229A0UL))
#define bM4_INTC_INTSEL61_INTSEL0                       *((volatile unsigned int*)(0x42A22A00UL))
#define bM4_INTC_INTSEL61_INTSEL1                       *((volatile unsigned int*)(0x42A22A04UL))
#define bM4_INTC_INTSEL61_INTSEL2                       *((volatile unsigned int*)(0x42A22A08UL))
#define bM4_INTC_INTSEL61_INTSEL3                       *((volatile unsigned int*)(0x42A22A0CUL))
#define bM4_INTC_INTSEL61_INTSEL4                       *((volatile unsigned int*)(0x42A22A10UL))
#define bM4_INTC_INTSEL61_INTSEL5                       *((volatile unsigned int*)(0x42A22A14UL))
#define bM4_INTC_INTSEL61_INTSEL6                       *((volatile unsigned int*)(0x42A22A18UL))
#define bM4_INTC_INTSEL61_INTSEL7                       *((volatile unsigned int*)(0x42A22A1CUL))
#define bM4_INTC_INTSEL61_INTSEL8                       *((volatile unsigned int*)(0x42A22A20UL))
#define bM4_INTC_INTSEL62_INTSEL0                       *((volatile unsigned int*)(0x42A22A80UL))
#define bM4_INTC_INTSEL62_INTSEL1                       *((volatile unsigned int*)(0x42A22A84UL))
#define bM4_INTC_INTSEL62_INTSEL2                       *((volatile unsigned int*)(0x42A22A88UL))
#define bM4_INTC_INTSEL62_INTSEL3                       *((volatile unsigned int*)(0x42A22A8CUL))
#define bM4_INTC_INTSEL62_INTSEL4                       *((volatile unsigned int*)(0x42A22A90UL))
#define bM4_INTC_INTSEL62_INTSEL5                       *((volatile unsigned int*)(0x42A22A94UL))
#define bM4_INTC_INTSEL62_INTSEL6                       *((volatile unsigned int*)(0x42A22A98UL))
#define bM4_INTC_INTSEL62_INTSEL7                       *((volatile unsigned int*)(0x42A22A9CUL))
#define bM4_INTC_INTSEL62_INTSEL8                       *((volatile unsigned int*)(0x42A22AA0UL))
#define bM4_INTC_INTSEL63_INTSEL0                       *((volatile unsigned int*)(0x42A22B00UL))
#define bM4_INTC_INTSEL63_INTSEL1                       *((volatile unsigned int*)(0x42A22B04UL))
#define bM4_INTC_INTSEL63_INTSEL2                       *((volatile unsigned int*)(0x42A22B08UL))
#define bM4_INTC_INTSEL63_INTSEL3                       *((volatile unsigned int*)(0x42A22B0CUL))
#define bM4_INTC_INTSEL63_INTSEL4                       *((volatile unsigned int*)(0x42A22B10UL))
#define bM4_INTC_INTSEL63_INTSEL5                       *((volatile unsigned int*)(0x42A22B14UL))
#define bM4_INTC_INTSEL63_INTSEL6                       *((volatile unsigned int*)(0x42A22B18UL))
#define bM4_INTC_INTSEL63_INTSEL7                       *((volatile unsigned int*)(0x42A22B1CUL))
#define bM4_INTC_INTSEL63_INTSEL8                       *((volatile unsigned int*)(0x42A22B20UL))
#define bM4_INTC_INTSEL64_INTSEL0                       *((volatile unsigned int*)(0x42A22B80UL))
#define bM4_INTC_INTSEL64_INTSEL1                       *((volatile unsigned int*)(0x42A22B84UL))
#define bM4_INTC_INTSEL64_INTSEL2                       *((volatile unsigned int*)(0x42A22B88UL))
#define bM4_INTC_INTSEL64_INTSEL3                       *((volatile unsigned int*)(0x42A22B8CUL))
#define bM4_INTC_INTSEL64_INTSEL4                       *((volatile unsigned int*)(0x42A22B90UL))
#define bM4_INTC_INTSEL64_INTSEL5                       *((volatile unsigned int*)(0x42A22B94UL))
#define bM4_INTC_INTSEL64_INTSEL6                       *((volatile unsigned int*)(0x42A22B98UL))
#define bM4_INTC_INTSEL64_INTSEL7                       *((volatile unsigned int*)(0x42A22B9CUL))
#define bM4_INTC_INTSEL64_INTSEL8                       *((volatile unsigned int*)(0x42A22BA0UL))
#define bM4_INTC_INTSEL65_INTSEL0                       *((volatile unsigned int*)(0x42A22C00UL))
#define bM4_INTC_INTSEL65_INTSEL1                       *((volatile unsigned int*)(0x42A22C04UL))
#define bM4_INTC_INTSEL65_INTSEL2                       *((volatile unsigned int*)(0x42A22C08UL))
#define bM4_INTC_INTSEL65_INTSEL3                       *((volatile unsigned int*)(0x42A22C0CUL))
#define bM4_INTC_INTSEL65_INTSEL4                       *((volatile unsigned int*)(0x42A22C10UL))
#define bM4_INTC_INTSEL65_INTSEL5                       *((volatile unsigned int*)(0x42A22C14UL))
#define bM4_INTC_INTSEL65_INTSEL6                       *((volatile unsigned int*)(0x42A22C18UL))
#define bM4_INTC_INTSEL65_INTSEL7                       *((volatile unsigned int*)(0x42A22C1CUL))
#define bM4_INTC_INTSEL65_INTSEL8                       *((volatile unsigned int*)(0x42A22C20UL))
#define bM4_INTC_INTSEL66_INTSEL0                       *((volatile unsigned int*)(0x42A22C80UL))
#define bM4_INTC_INTSEL66_INTSEL1                       *((volatile unsigned int*)(0x42A22C84UL))
#define bM4_INTC_INTSEL66_INTSEL2                       *((volatile unsigned int*)(0x42A22C88UL))
#define bM4_INTC_INTSEL66_INTSEL3                       *((volatile unsigned int*)(0x42A22C8CUL))
#define bM4_INTC_INTSEL66_INTSEL4                       *((volatile unsigned int*)(0x42A22C90UL))
#define bM4_INTC_INTSEL66_INTSEL5                       *((volatile unsigned int*)(0x42A22C94UL))
#define bM4_INTC_INTSEL66_INTSEL6                       *((volatile unsigned int*)(0x42A22C98UL))
#define bM4_INTC_INTSEL66_INTSEL7                       *((volatile unsigned int*)(0x42A22C9CUL))
#define bM4_INTC_INTSEL66_INTSEL8                       *((volatile unsigned int*)(0x42A22CA0UL))
#define bM4_INTC_INTSEL67_INTSEL0                       *((volatile unsigned int*)(0x42A22D00UL))
#define bM4_INTC_INTSEL67_INTSEL1                       *((volatile unsigned int*)(0x42A22D04UL))
#define bM4_INTC_INTSEL67_INTSEL2                       *((volatile unsigned int*)(0x42A22D08UL))
#define bM4_INTC_INTSEL67_INTSEL3                       *((volatile unsigned int*)(0x42A22D0CUL))
#define bM4_INTC_INTSEL67_INTSEL4                       *((volatile unsigned int*)(0x42A22D10UL))
#define bM4_INTC_INTSEL67_INTSEL5                       *((volatile unsigned int*)(0x42A22D14UL))
#define bM4_INTC_INTSEL67_INTSEL6                       *((volatile unsigned int*)(0x42A22D18UL))
#define bM4_INTC_INTSEL67_INTSEL7                       *((volatile unsigned int*)(0x42A22D1CUL))
#define bM4_INTC_INTSEL67_INTSEL8                       *((volatile unsigned int*)(0x42A22D20UL))
#define bM4_INTC_INTSEL68_INTSEL0                       *((volatile unsigned int*)(0x42A22D80UL))
#define bM4_INTC_INTSEL68_INTSEL1                       *((volatile unsigned int*)(0x42A22D84UL))
#define bM4_INTC_INTSEL68_INTSEL2                       *((volatile unsigned int*)(0x42A22D88UL))
#define bM4_INTC_INTSEL68_INTSEL3                       *((volatile unsigned int*)(0x42A22D8CUL))
#define bM4_INTC_INTSEL68_INTSEL4                       *((volatile unsigned int*)(0x42A22D90UL))
#define bM4_INTC_INTSEL68_INTSEL5                       *((volatile unsigned int*)(0x42A22D94UL))
#define bM4_INTC_INTSEL68_INTSEL6                       *((volatile unsigned int*)(0x42A22D98UL))
#define bM4_INTC_INTSEL68_INTSEL7                       *((volatile unsigned int*)(0x42A22D9CUL))
#define bM4_INTC_INTSEL68_INTSEL8                       *((volatile unsigned int*)(0x42A22DA0UL))
#define bM4_INTC_INTSEL69_INTSEL0                       *((volatile unsigned int*)(0x42A22E00UL))
#define bM4_INTC_INTSEL69_INTSEL1                       *((volatile unsigned int*)(0x42A22E04UL))
#define bM4_INTC_INTSEL69_INTSEL2                       *((volatile unsigned int*)(0x42A22E08UL))
#define bM4_INTC_INTSEL69_INTSEL3                       *((volatile unsigned int*)(0x42A22E0CUL))
#define bM4_INTC_INTSEL69_INTSEL4                       *((volatile unsigned int*)(0x42A22E10UL))
#define bM4_INTC_INTSEL69_INTSEL5                       *((volatile unsigned int*)(0x42A22E14UL))
#define bM4_INTC_INTSEL69_INTSEL6                       *((volatile unsigned int*)(0x42A22E18UL))
#define bM4_INTC_INTSEL69_INTSEL7                       *((volatile unsigned int*)(0x42A22E1CUL))
#define bM4_INTC_INTSEL69_INTSEL8                       *((volatile unsigned int*)(0x42A22E20UL))
#define bM4_INTC_INTSEL70_INTSEL0                       *((volatile unsigned int*)(0x42A22E80UL))
#define bM4_INTC_INTSEL70_INTSEL1                       *((volatile unsigned int*)(0x42A22E84UL))
#define bM4_INTC_INTSEL70_INTSEL2                       *((volatile unsigned int*)(0x42A22E88UL))
#define bM4_INTC_INTSEL70_INTSEL3                       *((volatile unsigned int*)(0x42A22E8CUL))
#define bM4_INTC_INTSEL70_INTSEL4                       *((volatile unsigned int*)(0x42A22E90UL))
#define bM4_INTC_INTSEL70_INTSEL5                       *((volatile unsigned int*)(0x42A22E94UL))
#define bM4_INTC_INTSEL70_INTSEL6                       *((volatile unsigned int*)(0x42A22E98UL))
#define bM4_INTC_INTSEL70_INTSEL7                       *((volatile unsigned int*)(0x42A22E9CUL))
#define bM4_INTC_INTSEL70_INTSEL8                       *((volatile unsigned int*)(0x42A22EA0UL))
#define bM4_INTC_INTSEL71_INTSEL0                       *((volatile unsigned int*)(0x42A22F00UL))
#define bM4_INTC_INTSEL71_INTSEL1                       *((volatile unsigned int*)(0x42A22F04UL))
#define bM4_INTC_INTSEL71_INTSEL2                       *((volatile unsigned int*)(0x42A22F08UL))
#define bM4_INTC_INTSEL71_INTSEL3                       *((volatile unsigned int*)(0x42A22F0CUL))
#define bM4_INTC_INTSEL71_INTSEL4                       *((volatile unsigned int*)(0x42A22F10UL))
#define bM4_INTC_INTSEL71_INTSEL5                       *((volatile unsigned int*)(0x42A22F14UL))
#define bM4_INTC_INTSEL71_INTSEL6                       *((volatile unsigned int*)(0x42A22F18UL))
#define bM4_INTC_INTSEL71_INTSEL7                       *((volatile unsigned int*)(0x42A22F1CUL))
#define bM4_INTC_INTSEL71_INTSEL8                       *((volatile unsigned int*)(0x42A22F20UL))
#define bM4_INTC_INTSEL72_INTSEL0                       *((volatile unsigned int*)(0x42A22F80UL))
#define bM4_INTC_INTSEL72_INTSEL1                       *((volatile unsigned int*)(0x42A22F84UL))
#define bM4_INTC_INTSEL72_INTSEL2                       *((volatile unsigned int*)(0x42A22F88UL))
#define bM4_INTC_INTSEL72_INTSEL3                       *((volatile unsigned int*)(0x42A22F8CUL))
#define bM4_INTC_INTSEL72_INTSEL4                       *((volatile unsigned int*)(0x42A22F90UL))
#define bM4_INTC_INTSEL72_INTSEL5                       *((volatile unsigned int*)(0x42A22F94UL))
#define bM4_INTC_INTSEL72_INTSEL6                       *((volatile unsigned int*)(0x42A22F98UL))
#define bM4_INTC_INTSEL72_INTSEL7                       *((volatile unsigned int*)(0x42A22F9CUL))
#define bM4_INTC_INTSEL72_INTSEL8                       *((volatile unsigned int*)(0x42A22FA0UL))
#define bM4_INTC_INTSEL73_INTSEL0                       *((volatile unsigned int*)(0x42A23000UL))
#define bM4_INTC_INTSEL73_INTSEL1                       *((volatile unsigned int*)(0x42A23004UL))
#define bM4_INTC_INTSEL73_INTSEL2                       *((volatile unsigned int*)(0x42A23008UL))
#define bM4_INTC_INTSEL73_INTSEL3                       *((volatile unsigned int*)(0x42A2300CUL))
#define bM4_INTC_INTSEL73_INTSEL4                       *((volatile unsigned int*)(0x42A23010UL))
#define bM4_INTC_INTSEL73_INTSEL5                       *((volatile unsigned int*)(0x42A23014UL))
#define bM4_INTC_INTSEL73_INTSEL6                       *((volatile unsigned int*)(0x42A23018UL))
#define bM4_INTC_INTSEL73_INTSEL7                       *((volatile unsigned int*)(0x42A2301CUL))
#define bM4_INTC_INTSEL73_INTSEL8                       *((volatile unsigned int*)(0x42A23020UL))
#define bM4_INTC_INTSEL74_INTSEL0                       *((volatile unsigned int*)(0x42A23080UL))
#define bM4_INTC_INTSEL74_INTSEL1                       *((volatile unsigned int*)(0x42A23084UL))
#define bM4_INTC_INTSEL74_INTSEL2                       *((volatile unsigned int*)(0x42A23088UL))
#define bM4_INTC_INTSEL74_INTSEL3                       *((volatile unsigned int*)(0x42A2308CUL))
#define bM4_INTC_INTSEL74_INTSEL4                       *((volatile unsigned int*)(0x42A23090UL))
#define bM4_INTC_INTSEL74_INTSEL5                       *((volatile unsigned int*)(0x42A23094UL))
#define bM4_INTC_INTSEL74_INTSEL6                       *((volatile unsigned int*)(0x42A23098UL))
#define bM4_INTC_INTSEL74_INTSEL7                       *((volatile unsigned int*)(0x42A2309CUL))
#define bM4_INTC_INTSEL74_INTSEL8                       *((volatile unsigned int*)(0x42A230A0UL))
#define bM4_INTC_INTSEL75_INTSEL0                       *((volatile unsigned int*)(0x42A23100UL))
#define bM4_INTC_INTSEL75_INTSEL1                       *((volatile unsigned int*)(0x42A23104UL))
#define bM4_INTC_INTSEL75_INTSEL2                       *((volatile unsigned int*)(0x42A23108UL))
#define bM4_INTC_INTSEL75_INTSEL3                       *((volatile unsigned int*)(0x42A2310CUL))
#define bM4_INTC_INTSEL75_INTSEL4                       *((volatile unsigned int*)(0x42A23110UL))
#define bM4_INTC_INTSEL75_INTSEL5                       *((volatile unsigned int*)(0x42A23114UL))
#define bM4_INTC_INTSEL75_INTSEL6                       *((volatile unsigned int*)(0x42A23118UL))
#define bM4_INTC_INTSEL75_INTSEL7                       *((volatile unsigned int*)(0x42A2311CUL))
#define bM4_INTC_INTSEL75_INTSEL8                       *((volatile unsigned int*)(0x42A23120UL))
#define bM4_INTC_INTSEL76_INTSEL0                       *((volatile unsigned int*)(0x42A23180UL))
#define bM4_INTC_INTSEL76_INTSEL1                       *((volatile unsigned int*)(0x42A23184UL))
#define bM4_INTC_INTSEL76_INTSEL2                       *((volatile unsigned int*)(0x42A23188UL))
#define bM4_INTC_INTSEL76_INTSEL3                       *((volatile unsigned int*)(0x42A2318CUL))
#define bM4_INTC_INTSEL76_INTSEL4                       *((volatile unsigned int*)(0x42A23190UL))
#define bM4_INTC_INTSEL76_INTSEL5                       *((volatile unsigned int*)(0x42A23194UL))
#define bM4_INTC_INTSEL76_INTSEL6                       *((volatile unsigned int*)(0x42A23198UL))
#define bM4_INTC_INTSEL76_INTSEL7                       *((volatile unsigned int*)(0x42A2319CUL))
#define bM4_INTC_INTSEL76_INTSEL8                       *((volatile unsigned int*)(0x42A231A0UL))
#define bM4_INTC_INTSEL77_INTSEL0                       *((volatile unsigned int*)(0x42A23200UL))
#define bM4_INTC_INTSEL77_INTSEL1                       *((volatile unsigned int*)(0x42A23204UL))
#define bM4_INTC_INTSEL77_INTSEL2                       *((volatile unsigned int*)(0x42A23208UL))
#define bM4_INTC_INTSEL77_INTSEL3                       *((volatile unsigned int*)(0x42A2320CUL))
#define bM4_INTC_INTSEL77_INTSEL4                       *((volatile unsigned int*)(0x42A23210UL))
#define bM4_INTC_INTSEL77_INTSEL5                       *((volatile unsigned int*)(0x42A23214UL))
#define bM4_INTC_INTSEL77_INTSEL6                       *((volatile unsigned int*)(0x42A23218UL))
#define bM4_INTC_INTSEL77_INTSEL7                       *((volatile unsigned int*)(0x42A2321CUL))
#define bM4_INTC_INTSEL77_INTSEL8                       *((volatile unsigned int*)(0x42A23220UL))
#define bM4_INTC_INTSEL78_INTSEL0                       *((volatile unsigned int*)(0x42A23280UL))
#define bM4_INTC_INTSEL78_INTSEL1                       *((volatile unsigned int*)(0x42A23284UL))
#define bM4_INTC_INTSEL78_INTSEL2                       *((volatile unsigned int*)(0x42A23288UL))
#define bM4_INTC_INTSEL78_INTSEL3                       *((volatile unsigned int*)(0x42A2328CUL))
#define bM4_INTC_INTSEL78_INTSEL4                       *((volatile unsigned int*)(0x42A23290UL))
#define bM4_INTC_INTSEL78_INTSEL5                       *((volatile unsigned int*)(0x42A23294UL))
#define bM4_INTC_INTSEL78_INTSEL6                       *((volatile unsigned int*)(0x42A23298UL))
#define bM4_INTC_INTSEL78_INTSEL7                       *((volatile unsigned int*)(0x42A2329CUL))
#define bM4_INTC_INTSEL78_INTSEL8                       *((volatile unsigned int*)(0x42A232A0UL))
#define bM4_INTC_INTSEL79_INTSEL0                       *((volatile unsigned int*)(0x42A23300UL))
#define bM4_INTC_INTSEL79_INTSEL1                       *((volatile unsigned int*)(0x42A23304UL))
#define bM4_INTC_INTSEL79_INTSEL2                       *((volatile unsigned int*)(0x42A23308UL))
#define bM4_INTC_INTSEL79_INTSEL3                       *((volatile unsigned int*)(0x42A2330CUL))
#define bM4_INTC_INTSEL79_INTSEL4                       *((volatile unsigned int*)(0x42A23310UL))
#define bM4_INTC_INTSEL79_INTSEL5                       *((volatile unsigned int*)(0x42A23314UL))
#define bM4_INTC_INTSEL79_INTSEL6                       *((volatile unsigned int*)(0x42A23318UL))
#define bM4_INTC_INTSEL79_INTSEL7                       *((volatile unsigned int*)(0x42A2331CUL))
#define bM4_INTC_INTSEL79_INTSEL8                       *((volatile unsigned int*)(0x42A23320UL))
#define bM4_INTC_INTSEL80_INTSEL0                       *((volatile unsigned int*)(0x42A23380UL))
#define bM4_INTC_INTSEL80_INTSEL1                       *((volatile unsigned int*)(0x42A23384UL))
#define bM4_INTC_INTSEL80_INTSEL2                       *((volatile unsigned int*)(0x42A23388UL))
#define bM4_INTC_INTSEL80_INTSEL3                       *((volatile unsigned int*)(0x42A2338CUL))
#define bM4_INTC_INTSEL80_INTSEL4                       *((volatile unsigned int*)(0x42A23390UL))
#define bM4_INTC_INTSEL80_INTSEL5                       *((volatile unsigned int*)(0x42A23394UL))
#define bM4_INTC_INTSEL80_INTSEL6                       *((volatile unsigned int*)(0x42A23398UL))
#define bM4_INTC_INTSEL80_INTSEL7                       *((volatile unsigned int*)(0x42A2339CUL))
#define bM4_INTC_INTSEL80_INTSEL8                       *((volatile unsigned int*)(0x42A233A0UL))
#define bM4_INTC_INTSEL81_INTSEL0                       *((volatile unsigned int*)(0x42A23400UL))
#define bM4_INTC_INTSEL81_INTSEL1                       *((volatile unsigned int*)(0x42A23404UL))
#define bM4_INTC_INTSEL81_INTSEL2                       *((volatile unsigned int*)(0x42A23408UL))
#define bM4_INTC_INTSEL81_INTSEL3                       *((volatile unsigned int*)(0x42A2340CUL))
#define bM4_INTC_INTSEL81_INTSEL4                       *((volatile unsigned int*)(0x42A23410UL))
#define bM4_INTC_INTSEL81_INTSEL5                       *((volatile unsigned int*)(0x42A23414UL))
#define bM4_INTC_INTSEL81_INTSEL6                       *((volatile unsigned int*)(0x42A23418UL))
#define bM4_INTC_INTSEL81_INTSEL7                       *((volatile unsigned int*)(0x42A2341CUL))
#define bM4_INTC_INTSEL81_INTSEL8                       *((volatile unsigned int*)(0x42A23420UL))
#define bM4_INTC_INTSEL82_INTSEL0                       *((volatile unsigned int*)(0x42A23480UL))
#define bM4_INTC_INTSEL82_INTSEL1                       *((volatile unsigned int*)(0x42A23484UL))
#define bM4_INTC_INTSEL82_INTSEL2                       *((volatile unsigned int*)(0x42A23488UL))
#define bM4_INTC_INTSEL82_INTSEL3                       *((volatile unsigned int*)(0x42A2348CUL))
#define bM4_INTC_INTSEL82_INTSEL4                       *((volatile unsigned int*)(0x42A23490UL))
#define bM4_INTC_INTSEL82_INTSEL5                       *((volatile unsigned int*)(0x42A23494UL))
#define bM4_INTC_INTSEL82_INTSEL6                       *((volatile unsigned int*)(0x42A23498UL))
#define bM4_INTC_INTSEL82_INTSEL7                       *((volatile unsigned int*)(0x42A2349CUL))
#define bM4_INTC_INTSEL82_INTSEL8                       *((volatile unsigned int*)(0x42A234A0UL))
#define bM4_INTC_INTSEL83_INTSEL0                       *((volatile unsigned int*)(0x42A23500UL))
#define bM4_INTC_INTSEL83_INTSEL1                       *((volatile unsigned int*)(0x42A23504UL))
#define bM4_INTC_INTSEL83_INTSEL2                       *((volatile unsigned int*)(0x42A23508UL))
#define bM4_INTC_INTSEL83_INTSEL3                       *((volatile unsigned int*)(0x42A2350CUL))
#define bM4_INTC_INTSEL83_INTSEL4                       *((volatile unsigned int*)(0x42A23510UL))
#define bM4_INTC_INTSEL83_INTSEL5                       *((volatile unsigned int*)(0x42A23514UL))
#define bM4_INTC_INTSEL83_INTSEL6                       *((volatile unsigned int*)(0x42A23518UL))
#define bM4_INTC_INTSEL83_INTSEL7                       *((volatile unsigned int*)(0x42A2351CUL))
#define bM4_INTC_INTSEL83_INTSEL8                       *((volatile unsigned int*)(0x42A23520UL))
#define bM4_INTC_INTSEL84_INTSEL0                       *((volatile unsigned int*)(0x42A23580UL))
#define bM4_INTC_INTSEL84_INTSEL1                       *((volatile unsigned int*)(0x42A23584UL))
#define bM4_INTC_INTSEL84_INTSEL2                       *((volatile unsigned int*)(0x42A23588UL))
#define bM4_INTC_INTSEL84_INTSEL3                       *((volatile unsigned int*)(0x42A2358CUL))
#define bM4_INTC_INTSEL84_INTSEL4                       *((volatile unsigned int*)(0x42A23590UL))
#define bM4_INTC_INTSEL84_INTSEL5                       *((volatile unsigned int*)(0x42A23594UL))
#define bM4_INTC_INTSEL84_INTSEL6                       *((volatile unsigned int*)(0x42A23598UL))
#define bM4_INTC_INTSEL84_INTSEL7                       *((volatile unsigned int*)(0x42A2359CUL))
#define bM4_INTC_INTSEL84_INTSEL8                       *((volatile unsigned int*)(0x42A235A0UL))
#define bM4_INTC_INTSEL85_INTSEL0                       *((volatile unsigned int*)(0x42A23600UL))
