RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_INTC_INTSEL85_INTSEL1                       *((volatile unsigned int*)(0x42A23604UL))
#define bM4_INTC_INTSEL85_INTSEL2                       *((volatile unsigned int*)(0x42A23608UL))
#define bM4_INTC_INTSEL85_INTSEL3                       *((volatile unsigned int*)(0x42A2360CUL))
#define bM4_INTC_INTSEL85_INTSEL4                       *((volatile unsigned int*)(0x42A23610UL))
#define bM4_INTC_INTSEL85_INTSEL5                       *((volatile unsigned int*)(0x42A23614UL))
#define bM4_INTC_INTSEL85_INTSEL6                       *((volatile unsigned int*)(0x42A23618UL))
#define bM4_INTC_INTSEL85_INTSEL7                       *((volatile unsigned int*)(0x42A2361CUL))
#define bM4_INTC_INTSEL85_INTSEL8                       *((volatile unsigned int*)(0x42A23620UL))
#define bM4_INTC_INTSEL86_INTSEL0                       *((volatile unsigned int*)(0x42A23680UL))
#define bM4_INTC_INTSEL86_INTSEL1                       *((volatile unsigned int*)(0x42A23684UL))
#define bM4_INTC_INTSEL86_INTSEL2                       *((volatile unsigned int*)(0x42A23688UL))
#define bM4_INTC_INTSEL86_INTSEL3                       *((volatile unsigned int*)(0x42A2368CUL))
#define bM4_INTC_INTSEL86_INTSEL4                       *((volatile unsigned int*)(0x42A23690UL))
#define bM4_INTC_INTSEL86_INTSEL5                       *((volatile unsigned int*)(0x42A23694UL))
#define bM4_INTC_INTSEL86_INTSEL6                       *((volatile unsigned int*)(0x42A23698UL))
#define bM4_INTC_INTSEL86_INTSEL7                       *((volatile unsigned int*)(0x42A2369CUL))
#define bM4_INTC_INTSEL86_INTSEL8                       *((volatile unsigned int*)(0x42A236A0UL))
#define bM4_INTC_INTSEL87_INTSEL0                       *((volatile unsigned int*)(0x42A23700UL))
#define bM4_INTC_INTSEL87_INTSEL1                       *((volatile unsigned int*)(0x42A23704UL))
#define bM4_INTC_INTSEL87_INTSEL2                       *((volatile unsigned int*)(0x42A23708UL))
#define bM4_INTC_INTSEL87_INTSEL3                       *((volatile unsigned int*)(0x42A2370CUL))
#define bM4_INTC_INTSEL87_INTSEL4                       *((volatile unsigned int*)(0x42A23710UL))
#define bM4_INTC_INTSEL87_INTSEL5                       *((volatile unsigned int*)(0x42A23714UL))
#define bM4_INTC_INTSEL87_INTSEL6                       *((volatile unsigned int*)(0x42A23718UL))
#define bM4_INTC_INTSEL87_INTSEL7                       *((volatile unsigned int*)(0x42A2371CUL))
#define bM4_INTC_INTSEL87_INTSEL8                       *((volatile unsigned int*)(0x42A23720UL))
#define bM4_INTC_INTSEL88_INTSEL0                       *((volatile unsigned int*)(0x42A23780UL))
#define bM4_INTC_INTSEL88_INTSEL1                       *((volatile unsigned int*)(0x42A23784UL))
#define bM4_INTC_INTSEL88_INTSEL2                       *((volatile unsigned int*)(0x42A23788UL))
#define bM4_INTC_INTSEL88_INTSEL3                       *((volatile unsigned int*)(0x42A2378CUL))
#define bM4_INTC_INTSEL88_INTSEL4                       *((volatile unsigned int*)(0x42A23790UL))
#define bM4_INTC_INTSEL88_INTSEL5                       *((volatile unsigned int*)(0x42A23794UL))
#define bM4_INTC_INTSEL88_INTSEL6                       *((volatile unsigned int*)(0x42A23798UL))
#define bM4_INTC_INTSEL88_INTSEL7                       *((volatile unsigned int*)(0x42A2379CUL))
#define bM4_INTC_INTSEL88_INTSEL8                       *((volatile unsigned int*)(0x42A237A0UL))
#define bM4_INTC_INTSEL89_INTSEL0                       *((volatile unsigned int*)(0x42A23800UL))
#define bM4_INTC_INTSEL89_INTSEL1                       *((volatile unsigned int*)(0x42A23804UL))
#define bM4_INTC_INTSEL89_INTSEL2                       *((volatile unsigned int*)(0x42A23808UL))
#define bM4_INTC_INTSEL89_INTSEL3                       *((volatile unsigned int*)(0x42A2380CUL))
#define bM4_INTC_INTSEL89_INTSEL4                       *((volatile unsigned int*)(0x42A23810UL))
#define bM4_INTC_INTSEL89_INTSEL5                       *((volatile unsigned int*)(0x42A23814UL))
#define bM4_INTC_INTSEL89_INTSEL6                       *((volatile unsigned int*)(0x42A23818UL))
#define bM4_INTC_INTSEL89_INTSEL7                       *((volatile unsigned int*)(0x42A2381CUL))
#define bM4_INTC_INTSEL89_INTSEL8                       *((volatile unsigned int*)(0x42A23820UL))
#define bM4_INTC_INTSEL90_INTSEL0                       *((volatile unsigned int*)(0x42A23880UL))
#define bM4_INTC_INTSEL90_INTSEL1                       *((volatile unsigned int*)(0x42A23884UL))
#define bM4_INTC_INTSEL90_INTSEL2                       *((volatile unsigned int*)(0x42A23888UL))
#define bM4_INTC_INTSEL90_INTSEL3                       *((volatile unsigned int*)(0x42A2388CUL))
#define bM4_INTC_INTSEL90_INTSEL4                       *((volatile unsigned int*)(0x42A23890UL))
#define bM4_INTC_INTSEL90_INTSEL5                       *((volatile unsigned int*)(0x42A23894UL))
#define bM4_INTC_INTSEL90_INTSEL6                       *((volatile unsigned int*)(0x42A23898UL))
#define bM4_INTC_INTSEL90_INTSEL7                       *((volatile unsigned int*)(0x42A2389CUL))
#define bM4_INTC_INTSEL90_INTSEL8                       *((volatile unsigned int*)(0x42A238A0UL))
#define bM4_INTC_INTSEL91_INTSEL0                       *((volatile unsigned int*)(0x42A23900UL))
#define bM4_INTC_INTSEL91_INTSEL1                       *((volatile unsigned int*)(0x42A23904UL))
#define bM4_INTC_INTSEL91_INTSEL2                       *((volatile unsigned int*)(0x42A23908UL))
#define bM4_INTC_INTSEL91_INTSEL3                       *((volatile unsigned int*)(0x42A2390CUL))
#define bM4_INTC_INTSEL91_INTSEL4                       *((volatile unsigned int*)(0x42A23910UL))
#define bM4_INTC_INTSEL91_INTSEL5                       *((volatile unsigned int*)(0x42A23914UL))
#define bM4_INTC_INTSEL91_INTSEL6                       *((volatile unsigned int*)(0x42A23918UL))
#define bM4_INTC_INTSEL91_INTSEL7                       *((volatile unsigned int*)(0x42A2391CUL))
#define bM4_INTC_INTSEL91_INTSEL8                       *((volatile unsigned int*)(0x42A23920UL))
#define bM4_INTC_INTSEL92_INTSEL0                       *((volatile unsigned int*)(0x42A23980UL))
#define bM4_INTC_INTSEL92_INTSEL1                       *((volatile unsigned int*)(0x42A23984UL))
#define bM4_INTC_INTSEL92_INTSEL2                       *((volatile unsigned int*)(0x42A23988UL))
#define bM4_INTC_INTSEL92_INTSEL3                       *((volatile unsigned int*)(0x42A2398CUL))
#define bM4_INTC_INTSEL92_INTSEL4                       *((volatile unsigned int*)(0x42A23990UL))
#define bM4_INTC_INTSEL92_INTSEL5                       *((volatile unsigned int*)(0x42A23994UL))
#define bM4_INTC_INTSEL92_INTSEL6                       *((volatile unsigned int*)(0x42A23998UL))
#define bM4_INTC_INTSEL92_INTSEL7                       *((volatile unsigned int*)(0x42A2399CUL))
#define bM4_INTC_INTSEL92_INTSEL8                       *((volatile unsigned int*)(0x42A239A0UL))
#define bM4_INTC_INTSEL93_INTSEL0                       *((volatile unsigned int*)(0x42A23A00UL))
#define bM4_INTC_INTSEL93_INTSEL1                       *((volatile unsigned int*)(0x42A23A04UL))
#define bM4_INTC_INTSEL93_INTSEL2                       *((volatile unsigned int*)(0x42A23A08UL))
#define bM4_INTC_INTSEL93_INTSEL3                       *((volatile unsigned int*)(0x42A23A0CUL))
#define bM4_INTC_INTSEL93_INTSEL4                       *((volatile unsigned int*)(0x42A23A10UL))
#define bM4_INTC_INTSEL93_INTSEL5                       *((volatile unsigned int*)(0x42A23A14UL))
#define bM4_INTC_INTSEL93_INTSEL6                       *((volatile unsigned int*)(0x42A23A18UL))
#define bM4_INTC_INTSEL93_INTSEL7                       *((volatile unsigned int*)(0x42A23A1CUL))
#define bM4_INTC_INTSEL93_INTSEL8                       *((volatile unsigned int*)(0x42A23A20UL))
#define bM4_INTC_INTSEL94_INTSEL0                       *((volatile unsigned int*)(0x42A23A80UL))
#define bM4_INTC_INTSEL94_INTSEL1                       *((volatile unsigned int*)(0x42A23A84UL))
#define bM4_INTC_INTSEL94_INTSEL2                       *((volatile unsigned int*)(0x42A23A88UL))
#define bM4_INTC_INTSEL94_INTSEL3                       *((volatile unsigned int*)(0x42A23A8CUL))
#define bM4_INTC_INTSEL94_INTSEL4                       *((volatile unsigned int*)(0x42A23A90UL))
#define bM4_INTC_INTSEL94_INTSEL5                       *((volatile unsigned int*)(0x42A23A94UL))
#define bM4_INTC_INTSEL94_INTSEL6                       *((volatile unsigned int*)(0x42A23A98UL))
#define bM4_INTC_INTSEL94_INTSEL7                       *((volatile unsigned int*)(0x42A23A9CUL))
#define bM4_INTC_INTSEL94_INTSEL8                       *((volatile unsigned int*)(0x42A23AA0UL))
#define bM4_INTC_INTSEL95_INTSEL0                       *((volatile unsigned int*)(0x42A23B00UL))
#define bM4_INTC_INTSEL95_INTSEL1                       *((volatile unsigned int*)(0x42A23B04UL))
#define bM4_INTC_INTSEL95_INTSEL2                       *((volatile unsigned int*)(0x42A23B08UL))
#define bM4_INTC_INTSEL95_INTSEL3                       *((volatile unsigned int*)(0x42A23B0CUL))
#define bM4_INTC_INTSEL95_INTSEL4                       *((volatile unsigned int*)(0x42A23B10UL))
#define bM4_INTC_INTSEL95_INTSEL5                       *((volatile unsigned int*)(0x42A23B14UL))
#define bM4_INTC_INTSEL95_INTSEL6                       *((volatile unsigned int*)(0x42A23B18UL))
#define bM4_INTC_INTSEL95_INTSEL7                       *((volatile unsigned int*)(0x42A23B1CUL))
#define bM4_INTC_INTSEL95_INTSEL8                       *((volatile unsigned int*)(0x42A23B20UL))
#define bM4_INTC_INTSEL96_INTSEL0                       *((volatile unsigned int*)(0x42A23B80UL))
#define bM4_INTC_INTSEL96_INTSEL1                       *((volatile unsigned int*)(0x42A23B84UL))
#define bM4_INTC_INTSEL96_INTSEL2                       *((volatile unsigned int*)(0x42A23B88UL))
#define bM4_INTC_INTSEL96_INTSEL3                       *((volatile unsigned int*)(0x42A23B8CUL))
#define bM4_INTC_INTSEL96_INTSEL4                       *((volatile unsigned int*)(0x42A23B90UL))
#define bM4_INTC_INTSEL96_INTSEL5                       *((volatile unsigned int*)(0x42A23B94UL))
#define bM4_INTC_INTSEL96_INTSEL6                       *((volatile unsigned int*)(0x42A23B98UL))
#define bM4_INTC_INTSEL96_INTSEL7                       *((volatile unsigned int*)(0x42A23B9CUL))
#define bM4_INTC_INTSEL96_INTSEL8                       *((volatile unsigned int*)(0x42A23BA0UL))
#define bM4_INTC_INTSEL97_INTSEL0                       *((volatile unsigned int*)(0x42A23C00UL))
#define bM4_INTC_INTSEL97_INTSEL1                       *((volatile unsigned int*)(0x42A23C04UL))
#define bM4_INTC_INTSEL97_INTSEL2                       *((volatile unsigned int*)(0x42A23C08UL))
#define bM4_INTC_INTSEL97_INTSEL3                       *((volatile unsigned int*)(0x42A23C0CUL))
#define bM4_INTC_INTSEL97_INTSEL4                       *((volatile unsigned int*)(0x42A23C10UL))
#define bM4_INTC_INTSEL97_INTSEL5                       *((volatile unsigned int*)(0x42A23C14UL))
#define bM4_INTC_INTSEL97_INTSEL6                       *((volatile unsigned int*)(0x42A23C18UL))
#define bM4_INTC_INTSEL97_INTSEL7                       *((volatile unsigned int*)(0x42A23C1CUL))
#define bM4_INTC_INTSEL97_INTSEL8                       *((volatile unsigned int*)(0x42A23C20UL))
#define bM4_INTC_INTSEL98_INTSEL0                       *((volatile unsigned int*)(0x42A23C80UL))
#define bM4_INTC_INTSEL98_INTSEL1                       *((volatile unsigned int*)(0x42A23C84UL))
#define bM4_INTC_INTSEL98_INTSEL2                       *((volatile unsigned int*)(0x42A23C88UL))
#define bM4_INTC_INTSEL98_INTSEL3                       *((volatile unsigned int*)(0x42A23C8CUL))
#define bM4_INTC_INTSEL98_INTSEL4                       *((volatile unsigned int*)(0x42A23C90UL))
#define bM4_INTC_INTSEL98_INTSEL5                       *((volatile unsigned int*)(0x42A23C94UL))
#define bM4_INTC_INTSEL98_INTSEL6                       *((volatile unsigned int*)(0x42A23C98UL))
#define bM4_INTC_INTSEL98_INTSEL7                       *((volatile unsigned int*)(0x42A23C9CUL))
#define bM4_INTC_INTSEL98_INTSEL8                       *((volatile unsigned int*)(0x42A23CA0UL))
#define bM4_INTC_INTSEL99_INTSEL0                       *((volatile unsigned int*)(0x42A23D00UL))
#define bM4_INTC_INTSEL99_INTSEL1                       *((volatile unsigned int*)(0x42A23D04UL))
#define bM4_INTC_INTSEL99_INTSEL2                       *((volatile unsigned int*)(0x42A23D08UL))
#define bM4_INTC_INTSEL99_INTSEL3                       *((volatile unsigned int*)(0x42A23D0CUL))
#define bM4_INTC_INTSEL99_INTSEL4                       *((volatile unsigned int*)(0x42A23D10UL))
#define bM4_INTC_INTSEL99_INTSEL5                       *((volatile unsigned int*)(0x42A23D14UL))
#define bM4_INTC_INTSEL99_INTSEL6                       *((volatile unsigned int*)(0x42A23D18UL))
#define bM4_INTC_INTSEL99_INTSEL7                       *((volatile unsigned int*)(0x42A23D1CUL))
#define bM4_INTC_INTSEL99_INTSEL8                       *((volatile unsigned int*)(0x42A23D20UL))
#define bM4_INTC_INTSEL100_INTSEL0                      *((volatile unsigned int*)(0x42A23D80UL))
#define bM4_INTC_INTSEL100_INTSEL1                      *((volatile unsigned int*)(0x42A23D84UL))
#define bM4_INTC_INTSEL100_INTSEL2                      *((volatile unsigned int*)(0x42A23D88UL))
#define bM4_INTC_INTSEL100_INTSEL3                      *((volatile unsigned int*)(0x42A23D8CUL))
#define bM4_INTC_INTSEL100_INTSEL4                      *((volatile unsigned int*)(0x42A23D90UL))
#define bM4_INTC_INTSEL100_INTSEL5                      *((volatile unsigned int*)(0x42A23D94UL))
#define bM4_INTC_INTSEL100_INTSEL6                      *((volatile unsigned int*)(0x42A23D98UL))
#define bM4_INTC_INTSEL100_INTSEL7                      *((volatile unsigned int*)(0x42A23D9CUL))
#define bM4_INTC_INTSEL100_INTSEL8                      *((volatile unsigned int*)(0x42A23DA0UL))
#define bM4_INTC_INTSEL101_INTSEL0                      *((volatile unsigned int*)(0x42A23E00UL))
#define bM4_INTC_INTSEL101_INTSEL1                      *((volatile unsigned int*)(0x42A23E04UL))
#define bM4_INTC_INTSEL101_INTSEL2                      *((volatile unsigned int*)(0x42A23E08UL))
#define bM4_INTC_INTSEL101_INTSEL3                      *((volatile unsigned int*)(0x42A23E0CUL))
#define bM4_INTC_INTSEL101_INTSEL4                      *((volatile unsigned int*)(0x42A23E10UL))
#define bM4_INTC_INTSEL101_INTSEL5                      *((volatile unsigned int*)(0x42A23E14UL))
#define bM4_INTC_INTSEL101_INTSEL6                      *((volatile unsigned int*)(0x42A23E18UL))
#define bM4_INTC_INTSEL101_INTSEL7                      *((volatile unsigned int*)(0x42A23E1CUL))
#define bM4_INTC_INTSEL101_INTSEL8                      *((volatile unsigned int*)(0x42A23E20UL))
#define bM4_INTC_INTSEL102_INTSEL0                      *((volatile unsigned int*)(0x42A23E80UL))
#define bM4_INTC_INTSEL102_INTSEL1                      *((volatile unsigned int*)(0x42A23E84UL))
#define bM4_INTC_INTSEL102_INTSEL2                      *((volatile unsigned int*)(0x42A23E88UL))
#define bM4_INTC_INTSEL102_INTSEL3                      *((volatile unsigned int*)(0x42A23E8CUL))
#define bM4_INTC_INTSEL102_INTSEL4                      *((volatile unsigned int*)(0x42A23E90UL))
#define bM4_INTC_INTSEL102_INTSEL5                      *((volatile unsigned int*)(0x42A23E94UL))
#define bM4_INTC_INTSEL102_INTSEL6                      *((volatile unsigned int*)(0x42A23E98UL))
#define bM4_INTC_INTSEL102_INTSEL7                      *((volatile unsigned int*)(0x42A23E9CUL))
#define bM4_INTC_INTSEL102_INTSEL8                      *((volatile unsigned int*)(0x42A23EA0UL))
#define bM4_INTC_INTSEL103_INTSEL0                      *((volatile unsigned int*)(0x42A23F00UL))
#define bM4_INTC_INTSEL103_INTSEL1                      *((volatile unsigned int*)(0x42A23F04UL))
#define bM4_INTC_INTSEL103_INTSEL2                      *((volatile unsigned int*)(0x42A23F08UL))
#define bM4_INTC_INTSEL103_INTSEL3                      *((volatile unsigned int*)(0x42A23F0CUL))
#define bM4_INTC_INTSEL103_INTSEL4                      *((volatile unsigned int*)(0x42A23F10UL))
#define bM4_INTC_INTSEL103_INTSEL5                      *((volatile unsigned int*)(0x42A23F14UL))
#define bM4_INTC_INTSEL103_INTSEL6                      *((volatile unsigned int*)(0x42A23F18UL))
#define bM4_INTC_INTSEL103_INTSEL7                      *((volatile unsigned int*)(0x42A23F1CUL))
#define bM4_INTC_INTSEL103_INTSEL8                      *((volatile unsigned int*)(0x42A23F20UL))
#define bM4_INTC_INTSEL104_INTSEL0                      *((volatile unsigned int*)(0x42A23F80UL))
#define bM4_INTC_INTSEL104_INTSEL1                      *((volatile unsigned int*)(0x42A23F84UL))
#define bM4_INTC_INTSEL104_INTSEL2                      *((volatile unsigned int*)(0x42A23F88UL))
#define bM4_INTC_INTSEL104_INTSEL3                      *((volatile unsigned int*)(0x42A23F8CUL))
#define bM4_INTC_INTSEL104_INTSEL4                      *((volatile unsigned int*)(0x42A23F90UL))
#define bM4_INTC_INTSEL104_INTSEL5                      *((volatile unsigned int*)(0x42A23F94UL))
#define bM4_INTC_INTSEL104_INTSEL6                      *((volatile unsigned int*)(0x42A23F98UL))
#define bM4_INTC_INTSEL104_INTSEL7                      *((volatile unsigned int*)(0x42A23F9CUL))
#define bM4_INTC_INTSEL104_INTSEL8                      *((volatile unsigned int*)(0x42A23FA0UL))
#define bM4_INTC_INTSEL105_INTSEL0                      *((volatile unsigned int*)(0x42A24000UL))
#define bM4_INTC_INTSEL105_INTSEL1                      *((volatile unsigned int*)(0x42A24004UL))
#define bM4_INTC_INTSEL105_INTSEL2                      *((volatile unsigned int*)(0x42A24008UL))
#define bM4_INTC_INTSEL105_INTSEL3                      *((volatile unsigned int*)(0x42A2400CUL))
#define bM4_INTC_INTSEL105_INTSEL4                      *((volatile unsigned int*)(0x42A24010UL))
#define bM4_INTC_INTSEL105_INTSEL5                      *((volatile unsigned int*)(0x42A24014UL))
#define bM4_INTC_INTSEL105_INTSEL6                      *((volatile unsigned int*)(0x42A24018UL))
#define bM4_INTC_INTSEL105_INTSEL7                      *((volatile unsigned int*)(0x42A2401CUL))
#define bM4_INTC_INTSEL105_INTSEL8                      *((volatile unsigned int*)(0x42A24020UL))
#define bM4_INTC_INTSEL106_INTSEL0                      *((volatile unsigned int*)(0x42A24080UL))
#define bM4_INTC_INTSEL106_INTSEL1                      *((volatile unsigned int*)(0x42A24084UL))
#define bM4_INTC_INTSEL106_INTSEL2                      *((volatile unsigned int*)(0x42A24088UL))
#define bM4_INTC_INTSEL106_INTSEL3                      *((volatile unsigned int*)(0x42A2408CUL))
#define bM4_INTC_INTSEL106_INTSEL4                      *((volatile unsigned int*)(0x42A24090UL))
#define bM4_INTC_INTSEL106_INTSEL5                      *((volatile unsigned int*)(0x42A24094UL))
#define bM4_INTC_INTSEL106_INTSEL6                      *((volatile unsigned int*)(0x42A24098UL))
#define bM4_INTC_INTSEL106_INTSEL7                      *((volatile unsigned int*)(0x42A2409CUL))
#define bM4_INTC_INTSEL106_INTSEL8                      *((volatile unsigned int*)(0x42A240A0UL))
#define bM4_INTC_INTSEL107_INTSEL0                      *((volatile unsigned int*)(0x42A24100UL))
#define bM4_INTC_INTSEL107_INTSEL1                      *((volatile unsigned int*)(0x42A24104UL))
#define bM4_INTC_INTSEL107_INTSEL2                      *((volatile unsigned int*)(0x42A24108UL))
#define bM4_INTC_INTSEL107_INTSEL3                      *((volatile unsigned int*)(0x42A2410CUL))
#define bM4_INTC_INTSEL107_INTSEL4                      *((volatile unsigned int*)(0x42A24110UL))
#define bM4_INTC_INTSEL107_INTSEL5                      *((volatile unsigned int*)(0x42A24114UL))
#define bM4_INTC_INTSEL107_INTSEL6                      *((volatile unsigned int*)(0x42A24118UL))
#define bM4_INTC_INTSEL107_INTSEL7                      *((volatile unsigned int*)(0x42A2411CUL))
#define bM4_INTC_INTSEL107_INTSEL8                      *((volatile unsigned int*)(0x42A24120UL))
#define bM4_INTC_INTSEL108_INTSEL0                      *((volatile unsigned int*)(0x42A24180UL))
#define bM4_INTC_INTSEL108_INTSEL1                      *((volatile unsigned int*)(0x42A24184UL))
#define bM4_INTC_INTSEL108_INTSEL2                      *((volatile unsigned int*)(0x42A24188UL))
#define bM4_INTC_INTSEL108_INTSEL3                      *((volatile unsigned int*)(0x42A2418CUL))
#define bM4_INTC_INTSEL108_INTSEL4                      *((volatile unsigned int*)(0x42A24190UL))
#define bM4_INTC_INTSEL108_INTSEL5                      *((volatile unsigned int*)(0x42A24194UL))
#define bM4_INTC_INTSEL108_INTSEL6                      *((volatile unsigned int*)(0x42A24198UL))
#define bM4_INTC_INTSEL108_INTSEL7                      *((volatile unsigned int*)(0x42A2419CUL))
#define bM4_INTC_INTSEL108_INTSEL8                      *((volatile unsigned int*)(0x42A241A0UL))
#define bM4_INTC_INTSEL109_INTSEL0                      *((volatile unsigned int*)(0x42A24200UL))
#define bM4_INTC_INTSEL109_INTSEL1                      *((volatile unsigned int*)(0x42A24204UL))
#define bM4_INTC_INTSEL109_INTSEL2                      *((volatile unsigned int*)(0x42A24208UL))
#define bM4_INTC_INTSEL109_INTSEL3                      *((volatile unsigned int*)(0x42A2420CUL))
#define bM4_INTC_INTSEL109_INTSEL4                      *((volatile unsigned int*)(0x42A24210UL))
#define bM4_INTC_INTSEL109_INTSEL5                      *((volatile unsigned int*)(0x42A24214UL))
#define bM4_INTC_INTSEL109_INTSEL6                      *((volatile unsigned int*)(0x42A24218UL))
#define bM4_INTC_INTSEL109_INTSEL7                      *((volatile unsigned int*)(0x42A2421CUL))
#define bM4_INTC_INTSEL109_INTSEL8                      *((volatile unsigned int*)(0x42A24220UL))
#define bM4_INTC_INTSEL110_INTSEL0                      *((volatile unsigned int*)(0x42A24280UL))
#define bM4_INTC_INTSEL110_INTSEL1                      *((volatile unsigned int*)(0x42A24284UL))
#define bM4_INTC_INTSEL110_INTSEL2                      *((volatile unsigned int*)(0x42A24288UL))
#define bM4_INTC_INTSEL110_INTSEL3                      *((volatile unsigned int*)(0x42A2428CUL))
#define bM4_INTC_INTSEL110_INTSEL4                      *((volatile unsigned int*)(0x42A24290UL))
#define bM4_INTC_INTSEL110_INTSEL5                      *((volatile unsigned int*)(0x42A24294UL))
#define bM4_INTC_INTSEL110_INTSEL6                      *((volatile unsigned int*)(0x42A24298UL))
#define bM4_INTC_INTSEL110_INTSEL7                      *((volatile unsigned int*)(0x42A2429CUL))
#define bM4_INTC_INTSEL110_INTSEL8                      *((volatile unsigned int*)(0x42A242A0UL))
#define bM4_INTC_INTSEL111_INTSEL0                      *((volatile unsigned int*)(0x42A24300UL))
#define bM4_INTC_INTSEL111_INTSEL1                      *((volatile unsigned int*)(0x42A24304UL))
#define bM4_INTC_INTSEL111_INTSEL2                      *((volatile unsigned int*)(0x42A24308UL))
#define bM4_INTC_INTSEL111_INTSEL3                      *((volatile unsigned int*)(0x42A2430CUL))
#define bM4_INTC_INTSEL111_INTSEL4                      *((volatile unsigned int*)(0x42A24310UL))
#define bM4_INTC_INTSEL111_INTSEL5                      *((volatile unsigned int*)(0x42A24314UL))
#define bM4_INTC_INTSEL111_INTSEL6                      *((volatile unsigned int*)(0x42A24318UL))
#define bM4_INTC_INTSEL111_INTSEL7                      *((volatile unsigned int*)(0x42A2431CUL))
#define bM4_INTC_INTSEL111_INTSEL8                      *((volatile unsigned int*)(0x42A24320UL))
#define bM4_INTC_INTSEL112_INTSEL0                      *((volatile unsigned int*)(0x42A24380UL))
#define bM4_INTC_INTSEL112_INTSEL1                      *((volatile unsigned int*)(0x42A24384UL))
