RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_INTC_INTSEL112_INTSEL2                      *((volatile unsigned int*)(0x42A24388UL))
#define bM4_INTC_INTSEL112_INTSEL3                      *((volatile unsigned int*)(0x42A2438CUL))
#define bM4_INTC_INTSEL112_INTSEL4                      *((volatile unsigned int*)(0x42A24390UL))
#define bM4_INTC_INTSEL112_INTSEL5                      *((volatile unsigned int*)(0x42A24394UL))
#define bM4_INTC_INTSEL112_INTSEL6                      *((volatile unsigned int*)(0x42A24398UL))
#define bM4_INTC_INTSEL112_INTSEL7                      *((volatile unsigned int*)(0x42A2439CUL))
#define bM4_INTC_INTSEL112_INTSEL8                      *((volatile unsigned int*)(0x42A243A0UL))
#define bM4_INTC_INTSEL113_INTSEL0                      *((volatile unsigned int*)(0x42A24400UL))
#define bM4_INTC_INTSEL113_INTSEL1                      *((volatile unsigned int*)(0x42A24404UL))
#define bM4_INTC_INTSEL113_INTSEL2                      *((volatile unsigned int*)(0x42A24408UL))
#define bM4_INTC_INTSEL113_INTSEL3                      *((volatile unsigned int*)(0x42A2440CUL))
#define bM4_INTC_INTSEL113_INTSEL4                      *((volatile unsigned int*)(0x42A24410UL))
#define bM4_INTC_INTSEL113_INTSEL5                      *((volatile unsigned int*)(0x42A24414UL))
#define bM4_INTC_INTSEL113_INTSEL6                      *((volatile unsigned int*)(0x42A24418UL))
#define bM4_INTC_INTSEL113_INTSEL7                      *((volatile unsigned int*)(0x42A2441CUL))
#define bM4_INTC_INTSEL113_INTSEL8                      *((volatile unsigned int*)(0x42A24420UL))
#define bM4_INTC_INTSEL114_INTSEL0                      *((volatile unsigned int*)(0x42A24480UL))
#define bM4_INTC_INTSEL114_INTSEL1                      *((volatile unsigned int*)(0x42A24484UL))
#define bM4_INTC_INTSEL114_INTSEL2                      *((volatile unsigned int*)(0x42A24488UL))
#define bM4_INTC_INTSEL114_INTSEL3                      *((volatile unsigned int*)(0x42A2448CUL))
#define bM4_INTC_INTSEL114_INTSEL4                      *((volatile unsigned int*)(0x42A24490UL))
#define bM4_INTC_INTSEL114_INTSEL5                      *((volatile unsigned int*)(0x42A24494UL))
#define bM4_INTC_INTSEL114_INTSEL6                      *((volatile unsigned int*)(0x42A24498UL))
#define bM4_INTC_INTSEL114_INTSEL7                      *((volatile unsigned int*)(0x42A2449CUL))
#define bM4_INTC_INTSEL114_INTSEL8                      *((volatile unsigned int*)(0x42A244A0UL))
#define bM4_INTC_INTSEL115_INTSEL0                      *((volatile unsigned int*)(0x42A24500UL))
#define bM4_INTC_INTSEL115_INTSEL1                      *((volatile unsigned int*)(0x42A24504UL))
#define bM4_INTC_INTSEL115_INTSEL2                      *((volatile unsigned int*)(0x42A24508UL))
#define bM4_INTC_INTSEL115_INTSEL3                      *((volatile unsigned int*)(0x42A2450CUL))
#define bM4_INTC_INTSEL115_INTSEL4                      *((volatile unsigned int*)(0x42A24510UL))
#define bM4_INTC_INTSEL115_INTSEL5                      *((volatile unsigned int*)(0x42A24514UL))
#define bM4_INTC_INTSEL115_INTSEL6                      *((volatile unsigned int*)(0x42A24518UL))
#define bM4_INTC_INTSEL115_INTSEL7                      *((volatile unsigned int*)(0x42A2451CUL))
#define bM4_INTC_INTSEL115_INTSEL8                      *((volatile unsigned int*)(0x42A24520UL))
#define bM4_INTC_INTSEL116_INTSEL0                      *((volatile unsigned int*)(0x42A24580UL))
#define bM4_INTC_INTSEL116_INTSEL1                      *((volatile unsigned int*)(0x42A24584UL))
#define bM4_INTC_INTSEL116_INTSEL2                      *((volatile unsigned int*)(0x42A24588UL))
#define bM4_INTC_INTSEL116_INTSEL3                      *((volatile unsigned int*)(0x42A2458CUL))
#define bM4_INTC_INTSEL116_INTSEL4                      *((volatile unsigned int*)(0x42A24590UL))
#define bM4_INTC_INTSEL116_INTSEL5                      *((volatile unsigned int*)(0x42A24594UL))
#define bM4_INTC_INTSEL116_INTSEL6                      *((volatile unsigned int*)(0x42A24598UL))
#define bM4_INTC_INTSEL116_INTSEL7                      *((volatile unsigned int*)(0x42A2459CUL))
#define bM4_INTC_INTSEL116_INTSEL8                      *((volatile unsigned int*)(0x42A245A0UL))
#define bM4_INTC_INTSEL117_INTSEL0                      *((volatile unsigned int*)(0x42A24600UL))
#define bM4_INTC_INTSEL117_INTSEL1                      *((volatile unsigned int*)(0x42A24604UL))
#define bM4_INTC_INTSEL117_INTSEL2                      *((volatile unsigned int*)(0x42A24608UL))
#define bM4_INTC_INTSEL117_INTSEL3                      *((volatile unsigned int*)(0x42A2460CUL))
#define bM4_INTC_INTSEL117_INTSEL4                      *((volatile unsigned int*)(0x42A24610UL))
#define bM4_INTC_INTSEL117_INTSEL5                      *((volatile unsigned int*)(0x42A24614UL))
#define bM4_INTC_INTSEL117_INTSEL6                      *((volatile unsigned int*)(0x42A24618UL))
#define bM4_INTC_INTSEL117_INTSEL7                      *((volatile unsigned int*)(0x42A2461CUL))
#define bM4_INTC_INTSEL117_INTSEL8                      *((volatile unsigned int*)(0x42A24620UL))
#define bM4_INTC_INTSEL118_INTSEL0                      *((volatile unsigned int*)(0x42A24680UL))
#define bM4_INTC_INTSEL118_INTSEL1                      *((volatile unsigned int*)(0x42A24684UL))
#define bM4_INTC_INTSEL118_INTSEL2                      *((volatile unsigned int*)(0x42A24688UL))
#define bM4_INTC_INTSEL118_INTSEL3                      *((volatile unsigned int*)(0x42A2468CUL))
#define bM4_INTC_INTSEL118_INTSEL4                      *((volatile unsigned int*)(0x42A24690UL))
#define bM4_INTC_INTSEL118_INTSEL5                      *((volatile unsigned int*)(0x42A24694UL))
#define bM4_INTC_INTSEL118_INTSEL6                      *((volatile unsigned int*)(0x42A24698UL))
#define bM4_INTC_INTSEL118_INTSEL7                      *((volatile unsigned int*)(0x42A2469CUL))
#define bM4_INTC_INTSEL118_INTSEL8                      *((volatile unsigned int*)(0x42A246A0UL))
#define bM4_INTC_INTSEL119_INTSEL0                      *((volatile unsigned int*)(0x42A24700UL))
#define bM4_INTC_INTSEL119_INTSEL1                      *((volatile unsigned int*)(0x42A24704UL))
#define bM4_INTC_INTSEL119_INTSEL2                      *((volatile unsigned int*)(0x42A24708UL))
#define bM4_INTC_INTSEL119_INTSEL3                      *((volatile unsigned int*)(0x42A2470CUL))
#define bM4_INTC_INTSEL119_INTSEL4                      *((volatile unsigned int*)(0x42A24710UL))
#define bM4_INTC_INTSEL119_INTSEL5                      *((volatile unsigned int*)(0x42A24714UL))
#define bM4_INTC_INTSEL119_INTSEL6                      *((volatile unsigned int*)(0x42A24718UL))
#define bM4_INTC_INTSEL119_INTSEL7                      *((volatile unsigned int*)(0x42A2471CUL))
#define bM4_INTC_INTSEL119_INTSEL8                      *((volatile unsigned int*)(0x42A24720UL))
#define bM4_INTC_INTSEL120_INTSEL0                      *((volatile unsigned int*)(0x42A24780UL))
#define bM4_INTC_INTSEL120_INTSEL1                      *((volatile unsigned int*)(0x42A24784UL))
#define bM4_INTC_INTSEL120_INTSEL2                      *((volatile unsigned int*)(0x42A24788UL))
#define bM4_INTC_INTSEL120_INTSEL3                      *((volatile unsigned int*)(0x42A2478CUL))
#define bM4_INTC_INTSEL120_INTSEL4                      *((volatile unsigned int*)(0x42A24790UL))
#define bM4_INTC_INTSEL120_INTSEL5                      *((volatile unsigned int*)(0x42A24794UL))
#define bM4_INTC_INTSEL120_INTSEL6                      *((volatile unsigned int*)(0x42A24798UL))
#define bM4_INTC_INTSEL120_INTSEL7                      *((volatile unsigned int*)(0x42A2479CUL))
#define bM4_INTC_INTSEL120_INTSEL8                      *((volatile unsigned int*)(0x42A247A0UL))
#define bM4_INTC_INTSEL121_INTSEL0                      *((volatile unsigned int*)(0x42A24800UL))
#define bM4_INTC_INTSEL121_INTSEL1                      *((volatile unsigned int*)(0x42A24804UL))
#define bM4_INTC_INTSEL121_INTSEL2                      *((volatile unsigned int*)(0x42A24808UL))
#define bM4_INTC_INTSEL121_INTSEL3                      *((volatile unsigned int*)(0x42A2480CUL))
#define bM4_INTC_INTSEL121_INTSEL4                      *((volatile unsigned int*)(0x42A24810UL))
#define bM4_INTC_INTSEL121_INTSEL5                      *((volatile unsigned int*)(0x42A24814UL))
#define bM4_INTC_INTSEL121_INTSEL6                      *((volatile unsigned int*)(0x42A24818UL))
#define bM4_INTC_INTSEL121_INTSEL7                      *((volatile unsigned int*)(0x42A2481CUL))
#define bM4_INTC_INTSEL121_INTSEL8                      *((volatile unsigned int*)(0x42A24820UL))
#define bM4_INTC_INTSEL122_INTSEL0                      *((volatile unsigned int*)(0x42A24880UL))
#define bM4_INTC_INTSEL122_INTSEL1                      *((volatile unsigned int*)(0x42A24884UL))
#define bM4_INTC_INTSEL122_INTSEL2                      *((volatile unsigned int*)(0x42A24888UL))
#define bM4_INTC_INTSEL122_INTSEL3                      *((volatile unsigned int*)(0x42A2488CUL))
#define bM4_INTC_INTSEL122_INTSEL4                      *((volatile unsigned int*)(0x42A24890UL))
#define bM4_INTC_INTSEL122_INTSEL5                      *((volatile unsigned int*)(0x42A24894UL))
#define bM4_INTC_INTSEL122_INTSEL6                      *((volatile unsigned int*)(0x42A24898UL))
#define bM4_INTC_INTSEL122_INTSEL7                      *((volatile unsigned int*)(0x42A2489CUL))
#define bM4_INTC_INTSEL122_INTSEL8                      *((volatile unsigned int*)(0x42A248A0UL))
#define bM4_INTC_INTSEL123_INTSEL0                      *((volatile unsigned int*)(0x42A24900UL))
#define bM4_INTC_INTSEL123_INTSEL1                      *((volatile unsigned int*)(0x42A24904UL))
#define bM4_INTC_INTSEL123_INTSEL2                      *((volatile unsigned int*)(0x42A24908UL))
#define bM4_INTC_INTSEL123_INTSEL3                      *((volatile unsigned int*)(0x42A2490CUL))
#define bM4_INTC_INTSEL123_INTSEL4                      *((volatile unsigned int*)(0x42A24910UL))
#define bM4_INTC_INTSEL123_INTSEL5                      *((volatile unsigned int*)(0x42A24914UL))
#define bM4_INTC_INTSEL123_INTSEL6                      *((volatile unsigned int*)(0x42A24918UL))
#define bM4_INTC_INTSEL123_INTSEL7                      *((volatile unsigned int*)(0x42A2491CUL))
#define bM4_INTC_INTSEL123_INTSEL8                      *((volatile unsigned int*)(0x42A24920UL))
#define bM4_INTC_INTSEL124_INTSEL0                      *((volatile unsigned int*)(0x42A24980UL))
#define bM4_INTC_INTSEL124_INTSEL1                      *((volatile unsigned int*)(0x42A24984UL))
#define bM4_INTC_INTSEL124_INTSEL2                      *((volatile unsigned int*)(0x42A24988UL))
#define bM4_INTC_INTSEL124_INTSEL3                      *((volatile unsigned int*)(0x42A2498CUL))
#define bM4_INTC_INTSEL124_INTSEL4                      *((volatile unsigned int*)(0x42A24990UL))
#define bM4_INTC_INTSEL124_INTSEL5                      *((volatile unsigned int*)(0x42A24994UL))
#define bM4_INTC_INTSEL124_INTSEL6                      *((volatile unsigned int*)(0x42A24998UL))
#define bM4_INTC_INTSEL124_INTSEL7                      *((volatile unsigned int*)(0x42A2499CUL))
#define bM4_INTC_INTSEL124_INTSEL8                      *((volatile unsigned int*)(0x42A249A0UL))
#define bM4_INTC_INTSEL125_INTSEL0                      *((volatile unsigned int*)(0x42A24A00UL))
#define bM4_INTC_INTSEL125_INTSEL1                      *((volatile unsigned int*)(0x42A24A04UL))
#define bM4_INTC_INTSEL125_INTSEL2                      *((volatile unsigned int*)(0x42A24A08UL))
#define bM4_INTC_INTSEL125_INTSEL3                      *((volatile unsigned int*)(0x42A24A0CUL))
#define bM4_INTC_INTSEL125_INTSEL4                      *((volatile unsigned int*)(0x42A24A10UL))
#define bM4_INTC_INTSEL125_INTSEL5                      *((volatile unsigned int*)(0x42A24A14UL))
#define bM4_INTC_INTSEL125_INTSEL6                      *((volatile unsigned int*)(0x42A24A18UL))
#define bM4_INTC_INTSEL125_INTSEL7                      *((volatile unsigned int*)(0x42A24A1CUL))
#define bM4_INTC_INTSEL125_INTSEL8                      *((volatile unsigned int*)(0x42A24A20UL))
#define bM4_INTC_INTSEL126_INTSEL0                      *((volatile unsigned int*)(0x42A24A80UL))
#define bM4_INTC_INTSEL126_INTSEL1                      *((volatile unsigned int*)(0x42A24A84UL))
#define bM4_INTC_INTSEL126_INTSEL2                      *((volatile unsigned int*)(0x42A24A88UL))
#define bM4_INTC_INTSEL126_INTSEL3                      *((volatile unsigned int*)(0x42A24A8CUL))
#define bM4_INTC_INTSEL126_INTSEL4                      *((volatile unsigned int*)(0x42A24A90UL))
#define bM4_INTC_INTSEL126_INTSEL5                      *((volatile unsigned int*)(0x42A24A94UL))
#define bM4_INTC_INTSEL126_INTSEL6                      *((volatile unsigned int*)(0x42A24A98UL))
#define bM4_INTC_INTSEL126_INTSEL7                      *((volatile unsigned int*)(0x42A24A9CUL))
#define bM4_INTC_INTSEL126_INTSEL8                      *((volatile unsigned int*)(0x42A24AA0UL))
#define bM4_INTC_INTSEL127_INTSEL0                      *((volatile unsigned int*)(0x42A24B00UL))
#define bM4_INTC_INTSEL127_INTSEL1                      *((volatile unsigned int*)(0x42A24B04UL))
#define bM4_INTC_INTSEL127_INTSEL2                      *((volatile unsigned int*)(0x42A24B08UL))
#define bM4_INTC_INTSEL127_INTSEL3                      *((volatile unsigned int*)(0x42A24B0CUL))
#define bM4_INTC_INTSEL127_INTSEL4                      *((volatile unsigned int*)(0x42A24B10UL))
#define bM4_INTC_INTSEL127_INTSEL5                      *((volatile unsigned int*)(0x42A24B14UL))
#define bM4_INTC_INTSEL127_INTSEL6                      *((volatile unsigned int*)(0x42A24B18UL))
#define bM4_INTC_INTSEL127_INTSEL7                      *((volatile unsigned int*)(0x42A24B1CUL))
#define bM4_INTC_INTSEL127_INTSEL8                      *((volatile unsigned int*)(0x42A24B20UL))
#define bM4_MSC0_I2C_SMR_TXIE                           *((volatile unsigned int*)(0x42420008UL))
#define bM4_MSC0_I2C_SMR_RXIE                           *((volatile unsigned int*)(0x4242000CUL))
#define bM4_MSC0_I2C_SMR_MODE0                          *((volatile unsigned int*)(0x42420014UL))
#define bM4_MSC0_I2C_SMR_MODE1                          *((volatile unsigned int*)(0x42420018UL))
#define bM4_MSC0_I2C_SMR_MODE2                          *((volatile unsigned int*)(0x4242001CUL))
#define bM4_MSC0_I2C_SCR_INTF                           *((volatile unsigned int*)(0x42420020UL))
#define bM4_MSC0_I2C_SCR_BERF                           *((volatile unsigned int*)(0x42420024UL))
#define bM4_MSC0_I2C_SCR_INTFE                          *((volatile unsigned int*)(0x42420028UL))
#define bM4_MSC0_I2C_SCR_CNDDIE                         *((volatile unsigned int*)(0x4242002CUL))
#define bM4_MSC0_I2C_SCR_WTSEL                          *((volatile unsigned int*)(0x42420030UL))
#define bM4_MSC0_I2C_SCR_ACKE                           *((volatile unsigned int*)(0x42420034UL))
#define bM4_MSC0_I2C_SCR_OFITS                          *((volatile unsigned int*)(0x42420038UL))
#define bM4_MSC0_I2C_SCR_MSS                            *((volatile unsigned int*)(0x4242003CUL))
#define bM4_MSC0_I2C_BS_BSS                             *((volatile unsigned int*)(0x42420080UL))
#define bM4_MSC0_I2C_BS_STPCC                           *((volatile unsigned int*)(0x42420084UL))
#define bM4_MSC0_I2C_BS_ITSCC                           *((volatile unsigned int*)(0x42420088UL))
#define bM4_MSC0_I2C_BS_ABL                             *((volatile unsigned int*)(0x4242008CUL))
#define bM4_MSC0_I2C_BS_TRX                             *((volatile unsigned int*)(0x42420090UL))
#define bM4_MSC0_I2C_BS_RAD                             *((volatile unsigned int*)(0x42420094UL))
#define bM4_MSC0_I2C_BS_ACKF                            *((volatile unsigned int*)(0x42420098UL))
#define bM4_MSC0_I2C_BS_FBSS                            *((volatile unsigned int*)(0x4242009CUL))
#define bM4_MSC0_I2C_SR_TDEF                            *((volatile unsigned int*)(0x424200A4UL))
#define bM4_MSC0_I2C_SR_RDFF                            *((volatile unsigned int*)(0x424200A8UL))
#define bM4_MSC0_I2C_SR_ORF                             *((volatile unsigned int*)(0x424200ACUL))
#define bM4_MSC0_I2C_SR_TEFS                            *((volatile unsigned int*)(0x424200B8UL))
#define bM4_MSC0_I2C_SR_RECLR                           *((volatile unsigned int*)(0x424200BCUL))
#define bM4_MSC0_I2C_BRS_BRR00                          *((volatile unsigned int*)(0x42420180UL))
#define bM4_MSC0_I2C_BRS_BRR01                          *((volatile unsigned int*)(0x42420184UL))
#define bM4_MSC0_I2C_BRS_BRR02                          *((volatile unsigned int*)(0x42420188UL))
#define bM4_MSC0_I2C_BRS_BRR03                          *((volatile unsigned int*)(0x4242018CUL))
#define bM4_MSC0_I2C_BRS_BRR04                          *((volatile unsigned int*)(0x42420190UL))
#define bM4_MSC0_I2C_BRS_BRR05                          *((volatile unsigned int*)(0x42420194UL))
#define bM4_MSC0_I2C_BRS_BRR06                          *((volatile unsigned int*)(0x42420198UL))
#define bM4_MSC0_I2C_BRS_BRR07                          *((volatile unsigned int*)(0x4242019CUL))
#define bM4_MSC0_I2C_BRS_ADDR0                          *((volatile unsigned int*)(0x42420180UL))
#define bM4_MSC0_I2C_BRS_ADDR1                          *((volatile unsigned int*)(0x42420184UL))
#define bM4_MSC0_I2C_BRS_ADDR2                          *((volatile unsigned int*)(0x42420188UL))
#define bM4_MSC0_I2C_BRS_ADDR3                          *((volatile unsigned int*)(0x4242018CUL))
#define bM4_MSC0_I2C_BRS_ADDR4                          *((volatile unsigned int*)(0x42420190UL))
#define bM4_MSC0_I2C_BRS_ADDR5                          *((volatile unsigned int*)(0x42420194UL))
#define bM4_MSC0_I2C_BRS_ADDR6                          *((volatile unsigned int*)(0x42420198UL))
#define bM4_MSC0_I2C_BRS_AE                             *((volatile unsigned int*)(0x4242019CUL))
#define bM4_MSC0_I2C_BRS_BRR10                          *((volatile unsigned int*)(0x424201A0UL))
#define bM4_MSC0_I2C_BRS_BRR11                          *((volatile unsigned int*)(0x424201A4UL))
#define bM4_MSC0_I2C_BRS_BRR12                          *((volatile unsigned int*)(0x424201A8UL))
#define bM4_MSC0_I2C_BRS_BRR13                          *((volatile unsigned int*)(0x424201ACUL))
#define bM4_MSC0_I2C_BRS_BRR14                          *((volatile unsigned int*)(0x424201B0UL))
#define bM4_MSC0_I2C_BRS_BRR15                          *((volatile unsigned int*)(0x424201B4UL))
#define bM4_MSC0_I2C_BRS_BRR16                          *((volatile unsigned int*)(0x424201B8UL))
#define bM4_MSC0_I2C_BRS_SA0                            *((volatile unsigned int*)(0x424201A0UL))
#define bM4_MSC0_I2C_BRS_SA1                            *((volatile unsigned int*)(0x424201A4UL))
#define bM4_MSC0_I2C_BRS_SA2                            *((volatile unsigned int*)(0x424201A8UL))
#define bM4_MSC0_I2C_SAMSK_MSK0                         *((volatile unsigned int*)(0x42420220UL))
#define bM4_MSC0_I2C_SAMSK_MSK1                         *((volatile unsigned int*)(0x42420224UL))
#define bM4_MSC0_I2C_SAMSK_MSK2                         *((volatile unsigned int*)(0x42420228UL))
#define bM4_MSC0_I2C_SAMSK_MSK3                         *((volatile unsigned int*)(0x4242022CUL))
#define bM4_MSC0_I2C_SAMSK_MSK4                         *((volatile unsigned int*)(0x42420230UL))
#define bM4_MSC0_I2C_SAMSK_MSK5                         *((volatile unsigned int*)(0x42420234UL))
#define bM4_MSC0_I2C_SAMSK_MSK6                         *((volatile unsigned int*)(0x42420238UL))
#define bM4_MSC0_I2C_SAMSK_EN                           *((volatile unsigned int*)(0x4242023CUL))
#define bM4_MSC0_I2C_EBCR_BEC                           *((volatile unsigned int*)(0x424203A0UL))
#define bM4_MSC0_I2C_EBCR_DOE                           *((volatile unsigned int*)(0x424203A4UL))
#define bM4_MSC0_I2C_EBCR_SCL0C                         *((volatile unsigned int*)(0x424203A8UL))
#define bM4_MSC0_I2C_EBCR_SDA0C                         *((volatile unsigned int*)(0x424203ACUL))
#define bM4_MSC0_I2C_EBCR_SCLS                          *((volatile unsigned int*)(0x424203B0UL))
#define bM4_MSC0_I2C_EBCR_SDAS                          *((volatile unsigned int*)(0x424203B4UL))
#define bM4_MSC1_I2C_SMR_TXIE                           *((volatile unsigned int*)(0x42422008UL))
#define bM4_MSC1_I2C_SMR_RXIE                           *((volatile unsigned int*)(0x4242200CUL))
#define bM4_MSC1_I2C_SMR_MODE0                          *((volatile unsigned int*)(0x42422014UL))
#define bM4_MSC1_I2C_SMR_MODE1                          *((volatile unsigned int*)(0x42422018UL))
#define bM4_MSC1_I2C_SMR_MODE2                          *((volatile unsigned int*)(0x4242201CUL))
#define bM4_MSC1_I2C_SCR_INTF                           *((volatile unsigned int*)(0x42422020UL))
#define bM4_MSC1_I2C_SCR_BERF                           *((volatile unsigned int*)(0x42422024UL))
#define bM4_MSC1_I2C_SCR_INTFE                          *((volatile unsigned int*)(0x42422028UL))
#define bM4_MSC1_I2C_SCR_CNDDIE                         *((volatile unsigned int*)(0x4242202CUL))
#define bM4_MSC1_I2C_SCR_WTSEL                          *((volatile unsigned int*)(0x42422030UL))
#define bM4_MSC1_I2C_SCR_ACKE                           *((volatile unsigned int*)(0x42422034UL))
#define bM4_MSC1_I2C_SCR_OFITS                          *((volatile unsigned int*)(0x42422038UL))
#define bM4_MSC1_I2C_SCR_MSS                            *((volatile unsigned int*)(0x4242203CUL))
#define bM4_MSC1_I2C_BS_BSS                             *((volatile unsigned int*)(0x42422080UL))
#define bM4_MSC1_I2C_BS_STPCC                           *((volatile unsigned int*)(0x42422084UL))
#define bM4_MSC1_I2C_BS_ITSCC                           *((volatile unsigned int*)(0x42422088UL))
#define bM4_MSC1_I2C_BS_ABL                             *((volatile unsigned int*)(0x4242208CUL))
#define bM4_MSC1_I2C_BS_TRX                             *((volatile unsigned int*)(0x42422090UL))
#define bM4_MSC1_I2C_BS_RAD                             *((volatile unsigned int*)(0x42422094UL))
#define bM4_MSC1_I2C_BS_ACKF                            *((volatile unsigned int*)(0x42422098UL))
#define bM4_MSC1_I2C_BS_FBSS                            *((volatile unsigned int*)(0x4242209CUL))
#define bM4_MSC1_I2C_SR_TDEF                            *((volatile unsigned int*)(0x424220A4UL))
#define bM4_MSC1_I2C_SR_RDFF                            *((volatile unsigned int*)(0x424220A8UL))
#define bM4_MSC1_I2C_SR_ORF                             *((volatile unsigned int*)(0x424220ACUL))
#define bM4_MSC1_I2C_SR_TEFS                            *((volatile unsigned int*)(0x424220B8UL))
#define bM4_MSC1_I2C_SR_RECLR                           *((volatile unsigned int*)(0x424220BCUL))
#define bM4_MSC1_I2C_BRS_BRR00                          *((volatile unsigned int*)(0x42422180UL))
#define bM4_MSC1_I2C_BRS_BRR01                          *((volatile unsigned int*)(0x42422184UL))
#define bM4_MSC1_I2C_BRS_BRR02                          *((volatile unsigned int*)(0x42422188UL))
#define bM4_MSC1_I2C_BRS_BRR03                          *((volatile unsigned int*)(0x4242218CUL))
#define bM4_MSC1_I2C_BRS_BRR04                          *((volatile unsigned int*)(0x42422190UL))
#define bM4_MSC1_I2C_BRS_BRR05                          *((volatile unsigned int*)(0x42422194UL))
#define bM4_MSC1_I2C_BRS_BRR06                          *((volatile unsigned int*)(0x42422198UL))
#define bM4_MSC1_I2C_BRS_BRR07                          *((volatile unsigned int*)(0x4242219CUL))
#define bM4_MSC1_I2C_BRS_ADDR0                          *((volatile unsigned int*)(0x42422180UL))
#define bM4_MSC1_I2C_BRS_ADDR1                          *((volatile unsigned int*)(0x42422184UL))
