RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_MSC1_I2C_BRS_ADDR2                          *((volatile unsigned int*)(0x42422188UL))
#define bM4_MSC1_I2C_BRS_ADDR3                          *((volatile unsigned int*)(0x4242218CUL))
#define bM4_MSC1_I2C_BRS_ADDR4                          *((volatile unsigned int*)(0x42422190UL))
#define bM4_MSC1_I2C_BRS_ADDR5                          *((volatile unsigned int*)(0x42422194UL))
#define bM4_MSC1_I2C_BRS_ADDR6                          *((volatile unsigned int*)(0x42422198UL))
#define bM4_MSC1_I2C_BRS_AE                             *((volatile unsigned int*)(0x4242219CUL))
#define bM4_MSC1_I2C_BRS_BRR10                          *((volatile unsigned int*)(0x424221A0UL))
#define bM4_MSC1_I2C_BRS_BRR11                          *((volatile unsigned int*)(0x424221A4UL))
#define bM4_MSC1_I2C_BRS_BRR12                          *((volatile unsigned int*)(0x424221A8UL))
#define bM4_MSC1_I2C_BRS_BRR13                          *((volatile unsigned int*)(0x424221ACUL))
#define bM4_MSC1_I2C_BRS_BRR14                          *((volatile unsigned int*)(0x424221B0UL))
#define bM4_MSC1_I2C_BRS_BRR15                          *((volatile unsigned int*)(0x424221B4UL))
#define bM4_MSC1_I2C_BRS_BRR16                          *((volatile unsigned int*)(0x424221B8UL))
#define bM4_MSC1_I2C_BRS_SA0                            *((volatile unsigned int*)(0x424221A0UL))
#define bM4_MSC1_I2C_BRS_SA1                            *((volatile unsigned int*)(0x424221A4UL))
#define bM4_MSC1_I2C_BRS_SA2                            *((volatile unsigned int*)(0x424221A8UL))
#define bM4_MSC1_I2C_SAMSK_MSK0                         *((volatile unsigned int*)(0x42422220UL))
#define bM4_MSC1_I2C_SAMSK_MSK1                         *((volatile unsigned int*)(0x42422224UL))
#define bM4_MSC1_I2C_SAMSK_MSK2                         *((volatile unsigned int*)(0x42422228UL))
#define bM4_MSC1_I2C_SAMSK_MSK3                         *((volatile unsigned int*)(0x4242222CUL))
#define bM4_MSC1_I2C_SAMSK_MSK4                         *((volatile unsigned int*)(0x42422230UL))
#define bM4_MSC1_I2C_SAMSK_MSK5                         *((volatile unsigned int*)(0x42422234UL))
#define bM4_MSC1_I2C_SAMSK_MSK6                         *((volatile unsigned int*)(0x42422238UL))
#define bM4_MSC1_I2C_SAMSK_EN                           *((volatile unsigned int*)(0x4242223CUL))
#define bM4_MSC1_I2C_EBCR_BEC                           *((volatile unsigned int*)(0x424223A0UL))
#define bM4_MSC1_I2C_EBCR_DOE                           *((volatile unsigned int*)(0x424223A4UL))
#define bM4_MSC1_I2C_EBCR_SCL0C                         *((volatile unsigned int*)(0x424223A8UL))
#define bM4_MSC1_I2C_EBCR_SDA0C                         *((volatile unsigned int*)(0x424223ACUL))
#define bM4_MSC1_I2C_EBCR_SCLS                          *((volatile unsigned int*)(0x424223B0UL))
#define bM4_MSC1_I2C_EBCR_SDAS                          *((volatile unsigned int*)(0x424223B4UL))
#define bM4_MSC2_I2C_SMR_TXIE                           *((volatile unsigned int*)(0x42424008UL))
#define bM4_MSC2_I2C_SMR_RXIE                           *((volatile unsigned int*)(0x4242400CUL))
#define bM4_MSC2_I2C_SMR_MODE0                          *((volatile unsigned int*)(0x42424014UL))
#define bM4_MSC2_I2C_SMR_MODE1                          *((volatile unsigned int*)(0x42424018UL))
#define bM4_MSC2_I2C_SMR_MODE2                          *((volatile unsigned int*)(0x4242401CUL))
#define bM4_MSC2_I2C_SCR_INTF                           *((volatile unsigned int*)(0x42424020UL))
#define bM4_MSC2_I2C_SCR_BERF                           *((volatile unsigned int*)(0x42424024UL))
#define bM4_MSC2_I2C_SCR_INTFE                          *((volatile unsigned int*)(0x42424028UL))
#define bM4_MSC2_I2C_SCR_CNDDIE                         *((volatile unsigned int*)(0x4242402CUL))
#define bM4_MSC2_I2C_SCR_WTSEL                          *((volatile unsigned int*)(0x42424030UL))
#define bM4_MSC2_I2C_SCR_ACKE                           *((volatile unsigned int*)(0x42424034UL))
#define bM4_MSC2_I2C_SCR_OFITS                          *((volatile unsigned int*)(0x42424038UL))
#define bM4_MSC2_I2C_SCR_MSS                            *((volatile unsigned int*)(0x4242403CUL))
#define bM4_MSC2_I2C_BS_BSS                             *((volatile unsigned int*)(0x42424080UL))
#define bM4_MSC2_I2C_BS_STPCC                           *((volatile unsigned int*)(0x42424084UL))
#define bM4_MSC2_I2C_BS_ITSCC                           *((volatile unsigned int*)(0x42424088UL))
#define bM4_MSC2_I2C_BS_ABL                             *((volatile unsigned int*)(0x4242408CUL))
#define bM4_MSC2_I2C_BS_TRX                             *((volatile unsigned int*)(0x42424090UL))
#define bM4_MSC2_I2C_BS_RAD                             *((volatile unsigned int*)(0x42424094UL))
#define bM4_MSC2_I2C_BS_ACKF                            *((volatile unsigned int*)(0x42424098UL))
#define bM4_MSC2_I2C_BS_FBSS                            *((volatile unsigned int*)(0x4242409CUL))
#define bM4_MSC2_I2C_SR_TDEF                            *((volatile unsigned int*)(0x424240A4UL))
#define bM4_MSC2_I2C_SR_RDFF                            *((volatile unsigned int*)(0x424240A8UL))
#define bM4_MSC2_I2C_SR_ORF                             *((volatile unsigned int*)(0x424240ACUL))
#define bM4_MSC2_I2C_SR_TEFS                            *((volatile unsigned int*)(0x424240B8UL))
#define bM4_MSC2_I2C_SR_RECLR                           *((volatile unsigned int*)(0x424240BCUL))
#define bM4_MSC2_I2C_BRS_BRR00                          *((volatile unsigned int*)(0x42424180UL))
#define bM4_MSC2_I2C_BRS_BRR01                          *((volatile unsigned int*)(0x42424184UL))
#define bM4_MSC2_I2C_BRS_BRR02                          *((volatile unsigned int*)(0x42424188UL))
#define bM4_MSC2_I2C_BRS_BRR03                          *((volatile unsigned int*)(0x4242418CUL))
#define bM4_MSC2_I2C_BRS_BRR04                          *((volatile unsigned int*)(0x42424190UL))
#define bM4_MSC2_I2C_BRS_BRR05                          *((volatile unsigned int*)(0x42424194UL))
#define bM4_MSC2_I2C_BRS_BRR06                          *((volatile unsigned int*)(0x42424198UL))
#define bM4_MSC2_I2C_BRS_BRR07                          *((volatile unsigned int*)(0x4242419CUL))
#define bM4_MSC2_I2C_BRS_ADDR0                          *((volatile unsigned int*)(0x42424180UL))
#define bM4_MSC2_I2C_BRS_ADDR1                          *((volatile unsigned int*)(0x42424184UL))
#define bM4_MSC2_I2C_BRS_ADDR2                          *((volatile unsigned int*)(0x42424188UL))
#define bM4_MSC2_I2C_BRS_ADDR3                          *((volatile unsigned int*)(0x4242418CUL))
#define bM4_MSC2_I2C_BRS_ADDR4                          *((volatile unsigned int*)(0x42424190UL))
#define bM4_MSC2_I2C_BRS_ADDR5                          *((volatile unsigned int*)(0x42424194UL))
#define bM4_MSC2_I2C_BRS_ADDR6                          *((volatile unsigned int*)(0x42424198UL))
#define bM4_MSC2_I2C_BRS_AE                             *((volatile unsigned int*)(0x4242419CUL))
#define bM4_MSC2_I2C_BRS_BRR10                          *((volatile unsigned int*)(0x424241A0UL))
#define bM4_MSC2_I2C_BRS_BRR11                          *((volatile unsigned int*)(0x424241A4UL))
#define bM4_MSC2_I2C_BRS_BRR12                          *((volatile unsigned int*)(0x424241A8UL))
#define bM4_MSC2_I2C_BRS_BRR13                          *((volatile unsigned int*)(0x424241ACUL))
#define bM4_MSC2_I2C_BRS_BRR14                          *((volatile unsigned int*)(0x424241B0UL))
#define bM4_MSC2_I2C_BRS_BRR15                          *((volatile unsigned int*)(0x424241B4UL))
#define bM4_MSC2_I2C_BRS_BRR16                          *((volatile unsigned int*)(0x424241B8UL))
#define bM4_MSC2_I2C_BRS_SA0                            *((volatile unsigned int*)(0x424241A0UL))
#define bM4_MSC2_I2C_BRS_SA1                            *((volatile unsigned int*)(0x424241A4UL))
#define bM4_MSC2_I2C_BRS_SA2                            *((volatile unsigned int*)(0x424241A8UL))
#define bM4_MSC2_I2C_SAMSK_MSK0                         *((volatile unsigned int*)(0x42424220UL))
#define bM4_MSC2_I2C_SAMSK_MSK1                         *((volatile unsigned int*)(0x42424224UL))
#define bM4_MSC2_I2C_SAMSK_MSK2                         *((volatile unsigned int*)(0x42424228UL))
#define bM4_MSC2_I2C_SAMSK_MSK3                         *((volatile unsigned int*)(0x4242422CUL))
#define bM4_MSC2_I2C_SAMSK_MSK4                         *((volatile unsigned int*)(0x42424230UL))
#define bM4_MSC2_I2C_SAMSK_MSK5                         *((volatile unsigned int*)(0x42424234UL))
#define bM4_MSC2_I2C_SAMSK_MSK6                         *((volatile unsigned int*)(0x42424238UL))
#define bM4_MSC2_I2C_SAMSK_EN                           *((volatile unsigned int*)(0x4242423CUL))
#define bM4_MSC2_I2C_EBCR_BEC                           *((volatile unsigned int*)(0x424243A0UL))
#define bM4_MSC2_I2C_EBCR_DOE                           *((volatile unsigned int*)(0x424243A4UL))
#define bM4_MSC2_I2C_EBCR_SCL0C                         *((volatile unsigned int*)(0x424243A8UL))
#define bM4_MSC2_I2C_EBCR_SDA0C                         *((volatile unsigned int*)(0x424243ACUL))
#define bM4_MSC2_I2C_EBCR_SCLS                          *((volatile unsigned int*)(0x424243B0UL))
#define bM4_MSC2_I2C_EBCR_SDAS                          *((volatile unsigned int*)(0x424243B4UL))
#define bM4_MSC0_SCI_SMR_DOE                            *((volatile unsigned int*)(0x42420000UL))
#define bM4_MSC0_SCI_SMR_TDS                            *((volatile unsigned int*)(0x42420008UL))
#define bM4_MSC0_SCI_SMR_SBLS                           *((volatile unsigned int*)(0x4242000CUL))
#define bM4_MSC0_SCI_SMR_MODE0                          *((volatile unsigned int*)(0x42420014UL))
#define bM4_MSC0_SCI_SMR_MODE1                          *((volatile unsigned int*)(0x42420018UL))
#define bM4_MSC0_SCI_SMR_MODE2                          *((volatile unsigned int*)(0x4242001CUL))
#define bM4_MSC0_SCI_SCR_TXE                            *((volatile unsigned int*)(0x42420020UL))
#define bM4_MSC0_SCI_SCR_RXE                            *((volatile unsigned int*)(0x42420024UL))
#define bM4_MSC0_SCI_SCR_TBIE                           *((volatile unsigned int*)(0x42420028UL))
#define bM4_MSC0_SCI_SCR_TXIE                           *((volatile unsigned int*)(0x4242002CUL))
#define bM4_MSC0_SCI_SCR_RXIE                           *((volatile unsigned int*)(0x42420030UL))
#define bM4_MSC0_SCI_SCR_PCL                            *((volatile unsigned int*)(0x4242003CUL))
#define bM4_MSC0_SCI_ECR_DL0                            *((volatile unsigned int*)(0x42420080UL))
#define bM4_MSC0_SCI_ECR_DL1                            *((volatile unsigned int*)(0x42420084UL))
#define bM4_MSC0_SCI_ECR_DL2                            *((volatile unsigned int*)(0x42420088UL))
#define bM4_MSC0_SCI_ECR_PS                             *((volatile unsigned int*)(0x4242008CUL))
#define bM4_MSC0_SCI_ECR_PE                             *((volatile unsigned int*)(0x42420090UL))
#define bM4_MSC0_SCI_ECR_INV                            *((volatile unsigned int*)(0x42420094UL))
#define bM4_MSC0_SCI_ECR_ESBLS                          *((volatile unsigned int*)(0x42420098UL))
#define bM4_MSC0_SCI_ECR_FCEB                           *((volatile unsigned int*)(0x4242009CUL))
#define bM4_MSC0_SCI_SR_TBIF                            *((volatile unsigned int*)(0x424200A0UL))
#define bM4_MSC0_SCI_SR_TDEF                            *((volatile unsigned int*)(0x424200A4UL))
#define bM4_MSC0_SCI_SR_RDFF                            *((volatile unsigned int*)(0x424200A8UL))
#define bM4_MSC0_SCI_SR_ORF                             *((volatile unsigned int*)(0x424200ACUL))
#define bM4_MSC0_SCI_SR_FEF                             *((volatile unsigned int*)(0x424200B0UL))
#define bM4_MSC0_SCI_SR_PEF                             *((volatile unsigned int*)(0x424200B4UL))
#define bM4_MSC0_SCI_SR_RECLR                           *((volatile unsigned int*)(0x424200BCUL))
#define bM4_MSC0_SCI_BRS_BRS0                           *((volatile unsigned int*)(0x42420180UL))
#define bM4_MSC0_SCI_BRS_BRS1                           *((volatile unsigned int*)(0x42420184UL))
#define bM4_MSC0_SCI_BRS_BRS2                           *((volatile unsigned int*)(0x42420188UL))
#define bM4_MSC0_SCI_BRS_BRS3                           *((volatile unsigned int*)(0x4242018CUL))
#define bM4_MSC0_SCI_BRS_BRS4                           *((volatile unsigned int*)(0x42420190UL))
#define bM4_MSC0_SCI_BRS_BRS5                           *((volatile unsigned int*)(0x42420194UL))
#define bM4_MSC0_SCI_BRS_BRS6                           *((volatile unsigned int*)(0x42420198UL))
#define bM4_MSC0_SCI_BRS_BRS7                           *((volatile unsigned int*)(0x4242019CUL))
#define bM4_MSC0_SCI_BRS_BRS8                           *((volatile unsigned int*)(0x424201A0UL))
#define bM4_MSC0_SCI_BRS_BRS9                           *((volatile unsigned int*)(0x424201A4UL))
#define bM4_MSC0_SCI_BRS_BRS10                          *((volatile unsigned int*)(0x424201A8UL))
#define bM4_MSC0_SCI_BRS_BRS11                          *((volatile unsigned int*)(0x424201ACUL))
#define bM4_MSC0_SCI_BRS_BRS12                          *((volatile unsigned int*)(0x424201B0UL))
#define bM4_MSC0_SCI_BRS_BRS13                          *((volatile unsigned int*)(0x424201B4UL))
#define bM4_MSC0_SCI_BRS_BRS14                          *((volatile unsigned int*)(0x424201B8UL))
#define bM4_MSC0_SCI_BRS_EXT                            *((volatile unsigned int*)(0x424201BCUL))
#define bM4_MSC0_SCI_COMP0_CE0                          *((volatile unsigned int*)(0x42420A00UL))
#define bM4_MSC0_SCI_COMP0_CE1                          *((volatile unsigned int*)(0x42420A04UL))
#define bM4_MSC0_SCI_COMP0_CE2                          *((volatile unsigned int*)(0x42420A08UL))
#define bM4_MSC0_SCI_COMP0_CE3                          *((volatile unsigned int*)(0x42420A0CUL))
#define bM4_MSC0_SCI_COMP0_CE4                          *((volatile unsigned int*)(0x42420A10UL))
#define bM4_MSC0_SCI_COMP0_CE5                          *((volatile unsigned int*)(0x42420A14UL))
#define bM4_MSC0_SCI_COMP0_CE6                          *((volatile unsigned int*)(0x42420A18UL))
#define bM4_MSC0_SCI_COMP0_CE7                          *((volatile unsigned int*)(0x42420A1CUL))
#define bM4_MSC0_SCI_COMP1_CE8                          *((volatile unsigned int*)(0x42420A20UL))
#define bM4_MSC0_SCI_COMP1_CE9                          *((volatile unsigned int*)(0x42420A24UL))
#define bM4_MSC0_SCI_COMP1_COE                          *((volatile unsigned int*)(0x42420A3CUL))
#define bM4_MSC1_SCI_SMR_DOE                            *((volatile unsigned int*)(0x42422000UL))
#define bM4_MSC1_SCI_SMR_TDS                            *((volatile unsigned int*)(0x42422008UL))
#define bM4_MSC1_SCI_SMR_SBLS                           *((volatile unsigned int*)(0x4242200CUL))
#define bM4_MSC1_SCI_SMR_MODE0                          *((volatile unsigned int*)(0x42422014UL))
#define bM4_MSC1_SCI_SMR_MODE1                          *((volatile unsigned int*)(0x42422018UL))
#define bM4_MSC1_SCI_SMR_MODE2                          *((volatile unsigned int*)(0x4242201CUL))
#define bM4_MSC1_SCI_SCR_TXE                            *((volatile unsigned int*)(0x42422020UL))
#define bM4_MSC1_SCI_SCR_RXE                            *((volatile unsigned int*)(0x42422024UL))
#define bM4_MSC1_SCI_SCR_TBIE                           *((volatile unsigned int*)(0x42422028UL))
#define bM4_MSC1_SCI_SCR_TXIE                           *((volatile unsigned int*)(0x4242202CUL))
#define bM4_MSC1_SCI_SCR_RXIE                           *((volatile unsigned int*)(0x42422030UL))
#define bM4_MSC1_SCI_SCR_PCL                            *((volatile unsigned int*)(0x4242203CUL))
#define bM4_MSC1_SCI_ECR_DL0                            *((volatile unsigned int*)(0x42422080UL))
#define bM4_MSC1_SCI_ECR_DL1                            *((volatile unsigned int*)(0x42422084UL))
#define bM4_MSC1_SCI_ECR_DL2                            *((volatile unsigned int*)(0x42422088UL))
#define bM4_MSC1_SCI_ECR_PS                             *((volatile unsigned int*)(0x4242208CUL))
#define bM4_MSC1_SCI_ECR_PE                             *((volatile unsigned int*)(0x42422090UL))
#define bM4_MSC1_SCI_ECR_INV                            *((volatile unsigned int*)(0x42422094UL))
#define bM4_MSC1_SCI_ECR_ESBLS                          *((volatile unsigned int*)(0x42422098UL))
#define bM4_MSC1_SCI_ECR_FCEB                           *((volatile unsigned int*)(0x4242209CUL))
#define bM4_MSC1_SCI_SR_TBIF                            *((volatile unsigned int*)(0x424220A0UL))
#define bM4_MSC1_SCI_SR_TDEF                            *((volatile unsigned int*)(0x424220A4UL))
#define bM4_MSC1_SCI_SR_RDFF                            *((volatile unsigned int*)(0x424220A8UL))
#define bM4_MSC1_SCI_SR_ORF                             *((volatile unsigned int*)(0x424220ACUL))
#define bM4_MSC1_SCI_SR_FEF                             *((volatile unsigned int*)(0x424220B0UL))
#define bM4_MSC1_SCI_SR_PEF                             *((volatile unsigned int*)(0x424220B4UL))
#define bM4_MSC1_SCI_SR_RECLR                           *((volatile unsigned int*)(0x424220BCUL))
#define bM4_MSC1_SCI_BRS_BRS0                           *((volatile unsigned int*)(0x42422180UL))
#define bM4_MSC1_SCI_BRS_BRS1                           *((volatile unsigned int*)(0x42422184UL))
#define bM4_MSC1_SCI_BRS_BRS2                           *((volatile unsigned int*)(0x42422188UL))
#define bM4_MSC1_SCI_BRS_BRS3                           *((volatile unsigned int*)(0x4242218CUL))
#define bM4_MSC1_SCI_BRS_BRS4                           *((volatile unsigned int*)(0x42422190UL))
#define bM4_MSC1_SCI_BRS_BRS5                           *((volatile unsigned int*)(0x42422194UL))
#define bM4_MSC1_SCI_BRS_BRS6                           *((volatile unsigned int*)(0x42422198UL))
#define bM4_MSC1_SCI_BRS_BRS7                           *((volatile unsigned int*)(0x4242219CUL))
#define bM4_MSC1_SCI_BRS_BRS8                           *((volatile unsigned int*)(0x424221A0UL))
#define bM4_MSC1_SCI_BRS_BRS9                           *((volatile unsigned int*)(0x424221A4UL))
#define bM4_MSC1_SCI_BRS_BRS10                          *((volatile unsigned int*)(0x424221A8UL))
#define bM4_MSC1_SCI_BRS_BRS11                          *((volatile unsigned int*)(0x424221ACUL))
#define bM4_MSC1_SCI_BRS_BRS12                          *((volatile unsigned int*)(0x424221B0UL))
#define bM4_MSC1_SCI_BRS_BRS13                          *((volatile unsigned int*)(0x424221B4UL))
#define bM4_MSC1_SCI_BRS_BRS14                          *((volatile unsigned int*)(0x424221B8UL))
#define bM4_MSC1_SCI_BRS_EXT                            *((volatile unsigned int*)(0x424221BCUL))
#define bM4_MSC1_SCI_COMP0_CE0                          *((volatile unsigned int*)(0x42422A00UL))
#define bM4_MSC1_SCI_COMP0_CE1                          *((volatile unsigned int*)(0x42422A04UL))
#define bM4_MSC1_SCI_COMP0_CE2                          *((volatile unsigned int*)(0x42422A08UL))
#define bM4_MSC1_SCI_COMP0_CE3                          *((volatile unsigned int*)(0x42422A0CUL))
#define bM4_MSC1_SCI_COMP0_CE4                          *((volatile unsigned int*)(0x42422A10UL))
#define bM4_MSC1_SCI_COMP0_CE5                          *((volatile unsigned int*)(0x42422A14UL))
#define bM4_MSC1_SCI_COMP0_CE6                          *((volatile unsigned int*)(0x42422A18UL))
#define bM4_MSC1_SCI_COMP0_CE7                          *((volatile unsigned int*)(0x42422A1CUL))
#define bM4_MSC1_SCI_COMP1_CE8                          *((volatile unsigned int*)(0x42422A20UL))
#define bM4_MSC1_SCI_COMP1_CE9                          *((volatile unsigned int*)(0x42422A24UL))
#define bM4_MSC1_SCI_COMP1_COE                          *((volatile unsigned int*)(0x42422A3CUL))
#define bM4_MSC2_SCI_SMR_DOE                            *((volatile unsigned int*)(0x42424000UL))
#define bM4_MSC2_SCI_SMR_TDS                            *((volatile unsigned int*)(0x42424008UL))
#define bM4_MSC2_SCI_SMR_SBLS                           *((volatile unsigned int*)(0x4242400CUL))
#define bM4_MSC2_SCI_SMR_MODE0                          *((volatile unsigned int*)(0x42424014UL))
#define bM4_MSC2_SCI_SMR_MODE1                          *((volatile unsigned int*)(0x42424018UL))
#define bM4_MSC2_SCI_SMR_MODE2                          *((volatile unsigned int*)(0x4242401CUL))
#define bM4_MSC2_SCI_SCR_TXE                            *((volatile unsigned int*)(0x42424020UL))
#define bM4_MSC2_SCI_SCR_RXE                            *((volatile unsigned int*)(0x42424024UL))
#define bM4_MSC2_SCI_SCR_TBIE                           *((volatile unsigned int*)(0x42424028UL))
#define bM4_MSC2_SCI_SCR_TXIE                           *((volatile unsigned int*)(0x4242402CUL))
#define bM4_MSC2_SCI_SCR_RXIE                           *((volatile unsigned int*)(0x42424030UL))
#define bM4_MSC2_SCI_SCR_PCL                            *((volatile unsigned int*)(0x4242403CUL))
#define bM4_MSC2_SCI_ECR_DL0                            *((volatile unsigned int*)(0x42424080UL))
#define bM4_MSC2_SCI_ECR_DL1                            *((volatile unsigned int*)(0x42424084UL))
#define bM4_MSC2_SCI_ECR_DL2                            *((volatile unsigned int*)(0x42424088UL))
#define bM4_MSC2_SCI_ECR_PS                             *((volatile unsigned int*)(0x4242408CUL))
#define bM4_MSC2_SCI_ECR_PE                             *((volatile unsigned int*)(0x42424090UL))
#define bM4_MSC2_SCI_ECR_INV                            *((volatile unsigned int*)(0x42424094UL))
#define bM4_MSC2_SCI_ECR_ESBLS                          *((volatile unsigned int*)(0x42424098UL))
#define bM4_MSC2_SCI_ECR_FCEB                           *((volatile unsigned int*)(0x4242409CUL))
#define bM4_MSC2_SCI_SR_TBIF                            *((volatile unsigned int*)(0x424240A0UL))
#define bM4_MSC2_SCI_SR_TDEF                            *((volatile unsigned int*)(0x424240A4UL))
#define bM4_MSC2_SCI_SR_RDFF                            *((volatile unsigned int*)(0x424240A8UL))
#define bM4_MSC2_SCI_SR_ORF                             *((volatile unsigned int*)(0x424240ACUL))
#define bM4_MSC2_SCI_SR_FEF                             *((volatile unsigned int*)(0x424240B0UL))
#define bM4_MSC2_SCI_SR_PEF                             *((volatile unsigned int*)(0x424240B4UL))
#define bM4_MSC2_SCI_SR_RECLR                           *((volatile unsigned int*)(0x424240BCUL))
#define bM4_MSC2_SCI_BRS_BRS0                           *((volatile unsigned int*)(0x42424180UL))
#define bM4_MSC2_SCI_BRS_BRS1                           *((volatile unsigned int*)(0x42424184UL))
#define bM4_MSC2_SCI_BRS_BRS2                           *((volatile unsigned int*)(0x42424188UL))
#define bM4_MSC2_SCI_BRS_BRS3                           *((volatile unsigned int*)(0x4242418CUL))
#define bM4_MSC2_SCI_BRS_BRS4                           *((volatile unsigned int*)(0x42424190UL))
#define bM4_MSC2_SCI_BRS_BRS5                           *((volatile unsigned int*)(0x42424194UL))
#define bM4_MSC2_SCI_BRS_BRS6                           *((volatile unsigned int*)(0x42424198UL))
#define bM4_MSC2_SCI_BRS_BRS7                           *((volatile unsigned int*)(0x4242419CUL))
#define bM4_MSC2_SCI_BRS_BRS8                           *((volatile unsigned int*)(0x424241A0UL))
#define bM4_MSC2_SCI_BRS_BRS9                           *((volatile unsigned int*)(0x424241A4UL))
#define bM4_MSC2_SCI_BRS_BRS10                          *((volatile unsigned int*)(0x424241A8UL))
#define bM4_MSC2_SCI_BRS_BRS11                          *((volatile unsigned int*)(0x424241ACUL))
#define bM4_MSC2_SCI_BRS_BRS12                          *((volatile unsigned int*)(0x424241B0UL))
