RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_MSC2_SCI_BRS_BRS13                          *((volatile unsigned int*)(0x424241B4UL))
#define bM4_MSC2_SCI_BRS_BRS14                          *((volatile unsigned int*)(0x424241B8UL))
#define bM4_MSC2_SCI_BRS_EXT                            *((volatile unsigned int*)(0x424241BCUL))
#define bM4_MSC2_SCI_COMP0_CE0                          *((volatile unsigned int*)(0x42424A00UL))
#define bM4_MSC2_SCI_COMP0_CE1                          *((volatile unsigned int*)(0x42424A04UL))
#define bM4_MSC2_SCI_COMP0_CE2                          *((volatile unsigned int*)(0x42424A08UL))
#define bM4_MSC2_SCI_COMP0_CE3                          *((volatile unsigned int*)(0x42424A0CUL))
#define bM4_MSC2_SCI_COMP0_CE4                          *((volatile unsigned int*)(0x42424A10UL))
#define bM4_MSC2_SCI_COMP0_CE5                          *((volatile unsigned int*)(0x42424A14UL))
#define bM4_MSC2_SCI_COMP0_CE6                          *((volatile unsigned int*)(0x42424A18UL))
#define bM4_MSC2_SCI_COMP0_CE7                          *((volatile unsigned int*)(0x42424A1CUL))
#define bM4_MSC2_SCI_COMP1_CE8                          *((volatile unsigned int*)(0x42424A20UL))
#define bM4_MSC2_SCI_COMP1_CE9                          *((volatile unsigned int*)(0x42424A24UL))
#define bM4_MSC2_SCI_COMP1_COE                          *((volatile unsigned int*)(0x42424A3CUL))
#define bM4_MSC0_SPI_SMR_DOE                            *((volatile unsigned int*)(0x42420000UL))
#define bM4_MSC0_SPI_SMR_CKE                            *((volatile unsigned int*)(0x42420004UL))
#define bM4_MSC0_SPI_SMR_TDS                            *((volatile unsigned int*)(0x42420008UL))
#define bM4_MSC0_SPI_SMR_CINV                           *((volatile unsigned int*)(0x4242000CUL))
#define bM4_MSC0_SPI_SMR_MODE0                          *((volatile unsigned int*)(0x42420014UL))
#define bM4_MSC0_SPI_SMR_MODE1                          *((volatile unsigned int*)(0x42420018UL))
#define bM4_MSC0_SPI_SMR_MODE2                          *((volatile unsigned int*)(0x4242001CUL))
#define bM4_MSC0_SPI_SCR_TXE                            *((volatile unsigned int*)(0x42420020UL))
#define bM4_MSC0_SPI_SCR_RXE                            *((volatile unsigned int*)(0x42420024UL))
#define bM4_MSC0_SPI_SCR_TBIE                           *((volatile unsigned int*)(0x42420028UL))
#define bM4_MSC0_SPI_SCR_TXIE                           *((volatile unsigned int*)(0x4242002CUL))
#define bM4_MSC0_SPI_SCR_RXIE                           *((volatile unsigned int*)(0x42420030UL))
#define bM4_MSC0_SPI_SCR_SPIMODE                        *((volatile unsigned int*)(0x42420034UL))
#define bM4_MSC0_SPI_SCR_MSS                            *((volatile unsigned int*)(0x42420038UL))
#define bM4_MSC0_SPI_SCR_PCL                            *((volatile unsigned int*)(0x4242003CUL))
#define bM4_MSC0_SPI_ECR_DL0                            *((volatile unsigned int*)(0x42420080UL))
#define bM4_MSC0_SPI_ECR_DL1                            *((volatile unsigned int*)(0x42420084UL))
#define bM4_MSC0_SPI_ECR_DL2                            *((volatile unsigned int*)(0x42420088UL))
#define bM4_MSC0_SPI_ECR_DTRWS0                         *((volatile unsigned int*)(0x4242008CUL))
#define bM4_MSC0_SPI_ECR_DTRWS1                         *((volatile unsigned int*)(0x42420090UL))
#define bM4_MSC0_SPI_ECR_CSFE                           *((volatile unsigned int*)(0x42420094UL))
#define bM4_MSC0_SPI_ECR_DL3                            *((volatile unsigned int*)(0x42420098UL))
#define bM4_MSC0_SPI_ECR_SOPS                           *((volatile unsigned int*)(0x4242009CUL))
#define bM4_MSC0_SPI_SR_TBIF                            *((volatile unsigned int*)(0x424200A0UL))
#define bM4_MSC0_SPI_SR_TDEF                            *((volatile unsigned int*)(0x424200A4UL))
#define bM4_MSC0_SPI_SR_RDFF                            *((volatile unsigned int*)(0x424200A8UL))
#define bM4_MSC0_SPI_SR_ORF                             *((volatile unsigned int*)(0x424200ACUL))
#define bM4_MSC0_SPI_SR_RECLR                           *((volatile unsigned int*)(0x424200BCUL))
#define bM4_MSC0_SPI_BRS_BRS00                          *((volatile unsigned int*)(0x42420180UL))
#define bM4_MSC0_SPI_BRS_BRS01                          *((volatile unsigned int*)(0x42420184UL))
#define bM4_MSC0_SPI_BRS_BRS02                          *((volatile unsigned int*)(0x42420188UL))
#define bM4_MSC0_SPI_BRS_BRS03                          *((volatile unsigned int*)(0x4242018CUL))
#define bM4_MSC0_SPI_BRS_BRS04                          *((volatile unsigned int*)(0x42420190UL))
#define bM4_MSC0_SPI_BRS_BRS05                          *((volatile unsigned int*)(0x42420194UL))
#define bM4_MSC0_SPI_BRS_BRS06                          *((volatile unsigned int*)(0x42420198UL))
#define bM4_MSC0_SPI_BRS_BRS07                          *((volatile unsigned int*)(0x4242019CUL))
#define bM4_MSC0_SPI_BRS_BRS10                          *((volatile unsigned int*)(0x424201A0UL))
#define bM4_MSC0_SPI_BRS_BRS11                          *((volatile unsigned int*)(0x424201A4UL))
#define bM4_MSC0_SPI_BRS_BRS12                          *((volatile unsigned int*)(0x424201A8UL))
#define bM4_MSC0_SPI_BRS_BRS13                          *((volatile unsigned int*)(0x424201ACUL))
#define bM4_MSC0_SPI_BRS_BRS14                          *((volatile unsigned int*)(0x424201B0UL))
#define bM4_MSC0_SPI_BRS_BRS15                          *((volatile unsigned int*)(0x424201B4UL))
#define bM4_MSC0_SPI_BRS_BRS16                          *((volatile unsigned int*)(0x424201B8UL))
#define bM4_MSC0_SPI_EACR_CSER                          *((volatile unsigned int*)(0x424204ACUL))
#define bM4_MSC0_SPI_EACR_CSEIE                         *((volatile unsigned int*)(0x424204B0UL))
#define bM4_MSC0_SPI_EACR_TBEE                          *((volatile unsigned int*)(0x424204B4UL))
#define bM4_MSC0_SPI_CSCR_CSOE                          *((volatile unsigned int*)(0x42420600UL))
#define bM4_MSC0_SPI_CSCR_CSEN0                         *((volatile unsigned int*)(0x42420604UL))
#define bM4_MSC0_SPI_CSCR_CSEN1                         *((volatile unsigned int*)(0x42420608UL))
#define bM4_MSC0_SPI_CSCR_CSEN2                         *((volatile unsigned int*)(0x4242060CUL))
#define bM4_MSC0_SPI_CSCR_CSLVS                         *((volatile unsigned int*)(0x42420614UL))
#define bM4_MSC0_SPI_CSCR_CSTODIV0                      *((volatile unsigned int*)(0x42420618UL))
#define bM4_MSC0_SPI_CSCR_CSTODIV1                      *((volatile unsigned int*)(0x4242061CUL))
#define bM4_MSC0_SPI_CSCR_CSTODIV2                      *((volatile unsigned int*)(0x42420620UL))
#define bM4_MSC0_SPI_CSCR_CSAH                          *((volatile unsigned int*)(0x42420624UL))
#define bM4_MSC0_SPI_CSCR_CSAD0                         *((volatile unsigned int*)(0x42420628UL))
#define bM4_MSC0_SPI_CSCR_CSAD1                         *((volatile unsigned int*)(0x4242062CUL))
#define bM4_MSC0_SPI_CSCR_CSAE0                         *((volatile unsigned int*)(0x42420630UL))
#define bM4_MSC0_SPI_CSCR_CSAE1                         *((volatile unsigned int*)(0x42420634UL))
#define bM4_MSC0_SPI_CSCR_CSAS0                         *((volatile unsigned int*)(0x42420638UL))
#define bM4_MSC0_SPI_CSCR_CSAS1                         *((volatile unsigned int*)(0x4242063CUL))
#define bM4_MSC0_SPI_CSFR1_DL0                          *((volatile unsigned int*)(0x42420680UL))
#define bM4_MSC0_SPI_CSFR1_DL1                          *((volatile unsigned int*)(0x42420684UL))
#define bM4_MSC0_SPI_CSFR1_DL2                          *((volatile unsigned int*)(0x42420688UL))
#define bM4_MSC0_SPI_CSFR1_DL3                          *((volatile unsigned int*)(0x4242068CUL))
#define bM4_MSC0_SPI_CSFR1_TDS                          *((volatile unsigned int*)(0x42420690UL))
#define bM4_MSC0_SPI_CSFR1_CINV                         *((volatile unsigned int*)(0x42420698UL))
#define bM4_MSC0_SPI_CSFR1_CSLVS                        *((volatile unsigned int*)(0x4242069CUL))
#define bM4_MSC0_SPI_CSFR2_DL0                          *((volatile unsigned int*)(0x424206A0UL))
#define bM4_MSC0_SPI_CSFR2_DL1                          *((volatile unsigned int*)(0x424206A4UL))
#define bM4_MSC0_SPI_CSFR2_DL2                          *((volatile unsigned int*)(0x424206A8UL))
#define bM4_MSC0_SPI_CSFR2_DL3                          *((volatile unsigned int*)(0x424206ACUL))
#define bM4_MSC0_SPI_CSFR2_TDS                          *((volatile unsigned int*)(0x424206B0UL))
#define bM4_MSC0_SPI_CSFR2_CINV                         *((volatile unsigned int*)(0x424206B8UL))
#define bM4_MSC0_SPI_CSFR2_CSLVS                        *((volatile unsigned int*)(0x424206BCUL))
#define bM4_MSC1_SPI_SMR_DOE                            *((volatile unsigned int*)(0x42422000UL))
#define bM4_MSC1_SPI_SMR_CKE                            *((volatile unsigned int*)(0x42422004UL))
#define bM4_MSC1_SPI_SMR_TDS                            *((volatile unsigned int*)(0x42422008UL))
#define bM4_MSC1_SPI_SMR_CINV                           *((volatile unsigned int*)(0x4242200CUL))
#define bM4_MSC1_SPI_SMR_MODE0                          *((volatile unsigned int*)(0x42422014UL))
#define bM4_MSC1_SPI_SMR_MODE1                          *((volatile unsigned int*)(0x42422018UL))
#define bM4_MSC1_SPI_SMR_MODE2                          *((volatile unsigned int*)(0x4242201CUL))
#define bM4_MSC1_SPI_SCR_TXE                            *((volatile unsigned int*)(0x42422020UL))
#define bM4_MSC1_SPI_SCR_RXE                            *((volatile unsigned int*)(0x42422024UL))
#define bM4_MSC1_SPI_SCR_TBIE                           *((volatile unsigned int*)(0x42422028UL))
#define bM4_MSC1_SPI_SCR_TXIE                           *((volatile unsigned int*)(0x4242202CUL))
#define bM4_MSC1_SPI_SCR_RXIE                           *((volatile unsigned int*)(0x42422030UL))
#define bM4_MSC1_SPI_SCR_SPIMODE                        *((volatile unsigned int*)(0x42422034UL))
#define bM4_MSC1_SPI_SCR_MSS                            *((volatile unsigned int*)(0x42422038UL))
#define bM4_MSC1_SPI_SCR_PCL                            *((volatile unsigned int*)(0x4242203CUL))
#define bM4_MSC1_SPI_ECR_DL0                            *((volatile unsigned int*)(0x42422080UL))
#define bM4_MSC1_SPI_ECR_DL1                            *((volatile unsigned int*)(0x42422084UL))
#define bM4_MSC1_SPI_ECR_DL2                            *((volatile unsigned int*)(0x42422088UL))
#define bM4_MSC1_SPI_ECR_DTRWS0                         *((volatile unsigned int*)(0x4242208CUL))
#define bM4_MSC1_SPI_ECR_DTRWS1                         *((volatile unsigned int*)(0x42422090UL))
#define bM4_MSC1_SPI_ECR_CSFE                           *((volatile unsigned int*)(0x42422094UL))
#define bM4_MSC1_SPI_ECR_DL3                            *((volatile unsigned int*)(0x42422098UL))
#define bM4_MSC1_SPI_ECR_SOPS                           *((volatile unsigned int*)(0x4242209CUL))
#define bM4_MSC1_SPI_SR_TBIF                            *((volatile unsigned int*)(0x424220A0UL))
#define bM4_MSC1_SPI_SR_TDEF                            *((volatile unsigned int*)(0x424220A4UL))
#define bM4_MSC1_SPI_SR_RDFF                            *((volatile unsigned int*)(0x424220A8UL))
#define bM4_MSC1_SPI_SR_ORF                             *((volatile unsigned int*)(0x424220ACUL))
#define bM4_MSC1_SPI_SR_RECLR                           *((volatile unsigned int*)(0x424220BCUL))
#define bM4_MSC1_SPI_BRS_BRS00                          *((volatile unsigned int*)(0x42422180UL))
#define bM4_MSC1_SPI_BRS_BRS01                          *((volatile unsigned int*)(0x42422184UL))
#define bM4_MSC1_SPI_BRS_BRS02                          *((volatile unsigned int*)(0x42422188UL))
#define bM4_MSC1_SPI_BRS_BRS03                          *((volatile unsigned int*)(0x4242218CUL))
#define bM4_MSC1_SPI_BRS_BRS04                          *((volatile unsigned int*)(0x42422190UL))
#define bM4_MSC1_SPI_BRS_BRS05                          *((volatile unsigned int*)(0x42422194UL))
#define bM4_MSC1_SPI_BRS_BRS06                          *((volatile unsigned int*)(0x42422198UL))
#define bM4_MSC1_SPI_BRS_BRS07                          *((volatile unsigned int*)(0x4242219CUL))
#define bM4_MSC1_SPI_BRS_BRS10                          *((volatile unsigned int*)(0x424221A0UL))
#define bM4_MSC1_SPI_BRS_BRS11                          *((volatile unsigned int*)(0x424221A4UL))
#define bM4_MSC1_SPI_BRS_BRS12                          *((volatile unsigned int*)(0x424221A8UL))
#define bM4_MSC1_SPI_BRS_BRS13                          *((volatile unsigned int*)(0x424221ACUL))
#define bM4_MSC1_SPI_BRS_BRS14                          *((volatile unsigned int*)(0x424221B0UL))
#define bM4_MSC1_SPI_BRS_BRS15                          *((volatile unsigned int*)(0x424221B4UL))
#define bM4_MSC1_SPI_BRS_BRS16                          *((volatile unsigned int*)(0x424221B8UL))
#define bM4_MSC1_SPI_EACR_CSER                          *((volatile unsigned int*)(0x424224ACUL))
#define bM4_MSC1_SPI_EACR_CSEIE                         *((volatile unsigned int*)(0x424224B0UL))
#define bM4_MSC1_SPI_EACR_TBEE                          *((volatile unsigned int*)(0x424224B4UL))
#define bM4_MSC1_SPI_CSCR_CSOE                          *((volatile unsigned int*)(0x42422600UL))
#define bM4_MSC1_SPI_CSCR_CSEN0                         *((volatile unsigned int*)(0x42422604UL))
#define bM4_MSC1_SPI_CSCR_CSEN1                         *((volatile unsigned int*)(0x42422608UL))
#define bM4_MSC1_SPI_CSCR_CSEN2                         *((volatile unsigned int*)(0x4242260CUL))
#define bM4_MSC1_SPI_CSCR_CSLVS                         *((volatile unsigned int*)(0x42422614UL))
#define bM4_MSC1_SPI_CSCR_CSTODIV0                      *((volatile unsigned int*)(0x42422618UL))
#define bM4_MSC1_SPI_CSCR_CSTODIV1                      *((volatile unsigned int*)(0x4242261CUL))
#define bM4_MSC1_SPI_CSCR_CSTODIV2                      *((volatile unsigned int*)(0x42422620UL))
#define bM4_MSC1_SPI_CSCR_CSAH                          *((volatile unsigned int*)(0x42422624UL))
#define bM4_MSC1_SPI_CSCR_CSAD0                         *((volatile unsigned int*)(0x42422628UL))
#define bM4_MSC1_SPI_CSCR_CSAD1                         *((volatile unsigned int*)(0x4242262CUL))
#define bM4_MSC1_SPI_CSCR_CSAE0                         *((volatile unsigned int*)(0x42422630UL))
#define bM4_MSC1_SPI_CSCR_CSAE1                         *((volatile unsigned int*)(0x42422634UL))
#define bM4_MSC1_SPI_CSCR_CSAS0                         *((volatile unsigned int*)(0x42422638UL))
#define bM4_MSC1_SPI_CSCR_CSAS1                         *((volatile unsigned int*)(0x4242263CUL))
#define bM4_MSC1_SPI_CSFR1_DL0                          *((volatile unsigned int*)(0x42422680UL))
#define bM4_MSC1_SPI_CSFR1_DL1                          *((volatile unsigned int*)(0x42422684UL))
#define bM4_MSC1_SPI_CSFR1_DL2                          *((volatile unsigned int*)(0x42422688UL))
#define bM4_MSC1_SPI_CSFR1_DL3                          *((volatile unsigned int*)(0x4242268CUL))
#define bM4_MSC1_SPI_CSFR1_TDS                          *((volatile unsigned int*)(0x42422690UL))
#define bM4_MSC1_SPI_CSFR1_CINV                         *((volatile unsigned int*)(0x42422698UL))
#define bM4_MSC1_SPI_CSFR1_CSLVS                        *((volatile unsigned int*)(0x4242269CUL))
#define bM4_MSC1_SPI_CSFR2_DL0                          *((volatile unsigned int*)(0x424226A0UL))
#define bM4_MSC1_SPI_CSFR2_DL1                          *((volatile unsigned int*)(0x424226A4UL))
#define bM4_MSC1_SPI_CSFR2_DL2                          *((volatile unsigned int*)(0x424226A8UL))
#define bM4_MSC1_SPI_CSFR2_DL3                          *((volatile unsigned int*)(0x424226ACUL))
#define bM4_MSC1_SPI_CSFR2_TDS                          *((volatile unsigned int*)(0x424226B0UL))
#define bM4_MSC1_SPI_CSFR2_CINV                         *((volatile unsigned int*)(0x424226B8UL))
#define bM4_MSC1_SPI_CSFR2_CSLVS                        *((volatile unsigned int*)(0x424226BCUL))
#define bM4_MSC2_SPI_SMR_DOE                            *((volatile unsigned int*)(0x42424000UL))
#define bM4_MSC2_SPI_SMR_CKE                            *((volatile unsigned int*)(0x42424004UL))
#define bM4_MSC2_SPI_SMR_TDS                            *((volatile unsigned int*)(0x42424008UL))
#define bM4_MSC2_SPI_SMR_CINV                           *((volatile unsigned int*)(0x4242400CUL))
#define bM4_MSC2_SPI_SMR_MODE0                          *((volatile unsigned int*)(0x42424014UL))
#define bM4_MSC2_SPI_SMR_MODE1                          *((volatile unsigned int*)(0x42424018UL))
#define bM4_MSC2_SPI_SMR_MODE2                          *((volatile unsigned int*)(0x4242401CUL))
#define bM4_MSC2_SPI_SCR_TXE                            *((volatile unsigned int*)(0x42424020UL))
#define bM4_MSC2_SPI_SCR_RXE                            *((volatile unsigned int*)(0x42424024UL))
#define bM4_MSC2_SPI_SCR_TBIE                           *((volatile unsigned int*)(0x42424028UL))
#define bM4_MSC2_SPI_SCR_TXIE                           *((volatile unsigned int*)(0x4242402CUL))
#define bM4_MSC2_SPI_SCR_RXIE                           *((volatile unsigned int*)(0x42424030UL))
#define bM4_MSC2_SPI_SCR_SPIMODE                        *((volatile unsigned int*)(0x42424034UL))
#define bM4_MSC2_SPI_SCR_MSS                            *((volatile unsigned int*)(0x42424038UL))
#define bM4_MSC2_SPI_SCR_PCL                            *((volatile unsigned int*)(0x4242403CUL))
#define bM4_MSC2_SPI_ECR_DL0                            *((volatile unsigned int*)(0x42424080UL))
#define bM4_MSC2_SPI_ECR_DL1                            *((volatile unsigned int*)(0x42424084UL))
#define bM4_MSC2_SPI_ECR_DL2                            *((volatile unsigned int*)(0x42424088UL))
#define bM4_MSC2_SPI_ECR_DTRWS0                         *((volatile unsigned int*)(0x4242408CUL))
#define bM4_MSC2_SPI_ECR_DTRWS1                         *((volatile unsigned int*)(0x42424090UL))
#define bM4_MSC2_SPI_ECR_CSFE                           *((volatile unsigned int*)(0x42424094UL))
#define bM4_MSC2_SPI_ECR_DL3                            *((volatile unsigned int*)(0x42424098UL))
#define bM4_MSC2_SPI_ECR_SOPS                           *((volatile unsigned int*)(0x4242409CUL))
#define bM4_MSC2_SPI_SR_TBIF                            *((volatile unsigned int*)(0x424240A0UL))
#define bM4_MSC2_SPI_SR_TDEF                            *((volatile unsigned int*)(0x424240A4UL))
#define bM4_MSC2_SPI_SR_RDFF                            *((volatile unsigned int*)(0x424240A8UL))
#define bM4_MSC2_SPI_SR_ORF                             *((volatile unsigned int*)(0x424240ACUL))
#define bM4_MSC2_SPI_SR_RECLR                           *((volatile unsigned int*)(0x424240BCUL))
#define bM4_MSC2_SPI_BRS_BRS00                          *((volatile unsigned int*)(0x42424180UL))
#define bM4_MSC2_SPI_BRS_BRS01                          *((volatile unsigned int*)(0x42424184UL))
#define bM4_MSC2_SPI_BRS_BRS02                          *((volatile unsigned int*)(0x42424188UL))
#define bM4_MSC2_SPI_BRS_BRS03                          *((volatile unsigned int*)(0x4242418CUL))
#define bM4_MSC2_SPI_BRS_BRS04                          *((volatile unsigned int*)(0x42424190UL))
#define bM4_MSC2_SPI_BRS_BRS05                          *((volatile unsigned int*)(0x42424194UL))
#define bM4_MSC2_SPI_BRS_BRS06                          *((volatile unsigned int*)(0x42424198UL))
#define bM4_MSC2_SPI_BRS_BRS07                          *((volatile unsigned int*)(0x4242419CUL))
#define bM4_MSC2_SPI_BRS_BRS10                          *((volatile unsigned int*)(0x424241A0UL))
#define bM4_MSC2_SPI_BRS_BRS11                          *((volatile unsigned int*)(0x424241A4UL))
#define bM4_MSC2_SPI_BRS_BRS12                          *((volatile unsigned int*)(0x424241A8UL))
#define bM4_MSC2_SPI_BRS_BRS13                          *((volatile unsigned int*)(0x424241ACUL))
#define bM4_MSC2_SPI_BRS_BRS14                          *((volatile unsigned int*)(0x424241B0UL))
#define bM4_MSC2_SPI_BRS_BRS15                          *((volatile unsigned int*)(0x424241B4UL))
#define bM4_MSC2_SPI_BRS_BRS16                          *((volatile unsigned int*)(0x424241B8UL))
#define bM4_MSC2_SPI_EACR_CSER                          *((volatile unsigned int*)(0x424244ACUL))
#define bM4_MSC2_SPI_EACR_CSEIE                         *((volatile unsigned int*)(0x424244B0UL))
#define bM4_MSC2_SPI_EACR_TBEE                          *((volatile unsigned int*)(0x424244B4UL))
#define bM4_MSC2_SPI_CSCR_CSOE                          *((volatile unsigned int*)(0x42424600UL))
#define bM4_MSC2_SPI_CSCR_CSEN0                         *((volatile unsigned int*)(0x42424604UL))
#define bM4_MSC2_SPI_CSCR_CSEN1                         *((volatile unsigned int*)(0x42424608UL))
#define bM4_MSC2_SPI_CSCR_CSEN2                         *((volatile unsigned int*)(0x4242460CUL))
#define bM4_MSC2_SPI_CSCR_CSLVS                         *((volatile unsigned int*)(0x42424614UL))
#define bM4_MSC2_SPI_CSCR_CSTODIV0                      *((volatile unsigned int*)(0x42424618UL))
#define bM4_MSC2_SPI_CSCR_CSTODIV1                      *((volatile unsigned int*)(0x4242461CUL))
#define bM4_MSC2_SPI_CSCR_CSTODIV2                      *((volatile unsigned int*)(0x42424620UL))
#define bM4_MSC2_SPI_CSCR_CSAH                          *((volatile unsigned int*)(0x42424624UL))
#define bM4_MSC2_SPI_CSCR_CSAD0                         *((volatile unsigned int*)(0x42424628UL))
#define bM4_MSC2_SPI_CSCR_CSAD1                         *((volatile unsigned int*)(0x4242462CUL))
#define bM4_MSC2_SPI_CSCR_CSAE0                         *((volatile unsigned int*)(0x42424630UL))
#define bM4_MSC2_SPI_CSCR_CSAE1                         *((volatile unsigned int*)(0x42424634UL))
#define bM4_MSC2_SPI_CSCR_CSAS0                         *((volatile unsigned int*)(0x42424638UL))
#define bM4_MSC2_SPI_CSCR_CSAS1                         *((volatile unsigned int*)(0x4242463CUL))
#define bM4_MSC2_SPI_CSFR1_DL0                          *((volatile unsigned int*)(0x42424680UL))
#define bM4_MSC2_SPI_CSFR1_DL1                          *((volatile unsigned int*)(0x42424684UL))
#define bM4_MSC2_SPI_CSFR1_DL2                          *((volatile unsigned int*)(0x42424688UL))
#define bM4_MSC2_SPI_CSFR1_DL3                          *((volatile unsigned int*)(0x4242468CUL))
#define bM4_MSC2_SPI_CSFR1_TDS                          *((volatile unsigned int*)(0x42424690UL))
#define bM4_MSC2_SPI_CSFR1_CINV                         *((volatile unsigned int*)(0x42424698UL))
#define bM4_MSC2_SPI_CSFR1_CSLVS                        *((volatile unsigned int*)(0x4242469CUL))
#define bM4_MSC2_SPI_CSFR2_DL0                          *((volatile unsigned int*)(0x424246A0UL))
#define bM4_MSC2_SPI_CSFR2_DL1                          *((volatile unsigned int*)(0x424246A4UL))
#define bM4_MSC2_SPI_CSFR2_DL2                          *((volatile unsigned int*)(0x424246A8UL))
#define bM4_MSC2_SPI_CSFR2_DL3                          *((volatile unsigned int*)(0x424246ACUL))
#define bM4_MSC2_SPI_CSFR2_TDS                          *((volatile unsigned int*)(0x424246B0UL))
#define bM4_MSC2_SPI_CSFR2_CINV                         *((volatile unsigned int*)(0x424246B8UL))
#define bM4_MSC2_SPI_CSFR2_CSLVS                        *((volatile unsigned int*)(0x424246BCUL))
#define bM4_MSTP_FCG0_RAMHS                             *((volatile unsigned int*)(0x42900000UL))
#define bM4_MSTP_FCG0_RAM0                              *((volatile unsigned int*)(0x42900010UL))
#define bM4_MSTP_FCG0_ECCRAM                            *((volatile unsigned int*)(0x42900020UL))
#define bM4_MSTP_FCG0_BRAM                              *((volatile unsigned int*)(0x42900028UL))
#define bM4_MSTP_FCG0_SMI                               *((volatile unsigned int*)(0x42900030UL))
