RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_MSTP_FCG0_DMA                               *((volatile unsigned int*)(0x42900038UL))
#define bM4_MSTP_FCG0_FCM                               *((volatile unsigned int*)(0x42900040UL))
#define bM4_MSTP_FCG0_AOS                               *((volatile unsigned int*)(0x42900044UL))
#define bM4_MSTP_FCG0_AES                               *((volatile unsigned int*)(0x42900050UL))
#define bM4_MSTP_FCG0_HASH                              *((volatile unsigned int*)(0x42900054UL))
#define bM4_MSTP_FCG0_TRNG                              *((volatile unsigned int*)(0x42900058UL))
#define bM4_MSTP_FCG0_CRC                               *((volatile unsigned int*)(0x4290005CUL))
#define bM4_MSTP_FCG0_DCU0                              *((volatile unsigned int*)(0x42900060UL))
#define bM4_MSTP_FCG0_DCU1                              *((volatile unsigned int*)(0x42900064UL))
#define bM4_MSTP_FCG0_DCU2                              *((volatile unsigned int*)(0x42900068UL))
#define bM4_MSTP_FCG0_DCU3                              *((volatile unsigned int*)(0x4290006CUL))
#define bM4_MSTP_FCG1_CAN0                              *((volatile unsigned int*)(0x42900080UL))
#define bM4_MSTP_FCG1_CAN1                              *((volatile unsigned int*)(0x42900084UL))
#define bM4_MSTP_FCG1_QSPI                              *((volatile unsigned int*)(0x42900090UL))
#define bM4_MSTP_FCG1_IIC                               *((volatile unsigned int*)(0x42900098UL))
#define bM4_MSTP_FCG1_USBFS                             *((volatile unsigned int*)(0x429000A0UL))
#define bM4_MSTP_FCG1_USBHS                             *((volatile unsigned int*)(0x429000A4UL))
#define bM4_MSTP_FCG1_ETHER                             *((volatile unsigned int*)(0x429000ACUL))
#define bM4_MSTP_FCG1_EXMC_SMC                          *((volatile unsigned int*)(0x429000B4UL))
#define bM4_MSTP_FCG1_EXMC_DMC                          *((volatile unsigned int*)(0x429000B8UL))
#define bM4_MSTP_FCG1_EXMC_NFC                          *((volatile unsigned int*)(0x429000BCUL))
#define bM4_MSTP_FCG1_SPI                               *((volatile unsigned int*)(0x429000C0UL))
#define bM4_MSTP_FCG1_MSC0                              *((volatile unsigned int*)(0x429000D0UL))
#define bM4_MSTP_FCG1_MSC1                              *((volatile unsigned int*)(0x429000D4UL))
#define bM4_MSTP_FCG1_MSC2                              *((volatile unsigned int*)(0x429000D8UL))
#define bM4_MSTP_FCG1_SCI0                              *((volatile unsigned int*)(0x429000E0UL))
#define bM4_MSTP_FCG1_SCI1                              *((volatile unsigned int*)(0x429000E4UL))
#define bM4_MSTP_FCG1_SCI2                              *((volatile unsigned int*)(0x429000E8UL))
#define bM4_MSTP_FCG1_SCI3                              *((volatile unsigned int*)(0x429000ECUL))
#define bM4_MSTP_FCG1_SCI4                              *((volatile unsigned int*)(0x429000F0UL))
#define bM4_MSTP_FCG1_SCI5                              *((volatile unsigned int*)(0x429000F4UL))
#define bM4_MSTP_FCG1_SCI6                              *((volatile unsigned int*)(0x429000F8UL))
#define bM4_MSTP_FCG2_TIMER0_01                         *((volatile unsigned int*)(0x42900100UL))
#define bM4_MSTP_FCG2_TIMER0_23                         *((volatile unsigned int*)(0x42900104UL))
#define bM4_MSTP_FCG2_TIMER2_01                         *((volatile unsigned int*)(0x42900110UL))
#define bM4_MSTP_FCG2_TIMER2_23                         *((volatile unsigned int*)(0x42900114UL))
#define bM4_MSTP_FCG2_TIMER2_45                         *((volatile unsigned int*)(0x42900118UL))
#define bM4_MSTP_FCG2_TIMER2_67                         *((volatile unsigned int*)(0x4290011CUL))
#define bM4_MSTP_FCG2_TIMER4_0                          *((volatile unsigned int*)(0x42900120UL))
#define bM4_MSTP_FCG2_TIMER4_1                          *((volatile unsigned int*)(0x42900124UL))
#define bM4_MSTP_FCG2_EMB                               *((volatile unsigned int*)(0x4290013CUL))
#define bM4_MSTP_FCG2_TIMER6_0                          *((volatile unsigned int*)(0x42900140UL))
#define bM4_MSTP_FCG2_TIMER6_1                          *((volatile unsigned int*)(0x42900144UL))
#define bM4_MSTP_FCG2_TIMER6_2                          *((volatile unsigned int*)(0x42900148UL))
#define bM4_MSTP_FCG2_TIMER6_3                          *((volatile unsigned int*)(0x4290014CUL))
#define bM4_MSTP_FCG2_TIMER6_4                          *((volatile unsigned int*)(0x42900150UL))
#define bM4_MSTP_FCG2_TIMER6_5                          *((volatile unsigned int*)(0x42900154UL))
#define bM4_MSTP_FCG2_TIMER6_6                          *((volatile unsigned int*)(0x42900158UL))
#define bM4_MSTP_FCG2_TIMER6_7                          *((volatile unsigned int*)(0x4290015CUL))
#define bM4_MSTP_FCG2_TIMER6_8                          *((volatile unsigned int*)(0x42900160UL))
#define bM4_MSTP_FCG2_TIMER6_9                          *((volatile unsigned int*)(0x42900164UL))
#define bM4_MSTP_FCG3_ADC0                              *((volatile unsigned int*)(0x42900180UL))
#define bM4_MSTP_FCG3_ADC1                              *((volatile unsigned int*)(0x42900184UL))
#define bM4_MSTP_FCG3_ADC2                              *((volatile unsigned int*)(0x42900188UL))
#define bM4_MSTP_FCG3_DAC                               *((volatile unsigned int*)(0x42900190UL))
#define bM4_MSTP_FCG3_CMP                               *((volatile unsigned int*)(0x429001A0UL))
#define bM4_MSTP_FCG0PC_PRT0                            *((volatile unsigned int*)(0x42900200UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE0                       *((volatile unsigned int*)(0x42900240UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE1                       *((volatile unsigned int*)(0x42900244UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE2                       *((volatile unsigned int*)(0x42900248UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE3                       *((volatile unsigned int*)(0x4290024CUL))
#define bM4_MSTP_FCG0PC_FCG0PCWE4                       *((volatile unsigned int*)(0x42900250UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE5                       *((volatile unsigned int*)(0x42900254UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE6                       *((volatile unsigned int*)(0x42900258UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE7                       *((volatile unsigned int*)(0x4290025CUL))
#define bM4_MSTP_FCG0PC_FCG0PCWE8                       *((volatile unsigned int*)(0x42900260UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE9                       *((volatile unsigned int*)(0x42900264UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE10                      *((volatile unsigned int*)(0x42900268UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE11                      *((volatile unsigned int*)(0x4290026CUL))
#define bM4_MSTP_FCG0PC_FCG0PCWE12                      *((volatile unsigned int*)(0x42900270UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE13                      *((volatile unsigned int*)(0x42900274UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE14                      *((volatile unsigned int*)(0x42900278UL))
#define bM4_MSTP_FCG0PC_FCG0PCWE15                      *((volatile unsigned int*)(0x4290027CUL))
#define bM4_MSTP_PRAMLPC_USFRAC                         *((volatile unsigned int*)(0x42900280UL))
#define bM4_MSTP_PRAMLPC_USHRAC                         *((volatile unsigned int*)(0x42900284UL))
#define bM4_MSTP_PRAMLPC_CANRA0C                        *((volatile unsigned int*)(0x42900290UL))
#define bM4_MSTP_PRAMLPC_CANRA1C                        *((volatile unsigned int*)(0x42900294UL))
#define bM4_MSTP_PRAMLPC_ETHRXRAC                       *((volatile unsigned int*)(0x42900298UL))
#define bM4_MSTP_PRAMLPC_ETHTXRAC                       *((volatile unsigned int*)(0x4290029CUL))
#define bM4_MSTP_PRAMLPC_EXMCRAC                        *((volatile unsigned int*)(0x429002A0UL))
#define bM4_PORT_PIDR0_PIN00                            *((volatile unsigned int*)(0x42A70000UL))
#define bM4_PORT_PIDR0_PIN01                            *((volatile unsigned int*)(0x42A70004UL))
#define bM4_PORT_PIDR0_PIN02                            *((volatile unsigned int*)(0x42A70008UL))
#define bM4_PORT_PIDR0_PIN03                            *((volatile unsigned int*)(0x42A7000CUL))
#define bM4_PORT_PIDR0_PIN04                            *((volatile unsigned int*)(0x42A70010UL))
#define bM4_PORT_PIDR0_PIN05                            *((volatile unsigned int*)(0x42A70014UL))
#define bM4_PORT_PIDR0_PIN06                            *((volatile unsigned int*)(0x42A70018UL))
#define bM4_PORT_PIDR0_PIN07                            *((volatile unsigned int*)(0x42A7001CUL))
#define bM4_PORT_PIDR0_PIN08                            *((volatile unsigned int*)(0x42A70020UL))
#define bM4_PORT_PIDR0_PIN09                            *((volatile unsigned int*)(0x42A70024UL))
#define bM4_PORT_PIDR0_PIN10                            *((volatile unsigned int*)(0x42A70028UL))
#define bM4_PORT_PIDR0_PIN11                            *((volatile unsigned int*)(0x42A7002CUL))
#define bM4_PORT_PIDR0_PIN12                            *((volatile unsigned int*)(0x42A70030UL))
#define bM4_PORT_PIDR0_PIN13                            *((volatile unsigned int*)(0x42A70034UL))
#define bM4_PORT_PIDR0_PIN14                            *((volatile unsigned int*)(0x42A70038UL))
#define bM4_PORT_PIDR0_PIN15                            *((volatile unsigned int*)(0x42A7003CUL))
#define bM4_PORT_PODR0_POUT00                           *((volatile unsigned int*)(0x42A70080UL))
#define bM4_PORT_PODR0_POUT01                           *((volatile unsigned int*)(0x42A70084UL))
#define bM4_PORT_PODR0_POUT02                           *((volatile unsigned int*)(0x42A70088UL))
#define bM4_PORT_PODR0_POUT03                           *((volatile unsigned int*)(0x42A7008CUL))
#define bM4_PORT_PODR0_POUT04                           *((volatile unsigned int*)(0x42A70090UL))
#define bM4_PORT_PODR0_POUT05                           *((volatile unsigned int*)(0x42A70094UL))
#define bM4_PORT_PODR0_POUT06                           *((volatile unsigned int*)(0x42A70098UL))
#define bM4_PORT_PODR0_POUT07                           *((volatile unsigned int*)(0x42A7009CUL))
#define bM4_PORT_PODR0_POUT08                           *((volatile unsigned int*)(0x42A700A0UL))
#define bM4_PORT_PODR0_POUT09                           *((volatile unsigned int*)(0x42A700A4UL))
#define bM4_PORT_PODR0_POUT10                           *((volatile unsigned int*)(0x42A700A8UL))
#define bM4_PORT_PODR0_POUT11                           *((volatile unsigned int*)(0x42A700ACUL))
#define bM4_PORT_PODR0_POUT12                           *((volatile unsigned int*)(0x42A700B0UL))
#define bM4_PORT_PODR0_POUT13                           *((volatile unsigned int*)(0x42A700B4UL))
#define bM4_PORT_PODR0_POUT14                           *((volatile unsigned int*)(0x42A700B8UL))
#define bM4_PORT_PODR0_POUT15                           *((volatile unsigned int*)(0x42A700BCUL))
#define bM4_PORT_POER0_POUTE00                          *((volatile unsigned int*)(0x42A700C0UL))
#define bM4_PORT_POER0_POUTE01                          *((volatile unsigned int*)(0x42A700C4UL))
#define bM4_PORT_POER0_POUTE02                          *((volatile unsigned int*)(0x42A700C8UL))
#define bM4_PORT_POER0_POUTE03                          *((volatile unsigned int*)(0x42A700CCUL))
#define bM4_PORT_POER0_POUTE04                          *((volatile unsigned int*)(0x42A700D0UL))
#define bM4_PORT_POER0_POUTE05                          *((volatile unsigned int*)(0x42A700D4UL))
#define bM4_PORT_POER0_POUTE06                          *((volatile unsigned int*)(0x42A700D8UL))
#define bM4_PORT_POER0_POUTE07                          *((volatile unsigned int*)(0x42A700DCUL))
#define bM4_PORT_POER0_POUTE08                          *((volatile unsigned int*)(0x42A700E0UL))
#define bM4_PORT_POER0_POUTE09                          *((volatile unsigned int*)(0x42A700E4UL))
#define bM4_PORT_POER0_POUTE10                          *((volatile unsigned int*)(0x42A700E8UL))
#define bM4_PORT_POER0_POUTE11                          *((volatile unsigned int*)(0x42A700ECUL))
#define bM4_PORT_POER0_POUTE12                          *((volatile unsigned int*)(0x42A700F0UL))
#define bM4_PORT_POER0_POUTE13                          *((volatile unsigned int*)(0x42A700F4UL))
#define bM4_PORT_POER0_POUTE14                          *((volatile unsigned int*)(0x42A700F8UL))
#define bM4_PORT_POER0_POUTE15                          *((volatile unsigned int*)(0x42A700FCUL))
#define bM4_PORT_POSR0_POS00                            *((volatile unsigned int*)(0x42A70100UL))
#define bM4_PORT_POSR0_POS01                            *((volatile unsigned int*)(0x42A70104UL))
#define bM4_PORT_POSR0_POS02                            *((volatile unsigned int*)(0x42A70108UL))
#define bM4_PORT_POSR0_POS03                            *((volatile unsigned int*)(0x42A7010CUL))
#define bM4_PORT_POSR0_POS04                            *((volatile unsigned int*)(0x42A70110UL))
#define bM4_PORT_POSR0_POS05                            *((volatile unsigned int*)(0x42A70114UL))
#define bM4_PORT_POSR0_POS06                            *((volatile unsigned int*)(0x42A70118UL))
#define bM4_PORT_POSR0_POS07                            *((volatile unsigned int*)(0x42A7011CUL))
#define bM4_PORT_POSR0_POS08                            *((volatile unsigned int*)(0x42A70120UL))
#define bM4_PORT_POSR0_POS09                            *((volatile unsigned int*)(0x42A70124UL))
#define bM4_PORT_POSR0_POS10                            *((volatile unsigned int*)(0x42A70128UL))
#define bM4_PORT_POSR0_POS11                            *((volatile unsigned int*)(0x42A7012CUL))
#define bM4_PORT_POSR0_POS12                            *((volatile unsigned int*)(0x42A70130UL))
#define bM4_PORT_POSR0_POS13                            *((volatile unsigned int*)(0x42A70134UL))
#define bM4_PORT_POSR0_POS14                            *((volatile unsigned int*)(0x42A70138UL))
#define bM4_PORT_POSR0_POS15                            *((volatile unsigned int*)(0x42A7013CUL))
#define bM4_PORT_PORR0_POR00                            *((volatile unsigned int*)(0x42A70140UL))
#define bM4_PORT_PORR0_POR01                            *((volatile unsigned int*)(0x42A70144UL))
#define bM4_PORT_PORR0_POR02                            *((volatile unsigned int*)(0x42A70148UL))
#define bM4_PORT_PORR0_POR03                            *((volatile unsigned int*)(0x42A7014CUL))
#define bM4_PORT_PORR0_POR04                            *((volatile unsigned int*)(0x42A70150UL))
#define bM4_PORT_PORR0_POR05                            *((volatile unsigned int*)(0x42A70154UL))
#define bM4_PORT_PORR0_POR06                            *((volatile unsigned int*)(0x42A70158UL))
#define bM4_PORT_PORR0_POR07                            *((volatile unsigned int*)(0x42A7015CUL))
#define bM4_PORT_PORR0_POR08                            *((volatile unsigned int*)(0x42A70160UL))
#define bM4_PORT_PORR0_POR09                            *((volatile unsigned int*)(0x42A70164UL))
#define bM4_PORT_PORR0_POR10                            *((volatile unsigned int*)(0x42A70168UL))
#define bM4_PORT_PORR0_POR11                            *((volatile unsigned int*)(0x42A7016CUL))
#define bM4_PORT_PORR0_POR12                            *((volatile unsigned int*)(0x42A70170UL))
#define bM4_PORT_PORR0_POR13                            *((volatile unsigned int*)(0x42A70174UL))
#define bM4_PORT_PORR0_POR14                            *((volatile unsigned int*)(0x42A70178UL))
#define bM4_PORT_PORR0_POR15                            *((volatile unsigned int*)(0x42A7017CUL))
#define bM4_PORT_POTR0_POT00                            *((volatile unsigned int*)(0x42A70180UL))
#define bM4_PORT_POTR0_POT01                            *((volatile unsigned int*)(0x42A70184UL))
#define bM4_PORT_POTR0_POT02                            *((volatile unsigned int*)(0x42A70188UL))
#define bM4_PORT_POTR0_POT03                            *((volatile unsigned int*)(0x42A7018CUL))
#define bM4_PORT_POTR0_POT04                            *((volatile unsigned int*)(0x42A70190UL))
#define bM4_PORT_POTR0_POT05                            *((volatile unsigned int*)(0x42A70194UL))
#define bM4_PORT_POTR0_POT06                            *((volatile unsigned int*)(0x42A70198UL))
#define bM4_PORT_POTR0_POT07                            *((volatile unsigned int*)(0x42A7019CUL))
#define bM4_PORT_POTR0_POT08                            *((volatile unsigned int*)(0x42A701A0UL))
#define bM4_PORT_POTR0_POT09                            *((volatile unsigned int*)(0x42A701A4UL))
#define bM4_PORT_POTR0_POT10                            *((volatile unsigned int*)(0x42A701A8UL))
#define bM4_PORT_POTR0_POT11                            *((volatile unsigned int*)(0x42A701ACUL))
#define bM4_PORT_POTR0_POT12                            *((volatile unsigned int*)(0x42A701B0UL))
#define bM4_PORT_POTR0_POT13                            *((volatile unsigned int*)(0x42A701B4UL))
#define bM4_PORT_POTR0_POT14                            *((volatile unsigned int*)(0x42A701B8UL))
#define bM4_PORT_POTR0_POT15                            *((volatile unsigned int*)(0x42A701BCUL))
#define bM4_PORT_PIDR1_PIN00                            *((volatile unsigned int*)(0x42A70200UL))
#define bM4_PORT_PIDR1_PIN01                            *((volatile unsigned int*)(0x42A70204UL))
#define bM4_PORT_PIDR1_PIN02                            *((volatile unsigned int*)(0x42A70208UL))
#define bM4_PORT_PIDR1_PIN03                            *((volatile unsigned int*)(0x42A7020CUL))
#define bM4_PORT_PIDR1_PIN04                            *((volatile unsigned int*)(0x42A70210UL))
#define bM4_PORT_PIDR1_PIN05                            *((volatile unsigned int*)(0x42A70214UL))
#define bM4_PORT_PIDR1_PIN06                            *((volatile unsigned int*)(0x42A70218UL))
#define bM4_PORT_PIDR1_PIN07                            *((volatile unsigned int*)(0x42A7021CUL))
#define bM4_PORT_PIDR1_PIN08                            *((volatile unsigned int*)(0x42A70220UL))
#define bM4_PORT_PIDR1_PIN09                            *((volatile unsigned int*)(0x42A70224UL))
#define bM4_PORT_PIDR1_PIN10                            *((volatile unsigned int*)(0x42A70228UL))
#define bM4_PORT_PIDR1_PIN11                            *((volatile unsigned int*)(0x42A7022CUL))
#define bM4_PORT_PIDR1_PIN12                            *((volatile unsigned int*)(0x42A70230UL))
#define bM4_PORT_PIDR1_PIN13                            *((volatile unsigned int*)(0x42A70234UL))
#define bM4_PORT_PIDR1_PIN14                            *((volatile unsigned int*)(0x42A70238UL))
#define bM4_PORT_PIDR1_PIN15                            *((volatile unsigned int*)(0x42A7023CUL))
#define bM4_PORT_PODR1_POUT00                           *((volatile unsigned int*)(0x42A70280UL))
#define bM4_PORT_PODR1_POUT01                           *((volatile unsigned int*)(0x42A70284UL))
#define bM4_PORT_PODR1_POUT02                           *((volatile unsigned int*)(0x42A70288UL))
#define bM4_PORT_PODR1_POUT03                           *((volatile unsigned int*)(0x42A7028CUL))
#define bM4_PORT_PODR1_POUT04                           *((volatile unsigned int*)(0x42A70290UL))
#define bM4_PORT_PODR1_POUT05                           *((volatile unsigned int*)(0x42A70294UL))
#define bM4_PORT_PODR1_POUT06                           *((volatile unsigned int*)(0x42A70298UL))
#define bM4_PORT_PODR1_POUT07                           *((volatile unsigned int*)(0x42A7029CUL))
#define bM4_PORT_PODR1_POUT08                           *((volatile unsigned int*)(0x42A702A0UL))
#define bM4_PORT_PODR1_POUT09                           *((volatile unsigned int*)(0x42A702A4UL))
#define bM4_PORT_PODR1_POUT10                           *((volatile unsigned int*)(0x42A702A8UL))
#define bM4_PORT_PODR1_POUT11                           *((volatile unsigned int*)(0x42A702ACUL))
#define bM4_PORT_PODR1_POUT12                           *((volatile unsigned int*)(0x42A702B0UL))
#define bM4_PORT_PODR1_POUT13                           *((volatile unsigned int*)(0x42A702B4UL))
#define bM4_PORT_PODR1_POUT14                           *((volatile unsigned int*)(0x42A702B8UL))
#define bM4_PORT_PODR1_POUT15                           *((volatile unsigned int*)(0x42A702BCUL))
#define bM4_PORT_POER1_POUTE00                          *((volatile unsigned int*)(0x42A702C0UL))
#define bM4_PORT_POER1_POUTE01                          *((volatile unsigned int*)(0x42A702C4UL))
#define bM4_PORT_POER1_POUTE02                          *((volatile unsigned int*)(0x42A702C8UL))
#define bM4_PORT_POER1_POUTE03                          *((volatile unsigned int*)(0x42A702CCUL))
#define bM4_PORT_POER1_POUTE04                          *((volatile unsigned int*)(0x42A702D0UL))
#define bM4_PORT_POER1_POUTE05                          *((volatile unsigned int*)(0x42A702D4UL))
#define bM4_PORT_POER1_POUTE06                          *((volatile unsigned int*)(0x42A702D8UL))
#define bM4_PORT_POER1_POUTE07                          *((volatile unsigned int*)(0x42A702DCUL))
#define bM4_PORT_POER1_POUTE08                          *((volatile unsigned int*)(0x42A702E0UL))
#define bM4_PORT_POER1_POUTE09                          *((volatile unsigned int*)(0x42A702E4UL))
#define bM4_PORT_POER1_POUTE10                          *((volatile unsigned int*)(0x42A702E8UL))
#define bM4_PORT_POER1_POUTE11                          *((volatile unsigned int*)(0x42A702ECUL))
#define bM4_PORT_POER1_POUTE12                          *((volatile unsigned int*)(0x42A702F0UL))
#define bM4_PORT_POER1_POUTE13                          *((volatile unsigned int*)(0x42A702F4UL))
#define bM4_PORT_POER1_POUTE14                          *((volatile unsigned int*)(0x42A702F8UL))
#define bM4_PORT_POER1_POUTE15                          *((volatile unsigned int*)(0x42A702FCUL))
#define bM4_PORT_POSR1_POS00                            *((volatile unsigned int*)(0x42A70300UL))
#define bM4_PORT_POSR1_POS01                            *((volatile unsigned int*)(0x42A70304UL))
#define bM4_PORT_POSR1_POS02                            *((volatile unsigned int*)(0x42A70308UL))
#define bM4_PORT_POSR1_POS03                            *((volatile unsigned int*)(0x42A7030CUL))
#define bM4_PORT_POSR1_POS04                            *((volatile unsigned int*)(0x42A70310UL))
#define bM4_PORT_POSR1_POS05                            *((volatile unsigned int*)(0x42A70314UL))
#define bM4_PORT_POSR1_POS06                            *((volatile unsigned int*)(0x42A70318UL))
#define bM4_PORT_POSR1_POS07                            *((volatile unsigned int*)(0x42A7031CUL))
#define bM4_PORT_POSR1_POS08                            *((volatile unsigned int*)(0x42A70320UL))
#define bM4_PORT_POSR1_POS09                            *((volatile unsigned int*)(0x42A70324UL))
#define bM4_PORT_POSR1_POS10                            *((volatile unsigned int*)(0x42A70328UL))
#define bM4_PORT_POSR1_POS11                            *((volatile unsigned int*)(0x42A7032CUL))
#define bM4_PORT_POSR1_POS12                            *((volatile unsigned int*)(0x42A70330UL))
#define bM4_PORT_POSR1_POS13                            *((volatile unsigned int*)(0x42A70334UL))
#define bM4_PORT_POSR1_POS14                            *((volatile unsigned int*)(0x42A70338UL))
#define bM4_PORT_POSR1_POS15                            *((volatile unsigned int*)(0x42A7033CUL))
#define bM4_PORT_PORR1_POR00                            *((volatile unsigned int*)(0x42A70340UL))
#define bM4_PORT_PORR1_POR01                            *((volatile unsigned int*)(0x42A70344UL))
#define bM4_PORT_PORR1_POR02                            *((volatile unsigned int*)(0x42A70348UL))
#define bM4_PORT_PORR1_POR03                            *((volatile unsigned int*)(0x42A7034CUL))
