RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_PORT_PORR1_POR04                            *((volatile unsigned int*)(0x42A70350UL))
#define bM4_PORT_PORR1_POR05                            *((volatile unsigned int*)(0x42A70354UL))
#define bM4_PORT_PORR1_POR06                            *((volatile unsigned int*)(0x42A70358UL))
#define bM4_PORT_PORR1_POR07                            *((volatile unsigned int*)(0x42A7035CUL))
#define bM4_PORT_PORR1_POR08                            *((volatile unsigned int*)(0x42A70360UL))
#define bM4_PORT_PORR1_POR09                            *((volatile unsigned int*)(0x42A70364UL))
#define bM4_PORT_PORR1_POR10                            *((volatile unsigned int*)(0x42A70368UL))
#define bM4_PORT_PORR1_POR11                            *((volatile unsigned int*)(0x42A7036CUL))
#define bM4_PORT_PORR1_POR12                            *((volatile unsigned int*)(0x42A70370UL))
#define bM4_PORT_PORR1_POR13                            *((volatile unsigned int*)(0x42A70374UL))
#define bM4_PORT_PORR1_POR14                            *((volatile unsigned int*)(0x42A70378UL))
#define bM4_PORT_PORR1_POR15                            *((volatile unsigned int*)(0x42A7037CUL))
#define bM4_PORT_POTR1_POT00                            *((volatile unsigned int*)(0x42A70380UL))
#define bM4_PORT_POTR1_POT01                            *((volatile unsigned int*)(0x42A70384UL))
#define bM4_PORT_POTR1_POT02                            *((volatile unsigned int*)(0x42A70388UL))
#define bM4_PORT_POTR1_POT03                            *((volatile unsigned int*)(0x42A7038CUL))
#define bM4_PORT_POTR1_POT04                            *((volatile unsigned int*)(0x42A70390UL))
#define bM4_PORT_POTR1_POT05                            *((volatile unsigned int*)(0x42A70394UL))
#define bM4_PORT_POTR1_POT06                            *((volatile unsigned int*)(0x42A70398UL))
#define bM4_PORT_POTR1_POT07                            *((volatile unsigned int*)(0x42A7039CUL))
#define bM4_PORT_POTR1_POT08                            *((volatile unsigned int*)(0x42A703A0UL))
#define bM4_PORT_POTR1_POT09                            *((volatile unsigned int*)(0x42A703A4UL))
#define bM4_PORT_POTR1_POT10                            *((volatile unsigned int*)(0x42A703A8UL))
#define bM4_PORT_POTR1_POT11                            *((volatile unsigned int*)(0x42A703ACUL))
#define bM4_PORT_POTR1_POT12                            *((volatile unsigned int*)(0x42A703B0UL))
#define bM4_PORT_POTR1_POT13                            *((volatile unsigned int*)(0x42A703B4UL))
#define bM4_PORT_POTR1_POT14                            *((volatile unsigned int*)(0x42A703B8UL))
#define bM4_PORT_POTR1_POT15                            *((volatile unsigned int*)(0x42A703BCUL))
#define bM4_PORT_PIDR2_PIN00                            *((volatile unsigned int*)(0x42A70400UL))
#define bM4_PORT_PIDR2_PIN01                            *((volatile unsigned int*)(0x42A70404UL))
#define bM4_PORT_PIDR2_PIN02                            *((volatile unsigned int*)(0x42A70408UL))
#define bM4_PORT_PIDR2_PIN03                            *((volatile unsigned int*)(0x42A7040CUL))
#define bM4_PORT_PIDR2_PIN04                            *((volatile unsigned int*)(0x42A70410UL))
#define bM4_PORT_PIDR2_PIN05                            *((volatile unsigned int*)(0x42A70414UL))
#define bM4_PORT_PIDR2_PIN06                            *((volatile unsigned int*)(0x42A70418UL))
#define bM4_PORT_PIDR2_PIN07                            *((volatile unsigned int*)(0x42A7041CUL))
#define bM4_PORT_PIDR2_PIN08                            *((volatile unsigned int*)(0x42A70420UL))
#define bM4_PORT_PIDR2_PIN09                            *((volatile unsigned int*)(0x42A70424UL))
#define bM4_PORT_PIDR2_PIN10                            *((volatile unsigned int*)(0x42A70428UL))
#define bM4_PORT_PIDR2_PIN11                            *((volatile unsigned int*)(0x42A7042CUL))
#define bM4_PORT_PIDR2_PIN12                            *((volatile unsigned int*)(0x42A70430UL))
#define bM4_PORT_PIDR2_PIN13                            *((volatile unsigned int*)(0x42A70434UL))
#define bM4_PORT_PIDR2_PIN14                            *((volatile unsigned int*)(0x42A70438UL))
#define bM4_PORT_PIDR2_PIN15                            *((volatile unsigned int*)(0x42A7043CUL))
#define bM4_PORT_PODR2_POUT00                           *((volatile unsigned int*)(0x42A70480UL))
#define bM4_PORT_PODR2_POUT01                           *((volatile unsigned int*)(0x42A70484UL))
#define bM4_PORT_PODR2_POUT02                           *((volatile unsigned int*)(0x42A70488UL))
#define bM4_PORT_PODR2_POUT03                           *((volatile unsigned int*)(0x42A7048CUL))
#define bM4_PORT_PODR2_POUT04                           *((volatile unsigned int*)(0x42A70490UL))
#define bM4_PORT_PODR2_POUT05                           *((volatile unsigned int*)(0x42A70494UL))
#define bM4_PORT_PODR2_POUT06                           *((volatile unsigned int*)(0x42A70498UL))
#define bM4_PORT_PODR2_POUT07                           *((volatile unsigned int*)(0x42A7049CUL))
#define bM4_PORT_PODR2_POUT08                           *((volatile unsigned int*)(0x42A704A0UL))
#define bM4_PORT_PODR2_POUT09                           *((volatile unsigned int*)(0x42A704A4UL))
#define bM4_PORT_PODR2_POUT10                           *((volatile unsigned int*)(0x42A704A8UL))
#define bM4_PORT_PODR2_POUT11                           *((volatile unsigned int*)(0x42A704ACUL))
#define bM4_PORT_PODR2_POUT12                           *((volatile unsigned int*)(0x42A704B0UL))
#define bM4_PORT_PODR2_POUT13                           *((volatile unsigned int*)(0x42A704B4UL))
#define bM4_PORT_PODR2_POUT14                           *((volatile unsigned int*)(0x42A704B8UL))
#define bM4_PORT_PODR2_POUT15                           *((volatile unsigned int*)(0x42A704BCUL))
#define bM4_PORT_POER2_POUTE00                          *((volatile unsigned int*)(0x42A704C0UL))
#define bM4_PORT_POER2_POUTE01                          *((volatile unsigned int*)(0x42A704C4UL))
#define bM4_PORT_POER2_POUTE02                          *((volatile unsigned int*)(0x42A704C8UL))
#define bM4_PORT_POER2_POUTE03                          *((volatile unsigned int*)(0x42A704CCUL))
#define bM4_PORT_POER2_POUTE04                          *((volatile unsigned int*)(0x42A704D0UL))
#define bM4_PORT_POER2_POUTE05                          *((volatile unsigned int*)(0x42A704D4UL))
#define bM4_PORT_POER2_POUTE06                          *((volatile unsigned int*)(0x42A704D8UL))
#define bM4_PORT_POER2_POUTE07                          *((volatile unsigned int*)(0x42A704DCUL))
#define bM4_PORT_POER2_POUTE08                          *((volatile unsigned int*)(0x42A704E0UL))
#define bM4_PORT_POER2_POUTE09                          *((volatile unsigned int*)(0x42A704E4UL))
#define bM4_PORT_POER2_POUTE10                          *((volatile unsigned int*)(0x42A704E8UL))
#define bM4_PORT_POER2_POUTE11                          *((volatile unsigned int*)(0x42A704ECUL))
#define bM4_PORT_POER2_POUTE12                          *((volatile unsigned int*)(0x42A704F0UL))
#define bM4_PORT_POER2_POUTE13                          *((volatile unsigned int*)(0x42A704F4UL))
#define bM4_PORT_POER2_POUTE14                          *((volatile unsigned int*)(0x42A704F8UL))
#define bM4_PORT_POER2_POUTE15                          *((volatile unsigned int*)(0x42A704FCUL))
#define bM4_PORT_POSR2_POS00                            *((volatile unsigned int*)(0x42A70500UL))
#define bM4_PORT_POSR2_POS01                            *((volatile unsigned int*)(0x42A70504UL))
#define bM4_PORT_POSR2_POS02                            *((volatile unsigned int*)(0x42A70508UL))
#define bM4_PORT_POSR2_POS03                            *((volatile unsigned int*)(0x42A7050CUL))
#define bM4_PORT_POSR2_POS04                            *((volatile unsigned int*)(0x42A70510UL))
#define bM4_PORT_POSR2_POS05                            *((volatile unsigned int*)(0x42A70514UL))
#define bM4_PORT_POSR2_POS06                            *((volatile unsigned int*)(0x42A70518UL))
#define bM4_PORT_POSR2_POS07                            *((volatile unsigned int*)(0x42A7051CUL))
#define bM4_PORT_POSR2_POS08                            *((volatile unsigned int*)(0x42A70520UL))
#define bM4_PORT_POSR2_POS09                            *((volatile unsigned int*)(0x42A70524UL))
#define bM4_PORT_POSR2_POS10                            *((volatile unsigned int*)(0x42A70528UL))
#define bM4_PORT_POSR2_POS11                            *((volatile unsigned int*)(0x42A7052CUL))
#define bM4_PORT_POSR2_POS12                            *((volatile unsigned int*)(0x42A70530UL))
#define bM4_PORT_POSR2_POS13                            *((volatile unsigned int*)(0x42A70534UL))
#define bM4_PORT_POSR2_POS14                            *((volatile unsigned int*)(0x42A70538UL))
#define bM4_PORT_POSR2_POS15                            *((volatile unsigned int*)(0x42A7053CUL))
#define bM4_PORT_PORR2_POR00                            *((volatile unsigned int*)(0x42A70540UL))
#define bM4_PORT_PORR2_POR01                            *((volatile unsigned int*)(0x42A70544UL))
#define bM4_PORT_PORR2_POR02                            *((volatile unsigned int*)(0x42A70548UL))
#define bM4_PORT_PORR2_POR03                            *((volatile unsigned int*)(0x42A7054CUL))
#define bM4_PORT_PORR2_POR04                            *((volatile unsigned int*)(0x42A70550UL))
#define bM4_PORT_PORR2_POR05                            *((volatile unsigned int*)(0x42A70554UL))
#define bM4_PORT_PORR2_POR06                            *((volatile unsigned int*)(0x42A70558UL))
#define bM4_PORT_PORR2_POR07                            *((volatile unsigned int*)(0x42A7055CUL))
#define bM4_PORT_PORR2_POR08                            *((volatile unsigned int*)(0x42A70560UL))
#define bM4_PORT_PORR2_POR09                            *((volatile unsigned int*)(0x42A70564UL))
#define bM4_PORT_PORR2_POR10                            *((volatile unsigned int*)(0x42A70568UL))
#define bM4_PORT_PORR2_POR11                            *((volatile unsigned int*)(0x42A7056CUL))
#define bM4_PORT_PORR2_POR12                            *((volatile unsigned int*)(0x42A70570UL))
#define bM4_PORT_PORR2_POR13                            *((volatile unsigned int*)(0x42A70574UL))
#define bM4_PORT_PORR2_POR14                            *((volatile unsigned int*)(0x42A70578UL))
#define bM4_PORT_PORR2_POR15                            *((volatile unsigned int*)(0x42A7057CUL))
#define bM4_PORT_POTR2_POT00                            *((volatile unsigned int*)(0x42A70580UL))
#define bM4_PORT_POTR2_POT01                            *((volatile unsigned int*)(0x42A70584UL))
#define bM4_PORT_POTR2_POT02                            *((volatile unsigned int*)(0x42A70588UL))
#define bM4_PORT_POTR2_POT03                            *((volatile unsigned int*)(0x42A7058CUL))
#define bM4_PORT_POTR2_POT04                            *((volatile unsigned int*)(0x42A70590UL))
#define bM4_PORT_POTR2_POT05                            *((volatile unsigned int*)(0x42A70594UL))
#define bM4_PORT_POTR2_POT06                            *((volatile unsigned int*)(0x42A70598UL))
#define bM4_PORT_POTR2_POT07                            *((volatile unsigned int*)(0x42A7059CUL))
#define bM4_PORT_POTR2_POT08                            *((volatile unsigned int*)(0x42A705A0UL))
#define bM4_PORT_POTR2_POT09                            *((volatile unsigned int*)(0x42A705A4UL))
#define bM4_PORT_POTR2_POT10                            *((volatile unsigned int*)(0x42A705A8UL))
#define bM4_PORT_POTR2_POT11                            *((volatile unsigned int*)(0x42A705ACUL))
#define bM4_PORT_POTR2_POT12                            *((volatile unsigned int*)(0x42A705B0UL))
#define bM4_PORT_POTR2_POT13                            *((volatile unsigned int*)(0x42A705B4UL))
#define bM4_PORT_POTR2_POT14                            *((volatile unsigned int*)(0x42A705B8UL))
#define bM4_PORT_POTR2_POT15                            *((volatile unsigned int*)(0x42A705BCUL))
#define bM4_PORT_PIDR3_PIN00                            *((volatile unsigned int*)(0x42A70600UL))
#define bM4_PORT_PIDR3_PIN01                            *((volatile unsigned int*)(0x42A70604UL))
#define bM4_PORT_PIDR3_PIN02                            *((volatile unsigned int*)(0x42A70608UL))
#define bM4_PORT_PIDR3_PIN03                            *((volatile unsigned int*)(0x42A7060CUL))
#define bM4_PORT_PIDR3_PIN04                            *((volatile unsigned int*)(0x42A70610UL))
#define bM4_PORT_PIDR3_PIN05                            *((volatile unsigned int*)(0x42A70614UL))
#define bM4_PORT_PIDR3_PIN06                            *((volatile unsigned int*)(0x42A70618UL))
#define bM4_PORT_PIDR3_PIN07                            *((volatile unsigned int*)(0x42A7061CUL))
#define bM4_PORT_PIDR3_PIN08                            *((volatile unsigned int*)(0x42A70620UL))
#define bM4_PORT_PIDR3_PIN09                            *((volatile unsigned int*)(0x42A70624UL))
#define bM4_PORT_PIDR3_PIN10                            *((volatile unsigned int*)(0x42A70628UL))
#define bM4_PORT_PIDR3_PIN11                            *((volatile unsigned int*)(0x42A7062CUL))
#define bM4_PORT_PIDR3_PIN12                            *((volatile unsigned int*)(0x42A70630UL))
#define bM4_PORT_PIDR3_PIN13                            *((volatile unsigned int*)(0x42A70634UL))
#define bM4_PORT_PIDR3_PIN14                            *((volatile unsigned int*)(0x42A70638UL))
#define bM4_PORT_PIDR3_PIN15                            *((volatile unsigned int*)(0x42A7063CUL))
#define bM4_PORT_PODR3_POUT00                           *((volatile unsigned int*)(0x42A70680UL))
#define bM4_PORT_PODR3_POUT01                           *((volatile unsigned int*)(0x42A70684UL))
#define bM4_PORT_PODR3_POUT02                           *((volatile unsigned int*)(0x42A70688UL))
#define bM4_PORT_PODR3_POUT03                           *((volatile unsigned int*)(0x42A7068CUL))
#define bM4_PORT_PODR3_POUT04                           *((volatile unsigned int*)(0x42A70690UL))
#define bM4_PORT_PODR3_POUT05                           *((volatile unsigned int*)(0x42A70694UL))
#define bM4_PORT_PODR3_POUT06                           *((volatile unsigned int*)(0x42A70698UL))
#define bM4_PORT_PODR3_POUT07                           *((volatile unsigned int*)(0x42A7069CUL))
#define bM4_PORT_PODR3_POUT08                           *((volatile unsigned int*)(0x42A706A0UL))
#define bM4_PORT_PODR3_POUT09                           *((volatile unsigned int*)(0x42A706A4UL))
#define bM4_PORT_PODR3_POUT10                           *((volatile unsigned int*)(0x42A706A8UL))
#define bM4_PORT_PODR3_POUT11                           *((volatile unsigned int*)(0x42A706ACUL))
#define bM4_PORT_PODR3_POUT12                           *((volatile unsigned int*)(0x42A706B0UL))
#define bM4_PORT_PODR3_POUT13                           *((volatile unsigned int*)(0x42A706B4UL))
#define bM4_PORT_PODR3_POUT14                           *((volatile unsigned int*)(0x42A706B8UL))
#define bM4_PORT_PODR3_POUT15                           *((volatile unsigned int*)(0x42A706BCUL))
#define bM4_PORT_POER3_POUTE00                          *((volatile unsigned int*)(0x42A706C0UL))
#define bM4_PORT_POER3_POUTE01                          *((volatile unsigned int*)(0x42A706C4UL))
#define bM4_PORT_POER3_POUTE02                          *((volatile unsigned int*)(0x42A706C8UL))
#define bM4_PORT_POER3_POUTE03                          *((volatile unsigned int*)(0x42A706CCUL))
#define bM4_PORT_POER3_POUTE04                          *((volatile unsigned int*)(0x42A706D0UL))
#define bM4_PORT_POER3_POUTE05                          *((volatile unsigned int*)(0x42A706D4UL))
#define bM4_PORT_POER3_POUTE06                          *((volatile unsigned int*)(0x42A706D8UL))
#define bM4_PORT_POER3_POUTE07                          *((volatile unsigned int*)(0x42A706DCUL))
#define bM4_PORT_POER3_POUTE08                          *((volatile unsigned int*)(0x42A706E0UL))
#define bM4_PORT_POER3_POUTE09                          *((volatile unsigned int*)(0x42A706E4UL))
#define bM4_PORT_POER3_POUTE10                          *((volatile unsigned int*)(0x42A706E8UL))
#define bM4_PORT_POER3_POUTE11                          *((volatile unsigned int*)(0x42A706ECUL))
#define bM4_PORT_POER3_POUTE12                          *((volatile unsigned int*)(0x42A706F0UL))
#define bM4_PORT_POER3_POUTE13                          *((volatile unsigned int*)(0x42A706F4UL))
#define bM4_PORT_POER3_POUTE14                          *((volatile unsigned int*)(0x42A706F8UL))
#define bM4_PORT_POER3_POUTE15                          *((volatile unsigned int*)(0x42A706FCUL))
#define bM4_PORT_POSR3_POS00                            *((volatile unsigned int*)(0x42A70700UL))
#define bM4_PORT_POSR3_POS01                            *((volatile unsigned int*)(0x42A70704UL))
#define bM4_PORT_POSR3_POS02                            *((volatile unsigned int*)(0x42A70708UL))
#define bM4_PORT_POSR3_POS03                            *((volatile unsigned int*)(0x42A7070CUL))
#define bM4_PORT_POSR3_POS04                            *((volatile unsigned int*)(0x42A70710UL))
#define bM4_PORT_POSR3_POS05                            *((volatile unsigned int*)(0x42A70714UL))
#define bM4_PORT_POSR3_POS06                            *((volatile unsigned int*)(0x42A70718UL))
#define bM4_PORT_POSR3_POS07                            *((volatile unsigned int*)(0x42A7071CUL))
#define bM4_PORT_POSR3_POS08                            *((volatile unsigned int*)(0x42A70720UL))
#define bM4_PORT_POSR3_POS09                            *((volatile unsigned int*)(0x42A70724UL))
#define bM4_PORT_POSR3_POS10                            *((volatile unsigned int*)(0x42A70728UL))
#define bM4_PORT_POSR3_POS11                            *((volatile unsigned int*)(0x42A7072CUL))
#define bM4_PORT_POSR3_POS12                            *((volatile unsigned int*)(0x42A70730UL))
#define bM4_PORT_POSR3_POS13                            *((volatile unsigned int*)(0x42A70734UL))
#define bM4_PORT_POSR3_POS14                            *((volatile unsigned int*)(0x42A70738UL))
#define bM4_PORT_POSR3_POS15                            *((volatile unsigned int*)(0x42A7073CUL))
#define bM4_PORT_PORR3_POR00                            *((volatile unsigned int*)(0x42A70740UL))
#define bM4_PORT_PORR3_POR01                            *((volatile unsigned int*)(0x42A70744UL))
#define bM4_PORT_PORR3_POR02                            *((volatile unsigned int*)(0x42A70748UL))
#define bM4_PORT_PORR3_POR03                            *((volatile unsigned int*)(0x42A7074CUL))
#define bM4_PORT_PORR3_POR04                            *((volatile unsigned int*)(0x42A70750UL))
#define bM4_PORT_PORR3_POR05                            *((volatile unsigned int*)(0x42A70754UL))
#define bM4_PORT_PORR3_POR06                            *((volatile unsigned int*)(0x42A70758UL))
#define bM4_PORT_PORR3_POR07                            *((volatile unsigned int*)(0x42A7075CUL))
#define bM4_PORT_PORR3_POR08                            *((volatile unsigned int*)(0x42A70760UL))
#define bM4_PORT_PORR3_POR09                            *((volatile unsigned int*)(0x42A70764UL))
#define bM4_PORT_PORR3_POR10                            *((volatile unsigned int*)(0x42A70768UL))
#define bM4_PORT_PORR3_POR11                            *((volatile unsigned int*)(0x42A7076CUL))
#define bM4_PORT_PORR3_POR12                            *((volatile unsigned int*)(0x42A70770UL))
#define bM4_PORT_PORR3_POR13                            *((volatile unsigned int*)(0x42A70774UL))
#define bM4_PORT_PORR3_POR14                            *((volatile unsigned int*)(0x42A70778UL))
#define bM4_PORT_PORR3_POR15                            *((volatile unsigned int*)(0x42A7077CUL))
#define bM4_PORT_POTR3_POT00                            *((volatile unsigned int*)(0x42A70780UL))
#define bM4_PORT_POTR3_POT01                            *((volatile unsigned int*)(0x42A70784UL))
#define bM4_PORT_POTR3_POT02                            *((volatile unsigned int*)(0x42A70788UL))
#define bM4_PORT_POTR3_POT03                            *((volatile unsigned int*)(0x42A7078CUL))
#define bM4_PORT_POTR3_POT04                            *((volatile unsigned int*)(0x42A70790UL))
#define bM4_PORT_POTR3_POT05                            *((volatile unsigned int*)(0x42A70794UL))
#define bM4_PORT_POTR3_POT06                            *((volatile unsigned int*)(0x42A70798UL))
#define bM4_PORT_POTR3_POT07                            *((volatile unsigned int*)(0x42A7079CUL))
#define bM4_PORT_POTR3_POT08                            *((volatile unsigned int*)(0x42A707A0UL))
#define bM4_PORT_POTR3_POT09                            *((volatile unsigned int*)(0x42A707A4UL))
#define bM4_PORT_POTR3_POT10                            *((volatile unsigned int*)(0x42A707A8UL))
#define bM4_PORT_POTR3_POT11                            *((volatile unsigned int*)(0x42A707ACUL))
#define bM4_PORT_POTR3_POT12                            *((volatile unsigned int*)(0x42A707B0UL))
#define bM4_PORT_POTR3_POT13                            *((volatile unsigned int*)(0x42A707B4UL))
#define bM4_PORT_POTR3_POT14                            *((volatile unsigned int*)(0x42A707B8UL))
#define bM4_PORT_POTR3_POT15                            *((volatile unsigned int*)(0x42A707BCUL))
#define bM4_PORT_PIDR4_PIN00                            *((volatile unsigned int*)(0x42A70800UL))
#define bM4_PORT_PIDR4_PIN01                            *((volatile unsigned int*)(0x42A70804UL))
#define bM4_PORT_PIDR4_PIN02                            *((volatile unsigned int*)(0x42A70808UL))
#define bM4_PORT_PIDR4_PIN03                            *((volatile unsigned int*)(0x42A7080CUL))
#define bM4_PORT_PIDR4_PIN04                            *((volatile unsigned int*)(0x42A70810UL))
#define bM4_PORT_PIDR4_PIN05                            *((volatile unsigned int*)(0x42A70814UL))
#define bM4_PORT_PIDR4_PIN06                            *((volatile unsigned int*)(0x42A70818UL))
#define bM4_PORT_PIDR4_PIN07                            *((volatile unsigned int*)(0x42A7081CUL))
#define bM4_PORT_PIDR4_PIN08                            *((volatile unsigned int*)(0x42A70820UL))
#define bM4_PORT_PIDR4_PIN09                            *((volatile unsigned int*)(0x42A70824UL))
#define bM4_PORT_PIDR4_PIN10                            *((volatile unsigned int*)(0x42A70828UL))
#define bM4_PORT_PIDR4_PIN11                            *((volatile unsigned int*)(0x42A7082CUL))
#define bM4_PORT_PIDR4_PIN12                            *((volatile unsigned int*)(0x42A70830UL))
#define bM4_PORT_PIDR4_PIN13                            *((volatile unsigned int*)(0x42A70834UL))
#define bM4_PORT_PIDR4_PIN14                            *((volatile unsigned int*)(0x42A70838UL))
#define bM4_PORT_PIDR4_PIN15                            *((volatile unsigned int*)(0x42A7083CUL))
#define bM4_PORT_PODR4_POUT00                           *((volatile unsigned int*)(0x42A70880UL))
#define bM4_PORT_PODR4_POUT01                           *((volatile unsigned int*)(0x42A70884UL))
#define bM4_PORT_PODR4_POUT02                           *((volatile unsigned int*)(0x42A70888UL))
#define bM4_PORT_PODR4_POUT03                           *((volatile unsigned int*)(0x42A7088CUL))
#define bM4_PORT_PODR4_POUT04                           *((volatile unsigned int*)(0x42A70890UL))
#define bM4_PORT_PODR4_POUT05                           *((volatile unsigned int*)(0x42A70894UL))
#define bM4_PORT_PODR4_POUT06                           *((volatile unsigned int*)(0x42A70898UL))
#define bM4_PORT_PODR4_POUT07                           *((volatile unsigned int*)(0x42A7089CUL))
