RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_PORT_PODR4_POUT08                           *((volatile unsigned int*)(0x42A708A0UL))
#define bM4_PORT_PODR4_POUT09                           *((volatile unsigned int*)(0x42A708A4UL))
#define bM4_PORT_PODR4_POUT10                           *((volatile unsigned int*)(0x42A708A8UL))
#define bM4_PORT_PODR4_POUT11                           *((volatile unsigned int*)(0x42A708ACUL))
#define bM4_PORT_PODR4_POUT12                           *((volatile unsigned int*)(0x42A708B0UL))
#define bM4_PORT_PODR4_POUT13                           *((volatile unsigned int*)(0x42A708B4UL))
#define bM4_PORT_PODR4_POUT14                           *((volatile unsigned int*)(0x42A708B8UL))
#define bM4_PORT_PODR4_POUT15                           *((volatile unsigned int*)(0x42A708BCUL))
#define bM4_PORT_POER4_POUTE00                          *((volatile unsigned int*)(0x42A708C0UL))
#define bM4_PORT_POER4_POUTE01                          *((volatile unsigned int*)(0x42A708C4UL))
#define bM4_PORT_POER4_POUTE02                          *((volatile unsigned int*)(0x42A708C8UL))
#define bM4_PORT_POER4_POUTE03                          *((volatile unsigned int*)(0x42A708CCUL))
#define bM4_PORT_POER4_POUTE04                          *((volatile unsigned int*)(0x42A708D0UL))
#define bM4_PORT_POER4_POUTE05                          *((volatile unsigned int*)(0x42A708D4UL))
#define bM4_PORT_POER4_POUTE06                          *((volatile unsigned int*)(0x42A708D8UL))
#define bM4_PORT_POER4_POUTE07                          *((volatile unsigned int*)(0x42A708DCUL))
#define bM4_PORT_POER4_POUTE08                          *((volatile unsigned int*)(0x42A708E0UL))
#define bM4_PORT_POER4_POUTE09                          *((volatile unsigned int*)(0x42A708E4UL))
#define bM4_PORT_POER4_POUTE10                          *((volatile unsigned int*)(0x42A708E8UL))
#define bM4_PORT_POER4_POUTE11                          *((volatile unsigned int*)(0x42A708ECUL))
#define bM4_PORT_POER4_POUTE12                          *((volatile unsigned int*)(0x42A708F0UL))
#define bM4_PORT_POER4_POUTE13                          *((volatile unsigned int*)(0x42A708F4UL))
#define bM4_PORT_POER4_POUTE14                          *((volatile unsigned int*)(0x42A708F8UL))
#define bM4_PORT_POER4_POUTE15                          *((volatile unsigned int*)(0x42A708FCUL))
#define bM4_PORT_POSR4_POS00                            *((volatile unsigned int*)(0x42A70900UL))
#define bM4_PORT_POSR4_POS01                            *((volatile unsigned int*)(0x42A70904UL))
#define bM4_PORT_POSR4_POS02                            *((volatile unsigned int*)(0x42A70908UL))
#define bM4_PORT_POSR4_POS03                            *((volatile unsigned int*)(0x42A7090CUL))
#define bM4_PORT_POSR4_POS04                            *((volatile unsigned int*)(0x42A70910UL))
#define bM4_PORT_POSR4_POS05                            *((volatile unsigned int*)(0x42A70914UL))
#define bM4_PORT_POSR4_POS06                            *((volatile unsigned int*)(0x42A70918UL))
#define bM4_PORT_POSR4_POS07                            *((volatile unsigned int*)(0x42A7091CUL))
#define bM4_PORT_POSR4_POS08                            *((volatile unsigned int*)(0x42A70920UL))
#define bM4_PORT_POSR4_POS09                            *((volatile unsigned int*)(0x42A70924UL))
#define bM4_PORT_POSR4_POS10                            *((volatile unsigned int*)(0x42A70928UL))
#define bM4_PORT_POSR4_POS11                            *((volatile unsigned int*)(0x42A7092CUL))
#define bM4_PORT_POSR4_POS12                            *((volatile unsigned int*)(0x42A70930UL))
#define bM4_PORT_POSR4_POS13                            *((volatile unsigned int*)(0x42A70934UL))
#define bM4_PORT_POSR4_POS14                            *((volatile unsigned int*)(0x42A70938UL))
#define bM4_PORT_POSR4_POS15                            *((volatile unsigned int*)(0x42A7093CUL))
#define bM4_PORT_PORR4_POR00                            *((volatile unsigned int*)(0x42A70940UL))
#define bM4_PORT_PORR4_POR01                            *((volatile unsigned int*)(0x42A70944UL))
#define bM4_PORT_PORR4_POR02                            *((volatile unsigned int*)(0x42A70948UL))
#define bM4_PORT_PORR4_POR03                            *((volatile unsigned int*)(0x42A7094CUL))
#define bM4_PORT_PORR4_POR04                            *((volatile unsigned int*)(0x42A70950UL))
#define bM4_PORT_PORR4_POR05                            *((volatile unsigned int*)(0x42A70954UL))
#define bM4_PORT_PORR4_POR06                            *((volatile unsigned int*)(0x42A70958UL))
#define bM4_PORT_PORR4_POR07                            *((volatile unsigned int*)(0x42A7095CUL))
#define bM4_PORT_PORR4_POR08                            *((volatile unsigned int*)(0x42A70960UL))
#define bM4_PORT_PORR4_POR09                            *((volatile unsigned int*)(0x42A70964UL))
#define bM4_PORT_PORR4_POR10                            *((volatile unsigned int*)(0x42A70968UL))
#define bM4_PORT_PORR4_POR11                            *((volatile unsigned int*)(0x42A7096CUL))
#define bM4_PORT_PORR4_POR12                            *((volatile unsigned int*)(0x42A70970UL))
#define bM4_PORT_PORR4_POR13                            *((volatile unsigned int*)(0x42A70974UL))
#define bM4_PORT_PORR4_POR14                            *((volatile unsigned int*)(0x42A70978UL))
#define bM4_PORT_PORR4_POR15                            *((volatile unsigned int*)(0x42A7097CUL))
#define bM4_PORT_POTR4_POT00                            *((volatile unsigned int*)(0x42A70980UL))
#define bM4_PORT_POTR4_POT01                            *((volatile unsigned int*)(0x42A70984UL))
#define bM4_PORT_POTR4_POT02                            *((volatile unsigned int*)(0x42A70988UL))
#define bM4_PORT_POTR4_POT03                            *((volatile unsigned int*)(0x42A7098CUL))
#define bM4_PORT_POTR4_POT04                            *((volatile unsigned int*)(0x42A70990UL))
#define bM4_PORT_POTR4_POT05                            *((volatile unsigned int*)(0x42A70994UL))
#define bM4_PORT_POTR4_POT06                            *((volatile unsigned int*)(0x42A70998UL))
#define bM4_PORT_POTR4_POT07                            *((volatile unsigned int*)(0x42A7099CUL))
#define bM4_PORT_POTR4_POT08                            *((volatile unsigned int*)(0x42A709A0UL))
#define bM4_PORT_POTR4_POT09                            *((volatile unsigned int*)(0x42A709A4UL))
#define bM4_PORT_POTR4_POT10                            *((volatile unsigned int*)(0x42A709A8UL))
#define bM4_PORT_POTR4_POT11                            *((volatile unsigned int*)(0x42A709ACUL))
#define bM4_PORT_POTR4_POT12                            *((volatile unsigned int*)(0x42A709B0UL))
#define bM4_PORT_POTR4_POT13                            *((volatile unsigned int*)(0x42A709B4UL))
#define bM4_PORT_POTR4_POT14                            *((volatile unsigned int*)(0x42A709B8UL))
#define bM4_PORT_POTR4_POT15                            *((volatile unsigned int*)(0x42A709BCUL))
#define bM4_PORT_PIDR5_PIN00                            *((volatile unsigned int*)(0x42A70A00UL))
#define bM4_PORT_PIDR5_PIN01                            *((volatile unsigned int*)(0x42A70A04UL))
#define bM4_PORT_PIDR5_PIN02                            *((volatile unsigned int*)(0x42A70A08UL))
#define bM4_PORT_PIDR5_PIN03                            *((volatile unsigned int*)(0x42A70A0CUL))
#define bM4_PORT_PIDR5_PIN04                            *((volatile unsigned int*)(0x42A70A10UL))
#define bM4_PORT_PIDR5_PIN05                            *((volatile unsigned int*)(0x42A70A14UL))
#define bM4_PORT_PIDR5_PIN06                            *((volatile unsigned int*)(0x42A70A18UL))
#define bM4_PORT_PIDR5_PIN07                            *((volatile unsigned int*)(0x42A70A1CUL))
#define bM4_PORT_PIDR5_PIN08                            *((volatile unsigned int*)(0x42A70A20UL))
#define bM4_PORT_PIDR5_PIN09                            *((volatile unsigned int*)(0x42A70A24UL))
#define bM4_PORT_PIDR5_PIN10                            *((volatile unsigned int*)(0x42A70A28UL))
#define bM4_PORT_PIDR5_PIN11                            *((volatile unsigned int*)(0x42A70A2CUL))
#define bM4_PORT_PIDR5_PIN12                            *((volatile unsigned int*)(0x42A70A30UL))
#define bM4_PORT_PIDR5_PIN13                            *((volatile unsigned int*)(0x42A70A34UL))
#define bM4_PORT_PIDR5_PIN14                            *((volatile unsigned int*)(0x42A70A38UL))
#define bM4_PORT_PIDR5_PIN15                            *((volatile unsigned int*)(0x42A70A3CUL))
#define bM4_PORT_PODR5_POUT00                           *((volatile unsigned int*)(0x42A70A80UL))
#define bM4_PORT_PODR5_POUT01                           *((volatile unsigned int*)(0x42A70A84UL))
#define bM4_PORT_PODR5_POUT02                           *((volatile unsigned int*)(0x42A70A88UL))
#define bM4_PORT_PODR5_POUT03                           *((volatile unsigned int*)(0x42A70A8CUL))
#define bM4_PORT_PODR5_POUT04                           *((volatile unsigned int*)(0x42A70A90UL))
#define bM4_PORT_PODR5_POUT05                           *((volatile unsigned int*)(0x42A70A94UL))
#define bM4_PORT_PODR5_POUT06                           *((volatile unsigned int*)(0x42A70A98UL))
#define bM4_PORT_PODR5_POUT07                           *((volatile unsigned int*)(0x42A70A9CUL))
#define bM4_PORT_PODR5_POUT08                           *((volatile unsigned int*)(0x42A70AA0UL))
#define bM4_PORT_PODR5_POUT09                           *((volatile unsigned int*)(0x42A70AA4UL))
#define bM4_PORT_PODR5_POUT10                           *((volatile unsigned int*)(0x42A70AA8UL))
#define bM4_PORT_PODR5_POUT11                           *((volatile unsigned int*)(0x42A70AACUL))
#define bM4_PORT_PODR5_POUT12                           *((volatile unsigned int*)(0x42A70AB0UL))
#define bM4_PORT_PODR5_POUT13                           *((volatile unsigned int*)(0x42A70AB4UL))
#define bM4_PORT_PODR5_POUT14                           *((volatile unsigned int*)(0x42A70AB8UL))
#define bM4_PORT_PODR5_POUT15                           *((volatile unsigned int*)(0x42A70ABCUL))
#define bM4_PORT_POER5_POUTE00                          *((volatile unsigned int*)(0x42A70AC0UL))
#define bM4_PORT_POER5_POUTE01                          *((volatile unsigned int*)(0x42A70AC4UL))
#define bM4_PORT_POER5_POUTE02                          *((volatile unsigned int*)(0x42A70AC8UL))
#define bM4_PORT_POER5_POUTE03                          *((volatile unsigned int*)(0x42A70ACCUL))
#define bM4_PORT_POER5_POUTE04                          *((volatile unsigned int*)(0x42A70AD0UL))
#define bM4_PORT_POER5_POUTE05                          *((volatile unsigned int*)(0x42A70AD4UL))
#define bM4_PORT_POER5_POUTE06                          *((volatile unsigned int*)(0x42A70AD8UL))
#define bM4_PORT_POER5_POUTE07                          *((volatile unsigned int*)(0x42A70ADCUL))
#define bM4_PORT_POER5_POUTE08                          *((volatile unsigned int*)(0x42A70AE0UL))
#define bM4_PORT_POER5_POUTE09                          *((volatile unsigned int*)(0x42A70AE4UL))
#define bM4_PORT_POER5_POUTE10                          *((volatile unsigned int*)(0x42A70AE8UL))
#define bM4_PORT_POER5_POUTE11                          *((volatile unsigned int*)(0x42A70AECUL))
#define bM4_PORT_POER5_POUTE12                          *((volatile unsigned int*)(0x42A70AF0UL))
#define bM4_PORT_POER5_POUTE13                          *((volatile unsigned int*)(0x42A70AF4UL))
#define bM4_PORT_POER5_POUTE14                          *((volatile unsigned int*)(0x42A70AF8UL))
#define bM4_PORT_POER5_POUTE15                          *((volatile unsigned int*)(0x42A70AFCUL))
#define bM4_PORT_POSR5_POS00                            *((volatile unsigned int*)(0x42A70B00UL))
#define bM4_PORT_POSR5_POS01                            *((volatile unsigned int*)(0x42A70B04UL))
#define bM4_PORT_POSR5_POS02                            *((volatile unsigned int*)(0x42A70B08UL))
#define bM4_PORT_POSR5_POS03                            *((volatile unsigned int*)(0x42A70B0CUL))
#define bM4_PORT_POSR5_POS04                            *((volatile unsigned int*)(0x42A70B10UL))
#define bM4_PORT_POSR5_POS05                            *((volatile unsigned int*)(0x42A70B14UL))
#define bM4_PORT_POSR5_POS06                            *((volatile unsigned int*)(0x42A70B18UL))
#define bM4_PORT_POSR5_POS07                            *((volatile unsigned int*)(0x42A70B1CUL))
#define bM4_PORT_POSR5_POS08                            *((volatile unsigned int*)(0x42A70B20UL))
#define bM4_PORT_POSR5_POS09                            *((volatile unsigned int*)(0x42A70B24UL))
#define bM4_PORT_POSR5_POS10                            *((volatile unsigned int*)(0x42A70B28UL))
#define bM4_PORT_POSR5_POS11                            *((volatile unsigned int*)(0x42A70B2CUL))
#define bM4_PORT_POSR5_POS12                            *((volatile unsigned int*)(0x42A70B30UL))
#define bM4_PORT_POSR5_POS13                            *((volatile unsigned int*)(0x42A70B34UL))
#define bM4_PORT_POSR5_POS14                            *((volatile unsigned int*)(0x42A70B38UL))
#define bM4_PORT_POSR5_POS15                            *((volatile unsigned int*)(0x42A70B3CUL))
#define bM4_PORT_PORR5_POR00                            *((volatile unsigned int*)(0x42A70B40UL))
#define bM4_PORT_PORR5_POR01                            *((volatile unsigned int*)(0x42A70B44UL))
#define bM4_PORT_PORR5_POR02                            *((volatile unsigned int*)(0x42A70B48UL))
#define bM4_PORT_PORR5_POR03                            *((volatile unsigned int*)(0x42A70B4CUL))
#define bM4_PORT_PORR5_POR04                            *((volatile unsigned int*)(0x42A70B50UL))
#define bM4_PORT_PORR5_POR05                            *((volatile unsigned int*)(0x42A70B54UL))
#define bM4_PORT_PORR5_POR06                            *((volatile unsigned int*)(0x42A70B58UL))
#define bM4_PORT_PORR5_POR07                            *((volatile unsigned int*)(0x42A70B5CUL))
#define bM4_PORT_PORR5_POR08                            *((volatile unsigned int*)(0x42A70B60UL))
#define bM4_PORT_PORR5_POR09                            *((volatile unsigned int*)(0x42A70B64UL))
#define bM4_PORT_PORR5_POR10                            *((volatile unsigned int*)(0x42A70B68UL))
#define bM4_PORT_PORR5_POR11                            *((volatile unsigned int*)(0x42A70B6CUL))
#define bM4_PORT_PORR5_POR12                            *((volatile unsigned int*)(0x42A70B70UL))
#define bM4_PORT_PORR5_POR13                            *((volatile unsigned int*)(0x42A70B74UL))
#define bM4_PORT_PORR5_POR14                            *((volatile unsigned int*)(0x42A70B78UL))
#define bM4_PORT_PORR5_POR15                            *((volatile unsigned int*)(0x42A70B7CUL))
#define bM4_PORT_POTR5_POT00                            *((volatile unsigned int*)(0x42A70B80UL))
#define bM4_PORT_POTR5_POT01                            *((volatile unsigned int*)(0x42A70B84UL))
#define bM4_PORT_POTR5_POT02                            *((volatile unsigned int*)(0x42A70B88UL))
#define bM4_PORT_POTR5_POT03                            *((volatile unsigned int*)(0x42A70B8CUL))
#define bM4_PORT_POTR5_POT04                            *((volatile unsigned int*)(0x42A70B90UL))
#define bM4_PORT_POTR5_POT05                            *((volatile unsigned int*)(0x42A70B94UL))
#define bM4_PORT_POTR5_POT06                            *((volatile unsigned int*)(0x42A70B98UL))
#define bM4_PORT_POTR5_POT07                            *((volatile unsigned int*)(0x42A70B9CUL))
#define bM4_PORT_POTR5_POT08                            *((volatile unsigned int*)(0x42A70BA0UL))
#define bM4_PORT_POTR5_POT09                            *((volatile unsigned int*)(0x42A70BA4UL))
#define bM4_PORT_POTR5_POT10                            *((volatile unsigned int*)(0x42A70BA8UL))
#define bM4_PORT_POTR5_POT11                            *((volatile unsigned int*)(0x42A70BACUL))
#define bM4_PORT_POTR5_POT12                            *((volatile unsigned int*)(0x42A70BB0UL))
#define bM4_PORT_POTR5_POT13                            *((volatile unsigned int*)(0x42A70BB4UL))
#define bM4_PORT_POTR5_POT14                            *((volatile unsigned int*)(0x42A70BB8UL))
#define bM4_PORT_POTR5_POT15                            *((volatile unsigned int*)(0x42A70BBCUL))
#define bM4_PORT_PIDR6_PIN00                            *((volatile unsigned int*)(0x42A70C00UL))
#define bM4_PORT_PIDR6_PIN01                            *((volatile unsigned int*)(0x42A70C04UL))
#define bM4_PORT_PIDR6_PIN02                            *((volatile unsigned int*)(0x42A70C08UL))
#define bM4_PORT_PIDR6_PIN03                            *((volatile unsigned int*)(0x42A70C0CUL))
#define bM4_PORT_PIDR6_PIN04                            *((volatile unsigned int*)(0x42A70C10UL))
#define bM4_PORT_PIDR6_PIN05                            *((volatile unsigned int*)(0x42A70C14UL))
#define bM4_PORT_PIDR6_PIN06                            *((volatile unsigned int*)(0x42A70C18UL))
#define bM4_PORT_PIDR6_PIN07                            *((volatile unsigned int*)(0x42A70C1CUL))
#define bM4_PORT_PIDR6_PIN08                            *((volatile unsigned int*)(0x42A70C20UL))
#define bM4_PORT_PIDR6_PIN09                            *((volatile unsigned int*)(0x42A70C24UL))
#define bM4_PORT_PIDR6_PIN10                            *((volatile unsigned int*)(0x42A70C28UL))
#define bM4_PORT_PIDR6_PIN11                            *((volatile unsigned int*)(0x42A70C2CUL))
#define bM4_PORT_PIDR6_PIN12                            *((volatile unsigned int*)(0x42A70C30UL))
#define bM4_PORT_PIDR6_PIN13                            *((volatile unsigned int*)(0x42A70C34UL))
#define bM4_PORT_PIDR6_PIN14                            *((volatile unsigned int*)(0x42A70C38UL))
#define bM4_PORT_PIDR6_PIN15                            *((volatile unsigned int*)(0x42A70C3CUL))
#define bM4_PORT_PODR6_POUT00                           *((volatile unsigned int*)(0x42A70C80UL))
#define bM4_PORT_PODR6_POUT01                           *((volatile unsigned int*)(0x42A70C84UL))
#define bM4_PORT_PODR6_POUT02                           *((volatile unsigned int*)(0x42A70C88UL))
#define bM4_PORT_PODR6_POUT03                           *((volatile unsigned int*)(0x42A70C8CUL))
#define bM4_PORT_PODR6_POUT04                           *((volatile unsigned int*)(0x42A70C90UL))
#define bM4_PORT_PODR6_POUT05                           *((volatile unsigned int*)(0x42A70C94UL))
#define bM4_PORT_PODR6_POUT06                           *((volatile unsigned int*)(0x42A70C98UL))
#define bM4_PORT_PODR6_POUT07                           *((volatile unsigned int*)(0x42A70C9CUL))
#define bM4_PORT_PODR6_POUT08                           *((volatile unsigned int*)(0x42A70CA0UL))
#define bM4_PORT_PODR6_POUT09                           *((volatile unsigned int*)(0x42A70CA4UL))
#define bM4_PORT_PODR6_POUT10                           *((volatile unsigned int*)(0x42A70CA8UL))
#define bM4_PORT_PODR6_POUT11                           *((volatile unsigned int*)(0x42A70CACUL))
#define bM4_PORT_PODR6_POUT12                           *((volatile unsigned int*)(0x42A70CB0UL))
#define bM4_PORT_PODR6_POUT13                           *((volatile unsigned int*)(0x42A70CB4UL))
#define bM4_PORT_PODR6_POUT14                           *((volatile unsigned int*)(0x42A70CB8UL))
#define bM4_PORT_PODR6_POUT15                           *((volatile unsigned int*)(0x42A70CBCUL))
#define bM4_PORT_POER6_POUTE00                          *((volatile unsigned int*)(0x42A70CC0UL))
#define bM4_PORT_POER6_POUTE01                          *((volatile unsigned int*)(0x42A70CC4UL))
#define bM4_PORT_POER6_POUTE02                          *((volatile unsigned int*)(0x42A70CC8UL))
#define bM4_PORT_POER6_POUTE03                          *((volatile unsigned int*)(0x42A70CCCUL))
#define bM4_PORT_POER6_POUTE04                          *((volatile unsigned int*)(0x42A70CD0UL))
#define bM4_PORT_POER6_POUTE05                          *((volatile unsigned int*)(0x42A70CD4UL))
#define bM4_PORT_POER6_POUTE06                          *((volatile unsigned int*)(0x42A70CD8UL))
#define bM4_PORT_POER6_POUTE07                          *((volatile unsigned int*)(0x42A70CDCUL))
#define bM4_PORT_POER6_POUTE08                          *((volatile unsigned int*)(0x42A70CE0UL))
#define bM4_PORT_POER6_POUTE09                          *((volatile unsigned int*)(0x42A70CE4UL))
#define bM4_PORT_POER6_POUTE10                          *((volatile unsigned int*)(0x42A70CE8UL))
#define bM4_PORT_POER6_POUTE11                          *((volatile unsigned int*)(0x42A70CECUL))
#define bM4_PORT_POER6_POUTE12                          *((volatile unsigned int*)(0x42A70CF0UL))
#define bM4_PORT_POER6_POUTE13                          *((volatile unsigned int*)(0x42A70CF4UL))
#define bM4_PORT_POER6_POUTE14                          *((volatile unsigned int*)(0x42A70CF8UL))
#define bM4_PORT_POER6_POUTE15                          *((volatile unsigned int*)(0x42A70CFCUL))
#define bM4_PORT_POSR6_POS00                            *((volatile unsigned int*)(0x42A70D00UL))
#define bM4_PORT_POSR6_POS01                            *((volatile unsigned int*)(0x42A70D04UL))
#define bM4_PORT_POSR6_POS02                            *((volatile unsigned int*)(0x42A70D08UL))
#define bM4_PORT_POSR6_POS03                            *((volatile unsigned int*)(0x42A70D0CUL))
#define bM4_PORT_POSR6_POS04                            *((volatile unsigned int*)(0x42A70D10UL))
#define bM4_PORT_POSR6_POS05                            *((volatile unsigned int*)(0x42A70D14UL))
#define bM4_PORT_POSR6_POS06                            *((volatile unsigned int*)(0x42A70D18UL))
#define bM4_PORT_POSR6_POS07                            *((volatile unsigned int*)(0x42A70D1CUL))
#define bM4_PORT_POSR6_POS08                            *((volatile unsigned int*)(0x42A70D20UL))
#define bM4_PORT_POSR6_POS09                            *((volatile unsigned int*)(0x42A70D24UL))
#define bM4_PORT_POSR6_POS10                            *((volatile unsigned int*)(0x42A70D28UL))
#define bM4_PORT_POSR6_POS11                            *((volatile unsigned int*)(0x42A70D2CUL))
#define bM4_PORT_POSR6_POS12                            *((volatile unsigned int*)(0x42A70D30UL))
#define bM4_PORT_POSR6_POS13                            *((volatile unsigned int*)(0x42A70D34UL))
#define bM4_PORT_POSR6_POS14                            *((volatile unsigned int*)(0x42A70D38UL))
#define bM4_PORT_POSR6_POS15                            *((volatile unsigned int*)(0x42A70D3CUL))
#define bM4_PORT_PORR6_POR00                            *((volatile unsigned int*)(0x42A70D40UL))
#define bM4_PORT_PORR6_POR01                            *((volatile unsigned int*)(0x42A70D44UL))
#define bM4_PORT_PORR6_POR02                            *((volatile unsigned int*)(0x42A70D48UL))
#define bM4_PORT_PORR6_POR03                            *((volatile unsigned int*)(0x42A70D4CUL))
#define bM4_PORT_PORR6_POR04                            *((volatile unsigned int*)(0x42A70D50UL))
#define bM4_PORT_PORR6_POR05                            *((volatile unsigned int*)(0x42A70D54UL))
#define bM4_PORT_PORR6_POR06                            *((volatile unsigned int*)(0x42A70D58UL))
#define bM4_PORT_PORR6_POR07                            *((volatile unsigned int*)(0x42A70D5CUL))
#define bM4_PORT_PORR6_POR08                            *((volatile unsigned int*)(0x42A70D60UL))
#define bM4_PORT_PORR6_POR09                            *((volatile unsigned int*)(0x42A70D64UL))
#define bM4_PORT_PORR6_POR10                            *((volatile unsigned int*)(0x42A70D68UL))
#define bM4_PORT_PORR6_POR11                            *((volatile unsigned int*)(0x42A70D6CUL))
