RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_PORT_PORR6_POR12                            *((volatile unsigned int*)(0x42A70D70UL))
#define bM4_PORT_PORR6_POR13                            *((volatile unsigned int*)(0x42A70D74UL))
#define bM4_PORT_PORR6_POR14                            *((volatile unsigned int*)(0x42A70D78UL))
#define bM4_PORT_PORR6_POR15                            *((volatile unsigned int*)(0x42A70D7CUL))
#define bM4_PORT_POTR6_POT00                            *((volatile unsigned int*)(0x42A70D80UL))
#define bM4_PORT_POTR6_POT01                            *((volatile unsigned int*)(0x42A70D84UL))
#define bM4_PORT_POTR6_POT02                            *((volatile unsigned int*)(0x42A70D88UL))
#define bM4_PORT_POTR6_POT03                            *((volatile unsigned int*)(0x42A70D8CUL))
#define bM4_PORT_POTR6_POT04                            *((volatile unsigned int*)(0x42A70D90UL))
#define bM4_PORT_POTR6_POT05                            *((volatile unsigned int*)(0x42A70D94UL))
#define bM4_PORT_POTR6_POT06                            *((volatile unsigned int*)(0x42A70D98UL))
#define bM4_PORT_POTR6_POT07                            *((volatile unsigned int*)(0x42A70D9CUL))
#define bM4_PORT_POTR6_POT08                            *((volatile unsigned int*)(0x42A70DA0UL))
#define bM4_PORT_POTR6_POT09                            *((volatile unsigned int*)(0x42A70DA4UL))
#define bM4_PORT_POTR6_POT10                            *((volatile unsigned int*)(0x42A70DA8UL))
#define bM4_PORT_POTR6_POT11                            *((volatile unsigned int*)(0x42A70DACUL))
#define bM4_PORT_POTR6_POT12                            *((volatile unsigned int*)(0x42A70DB0UL))
#define bM4_PORT_POTR6_POT13                            *((volatile unsigned int*)(0x42A70DB4UL))
#define bM4_PORT_POTR6_POT14                            *((volatile unsigned int*)(0x42A70DB8UL))
#define bM4_PORT_POTR6_POT15                            *((volatile unsigned int*)(0x42A70DBCUL))
#define bM4_PORT_PIDR7_PIN00                            *((volatile unsigned int*)(0x42A70E00UL))
#define bM4_PORT_PIDR7_PIN01                            *((volatile unsigned int*)(0x42A70E04UL))
#define bM4_PORT_PIDR7_PIN02                            *((volatile unsigned int*)(0x42A70E08UL))
#define bM4_PORT_PIDR7_PIN03                            *((volatile unsigned int*)(0x42A70E0CUL))
#define bM4_PORT_PIDR7_PIN04                            *((volatile unsigned int*)(0x42A70E10UL))
#define bM4_PORT_PODR7_POUT00                           *((volatile unsigned int*)(0x42A70E80UL))
#define bM4_PORT_PODR7_POUT01                           *((volatile unsigned int*)(0x42A70E84UL))
#define bM4_PORT_PODR7_POUT02                           *((volatile unsigned int*)(0x42A70E88UL))
#define bM4_PORT_PODR7_POUT03                           *((volatile unsigned int*)(0x42A70E8CUL))
#define bM4_PORT_PODR7_POUT04                           *((volatile unsigned int*)(0x42A70E90UL))
#define bM4_PORT_POER7_POUTE00                          *((volatile unsigned int*)(0x42A70EC0UL))
#define bM4_PORT_POER7_POUTE01                          *((volatile unsigned int*)(0x42A70EC4UL))
#define bM4_PORT_POER7_POUTE02                          *((volatile unsigned int*)(0x42A70EC8UL))
#define bM4_PORT_POER7_POUTE03                          *((volatile unsigned int*)(0x42A70ECCUL))
#define bM4_PORT_POER7_POUTE04                          *((volatile unsigned int*)(0x42A70ED0UL))
#define bM4_PORT_POSR7_POS00                            *((volatile unsigned int*)(0x42A70F00UL))
#define bM4_PORT_POSR7_POS01                            *((volatile unsigned int*)(0x42A70F04UL))
#define bM4_PORT_POSR7_POS02                            *((volatile unsigned int*)(0x42A70F08UL))
#define bM4_PORT_POSR7_POS03                            *((volatile unsigned int*)(0x42A70F0CUL))
#define bM4_PORT_POSR7_POS04                            *((volatile unsigned int*)(0x42A70F10UL))
#define bM4_PORT_PORR7_POR00                            *((volatile unsigned int*)(0x42A70F40UL))
#define bM4_PORT_PORR7_POR01                            *((volatile unsigned int*)(0x42A70F44UL))
#define bM4_PORT_PORR7_POR02                            *((volatile unsigned int*)(0x42A70F48UL))
#define bM4_PORT_PORR7_POR03                            *((volatile unsigned int*)(0x42A70F4CUL))
#define bM4_PORT_PORR7_POR04                            *((volatile unsigned int*)(0x42A70F50UL))
#define bM4_PORT_POTR7_POT00                            *((volatile unsigned int*)(0x42A70F80UL))
#define bM4_PORT_POTR7_POT01                            *((volatile unsigned int*)(0x42A70F84UL))
#define bM4_PORT_POTR7_POT02                            *((volatile unsigned int*)(0x42A70F88UL))
#define bM4_PORT_POTR7_POT03                            *((volatile unsigned int*)(0x42A70F8CUL))
#define bM4_PORT_POTR7_POT04                            *((volatile unsigned int*)(0x42A70F90UL))
#define bM4_PORT_PCCR_BFSEL0                            *((volatile unsigned int*)(0x42A77F00UL))
#define bM4_PORT_PCCR_BFSEL1                            *((volatile unsigned int*)(0x42A77F04UL))
#define bM4_PORT_PCCR_BFSEL2                            *((volatile unsigned int*)(0x42A77F08UL))
#define bM4_PORT_PCCR_BFSEL3                            *((volatile unsigned int*)(0x42A77F0CUL))
#define bM4_PORT_PCCR_PINAE                             *((volatile unsigned int*)(0x42A77F20UL))
#define bM4_PORT_PCCR_NORDWAIT                          *((volatile unsigned int*)(0x42A77F3CUL))
#define bM4_PORT_PWPR_WE                                *((volatile unsigned int*)(0x42A77F80UL))
#define bM4_PORT_PWPR_WP0                               *((volatile unsigned int*)(0x42A77FA0UL))
#define bM4_PORT_PWPR_WP1                               *((volatile unsigned int*)(0x42A77FA4UL))
#define bM4_PORT_PWPR_WP2                               *((volatile unsigned int*)(0x42A77FA8UL))
#define bM4_PORT_PWPR_WP3                               *((volatile unsigned int*)(0x42A77FACUL))
#define bM4_PORT_PWPR_WP4                               *((volatile unsigned int*)(0x42A77FB0UL))
#define bM4_PORT_PWPR_WP5                               *((volatile unsigned int*)(0x42A77FB4UL))
#define bM4_PORT_PWPR_WP6                               *((volatile unsigned int*)(0x42A77FB8UL))
#define bM4_PORT_PWPR_WP7                               *((volatile unsigned int*)(0x42A77FBCUL))
#define bM4_PORT_PCR000_POUT                            *((volatile unsigned int*)(0x42A78000UL))
#define bM4_PORT_PCR000_POUTE                           *((volatile unsigned int*)(0x42A78004UL))
#define bM4_PORT_PCR000_NOD                             *((volatile unsigned int*)(0x42A78008UL))
#define bM4_PORT_PCR000_DRV0                            *((volatile unsigned int*)(0x42A78010UL))
#define bM4_PORT_PCR000_DRV1                            *((volatile unsigned int*)(0x42A78014UL))
#define bM4_PORT_PCR000_PUU                             *((volatile unsigned int*)(0x42A78018UL))
#define bM4_PORT_PCR000_PIN                             *((volatile unsigned int*)(0x42A78020UL))
#define bM4_PORT_PCR000_INVE                            *((volatile unsigned int*)(0x42A78024UL))
#define bM4_PORT_PCR000_INTE                            *((volatile unsigned int*)(0x42A78030UL))
#define bM4_PORT_PCR000_DDIS                            *((volatile unsigned int*)(0x42A7803CUL))
#define bM4_PORT_PFSR000_FSEL0                          *((volatile unsigned int*)(0x42A78040UL))
#define bM4_PORT_PFSR000_FSEL1                          *((volatile unsigned int*)(0x42A78044UL))
#define bM4_PORT_PFSR000_FSEL2                          *((volatile unsigned int*)(0x42A78048UL))
#define bM4_PORT_PFSR000_FSEL3                          *((volatile unsigned int*)(0x42A7804CUL))
#define bM4_PORT_PFSR000_BFE                            *((volatile unsigned int*)(0x42A78060UL))
#define bM4_PORT_PCR001_POUT                            *((volatile unsigned int*)(0x42A78080UL))
#define bM4_PORT_PCR001_POUTE                           *((volatile unsigned int*)(0x42A78084UL))
#define bM4_PORT_PCR001_NOD                             *((volatile unsigned int*)(0x42A78088UL))
#define bM4_PORT_PCR001_DRV0                            *((volatile unsigned int*)(0x42A78090UL))
#define bM4_PORT_PCR001_DRV1                            *((volatile unsigned int*)(0x42A78094UL))
#define bM4_PORT_PCR001_PUU                             *((volatile unsigned int*)(0x42A78098UL))
#define bM4_PORT_PCR001_PIN                             *((volatile unsigned int*)(0x42A780A0UL))
#define bM4_PORT_PCR001_INVE                            *((volatile unsigned int*)(0x42A780A4UL))
#define bM4_PORT_PCR001_INTE                            *((volatile unsigned int*)(0x42A780B0UL))
#define bM4_PORT_PCR001_DDIS                            *((volatile unsigned int*)(0x42A780BCUL))
#define bM4_PORT_PFSR001_FSEL0                          *((volatile unsigned int*)(0x42A780C0UL))
#define bM4_PORT_PFSR001_FSEL1                          *((volatile unsigned int*)(0x42A780C4UL))
#define bM4_PORT_PFSR001_FSEL2                          *((volatile unsigned int*)(0x42A780C8UL))
#define bM4_PORT_PFSR001_FSEL3                          *((volatile unsigned int*)(0x42A780CCUL))
#define bM4_PORT_PFSR001_BFE                            *((volatile unsigned int*)(0x42A780E0UL))
#define bM4_PORT_PCR002_POUT                            *((volatile unsigned int*)(0x42A78100UL))
#define bM4_PORT_PCR002_POUTE                           *((volatile unsigned int*)(0x42A78104UL))
#define bM4_PORT_PCR002_NOD                             *((volatile unsigned int*)(0x42A78108UL))
#define bM4_PORT_PCR002_DRV0                            *((volatile unsigned int*)(0x42A78110UL))
#define bM4_PORT_PCR002_DRV1                            *((volatile unsigned int*)(0x42A78114UL))
#define bM4_PORT_PCR002_PUU                             *((volatile unsigned int*)(0x42A78118UL))
#define bM4_PORT_PCR002_PIN                             *((volatile unsigned int*)(0x42A78120UL))
#define bM4_PORT_PCR002_INVE                            *((volatile unsigned int*)(0x42A78124UL))
#define bM4_PORT_PCR002_INTE                            *((volatile unsigned int*)(0x42A78130UL))
#define bM4_PORT_PCR002_DDIS                            *((volatile unsigned int*)(0x42A7813CUL))
#define bM4_PORT_PFSR002_FSEL0                          *((volatile unsigned int*)(0x42A78140UL))
#define bM4_PORT_PFSR002_FSEL1                          *((volatile unsigned int*)(0x42A78144UL))
#define bM4_PORT_PFSR002_FSEL2                          *((volatile unsigned int*)(0x42A78148UL))
#define bM4_PORT_PFSR002_FSEL3                          *((volatile unsigned int*)(0x42A7814CUL))
#define bM4_PORT_PFSR002_BFE                            *((volatile unsigned int*)(0x42A78160UL))
#define bM4_PORT_PCR003_POUT                            *((volatile unsigned int*)(0x42A78180UL))
#define bM4_PORT_PCR003_POUTE                           *((volatile unsigned int*)(0x42A78184UL))
#define bM4_PORT_PCR003_NOD                             *((volatile unsigned int*)(0x42A78188UL))
#define bM4_PORT_PCR003_DRV0                            *((volatile unsigned int*)(0x42A78190UL))
#define bM4_PORT_PCR003_DRV1                            *((volatile unsigned int*)(0x42A78194UL))
#define bM4_PORT_PCR003_PUU                             *((volatile unsigned int*)(0x42A78198UL))
#define bM4_PORT_PCR003_PIN                             *((volatile unsigned int*)(0x42A781A0UL))
#define bM4_PORT_PCR003_INVE                            *((volatile unsigned int*)(0x42A781A4UL))
#define bM4_PORT_PCR003_INTE                            *((volatile unsigned int*)(0x42A781B0UL))
#define bM4_PORT_PCR003_DDIS                            *((volatile unsigned int*)(0x42A781BCUL))
#define bM4_PORT_PFSR003_FSEL0                          *((volatile unsigned int*)(0x42A781C0UL))
#define bM4_PORT_PFSR003_FSEL1                          *((volatile unsigned int*)(0x42A781C4UL))
#define bM4_PORT_PFSR003_FSEL2                          *((volatile unsigned int*)(0x42A781C8UL))
#define bM4_PORT_PFSR003_FSEL3                          *((volatile unsigned int*)(0x42A781CCUL))
#define bM4_PORT_PFSR003_BFE                            *((volatile unsigned int*)(0x42A781E0UL))
#define bM4_PORT_PCR004_POUT                            *((volatile unsigned int*)(0x42A78200UL))
#define bM4_PORT_PCR004_POUTE                           *((volatile unsigned int*)(0x42A78204UL))
#define bM4_PORT_PCR004_NOD                             *((volatile unsigned int*)(0x42A78208UL))
#define bM4_PORT_PCR004_DRV0                            *((volatile unsigned int*)(0x42A78210UL))
#define bM4_PORT_PCR004_DRV1                            *((volatile unsigned int*)(0x42A78214UL))
#define bM4_PORT_PCR004_PUU                             *((volatile unsigned int*)(0x42A78218UL))
#define bM4_PORT_PCR004_PIN                             *((volatile unsigned int*)(0x42A78220UL))
#define bM4_PORT_PCR004_INVE                            *((volatile unsigned int*)(0x42A78224UL))
#define bM4_PORT_PCR004_INTE                            *((volatile unsigned int*)(0x42A78230UL))
#define bM4_PORT_PCR004_DDIS                            *((volatile unsigned int*)(0x42A7823CUL))
#define bM4_PORT_PFSR004_FSEL0                          *((volatile unsigned int*)(0x42A78240UL))
#define bM4_PORT_PFSR004_FSEL1                          *((volatile unsigned int*)(0x42A78244UL))
#define bM4_PORT_PFSR004_FSEL2                          *((volatile unsigned int*)(0x42A78248UL))
#define bM4_PORT_PFSR004_FSEL3                          *((volatile unsigned int*)(0x42A7824CUL))
#define bM4_PORT_PFSR004_BFE                            *((volatile unsigned int*)(0x42A78260UL))
#define bM4_PORT_PCR005_POUT                            *((volatile unsigned int*)(0x42A78280UL))
#define bM4_PORT_PCR005_POUTE                           *((volatile unsigned int*)(0x42A78284UL))
#define bM4_PORT_PCR005_NOD                             *((volatile unsigned int*)(0x42A78288UL))
#define bM4_PORT_PCR005_DRV0                            *((volatile unsigned int*)(0x42A78290UL))
#define bM4_PORT_PCR005_DRV1                            *((volatile unsigned int*)(0x42A78294UL))
#define bM4_PORT_PCR005_PUU                             *((volatile unsigned int*)(0x42A78298UL))
#define bM4_PORT_PCR005_PIN                             *((volatile unsigned int*)(0x42A782A0UL))
#define bM4_PORT_PCR005_INVE                            *((volatile unsigned int*)(0x42A782A4UL))
#define bM4_PORT_PCR005_INTE                            *((volatile unsigned int*)(0x42A782B0UL))
#define bM4_PORT_PCR005_DDIS                            *((volatile unsigned int*)(0x42A782BCUL))
#define bM4_PORT_PFSR005_FSEL0                          *((volatile unsigned int*)(0x42A782C0UL))
#define bM4_PORT_PFSR005_FSEL1                          *((volatile unsigned int*)(0x42A782C4UL))
#define bM4_PORT_PFSR005_FSEL2                          *((volatile unsigned int*)(0x42A782C8UL))
#define bM4_PORT_PFSR005_FSEL3                          *((volatile unsigned int*)(0x42A782CCUL))
#define bM4_PORT_PFSR005_BFE                            *((volatile unsigned int*)(0x42A782E0UL))
#define bM4_PORT_PCR006_POUT                            *((volatile unsigned int*)(0x42A78300UL))
#define bM4_PORT_PCR006_POUTE                           *((volatile unsigned int*)(0x42A78304UL))
#define bM4_PORT_PCR006_NOD                             *((volatile unsigned int*)(0x42A78308UL))
#define bM4_PORT_PCR006_DRV0                            *((volatile unsigned int*)(0x42A78310UL))
#define bM4_PORT_PCR006_DRV1                            *((volatile unsigned int*)(0x42A78314UL))
#define bM4_PORT_PCR006_PUU                             *((volatile unsigned int*)(0x42A78318UL))
#define bM4_PORT_PCR006_PIN                             *((volatile unsigned int*)(0x42A78320UL))
#define bM4_PORT_PCR006_INVE                            *((volatile unsigned int*)(0x42A78324UL))
#define bM4_PORT_PCR006_INTE                            *((volatile unsigned int*)(0x42A78330UL))
#define bM4_PORT_PCR006_DDIS                            *((volatile unsigned int*)(0x42A7833CUL))
#define bM4_PORT_PFSR006_FSEL0                          *((volatile unsigned int*)(0x42A78340UL))
#define bM4_PORT_PFSR006_FSEL1                          *((volatile unsigned int*)(0x42A78344UL))
#define bM4_PORT_PFSR006_FSEL2                          *((volatile unsigned int*)(0x42A78348UL))
#define bM4_PORT_PFSR006_FSEL3                          *((volatile unsigned int*)(0x42A7834CUL))
#define bM4_PORT_PFSR006_BFE                            *((volatile unsigned int*)(0x42A78360UL))
#define bM4_PORT_PCR007_POUT                            *((volatile unsigned int*)(0x42A78380UL))
#define bM4_PORT_PCR007_POUTE                           *((volatile unsigned int*)(0x42A78384UL))
#define bM4_PORT_PCR007_NOD                             *((volatile unsigned int*)(0x42A78388UL))
#define bM4_PORT_PCR007_DRV0                            *((volatile unsigned int*)(0x42A78390UL))
#define bM4_PORT_PCR007_DRV1                            *((volatile unsigned int*)(0x42A78394UL))
#define bM4_PORT_PCR007_PUU                             *((volatile unsigned int*)(0x42A78398UL))
#define bM4_PORT_PCR007_PIN                             *((volatile unsigned int*)(0x42A783A0UL))
#define bM4_PORT_PCR007_INVE                            *((volatile unsigned int*)(0x42A783A4UL))
#define bM4_PORT_PCR007_INTE                            *((volatile unsigned int*)(0x42A783B0UL))
#define bM4_PORT_PCR007_DDIS                            *((volatile unsigned int*)(0x42A783BCUL))
#define bM4_PORT_PFSR007_FSEL0                          *((volatile unsigned int*)(0x42A783C0UL))
#define bM4_PORT_PFSR007_FSEL1                          *((volatile unsigned int*)(0x42A783C4UL))
#define bM4_PORT_PFSR007_FSEL2                          *((volatile unsigned int*)(0x42A783C8UL))
#define bM4_PORT_PFSR007_FSEL3                          *((volatile unsigned int*)(0x42A783CCUL))
#define bM4_PORT_PFSR007_BFE                            *((volatile unsigned int*)(0x42A783E0UL))
#define bM4_PORT_PCR008_POUT                            *((volatile unsigned int*)(0x42A78400UL))
#define bM4_PORT_PCR008_POUTE                           *((volatile unsigned int*)(0x42A78404UL))
#define bM4_PORT_PCR008_NOD                             *((volatile unsigned int*)(0x42A78408UL))
#define bM4_PORT_PCR008_DRV0                            *((volatile unsigned int*)(0x42A78410UL))
#define bM4_PORT_PCR008_DRV1                            *((volatile unsigned int*)(0x42A78414UL))
#define bM4_PORT_PCR008_PUU                             *((volatile unsigned int*)(0x42A78418UL))
#define bM4_PORT_PCR008_PIN                             *((volatile unsigned int*)(0x42A78420UL))
#define bM4_PORT_PCR008_INVE                            *((volatile unsigned int*)(0x42A78424UL))
#define bM4_PORT_PCR008_INTE                            *((volatile unsigned int*)(0x42A78430UL))
#define bM4_PORT_PCR008_DDIS                            *((volatile unsigned int*)(0x42A7843CUL))
#define bM4_PORT_PFSR008_FSEL0                          *((volatile unsigned int*)(0x42A78440UL))
#define bM4_PORT_PFSR008_FSEL1                          *((volatile unsigned int*)(0x42A78444UL))
#define bM4_PORT_PFSR008_FSEL2                          *((volatile unsigned int*)(0x42A78448UL))
#define bM4_PORT_PFSR008_FSEL3                          *((volatile unsigned int*)(0x42A7844CUL))
#define bM4_PORT_PFSR008_BFE                            *((volatile unsigned int*)(0x42A78460UL))
#define bM4_PORT_PCR009_POUT                            *((volatile unsigned int*)(0x42A78480UL))
#define bM4_PORT_PCR009_POUTE                           *((volatile unsigned int*)(0x42A78484UL))
#define bM4_PORT_PCR009_NOD                             *((volatile unsigned int*)(0x42A78488UL))
#define bM4_PORT_PCR009_DRV0                            *((volatile unsigned int*)(0x42A78490UL))
#define bM4_PORT_PCR009_DRV1                            *((volatile unsigned int*)(0x42A78494UL))
#define bM4_PORT_PCR009_PUU                             *((volatile unsigned int*)(0x42A78498UL))
#define bM4_PORT_PCR009_PIN                             *((volatile unsigned int*)(0x42A784A0UL))
#define bM4_PORT_PCR009_INVE                            *((volatile unsigned int*)(0x42A784A4UL))
#define bM4_PORT_PCR009_INTE                            *((volatile unsigned int*)(0x42A784B0UL))
#define bM4_PORT_PCR009_DDIS                            *((volatile unsigned int*)(0x42A784BCUL))
#define bM4_PORT_PFSR009_FSEL0                          *((volatile unsigned int*)(0x42A784C0UL))
#define bM4_PORT_PFSR009_FSEL1                          *((volatile unsigned int*)(0x42A784C4UL))
#define bM4_PORT_PFSR009_FSEL2                          *((volatile unsigned int*)(0x42A784C8UL))
#define bM4_PORT_PFSR009_FSEL3                          *((volatile unsigned int*)(0x42A784CCUL))
#define bM4_PORT_PFSR009_BFE                            *((volatile unsigned int*)(0x42A784E0UL))
#define bM4_PORT_PCR010_POUT                            *((volatile unsigned int*)(0x42A78500UL))
#define bM4_PORT_PCR010_POUTE                           *((volatile unsigned int*)(0x42A78504UL))
#define bM4_PORT_PCR010_NOD                             *((volatile unsigned int*)(0x42A78508UL))
#define bM4_PORT_PCR010_DRV0                            *((volatile unsigned int*)(0x42A78510UL))
#define bM4_PORT_PCR010_DRV1                            *((volatile unsigned int*)(0x42A78514UL))
#define bM4_PORT_PCR010_PUU                             *((volatile unsigned int*)(0x42A78518UL))
#define bM4_PORT_PCR010_PIN                             *((volatile unsigned int*)(0x42A78520UL))
#define bM4_PORT_PCR010_INVE                            *((volatile unsigned int*)(0x42A78524UL))
#define bM4_PORT_PCR010_INTE                            *((volatile unsigned int*)(0x42A78530UL))
#define bM4_PORT_PCR010_DDIS                            *((volatile unsigned int*)(0x42A7853CUL))
#define bM4_PORT_PFSR010_FSEL0                          *((volatile unsigned int*)(0x42A78540UL))
#define bM4_PORT_PFSR010_FSEL1                          *((volatile unsigned int*)(0x42A78544UL))
#define bM4_PORT_PFSR010_FSEL2                          *((volatile unsigned int*)(0x42A78548UL))
#define bM4_PORT_PFSR010_FSEL3                          *((volatile unsigned int*)(0x42A7854CUL))
#define bM4_PORT_PFSR010_BFE                            *((volatile unsigned int*)(0x42A78560UL))
#define bM4_PORT_PCR011_POUT                            *((volatile unsigned int*)(0x42A78580UL))
#define bM4_PORT_PCR011_POUTE                           *((volatile unsigned int*)(0x42A78584UL))
#define bM4_PORT_PCR011_NOD                             *((volatile unsigned int*)(0x42A78588UL))
#define bM4_PORT_PCR011_DRV0                            *((volatile unsigned int*)(0x42A78590UL))
#define bM4_PORT_PCR011_DRV1                            *((volatile unsigned int*)(0x42A78594UL))
#define bM4_PORT_PCR011_PUU                             *((volatile unsigned int*)(0x42A78598UL))
#define bM4_PORT_PCR011_PIN                             *((volatile unsigned int*)(0x42A785A0UL))
#define bM4_PORT_PCR011_INVE                            *((volatile unsigned int*)(0x42A785A4UL))
#define bM4_PORT_PCR011_INTE                            *((volatile unsigned int*)(0x42A785B0UL))
#define bM4_PORT_PCR011_DDIS                            *((volatile unsigned int*)(0x42A785BCUL))
#define bM4_PORT_PFSR011_FSEL0                          *((volatile unsigned int*)(0x42A785C0UL))
#define bM4_PORT_PFSR011_FSEL1                          *((volatile unsigned int*)(0x42A785C4UL))
#define bM4_PORT_PFSR011_FSEL2                          *((volatile unsigned int*)(0x42A785C8UL))
#define bM4_PORT_PFSR011_FSEL3                          *((volatile unsigned int*)(0x42A785CCUL))
