RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_PORT_PFSR011_BFE                            *((volatile unsigned int*)(0x42A785E0UL))
#define bM4_PORT_PCR012_POUT                            *((volatile unsigned int*)(0x42A78600UL))
#define bM4_PORT_PCR012_POUTE                           *((volatile unsigned int*)(0x42A78604UL))
#define bM4_PORT_PCR012_NOD                             *((volatile unsigned int*)(0x42A78608UL))
#define bM4_PORT_PCR012_DRV0                            *((volatile unsigned int*)(0x42A78610UL))
#define bM4_PORT_PCR012_DRV1                            *((volatile unsigned int*)(0x42A78614UL))
#define bM4_PORT_PCR012_PUU                             *((volatile unsigned int*)(0x42A78618UL))
#define bM4_PORT_PCR012_PIN                             *((volatile unsigned int*)(0x42A78620UL))
#define bM4_PORT_PCR012_INVE                            *((volatile unsigned int*)(0x42A78624UL))
#define bM4_PORT_PCR012_INTE                            *((volatile unsigned int*)(0x42A78630UL))
#define bM4_PORT_PCR012_DDIS                            *((volatile unsigned int*)(0x42A7863CUL))
#define bM4_PORT_PFSR012_FSEL0                          *((volatile unsigned int*)(0x42A78640UL))
#define bM4_PORT_PFSR012_FSEL1                          *((volatile unsigned int*)(0x42A78644UL))
#define bM4_PORT_PFSR012_FSEL2                          *((volatile unsigned int*)(0x42A78648UL))
#define bM4_PORT_PFSR012_FSEL3                          *((volatile unsigned int*)(0x42A7864CUL))
#define bM4_PORT_PFSR012_BFE                            *((volatile unsigned int*)(0x42A78660UL))
#define bM4_PORT_PCR013_POUT                            *((volatile unsigned int*)(0x42A78680UL))
#define bM4_PORT_PCR013_POUTE                           *((volatile unsigned int*)(0x42A78684UL))
#define bM4_PORT_PCR013_NOD                             *((volatile unsigned int*)(0x42A78688UL))
#define bM4_PORT_PCR013_DRV0                            *((volatile unsigned int*)(0x42A78690UL))
#define bM4_PORT_PCR013_DRV1                            *((volatile unsigned int*)(0x42A78694UL))
#define bM4_PORT_PCR013_PUU                             *((volatile unsigned int*)(0x42A78698UL))
#define bM4_PORT_PCR013_PIN                             *((volatile unsigned int*)(0x42A786A0UL))
#define bM4_PORT_PCR013_INVE                            *((volatile unsigned int*)(0x42A786A4UL))
#define bM4_PORT_PCR013_INTE                            *((volatile unsigned int*)(0x42A786B0UL))
#define bM4_PORT_PCR013_DDIS                            *((volatile unsigned int*)(0x42A786BCUL))
#define bM4_PORT_PFSR013_FSEL0                          *((volatile unsigned int*)(0x42A786C0UL))
#define bM4_PORT_PFSR013_FSEL1                          *((volatile unsigned int*)(0x42A786C4UL))
#define bM4_PORT_PFSR013_FSEL2                          *((volatile unsigned int*)(0x42A786C8UL))
#define bM4_PORT_PFSR013_FSEL3                          *((volatile unsigned int*)(0x42A786CCUL))
#define bM4_PORT_PFSR013_BFE                            *((volatile unsigned int*)(0x42A786E0UL))
#define bM4_PORT_PCR014_POUT                            *((volatile unsigned int*)(0x42A78700UL))
#define bM4_PORT_PCR014_POUTE                           *((volatile unsigned int*)(0x42A78704UL))
#define bM4_PORT_PCR014_NOD                             *((volatile unsigned int*)(0x42A78708UL))
#define bM4_PORT_PCR014_DRV0                            *((volatile unsigned int*)(0x42A78710UL))
#define bM4_PORT_PCR014_DRV1                            *((volatile unsigned int*)(0x42A78714UL))
#define bM4_PORT_PCR014_PUU                             *((volatile unsigned int*)(0x42A78718UL))
#define bM4_PORT_PCR014_PIN                             *((volatile unsigned int*)(0x42A78720UL))
#define bM4_PORT_PCR014_INVE                            *((volatile unsigned int*)(0x42A78724UL))
#define bM4_PORT_PCR014_INTE                            *((volatile unsigned int*)(0x42A78730UL))
#define bM4_PORT_PCR014_DDIS                            *((volatile unsigned int*)(0x42A7873CUL))
#define bM4_PORT_PFSR014_FSEL0                          *((volatile unsigned int*)(0x42A78740UL))
#define bM4_PORT_PFSR014_FSEL1                          *((volatile unsigned int*)(0x42A78744UL))
#define bM4_PORT_PFSR014_FSEL2                          *((volatile unsigned int*)(0x42A78748UL))
#define bM4_PORT_PFSR014_FSEL3                          *((volatile unsigned int*)(0x42A7874CUL))
#define bM4_PORT_PFSR014_BFE                            *((volatile unsigned int*)(0x42A78760UL))
#define bM4_PORT_PCR015_POUT                            *((volatile unsigned int*)(0x42A78780UL))
#define bM4_PORT_PCR015_POUTE                           *((volatile unsigned int*)(0x42A78784UL))
#define bM4_PORT_PCR015_NOD                             *((volatile unsigned int*)(0x42A78788UL))
#define bM4_PORT_PCR015_DRV0                            *((volatile unsigned int*)(0x42A78790UL))
#define bM4_PORT_PCR015_DRV1                            *((volatile unsigned int*)(0x42A78794UL))
#define bM4_PORT_PCR015_PUU                             *((volatile unsigned int*)(0x42A78798UL))
#define bM4_PORT_PCR015_PIN                             *((volatile unsigned int*)(0x42A787A0UL))
#define bM4_PORT_PCR015_INVE                            *((volatile unsigned int*)(0x42A787A4UL))
#define bM4_PORT_PCR015_INTE                            *((volatile unsigned int*)(0x42A787B0UL))
#define bM4_PORT_PCR015_DDIS                            *((volatile unsigned int*)(0x42A787BCUL))
#define bM4_PORT_PFSR015_FSEL0                          *((volatile unsigned int*)(0x42A787C0UL))
#define bM4_PORT_PFSR015_FSEL1                          *((volatile unsigned int*)(0x42A787C4UL))
#define bM4_PORT_PFSR015_FSEL2                          *((volatile unsigned int*)(0x42A787C8UL))
#define bM4_PORT_PFSR015_FSEL3                          *((volatile unsigned int*)(0x42A787CCUL))
#define bM4_PORT_PFSR015_BFE                            *((volatile unsigned int*)(0x42A787E0UL))
#define bM4_PORT_PCR100_POUT                            *((volatile unsigned int*)(0x42A78800UL))
#define bM4_PORT_PCR100_POUTE                           *((volatile unsigned int*)(0x42A78804UL))
#define bM4_PORT_PCR100_NOD                             *((volatile unsigned int*)(0x42A78808UL))
#define bM4_PORT_PCR100_DRV0                            *((volatile unsigned int*)(0x42A78810UL))
#define bM4_PORT_PCR100_DRV1                            *((volatile unsigned int*)(0x42A78814UL))
#define bM4_PORT_PCR100_PUU                             *((volatile unsigned int*)(0x42A78818UL))
#define bM4_PORT_PCR100_PIN                             *((volatile unsigned int*)(0x42A78820UL))
#define bM4_PORT_PCR100_INVE                            *((volatile unsigned int*)(0x42A78824UL))
#define bM4_PORT_PCR100_INTE                            *((volatile unsigned int*)(0x42A78830UL))
#define bM4_PORT_PCR100_DDIS                            *((volatile unsigned int*)(0x42A7883CUL))
#define bM4_PORT_PFSR100_FSEL0                          *((volatile unsigned int*)(0x42A78840UL))
#define bM4_PORT_PFSR100_FSEL1                          *((volatile unsigned int*)(0x42A78844UL))
#define bM4_PORT_PFSR100_FSEL2                          *((volatile unsigned int*)(0x42A78848UL))
#define bM4_PORT_PFSR100_FSEL3                          *((volatile unsigned int*)(0x42A7884CUL))
#define bM4_PORT_PFSR100_BFE                            *((volatile unsigned int*)(0x42A78860UL))
#define bM4_PORT_PCR101_POUT                            *((volatile unsigned int*)(0x42A78880UL))
#define bM4_PORT_PCR101_POUTE                           *((volatile unsigned int*)(0x42A78884UL))
#define bM4_PORT_PCR101_NOD                             *((volatile unsigned int*)(0x42A78888UL))
#define bM4_PORT_PCR101_DRV0                            *((volatile unsigned int*)(0x42A78890UL))
#define bM4_PORT_PCR101_DRV1                            *((volatile unsigned int*)(0x42A78894UL))
#define bM4_PORT_PCR101_PUU                             *((volatile unsigned int*)(0x42A78898UL))
#define bM4_PORT_PCR101_PIN                             *((volatile unsigned int*)(0x42A788A0UL))
#define bM4_PORT_PCR101_INVE                            *((volatile unsigned int*)(0x42A788A4UL))
#define bM4_PORT_PCR101_INTE                            *((volatile unsigned int*)(0x42A788B0UL))
#define bM4_PORT_PCR101_DDIS                            *((volatile unsigned int*)(0x42A788BCUL))
#define bM4_PORT_PFSR101_FSEL0                          *((volatile unsigned int*)(0x42A788C0UL))
#define bM4_PORT_PFSR101_FSEL1                          *((volatile unsigned int*)(0x42A788C4UL))
#define bM4_PORT_PFSR101_FSEL2                          *((volatile unsigned int*)(0x42A788C8UL))
#define bM4_PORT_PFSR101_FSEL3                          *((volatile unsigned int*)(0x42A788CCUL))
#define bM4_PORT_PFSR101_BFE                            *((volatile unsigned int*)(0x42A788E0UL))
#define bM4_PORT_PCR102_POUT                            *((volatile unsigned int*)(0x42A78900UL))
#define bM4_PORT_PCR102_POUTE                           *((volatile unsigned int*)(0x42A78904UL))
#define bM4_PORT_PCR102_NOD                             *((volatile unsigned int*)(0x42A78908UL))
#define bM4_PORT_PCR102_DRV0                            *((volatile unsigned int*)(0x42A78910UL))
#define bM4_PORT_PCR102_DRV1                            *((volatile unsigned int*)(0x42A78914UL))
#define bM4_PORT_PCR102_PUU                             *((volatile unsigned int*)(0x42A78918UL))
#define bM4_PORT_PCR102_PIN                             *((volatile unsigned int*)(0x42A78920UL))
#define bM4_PORT_PCR102_INVE                            *((volatile unsigned int*)(0x42A78924UL))
#define bM4_PORT_PCR102_INTE                            *((volatile unsigned int*)(0x42A78930UL))
#define bM4_PORT_PCR102_DDIS                            *((volatile unsigned int*)(0x42A7893CUL))
#define bM4_PORT_PFSR102_FSEL0                          *((volatile unsigned int*)(0x42A78940UL))
#define bM4_PORT_PFSR102_FSEL1                          *((volatile unsigned int*)(0x42A78944UL))
#define bM4_PORT_PFSR102_FSEL2                          *((volatile unsigned int*)(0x42A78948UL))
#define bM4_PORT_PFSR102_FSEL3                          *((volatile unsigned int*)(0x42A7894CUL))
#define bM4_PORT_PFSR102_BFE                            *((volatile unsigned int*)(0x42A78960UL))
#define bM4_PORT_PCR103_POUT                            *((volatile unsigned int*)(0x42A78980UL))
#define bM4_PORT_PCR103_POUTE                           *((volatile unsigned int*)(0x42A78984UL))
#define bM4_PORT_PCR103_NOD                             *((volatile unsigned int*)(0x42A78988UL))
#define bM4_PORT_PCR103_DRV0                            *((volatile unsigned int*)(0x42A78990UL))
#define bM4_PORT_PCR103_DRV1                            *((volatile unsigned int*)(0x42A78994UL))
#define bM4_PORT_PCR103_PUU                             *((volatile unsigned int*)(0x42A78998UL))
#define bM4_PORT_PCR103_PIN                             *((volatile unsigned int*)(0x42A789A0UL))
#define bM4_PORT_PCR103_INVE                            *((volatile unsigned int*)(0x42A789A4UL))
#define bM4_PORT_PCR103_INTE                            *((volatile unsigned int*)(0x42A789B0UL))
#define bM4_PORT_PCR103_DDIS                            *((volatile unsigned int*)(0x42A789BCUL))
#define bM4_PORT_PFSR103_FSEL0                          *((volatile unsigned int*)(0x42A789C0UL))
#define bM4_PORT_PFSR103_FSEL1                          *((volatile unsigned int*)(0x42A789C4UL))
#define bM4_PORT_PFSR103_FSEL2                          *((volatile unsigned int*)(0x42A789C8UL))
#define bM4_PORT_PFSR103_FSEL3                          *((volatile unsigned int*)(0x42A789CCUL))
#define bM4_PORT_PFSR103_BFE                            *((volatile unsigned int*)(0x42A789E0UL))
#define bM4_PORT_PCR104_POUT                            *((volatile unsigned int*)(0x42A78A00UL))
#define bM4_PORT_PCR104_POUTE                           *((volatile unsigned int*)(0x42A78A04UL))
#define bM4_PORT_PCR104_NOD                             *((volatile unsigned int*)(0x42A78A08UL))
#define bM4_PORT_PCR104_DRV0                            *((volatile unsigned int*)(0x42A78A10UL))
#define bM4_PORT_PCR104_DRV1                            *((volatile unsigned int*)(0x42A78A14UL))
#define bM4_PORT_PCR104_PUU                             *((volatile unsigned int*)(0x42A78A18UL))
#define bM4_PORT_PCR104_PIN                             *((volatile unsigned int*)(0x42A78A20UL))
#define bM4_PORT_PCR104_INVE                            *((volatile unsigned int*)(0x42A78A24UL))
#define bM4_PORT_PCR104_INTE                            *((volatile unsigned int*)(0x42A78A30UL))
#define bM4_PORT_PCR104_DDIS                            *((volatile unsigned int*)(0x42A78A3CUL))
#define bM4_PORT_PFSR104_FSEL0                          *((volatile unsigned int*)(0x42A78A40UL))
#define bM4_PORT_PFSR104_FSEL1                          *((volatile unsigned int*)(0x42A78A44UL))
#define bM4_PORT_PFSR104_FSEL2                          *((volatile unsigned int*)(0x42A78A48UL))
#define bM4_PORT_PFSR104_FSEL3                          *((volatile unsigned int*)(0x42A78A4CUL))
#define bM4_PORT_PFSR104_BFE                            *((volatile unsigned int*)(0x42A78A60UL))
#define bM4_PORT_PCR105_POUT                            *((volatile unsigned int*)(0x42A78A80UL))
#define bM4_PORT_PCR105_POUTE                           *((volatile unsigned int*)(0x42A78A84UL))
#define bM4_PORT_PCR105_NOD                             *((volatile unsigned int*)(0x42A78A88UL))
#define bM4_PORT_PCR105_DRV0                            *((volatile unsigned int*)(0x42A78A90UL))
#define bM4_PORT_PCR105_DRV1                            *((volatile unsigned int*)(0x42A78A94UL))
#define bM4_PORT_PCR105_PUU                             *((volatile unsigned int*)(0x42A78A98UL))
#define bM4_PORT_PCR105_PIN                             *((volatile unsigned int*)(0x42A78AA0UL))
#define bM4_PORT_PCR105_INVE                            *((volatile unsigned int*)(0x42A78AA4UL))
#define bM4_PORT_PCR105_INTE                            *((volatile unsigned int*)(0x42A78AB0UL))
#define bM4_PORT_PCR105_DDIS                            *((volatile unsigned int*)(0x42A78ABCUL))
#define bM4_PORT_PFSR105_FSEL0                          *((volatile unsigned int*)(0x42A78AC0UL))
#define bM4_PORT_PFSR105_FSEL1                          *((volatile unsigned int*)(0x42A78AC4UL))
#define bM4_PORT_PFSR105_FSEL2                          *((volatile unsigned int*)(0x42A78AC8UL))
#define bM4_PORT_PFSR105_FSEL3                          *((volatile unsigned int*)(0x42A78ACCUL))
#define bM4_PORT_PFSR105_BFE                            *((volatile unsigned int*)(0x42A78AE0UL))
#define bM4_PORT_PCR106_POUT                            *((volatile unsigned int*)(0x42A78B00UL))
#define bM4_PORT_PCR106_POUTE                           *((volatile unsigned int*)(0x42A78B04UL))
#define bM4_PORT_PCR106_NOD                             *((volatile unsigned int*)(0x42A78B08UL))
#define bM4_PORT_PCR106_DRV0                            *((volatile unsigned int*)(0x42A78B10UL))
#define bM4_PORT_PCR106_DRV1                            *((volatile unsigned int*)(0x42A78B14UL))
#define bM4_PORT_PCR106_PUU                             *((volatile unsigned int*)(0x42A78B18UL))
#define bM4_PORT_PCR106_PIN                             *((volatile unsigned int*)(0x42A78B20UL))
#define bM4_PORT_PCR106_INVE                            *((volatile unsigned int*)(0x42A78B24UL))
#define bM4_PORT_PCR106_INTE                            *((volatile unsigned int*)(0x42A78B30UL))
#define bM4_PORT_PCR106_DDIS                            *((volatile unsigned int*)(0x42A78B3CUL))
#define bM4_PORT_PFSR106_FSEL0                          *((volatile unsigned int*)(0x42A78B40UL))
#define bM4_PORT_PFSR106_FSEL1                          *((volatile unsigned int*)(0x42A78B44UL))
#define bM4_PORT_PFSR106_FSEL2                          *((volatile unsigned int*)(0x42A78B48UL))
#define bM4_PORT_PFSR106_FSEL3                          *((volatile unsigned int*)(0x42A78B4CUL))
#define bM4_PORT_PFSR106_BFE                            *((volatile unsigned int*)(0x42A78B60UL))
#define bM4_PORT_PCR107_POUT                            *((volatile unsigned int*)(0x42A78B80UL))
#define bM4_PORT_PCR107_POUTE                           *((volatile unsigned int*)(0x42A78B84UL))
#define bM4_PORT_PCR107_NOD                             *((volatile unsigned int*)(0x42A78B88UL))
#define bM4_PORT_PCR107_DRV0                            *((volatile unsigned int*)(0x42A78B90UL))
#define bM4_PORT_PCR107_DRV1                            *((volatile unsigned int*)(0x42A78B94UL))
#define bM4_PORT_PCR107_PUU                             *((volatile unsigned int*)(0x42A78B98UL))
#define bM4_PORT_PCR107_PIN                             *((volatile unsigned int*)(0x42A78BA0UL))
#define bM4_PORT_PCR107_INVE                            *((volatile unsigned int*)(0x42A78BA4UL))
#define bM4_PORT_PCR107_INTE                            *((volatile unsigned int*)(0x42A78BB0UL))
#define bM4_PORT_PCR107_DDIS                            *((volatile unsigned int*)(0x42A78BBCUL))
#define bM4_PORT_PFSR107_FSEL0                          *((volatile unsigned int*)(0x42A78BC0UL))
#define bM4_PORT_PFSR107_FSEL1                          *((volatile unsigned int*)(0x42A78BC4UL))
#define bM4_PORT_PFSR107_FSEL2                          *((volatile unsigned int*)(0x42A78BC8UL))
#define bM4_PORT_PFSR107_FSEL3                          *((volatile unsigned int*)(0x42A78BCCUL))
#define bM4_PORT_PFSR107_BFE                            *((volatile unsigned int*)(0x42A78BE0UL))
#define bM4_PORT_PCR108_POUT                            *((volatile unsigned int*)(0x42A78C00UL))
#define bM4_PORT_PCR108_POUTE                           *((volatile unsigned int*)(0x42A78C04UL))
#define bM4_PORT_PCR108_NOD                             *((volatile unsigned int*)(0x42A78C08UL))
#define bM4_PORT_PCR108_DRV0                            *((volatile unsigned int*)(0x42A78C10UL))
#define bM4_PORT_PCR108_DRV1                            *((volatile unsigned int*)(0x42A78C14UL))
#define bM4_PORT_PCR108_PUU                             *((volatile unsigned int*)(0x42A78C18UL))
#define bM4_PORT_PCR108_PIN                             *((volatile unsigned int*)(0x42A78C20UL))
#define bM4_PORT_PCR108_INVE                            *((volatile unsigned int*)(0x42A78C24UL))
#define bM4_PORT_PCR108_INTE                            *((volatile unsigned int*)(0x42A78C30UL))
#define bM4_PORT_PCR108_DDIS                            *((volatile unsigned int*)(0x42A78C3CUL))
#define bM4_PORT_PFSR108_FSEL0                          *((volatile unsigned int*)(0x42A78C40UL))
#define bM4_PORT_PFSR108_FSEL1                          *((volatile unsigned int*)(0x42A78C44UL))
#define bM4_PORT_PFSR108_FSEL2                          *((volatile unsigned int*)(0x42A78C48UL))
#define bM4_PORT_PFSR108_FSEL3                          *((volatile unsigned int*)(0x42A78C4CUL))
#define bM4_PORT_PFSR108_BFE                            *((volatile unsigned int*)(0x42A78C60UL))
#define bM4_PORT_PCR109_POUT                            *((volatile unsigned int*)(0x42A78C80UL))
#define bM4_PORT_PCR109_POUTE                           *((volatile unsigned int*)(0x42A78C84UL))
#define bM4_PORT_PCR109_NOD                             *((volatile unsigned int*)(0x42A78C88UL))
#define bM4_PORT_PCR109_DRV0                            *((volatile unsigned int*)(0x42A78C90UL))
#define bM4_PORT_PCR109_DRV1                            *((volatile unsigned int*)(0x42A78C94UL))
#define bM4_PORT_PCR109_PUU                             *((volatile unsigned int*)(0x42A78C98UL))
#define bM4_PORT_PCR109_PIN                             *((volatile unsigned int*)(0x42A78CA0UL))
#define bM4_PORT_PCR109_INVE                            *((volatile unsigned int*)(0x42A78CA4UL))
#define bM4_PORT_PCR109_INTE                            *((volatile unsigned int*)(0x42A78CB0UL))
#define bM4_PORT_PCR109_DDIS                            *((volatile unsigned int*)(0x42A78CBCUL))
#define bM4_PORT_PFSR109_FSEL0                          *((volatile unsigned int*)(0x42A78CC0UL))
#define bM4_PORT_PFSR109_FSEL1                          *((volatile unsigned int*)(0x42A78CC4UL))
#define bM4_PORT_PFSR109_FSEL2                          *((volatile unsigned int*)(0x42A78CC8UL))
#define bM4_PORT_PFSR109_FSEL3                          *((volatile unsigned int*)(0x42A78CCCUL))
#define bM4_PORT_PFSR109_BFE                            *((volatile unsigned int*)(0x42A78CE0UL))
#define bM4_PORT_PCR110_POUT                            *((volatile unsigned int*)(0x42A78D00UL))
#define bM4_PORT_PCR110_POUTE                           *((volatile unsigned int*)(0x42A78D04UL))
#define bM4_PORT_PCR110_NOD                             *((volatile unsigned int*)(0x42A78D08UL))
#define bM4_PORT_PCR110_DRV0                            *((volatile unsigned int*)(0x42A78D10UL))
#define bM4_PORT_PCR110_DRV1                            *((volatile unsigned int*)(0x42A78D14UL))
#define bM4_PORT_PCR110_PUU                             *((volatile unsigned int*)(0x42A78D18UL))
#define bM4_PORT_PCR110_PIN                             *((volatile unsigned int*)(0x42A78D20UL))
#define bM4_PORT_PCR110_INVE                            *((volatile unsigned int*)(0x42A78D24UL))
#define bM4_PORT_PCR110_INTE                            *((volatile unsigned int*)(0x42A78D30UL))
#define bM4_PORT_PCR110_DDIS                            *((volatile unsigned int*)(0x42A78D3CUL))
#define bM4_PORT_PFSR110_FSEL0                          *((volatile unsigned int*)(0x42A78D40UL))
#define bM4_PORT_PFSR110_FSEL1                          *((volatile unsigned int*)(0x42A78D44UL))
#define bM4_PORT_PFSR110_FSEL2                          *((volatile unsigned int*)(0x42A78D48UL))
#define bM4_PORT_PFSR110_FSEL3                          *((volatile unsigned int*)(0x42A78D4CUL))
#define bM4_PORT_PFSR110_BFE                            *((volatile unsigned int*)(0x42A78D60UL))
#define bM4_PORT_PCR111_POUT                            *((volatile unsigned int*)(0x42A78D80UL))
#define bM4_PORT_PCR111_POUTE                           *((volatile unsigned int*)(0x42A78D84UL))
#define bM4_PORT_PCR111_NOD                             *((volatile unsigned int*)(0x42A78D88UL))
#define bM4_PORT_PCR111_DRV0                            *((volatile unsigned int*)(0x42A78D90UL))
#define bM4_PORT_PCR111_DRV1                            *((volatile unsigned int*)(0x42A78D94UL))
#define bM4_PORT_PCR111_PUU                             *((volatile unsigned int*)(0x42A78D98UL))
#define bM4_PORT_PCR111_PIN                             *((volatile unsigned int*)(0x42A78DA0UL))
#define bM4_PORT_PCR111_INVE                            *((volatile unsigned int*)(0x42A78DA4UL))
#define bM4_PORT_PCR111_INTE                            *((volatile unsigned int*)(0x42A78DB0UL))
#define bM4_PORT_PCR111_DDIS                            *((volatile unsigned int*)(0x42A78DBCUL))
#define bM4_PORT_PFSR111_FSEL0                          *((volatile unsigned int*)(0x42A78DC0UL))
#define bM4_PORT_PFSR111_FSEL1                          *((volatile unsigned int*)(0x42A78DC4UL))
#define bM4_PORT_PFSR111_FSEL2                          *((volatile unsigned int*)(0x42A78DC8UL))
#define bM4_PORT_PFSR111_FSEL3                          *((volatile unsigned int*)(0x42A78DCCUL))
#define bM4_PORT_PFSR111_BFE                            *((volatile unsigned int*)(0x42A78DE0UL))
#define bM4_PORT_PCR112_POUT                            *((volatile unsigned int*)(0x42A78E00UL))
#define bM4_PORT_PCR112_POUTE                           *((volatile unsigned int*)(0x42A78E04UL))
#define bM4_PORT_PCR112_NOD                             *((volatile unsigned int*)(0x42A78E08UL))
