RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_PORT_PCR112_DRV0                            *((volatile unsigned int*)(0x42A78E10UL))
#define bM4_PORT_PCR112_DRV1                            *((volatile unsigned int*)(0x42A78E14UL))
#define bM4_PORT_PCR112_PUU                             *((volatile unsigned int*)(0x42A78E18UL))
#define bM4_PORT_PCR112_PIN                             *((volatile unsigned int*)(0x42A78E20UL))
#define bM4_PORT_PCR112_INVE                            *((volatile unsigned int*)(0x42A78E24UL))
#define bM4_PORT_PCR112_INTE                            *((volatile unsigned int*)(0x42A78E30UL))
#define bM4_PORT_PCR112_DDIS                            *((volatile unsigned int*)(0x42A78E3CUL))
#define bM4_PORT_PFSR112_FSEL0                          *((volatile unsigned int*)(0x42A78E40UL))
#define bM4_PORT_PFSR112_FSEL1                          *((volatile unsigned int*)(0x42A78E44UL))
#define bM4_PORT_PFSR112_FSEL2                          *((volatile unsigned int*)(0x42A78E48UL))
#define bM4_PORT_PFSR112_FSEL3                          *((volatile unsigned int*)(0x42A78E4CUL))
#define bM4_PORT_PFSR112_BFE                            *((volatile unsigned int*)(0x42A78E60UL))
#define bM4_PORT_PCR113_POUT                            *((volatile unsigned int*)(0x42A78E80UL))
#define bM4_PORT_PCR113_POUTE                           *((volatile unsigned int*)(0x42A78E84UL))
#define bM4_PORT_PCR113_NOD                             *((volatile unsigned int*)(0x42A78E88UL))
#define bM4_PORT_PCR113_DRV0                            *((volatile unsigned int*)(0x42A78E90UL))
#define bM4_PORT_PCR113_DRV1                            *((volatile unsigned int*)(0x42A78E94UL))
#define bM4_PORT_PCR113_PUU                             *((volatile unsigned int*)(0x42A78E98UL))
#define bM4_PORT_PCR113_PIN                             *((volatile unsigned int*)(0x42A78EA0UL))
#define bM4_PORT_PCR113_INVE                            *((volatile unsigned int*)(0x42A78EA4UL))
#define bM4_PORT_PCR113_INTE                            *((volatile unsigned int*)(0x42A78EB0UL))
#define bM4_PORT_PCR113_DDIS                            *((volatile unsigned int*)(0x42A78EBCUL))
#define bM4_PORT_PFSR113_FSEL0                          *((volatile unsigned int*)(0x42A78EC0UL))
#define bM4_PORT_PFSR113_FSEL1                          *((volatile unsigned int*)(0x42A78EC4UL))
#define bM4_PORT_PFSR113_FSEL2                          *((volatile unsigned int*)(0x42A78EC8UL))
#define bM4_PORT_PFSR113_FSEL3                          *((volatile unsigned int*)(0x42A78ECCUL))
#define bM4_PORT_PFSR113_BFE                            *((volatile unsigned int*)(0x42A78EE0UL))
#define bM4_PORT_PCR114_POUT                            *((volatile unsigned int*)(0x42A78F00UL))
#define bM4_PORT_PCR114_POUTE                           *((volatile unsigned int*)(0x42A78F04UL))
#define bM4_PORT_PCR114_NOD                             *((volatile unsigned int*)(0x42A78F08UL))
#define bM4_PORT_PCR114_DRV0                            *((volatile unsigned int*)(0x42A78F10UL))
#define bM4_PORT_PCR114_DRV1                            *((volatile unsigned int*)(0x42A78F14UL))
#define bM4_PORT_PCR114_PUU                             *((volatile unsigned int*)(0x42A78F18UL))
#define bM4_PORT_PCR114_PIN                             *((volatile unsigned int*)(0x42A78F20UL))
#define bM4_PORT_PCR114_INVE                            *((volatile unsigned int*)(0x42A78F24UL))
#define bM4_PORT_PCR114_INTE                            *((volatile unsigned int*)(0x42A78F30UL))
#define bM4_PORT_PCR114_DDIS                            *((volatile unsigned int*)(0x42A78F3CUL))
#define bM4_PORT_PFSR114_FSEL0                          *((volatile unsigned int*)(0x42A78F40UL))
#define bM4_PORT_PFSR114_FSEL1                          *((volatile unsigned int*)(0x42A78F44UL))
#define bM4_PORT_PFSR114_FSEL2                          *((volatile unsigned int*)(0x42A78F48UL))
#define bM4_PORT_PFSR114_FSEL3                          *((volatile unsigned int*)(0x42A78F4CUL))
#define bM4_PORT_PFSR114_BFE                            *((volatile unsigned int*)(0x42A78F60UL))
#define bM4_PORT_PCR115_POUT                            *((volatile unsigned int*)(0x42A78F80UL))
#define bM4_PORT_PCR115_POUTE                           *((volatile unsigned int*)(0x42A78F84UL))
#define bM4_PORT_PCR115_NOD                             *((volatile unsigned int*)(0x42A78F88UL))
#define bM4_PORT_PCR115_DRV0                            *((volatile unsigned int*)(0x42A78F90UL))
#define bM4_PORT_PCR115_DRV1                            *((volatile unsigned int*)(0x42A78F94UL))
#define bM4_PORT_PCR115_PUU                             *((volatile unsigned int*)(0x42A78F98UL))
#define bM4_PORT_PCR115_PIN                             *((volatile unsigned int*)(0x42A78FA0UL))
#define bM4_PORT_PCR115_INVE                            *((volatile unsigned int*)(0x42A78FA4UL))
#define bM4_PORT_PCR115_INTE                            *((volatile unsigned int*)(0x42A78FB0UL))
#define bM4_PORT_PCR115_DDIS                            *((volatile unsigned int*)(0x42A78FBCUL))
#define bM4_PORT_PFSR115_FSEL0                          *((volatile unsigned int*)(0x42A78FC0UL))
#define bM4_PORT_PFSR115_FSEL1                          *((volatile unsigned int*)(0x42A78FC4UL))
#define bM4_PORT_PFSR115_FSEL2                          *((volatile unsigned int*)(0x42A78FC8UL))
#define bM4_PORT_PFSR115_FSEL3                          *((volatile unsigned int*)(0x42A78FCCUL))
#define bM4_PORT_PFSR115_BFE                            *((volatile unsigned int*)(0x42A78FE0UL))
#define bM4_PORT_PCR200_POUT                            *((volatile unsigned int*)(0x42A79000UL))
#define bM4_PORT_PCR200_POUTE                           *((volatile unsigned int*)(0x42A79004UL))
#define bM4_PORT_PCR200_NOD                             *((volatile unsigned int*)(0x42A79008UL))
#define bM4_PORT_PCR200_DRV0                            *((volatile unsigned int*)(0x42A79010UL))
#define bM4_PORT_PCR200_DRV1                            *((volatile unsigned int*)(0x42A79014UL))
#define bM4_PORT_PCR200_PUU                             *((volatile unsigned int*)(0x42A79018UL))
#define bM4_PORT_PCR200_PIN                             *((volatile unsigned int*)(0x42A79020UL))
#define bM4_PORT_PCR200_INVE                            *((volatile unsigned int*)(0x42A79024UL))
#define bM4_PORT_PCR200_INTE                            *((volatile unsigned int*)(0x42A79030UL))
#define bM4_PORT_PCR200_DDIS                            *((volatile unsigned int*)(0x42A7903CUL))
#define bM4_PORT_PFSR200_FSEL0                          *((volatile unsigned int*)(0x42A79040UL))
#define bM4_PORT_PFSR200_FSEL1                          *((volatile unsigned int*)(0x42A79044UL))
#define bM4_PORT_PFSR200_FSEL2                          *((volatile unsigned int*)(0x42A79048UL))
#define bM4_PORT_PFSR200_FSEL3                          *((volatile unsigned int*)(0x42A7904CUL))
#define bM4_PORT_PFSR200_BFE                            *((volatile unsigned int*)(0x42A79060UL))
#define bM4_PORT_PCR201_POUT                            *((volatile unsigned int*)(0x42A79080UL))
#define bM4_PORT_PCR201_POUTE                           *((volatile unsigned int*)(0x42A79084UL))
#define bM4_PORT_PCR201_NOD                             *((volatile unsigned int*)(0x42A79088UL))
#define bM4_PORT_PCR201_DRV0                            *((volatile unsigned int*)(0x42A79090UL))
#define bM4_PORT_PCR201_DRV1                            *((volatile unsigned int*)(0x42A79094UL))
#define bM4_PORT_PCR201_PUU                             *((volatile unsigned int*)(0x42A79098UL))
#define bM4_PORT_PCR201_PIN                             *((volatile unsigned int*)(0x42A790A0UL))
#define bM4_PORT_PCR201_INVE                            *((volatile unsigned int*)(0x42A790A4UL))
#define bM4_PORT_PCR201_INTE                            *((volatile unsigned int*)(0x42A790B0UL))
#define bM4_PORT_PCR201_DDIS                            *((volatile unsigned int*)(0x42A790BCUL))
#define bM4_PORT_PFSR201_FSEL0                          *((volatile unsigned int*)(0x42A790C0UL))
#define bM4_PORT_PFSR201_FSEL1                          *((volatile unsigned int*)(0x42A790C4UL))
#define bM4_PORT_PFSR201_FSEL2                          *((volatile unsigned int*)(0x42A790C8UL))
#define bM4_PORT_PFSR201_FSEL3                          *((volatile unsigned int*)(0x42A790CCUL))
#define bM4_PORT_PFSR201_BFE                            *((volatile unsigned int*)(0x42A790E0UL))
#define bM4_PORT_PCR202_POUT                            *((volatile unsigned int*)(0x42A79100UL))
#define bM4_PORT_PCR202_POUTE                           *((volatile unsigned int*)(0x42A79104UL))
#define bM4_PORT_PCR202_NOD                             *((volatile unsigned int*)(0x42A79108UL))
#define bM4_PORT_PCR202_DRV0                            *((volatile unsigned int*)(0x42A79110UL))
#define bM4_PORT_PCR202_DRV1                            *((volatile unsigned int*)(0x42A79114UL))
#define bM4_PORT_PCR202_PUU                             *((volatile unsigned int*)(0x42A79118UL))
#define bM4_PORT_PCR202_PIN                             *((volatile unsigned int*)(0x42A79120UL))
#define bM4_PORT_PCR202_INVE                            *((volatile unsigned int*)(0x42A79124UL))
#define bM4_PORT_PCR202_INTE                            *((volatile unsigned int*)(0x42A79130UL))
#define bM4_PORT_PCR202_DDIS                            *((volatile unsigned int*)(0x42A7913CUL))
#define bM4_PORT_PFSR202_FSEL0                          *((volatile unsigned int*)(0x42A79140UL))
#define bM4_PORT_PFSR202_FSEL1                          *((volatile unsigned int*)(0x42A79144UL))
#define bM4_PORT_PFSR202_FSEL2                          *((volatile unsigned int*)(0x42A79148UL))
#define bM4_PORT_PFSR202_FSEL3                          *((volatile unsigned int*)(0x42A7914CUL))
#define bM4_PORT_PFSR202_BFE                            *((volatile unsigned int*)(0x42A79160UL))
#define bM4_PORT_PCR203_POUT                            *((volatile unsigned int*)(0x42A79180UL))
#define bM4_PORT_PCR203_POUTE                           *((volatile unsigned int*)(0x42A79184UL))
#define bM4_PORT_PCR203_NOD                             *((volatile unsigned int*)(0x42A79188UL))
#define bM4_PORT_PCR203_DRV0                            *((volatile unsigned int*)(0x42A79190UL))
#define bM4_PORT_PCR203_DRV1                            *((volatile unsigned int*)(0x42A79194UL))
#define bM4_PORT_PCR203_PUU                             *((volatile unsigned int*)(0x42A79198UL))
#define bM4_PORT_PCR203_PIN                             *((volatile unsigned int*)(0x42A791A0UL))
#define bM4_PORT_PCR203_INVE                            *((volatile unsigned int*)(0x42A791A4UL))
#define bM4_PORT_PCR203_INTE                            *((volatile unsigned int*)(0x42A791B0UL))
#define bM4_PORT_PCR203_DDIS                            *((volatile unsigned int*)(0x42A791BCUL))
#define bM4_PORT_PFSR203_FSEL0                          *((volatile unsigned int*)(0x42A791C0UL))
#define bM4_PORT_PFSR203_FSEL1                          *((volatile unsigned int*)(0x42A791C4UL))
#define bM4_PORT_PFSR203_FSEL2                          *((volatile unsigned int*)(0x42A791C8UL))
#define bM4_PORT_PFSR203_FSEL3                          *((volatile unsigned int*)(0x42A791CCUL))
#define bM4_PORT_PFSR203_BFE                            *((volatile unsigned int*)(0x42A791E0UL))
#define bM4_PORT_PCR204_POUT                            *((volatile unsigned int*)(0x42A79200UL))
#define bM4_PORT_PCR204_POUTE                           *((volatile unsigned int*)(0x42A79204UL))
#define bM4_PORT_PCR204_NOD                             *((volatile unsigned int*)(0x42A79208UL))
#define bM4_PORT_PCR204_DRV0                            *((volatile unsigned int*)(0x42A79210UL))
#define bM4_PORT_PCR204_DRV1                            *((volatile unsigned int*)(0x42A79214UL))
#define bM4_PORT_PCR204_PUU                             *((volatile unsigned int*)(0x42A79218UL))
#define bM4_PORT_PCR204_PIN                             *((volatile unsigned int*)(0x42A79220UL))
#define bM4_PORT_PCR204_INVE                            *((volatile unsigned int*)(0x42A79224UL))
#define bM4_PORT_PCR204_INTE                            *((volatile unsigned int*)(0x42A79230UL))
#define bM4_PORT_PCR204_DDIS                            *((volatile unsigned int*)(0x42A7923CUL))
#define bM4_PORT_PFSR204_FSEL0                          *((volatile unsigned int*)(0x42A79240UL))
#define bM4_PORT_PFSR204_FSEL1                          *((volatile unsigned int*)(0x42A79244UL))
#define bM4_PORT_PFSR204_FSEL2                          *((volatile unsigned int*)(0x42A79248UL))
#define bM4_PORT_PFSR204_FSEL3                          *((volatile unsigned int*)(0x42A7924CUL))
#define bM4_PORT_PFSR204_BFE                            *((volatile unsigned int*)(0x42A79260UL))
#define bM4_PORT_PCR205_POUT                            *((volatile unsigned int*)(0x42A79280UL))
#define bM4_PORT_PCR205_POUTE                           *((volatile unsigned int*)(0x42A79284UL))
#define bM4_PORT_PCR205_NOD                             *((volatile unsigned int*)(0x42A79288UL))
#define bM4_PORT_PCR205_DRV0                            *((volatile unsigned int*)(0x42A79290UL))
#define bM4_PORT_PCR205_DRV1                            *((volatile unsigned int*)(0x42A79294UL))
#define bM4_PORT_PCR205_PUU                             *((volatile unsigned int*)(0x42A79298UL))
#define bM4_PORT_PCR205_PIN                             *((volatile unsigned int*)(0x42A792A0UL))
#define bM4_PORT_PCR205_INVE                            *((volatile unsigned int*)(0x42A792A4UL))
#define bM4_PORT_PCR205_INTE                            *((volatile unsigned int*)(0x42A792B0UL))
#define bM4_PORT_PCR205_DDIS                            *((volatile unsigned int*)(0x42A792BCUL))
#define bM4_PORT_PFSR205_FSEL0                          *((volatile unsigned int*)(0x42A792C0UL))
#define bM4_PORT_PFSR205_FSEL1                          *((volatile unsigned int*)(0x42A792C4UL))
#define bM4_PORT_PFSR205_FSEL2                          *((volatile unsigned int*)(0x42A792C8UL))
#define bM4_PORT_PFSR205_FSEL3                          *((volatile unsigned int*)(0x42A792CCUL))
#define bM4_PORT_PFSR205_BFE                            *((volatile unsigned int*)(0x42A792E0UL))
#define bM4_PORT_PCR206_POUT                            *((volatile unsigned int*)(0x42A79300UL))
#define bM4_PORT_PCR206_POUTE                           *((volatile unsigned int*)(0x42A79304UL))
#define bM4_PORT_PCR206_NOD                             *((volatile unsigned int*)(0x42A79308UL))
#define bM4_PORT_PCR206_DRV0                            *((volatile unsigned int*)(0x42A79310UL))
#define bM4_PORT_PCR206_DRV1                            *((volatile unsigned int*)(0x42A79314UL))
#define bM4_PORT_PCR206_PUU                             *((volatile unsigned int*)(0x42A79318UL))
#define bM4_PORT_PCR206_PIN                             *((volatile unsigned int*)(0x42A79320UL))
#define bM4_PORT_PCR206_INVE                            *((volatile unsigned int*)(0x42A79324UL))
#define bM4_PORT_PCR206_INTE                            *((volatile unsigned int*)(0x42A79330UL))
#define bM4_PORT_PCR206_DDIS                            *((volatile unsigned int*)(0x42A7933CUL))
#define bM4_PORT_PFSR206_FSEL0                          *((volatile unsigned int*)(0x42A79340UL))
#define bM4_PORT_PFSR206_FSEL1                          *((volatile unsigned int*)(0x42A79344UL))
#define bM4_PORT_PFSR206_FSEL2                          *((volatile unsigned int*)(0x42A79348UL))
#define bM4_PORT_PFSR206_FSEL3                          *((volatile unsigned int*)(0x42A7934CUL))
#define bM4_PORT_PFSR206_BFE                            *((volatile unsigned int*)(0x42A79360UL))
#define bM4_PORT_PCR207_POUT                            *((volatile unsigned int*)(0x42A79380UL))
#define bM4_PORT_PCR207_POUTE                           *((volatile unsigned int*)(0x42A79384UL))
#define bM4_PORT_PCR207_NOD                             *((volatile unsigned int*)(0x42A79388UL))
#define bM4_PORT_PCR207_DRV0                            *((volatile unsigned int*)(0x42A79390UL))
#define bM4_PORT_PCR207_DRV1                            *((volatile unsigned int*)(0x42A79394UL))
#define bM4_PORT_PCR207_PUU                             *((volatile unsigned int*)(0x42A79398UL))
#define bM4_PORT_PCR207_PIN                             *((volatile unsigned int*)(0x42A793A0UL))
#define bM4_PORT_PCR207_INVE                            *((volatile unsigned int*)(0x42A793A4UL))
#define bM4_PORT_PCR207_INTE                            *((volatile unsigned int*)(0x42A793B0UL))
#define bM4_PORT_PCR207_DDIS                            *((volatile unsigned int*)(0x42A793BCUL))
#define bM4_PORT_PFSR207_FSEL0                          *((volatile unsigned int*)(0x42A793C0UL))
#define bM4_PORT_PFSR207_FSEL1                          *((volatile unsigned int*)(0x42A793C4UL))
#define bM4_PORT_PFSR207_FSEL2                          *((volatile unsigned int*)(0x42A793C8UL))
#define bM4_PORT_PFSR207_FSEL3                          *((volatile unsigned int*)(0x42A793CCUL))
#define bM4_PORT_PFSR207_BFE                            *((volatile unsigned int*)(0x42A793E0UL))
#define bM4_PORT_PCR208_POUT                            *((volatile unsigned int*)(0x42A79400UL))
#define bM4_PORT_PCR208_POUTE                           *((volatile unsigned int*)(0x42A79404UL))
#define bM4_PORT_PCR208_NOD                             *((volatile unsigned int*)(0x42A79408UL))
#define bM4_PORT_PCR208_DRV0                            *((volatile unsigned int*)(0x42A79410UL))
#define bM4_PORT_PCR208_DRV1                            *((volatile unsigned int*)(0x42A79414UL))
#define bM4_PORT_PCR208_PUU                             *((volatile unsigned int*)(0x42A79418UL))
#define bM4_PORT_PCR208_PIN                             *((volatile unsigned int*)(0x42A79420UL))
#define bM4_PORT_PCR208_INVE                            *((volatile unsigned int*)(0x42A79424UL))
#define bM4_PORT_PCR208_INTE                            *((volatile unsigned int*)(0x42A79430UL))
#define bM4_PORT_PCR208_DDIS                            *((volatile unsigned int*)(0x42A7943CUL))
#define bM4_PORT_PFSR208_FSEL0                          *((volatile unsigned int*)(0x42A79440UL))
#define bM4_PORT_PFSR208_FSEL1                          *((volatile unsigned int*)(0x42A79444UL))
#define bM4_PORT_PFSR208_FSEL2                          *((volatile unsigned int*)(0x42A79448UL))
#define bM4_PORT_PFSR208_FSEL3                          *((volatile unsigned int*)(0x42A7944CUL))
#define bM4_PORT_PFSR208_BFE                            *((volatile unsigned int*)(0x42A79460UL))
#define bM4_PORT_PCR209_POUT                            *((volatile unsigned int*)(0x42A79480UL))
#define bM4_PORT_PCR209_POUTE                           *((volatile unsigned int*)(0x42A79484UL))
#define bM4_PORT_PCR209_NOD                             *((volatile unsigned int*)(0x42A79488UL))
#define bM4_PORT_PCR209_DRV0                            *((volatile unsigned int*)(0x42A79490UL))
#define bM4_PORT_PCR209_DRV1                            *((volatile unsigned int*)(0x42A79494UL))
#define bM4_PORT_PCR209_PUU                             *((volatile unsigned int*)(0x42A79498UL))
#define bM4_PORT_PCR209_PIN                             *((volatile unsigned int*)(0x42A794A0UL))
#define bM4_PORT_PCR209_INVE                            *((volatile unsigned int*)(0x42A794A4UL))
#define bM4_PORT_PCR209_INTE                            *((volatile unsigned int*)(0x42A794B0UL))
#define bM4_PORT_PCR209_DDIS                            *((volatile unsigned int*)(0x42A794BCUL))
#define bM4_PORT_PFSR209_FSEL0                          *((volatile unsigned int*)(0x42A794C0UL))
#define bM4_PORT_PFSR209_FSEL1                          *((volatile unsigned int*)(0x42A794C4UL))
#define bM4_PORT_PFSR209_FSEL2                          *((volatile unsigned int*)(0x42A794C8UL))
#define bM4_PORT_PFSR209_FSEL3                          *((volatile unsigned int*)(0x42A794CCUL))
#define bM4_PORT_PFSR209_BFE                            *((volatile unsigned int*)(0x42A794E0UL))
#define bM4_PORT_PCR210_POUT                            *((volatile unsigned int*)(0x42A79500UL))
#define bM4_PORT_PCR210_POUTE                           *((volatile unsigned int*)(0x42A79504UL))
#define bM4_PORT_PCR210_NOD                             *((volatile unsigned int*)(0x42A79508UL))
#define bM4_PORT_PCR210_DRV0                            *((volatile unsigned int*)(0x42A79510UL))
#define bM4_PORT_PCR210_DRV1                            *((volatile unsigned int*)(0x42A79514UL))
#define bM4_PORT_PCR210_PUU                             *((volatile unsigned int*)(0x42A79518UL))
#define bM4_PORT_PCR210_PIN                             *((volatile unsigned int*)(0x42A79520UL))
#define bM4_PORT_PCR210_INVE                            *((volatile unsigned int*)(0x42A79524UL))
#define bM4_PORT_PCR210_INTE                            *((volatile unsigned int*)(0x42A79530UL))
#define bM4_PORT_PCR210_DDIS                            *((volatile unsigned int*)(0x42A7953CUL))
#define bM4_PORT_PFSR210_FSEL0                          *((volatile unsigned int*)(0x42A79540UL))
#define bM4_PORT_PFSR210_FSEL1                          *((volatile unsigned int*)(0x42A79544UL))
#define bM4_PORT_PFSR210_FSEL2                          *((volatile unsigned int*)(0x42A79548UL))
#define bM4_PORT_PFSR210_FSEL3                          *((volatile unsigned int*)(0x42A7954CUL))
#define bM4_PORT_PFSR210_BFE                            *((volatile unsigned int*)(0x42A79560UL))
#define bM4_PORT_PCR211_POUT                            *((volatile unsigned int*)(0x42A79580UL))
#define bM4_PORT_PCR211_POUTE                           *((volatile unsigned int*)(0x42A79584UL))
#define bM4_PORT_PCR211_NOD                             *((volatile unsigned int*)(0x42A79588UL))
#define bM4_PORT_PCR211_DRV0                            *((volatile unsigned int*)(0x42A79590UL))
#define bM4_PORT_PCR211_DRV1                            *((volatile unsigned int*)(0x42A79594UL))
#define bM4_PORT_PCR211_PUU                             *((volatile unsigned int*)(0x42A79598UL))
#define bM4_PORT_PCR211_PIN                             *((volatile unsigned int*)(0x42A795A0UL))
#define bM4_PORT_PCR211_INVE                            *((volatile unsigned int*)(0x42A795A4UL))
#define bM4_PORT_PCR211_INTE                            *((volatile unsigned int*)(0x42A795B0UL))
#define bM4_PORT_PCR211_DDIS                            *((volatile unsigned int*)(0x42A795BCUL))
#define bM4_PORT_PFSR211_FSEL0                          *((volatile unsigned int*)(0x42A795C0UL))
#define bM4_PORT_PFSR211_FSEL1                          *((volatile unsigned int*)(0x42A795C4UL))
#define bM4_PORT_PFSR211_FSEL2                          *((volatile unsigned int*)(0x42A795C8UL))
#define bM4_PORT_PFSR211_FSEL3                          *((volatile unsigned int*)(0x42A795CCUL))
#define bM4_PORT_PFSR211_BFE                            *((volatile unsigned int*)(0x42A795E0UL))
#define bM4_PORT_PCR212_POUT                            *((volatile unsigned int*)(0x42A79600UL))
#define bM4_PORT_PCR212_POUTE                           *((volatile unsigned int*)(0x42A79604UL))
#define bM4_PORT_PCR212_NOD                             *((volatile unsigned int*)(0x42A79608UL))
#define bM4_PORT_PCR212_DRV0                            *((volatile unsigned int*)(0x42A79610UL))
#define bM4_PORT_PCR212_DRV1                            *((volatile unsigned int*)(0x42A79614UL))
#define bM4_PORT_PCR212_PUU                             *((volatile unsigned int*)(0x42A79618UL))
#define bM4_PORT_PCR212_PIN                             *((volatile unsigned int*)(0x42A79620UL))
