RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_PORT_PCR212_INVE                            *((volatile unsigned int*)(0x42A79624UL))
#define bM4_PORT_PCR212_INTE                            *((volatile unsigned int*)(0x42A79630UL))
#define bM4_PORT_PCR212_DDIS                            *((volatile unsigned int*)(0x42A7963CUL))
#define bM4_PORT_PFSR212_FSEL0                          *((volatile unsigned int*)(0x42A79640UL))
#define bM4_PORT_PFSR212_FSEL1                          *((volatile unsigned int*)(0x42A79644UL))
#define bM4_PORT_PFSR212_FSEL2                          *((volatile unsigned int*)(0x42A79648UL))
#define bM4_PORT_PFSR212_FSEL3                          *((volatile unsigned int*)(0x42A7964CUL))
#define bM4_PORT_PFSR212_BFE                            *((volatile unsigned int*)(0x42A79660UL))
#define bM4_PORT_PCR213_POUT                            *((volatile unsigned int*)(0x42A79680UL))
#define bM4_PORT_PCR213_POUTE                           *((volatile unsigned int*)(0x42A79684UL))
#define bM4_PORT_PCR213_NOD                             *((volatile unsigned int*)(0x42A79688UL))
#define bM4_PORT_PCR213_DRV0                            *((volatile unsigned int*)(0x42A79690UL))
#define bM4_PORT_PCR213_DRV1                            *((volatile unsigned int*)(0x42A79694UL))
#define bM4_PORT_PCR213_PUU                             *((volatile unsigned int*)(0x42A79698UL))
#define bM4_PORT_PCR213_PIN                             *((volatile unsigned int*)(0x42A796A0UL))
#define bM4_PORT_PCR213_INVE                            *((volatile unsigned int*)(0x42A796A4UL))
#define bM4_PORT_PCR213_INTE                            *((volatile unsigned int*)(0x42A796B0UL))
#define bM4_PORT_PCR213_DDIS                            *((volatile unsigned int*)(0x42A796BCUL))
#define bM4_PORT_PFSR213_FSEL0                          *((volatile unsigned int*)(0x42A796C0UL))
#define bM4_PORT_PFSR213_FSEL1                          *((volatile unsigned int*)(0x42A796C4UL))
#define bM4_PORT_PFSR213_FSEL2                          *((volatile unsigned int*)(0x42A796C8UL))
#define bM4_PORT_PFSR213_FSEL3                          *((volatile unsigned int*)(0x42A796CCUL))
#define bM4_PORT_PFSR213_BFE                            *((volatile unsigned int*)(0x42A796E0UL))
#define bM4_PORT_PCR214_POUT                            *((volatile unsigned int*)(0x42A79700UL))
#define bM4_PORT_PCR214_POUTE                           *((volatile unsigned int*)(0x42A79704UL))
#define bM4_PORT_PCR214_NOD                             *((volatile unsigned int*)(0x42A79708UL))
#define bM4_PORT_PCR214_DRV0                            *((volatile unsigned int*)(0x42A79710UL))
#define bM4_PORT_PCR214_DRV1                            *((volatile unsigned int*)(0x42A79714UL))
#define bM4_PORT_PCR214_PUU                             *((volatile unsigned int*)(0x42A79718UL))
#define bM4_PORT_PCR214_PIN                             *((volatile unsigned int*)(0x42A79720UL))
#define bM4_PORT_PCR214_INVE                            *((volatile unsigned int*)(0x42A79724UL))
#define bM4_PORT_PCR214_INTE                            *((volatile unsigned int*)(0x42A79730UL))
#define bM4_PORT_PCR214_DDIS                            *((volatile unsigned int*)(0x42A7973CUL))
#define bM4_PORT_PFSR214_FSEL0                          *((volatile unsigned int*)(0x42A79740UL))
#define bM4_PORT_PFSR214_FSEL1                          *((volatile unsigned int*)(0x42A79744UL))
#define bM4_PORT_PFSR214_FSEL2                          *((volatile unsigned int*)(0x42A79748UL))
#define bM4_PORT_PFSR214_FSEL3                          *((volatile unsigned int*)(0x42A7974CUL))
#define bM4_PORT_PFSR214_BFE                            *((volatile unsigned int*)(0x42A79760UL))
#define bM4_PORT_PCR215_POUT                            *((volatile unsigned int*)(0x42A79780UL))
#define bM4_PORT_PCR215_POUTE                           *((volatile unsigned int*)(0x42A79784UL))
#define bM4_PORT_PCR215_NOD                             *((volatile unsigned int*)(0x42A79788UL))
#define bM4_PORT_PCR215_DRV0                            *((volatile unsigned int*)(0x42A79790UL))
#define bM4_PORT_PCR215_DRV1                            *((volatile unsigned int*)(0x42A79794UL))
#define bM4_PORT_PCR215_PUU                             *((volatile unsigned int*)(0x42A79798UL))
#define bM4_PORT_PCR215_PIN                             *((volatile unsigned int*)(0x42A797A0UL))
#define bM4_PORT_PCR215_INVE                            *((volatile unsigned int*)(0x42A797A4UL))
#define bM4_PORT_PCR215_INTE                            *((volatile unsigned int*)(0x42A797B0UL))
#define bM4_PORT_PCR215_DDIS                            *((volatile unsigned int*)(0x42A797BCUL))
#define bM4_PORT_PFSR215_FSEL0                          *((volatile unsigned int*)(0x42A797C0UL))
#define bM4_PORT_PFSR215_FSEL1                          *((volatile unsigned int*)(0x42A797C4UL))
#define bM4_PORT_PFSR215_FSEL2                          *((volatile unsigned int*)(0x42A797C8UL))
#define bM4_PORT_PFSR215_FSEL3                          *((volatile unsigned int*)(0x42A797CCUL))
#define bM4_PORT_PFSR215_BFE                            *((volatile unsigned int*)(0x42A797E0UL))
#define bM4_PORT_PCR300_POUT                            *((volatile unsigned int*)(0x42A79800UL))
#define bM4_PORT_PCR300_POUTE                           *((volatile unsigned int*)(0x42A79804UL))
#define bM4_PORT_PCR300_NOD                             *((volatile unsigned int*)(0x42A79808UL))
#define bM4_PORT_PCR300_DRV0                            *((volatile unsigned int*)(0x42A79810UL))
#define bM4_PORT_PCR300_DRV1                            *((volatile unsigned int*)(0x42A79814UL))
#define bM4_PORT_PCR300_PUU                             *((volatile unsigned int*)(0x42A79818UL))
#define bM4_PORT_PCR300_PIN                             *((volatile unsigned int*)(0x42A79820UL))
#define bM4_PORT_PCR300_INVE                            *((volatile unsigned int*)(0x42A79824UL))
#define bM4_PORT_PCR300_INTE                            *((volatile unsigned int*)(0x42A79830UL))
#define bM4_PORT_PCR300_DDIS                            *((volatile unsigned int*)(0x42A7983CUL))
#define bM4_PORT_PFSR300_FSEL0                          *((volatile unsigned int*)(0x42A79840UL))
#define bM4_PORT_PFSR300_FSEL1                          *((volatile unsigned int*)(0x42A79844UL))
#define bM4_PORT_PFSR300_FSEL2                          *((volatile unsigned int*)(0x42A79848UL))
#define bM4_PORT_PFSR300_FSEL3                          *((volatile unsigned int*)(0x42A7984CUL))
#define bM4_PORT_PFSR300_BFE                            *((volatile unsigned int*)(0x42A79860UL))
#define bM4_PORT_PCR301_POUT                            *((volatile unsigned int*)(0x42A79880UL))
#define bM4_PORT_PCR301_POUTE                           *((volatile unsigned int*)(0x42A79884UL))
#define bM4_PORT_PCR301_NOD                             *((volatile unsigned int*)(0x42A79888UL))
#define bM4_PORT_PCR301_DRV0                            *((volatile unsigned int*)(0x42A79890UL))
#define bM4_PORT_PCR301_DRV1                            *((volatile unsigned int*)(0x42A79894UL))
#define bM4_PORT_PCR301_PUU                             *((volatile unsigned int*)(0x42A79898UL))
#define bM4_PORT_PCR301_PIN                             *((volatile unsigned int*)(0x42A798A0UL))
#define bM4_PORT_PCR301_INVE                            *((volatile unsigned int*)(0x42A798A4UL))
#define bM4_PORT_PCR301_INTE                            *((volatile unsigned int*)(0x42A798B0UL))
#define bM4_PORT_PCR301_DDIS                            *((volatile unsigned int*)(0x42A798BCUL))
#define bM4_PORT_PFSR301_FSEL0                          *((volatile unsigned int*)(0x42A798C0UL))
#define bM4_PORT_PFSR301_FSEL1                          *((volatile unsigned int*)(0x42A798C4UL))
#define bM4_PORT_PFSR301_FSEL2                          *((volatile unsigned int*)(0x42A798C8UL))
#define bM4_PORT_PFSR301_FSEL3                          *((volatile unsigned int*)(0x42A798CCUL))
#define bM4_PORT_PFSR301_BFE                            *((volatile unsigned int*)(0x42A798E0UL))
#define bM4_PORT_PCR302_POUT                            *((volatile unsigned int*)(0x42A79900UL))
#define bM4_PORT_PCR302_POUTE                           *((volatile unsigned int*)(0x42A79904UL))
#define bM4_PORT_PCR302_NOD                             *((volatile unsigned int*)(0x42A79908UL))
#define bM4_PORT_PCR302_DRV0                            *((volatile unsigned int*)(0x42A79910UL))
#define bM4_PORT_PCR302_DRV1                            *((volatile unsigned int*)(0x42A79914UL))
#define bM4_PORT_PCR302_PUU                             *((volatile unsigned int*)(0x42A79918UL))
#define bM4_PORT_PCR302_PIN                             *((volatile unsigned int*)(0x42A79920UL))
#define bM4_PORT_PCR302_INVE                            *((volatile unsigned int*)(0x42A79924UL))
#define bM4_PORT_PCR302_INTE                            *((volatile unsigned int*)(0x42A79930UL))
#define bM4_PORT_PCR302_DDIS                            *((volatile unsigned int*)(0x42A7993CUL))
#define bM4_PORT_PFSR302_FSEL0                          *((volatile unsigned int*)(0x42A79940UL))
#define bM4_PORT_PFSR302_FSEL1                          *((volatile unsigned int*)(0x42A79944UL))
#define bM4_PORT_PFSR302_FSEL2                          *((volatile unsigned int*)(0x42A79948UL))
#define bM4_PORT_PFSR302_FSEL3                          *((volatile unsigned int*)(0x42A7994CUL))
#define bM4_PORT_PFSR302_BFE                            *((volatile unsigned int*)(0x42A79960UL))
#define bM4_PORT_PCR303_POUT                            *((volatile unsigned int*)(0x42A79980UL))
#define bM4_PORT_PCR303_POUTE                           *((volatile unsigned int*)(0x42A79984UL))
#define bM4_PORT_PCR303_NOD                             *((volatile unsigned int*)(0x42A79988UL))
#define bM4_PORT_PCR303_DRV0                            *((volatile unsigned int*)(0x42A79990UL))
#define bM4_PORT_PCR303_DRV1                            *((volatile unsigned int*)(0x42A79994UL))
#define bM4_PORT_PCR303_PUU                             *((volatile unsigned int*)(0x42A79998UL))
#define bM4_PORT_PCR303_PIN                             *((volatile unsigned int*)(0x42A799A0UL))
#define bM4_PORT_PCR303_INVE                            *((volatile unsigned int*)(0x42A799A4UL))
#define bM4_PORT_PCR303_INTE                            *((volatile unsigned int*)(0x42A799B0UL))
#define bM4_PORT_PCR303_DDIS                            *((volatile unsigned int*)(0x42A799BCUL))
#define bM4_PORT_PFSR303_FSEL0                          *((volatile unsigned int*)(0x42A799C0UL))
#define bM4_PORT_PFSR303_FSEL1                          *((volatile unsigned int*)(0x42A799C4UL))
#define bM4_PORT_PFSR303_FSEL2                          *((volatile unsigned int*)(0x42A799C8UL))
#define bM4_PORT_PFSR303_FSEL3                          *((volatile unsigned int*)(0x42A799CCUL))
#define bM4_PORT_PFSR303_BFE                            *((volatile unsigned int*)(0x42A799E0UL))
#define bM4_PORT_PCR304_POUT                            *((volatile unsigned int*)(0x42A79A00UL))
#define bM4_PORT_PCR304_POUTE                           *((volatile unsigned int*)(0x42A79A04UL))
#define bM4_PORT_PCR304_NOD                             *((volatile unsigned int*)(0x42A79A08UL))
#define bM4_PORT_PCR304_DRV0                            *((volatile unsigned int*)(0x42A79A10UL))
#define bM4_PORT_PCR304_DRV1                            *((volatile unsigned int*)(0x42A79A14UL))
#define bM4_PORT_PCR304_PUU                             *((volatile unsigned int*)(0x42A79A18UL))
#define bM4_PORT_PCR304_PIN                             *((volatile unsigned int*)(0x42A79A20UL))
#define bM4_PORT_PCR304_INVE                            *((volatile unsigned int*)(0x42A79A24UL))
#define bM4_PORT_PCR304_INTE                            *((volatile unsigned int*)(0x42A79A30UL))
#define bM4_PORT_PCR304_DDIS                            *((volatile unsigned int*)(0x42A79A3CUL))
#define bM4_PORT_PFSR304_FSEL0                          *((volatile unsigned int*)(0x42A79A40UL))
#define bM4_PORT_PFSR304_FSEL1                          *((volatile unsigned int*)(0x42A79A44UL))
#define bM4_PORT_PFSR304_FSEL2                          *((volatile unsigned int*)(0x42A79A48UL))
#define bM4_PORT_PFSR304_FSEL3                          *((volatile unsigned int*)(0x42A79A4CUL))
#define bM4_PORT_PFSR304_BFE                            *((volatile unsigned int*)(0x42A79A60UL))
#define bM4_PORT_PCR305_POUT                            *((volatile unsigned int*)(0x42A79A80UL))
#define bM4_PORT_PCR305_POUTE                           *((volatile unsigned int*)(0x42A79A84UL))
#define bM4_PORT_PCR305_NOD                             *((volatile unsigned int*)(0x42A79A88UL))
#define bM4_PORT_PCR305_DRV0                            *((volatile unsigned int*)(0x42A79A90UL))
#define bM4_PORT_PCR305_DRV1                            *((volatile unsigned int*)(0x42A79A94UL))
#define bM4_PORT_PCR305_PUU                             *((volatile unsigned int*)(0x42A79A98UL))
#define bM4_PORT_PCR305_PIN                             *((volatile unsigned int*)(0x42A79AA0UL))
#define bM4_PORT_PCR305_INVE                            *((volatile unsigned int*)(0x42A79AA4UL))
#define bM4_PORT_PCR305_INTE                            *((volatile unsigned int*)(0x42A79AB0UL))
#define bM4_PORT_PCR305_DDIS                            *((volatile unsigned int*)(0x42A79ABCUL))
#define bM4_PORT_PFSR305_FSEL0                          *((volatile unsigned int*)(0x42A79AC0UL))
#define bM4_PORT_PFSR305_FSEL1                          *((volatile unsigned int*)(0x42A79AC4UL))
#define bM4_PORT_PFSR305_FSEL2                          *((volatile unsigned int*)(0x42A79AC8UL))
#define bM4_PORT_PFSR305_FSEL3                          *((volatile unsigned int*)(0x42A79ACCUL))
#define bM4_PORT_PFSR305_BFE                            *((volatile unsigned int*)(0x42A79AE0UL))
#define bM4_PORT_PCR306_POUT                            *((volatile unsigned int*)(0x42A79B00UL))
#define bM4_PORT_PCR306_POUTE                           *((volatile unsigned int*)(0x42A79B04UL))
#define bM4_PORT_PCR306_NOD                             *((volatile unsigned int*)(0x42A79B08UL))
#define bM4_PORT_PCR306_DRV0                            *((volatile unsigned int*)(0x42A79B10UL))
#define bM4_PORT_PCR306_DRV1                            *((volatile unsigned int*)(0x42A79B14UL))
#define bM4_PORT_PCR306_PUU                             *((volatile unsigned int*)(0x42A79B18UL))
#define bM4_PORT_PCR306_PIN                             *((volatile unsigned int*)(0x42A79B20UL))
#define bM4_PORT_PCR306_INVE                            *((volatile unsigned int*)(0x42A79B24UL))
#define bM4_PORT_PCR306_INTE                            *((volatile unsigned int*)(0x42A79B30UL))
#define bM4_PORT_PCR306_DDIS                            *((volatile unsigned int*)(0x42A79B3CUL))
#define bM4_PORT_PFSR306_FSEL0                          *((volatile unsigned int*)(0x42A79B40UL))
#define bM4_PORT_PFSR306_FSEL1                          *((volatile unsigned int*)(0x42A79B44UL))
#define bM4_PORT_PFSR306_FSEL2                          *((volatile unsigned int*)(0x42A79B48UL))
#define bM4_PORT_PFSR306_FSEL3                          *((volatile unsigned int*)(0x42A79B4CUL))
#define bM4_PORT_PFSR306_BFE                            *((volatile unsigned int*)(0x42A79B60UL))
#define bM4_PORT_PCR307_POUT                            *((volatile unsigned int*)(0x42A79B80UL))
#define bM4_PORT_PCR307_POUTE                           *((volatile unsigned int*)(0x42A79B84UL))
#define bM4_PORT_PCR307_NOD                             *((volatile unsigned int*)(0x42A79B88UL))
#define bM4_PORT_PCR307_DRV0                            *((volatile unsigned int*)(0x42A79B90UL))
#define bM4_PORT_PCR307_DRV1                            *((volatile unsigned int*)(0x42A79B94UL))
#define bM4_PORT_PCR307_PUU                             *((volatile unsigned int*)(0x42A79B98UL))
#define bM4_PORT_PCR307_PIN                             *((volatile unsigned int*)(0x42A79BA0UL))
#define bM4_PORT_PCR307_INVE                            *((volatile unsigned int*)(0x42A79BA4UL))
#define bM4_PORT_PCR307_INTE                            *((volatile unsigned int*)(0x42A79BB0UL))
#define bM4_PORT_PCR307_DDIS                            *((volatile unsigned int*)(0x42A79BBCUL))
#define bM4_PORT_PFSR307_FSEL0                          *((volatile unsigned int*)(0x42A79BC0UL))
#define bM4_PORT_PFSR307_FSEL1                          *((volatile unsigned int*)(0x42A79BC4UL))
#define bM4_PORT_PFSR307_FSEL2                          *((volatile unsigned int*)(0x42A79BC8UL))
#define bM4_PORT_PFSR307_FSEL3                          *((volatile unsigned int*)(0x42A79BCCUL))
#define bM4_PORT_PFSR307_BFE                            *((volatile unsigned int*)(0x42A79BE0UL))
#define bM4_PORT_PCR308_POUT                            *((volatile unsigned int*)(0x42A79C00UL))
#define bM4_PORT_PCR308_POUTE                           *((volatile unsigned int*)(0x42A79C04UL))
#define bM4_PORT_PCR308_NOD                             *((volatile unsigned int*)(0x42A79C08UL))
#define bM4_PORT_PCR308_DRV0                            *((volatile unsigned int*)(0x42A79C10UL))
#define bM4_PORT_PCR308_DRV1                            *((volatile unsigned int*)(0x42A79C14UL))
#define bM4_PORT_PCR308_PUU                             *((volatile unsigned int*)(0x42A79C18UL))
#define bM4_PORT_PCR308_PIN                             *((volatile unsigned int*)(0x42A79C20UL))
#define bM4_PORT_PCR308_INVE                            *((volatile unsigned int*)(0x42A79C24UL))
#define bM4_PORT_PCR308_INTE                            *((volatile unsigned int*)(0x42A79C30UL))
#define bM4_PORT_PCR308_DDIS                            *((volatile unsigned int*)(0x42A79C3CUL))
#define bM4_PORT_PFSR308_FSEL0                          *((volatile unsigned int*)(0x42A79C40UL))
#define bM4_PORT_PFSR308_FSEL1                          *((volatile unsigned int*)(0x42A79C44UL))
#define bM4_PORT_PFSR308_FSEL2                          *((volatile unsigned int*)(0x42A79C48UL))
#define bM4_PORT_PFSR308_FSEL3                          *((volatile unsigned int*)(0x42A79C4CUL))
#define bM4_PORT_PFSR308_BFE                            *((volatile unsigned int*)(0x42A79C60UL))
#define bM4_PORT_PCR309_POUT                            *((volatile unsigned int*)(0x42A79C80UL))
#define bM4_PORT_PCR309_POUTE                           *((volatile unsigned int*)(0x42A79C84UL))
#define bM4_PORT_PCR309_NOD                             *((volatile unsigned int*)(0x42A79C88UL))
#define bM4_PORT_PCR309_DRV0                            *((volatile unsigned int*)(0x42A79C90UL))
#define bM4_PORT_PCR309_DRV1                            *((volatile unsigned int*)(0x42A79C94UL))
#define bM4_PORT_PCR309_PUU                             *((volatile unsigned int*)(0x42A79C98UL))
#define bM4_PORT_PCR309_PIN                             *((volatile unsigned int*)(0x42A79CA0UL))
#define bM4_PORT_PCR309_INVE                            *((volatile unsigned int*)(0x42A79CA4UL))
#define bM4_PORT_PCR309_INTE                            *((volatile unsigned int*)(0x42A79CB0UL))
#define bM4_PORT_PCR309_DDIS                            *((volatile unsigned int*)(0x42A79CBCUL))
#define bM4_PORT_PFSR309_FSEL0                          *((volatile unsigned int*)(0x42A79CC0UL))
#define bM4_PORT_PFSR309_FSEL1                          *((volatile unsigned int*)(0x42A79CC4UL))
#define bM4_PORT_PFSR309_FSEL2                          *((volatile unsigned int*)(0x42A79CC8UL))
#define bM4_PORT_PFSR309_FSEL3                          *((volatile unsigned int*)(0x42A79CCCUL))
#define bM4_PORT_PFSR309_BFE                            *((volatile unsigned int*)(0x42A79CE0UL))
#define bM4_PORT_PCR310_POUT                            *((volatile unsigned int*)(0x42A79D00UL))
#define bM4_PORT_PCR310_POUTE                           *((volatile unsigned int*)(0x42A79D04UL))
#define bM4_PORT_PCR310_NOD                             *((volatile unsigned int*)(0x42A79D08UL))
#define bM4_PORT_PCR310_DRV0                            *((volatile unsigned int*)(0x42A79D10UL))
#define bM4_PORT_PCR310_DRV1                            *((volatile unsigned int*)(0x42A79D14UL))
#define bM4_PORT_PCR310_PUU                             *((volatile unsigned int*)(0x42A79D18UL))
#define bM4_PORT_PCR310_PIN                             *((volatile unsigned int*)(0x42A79D20UL))
#define bM4_PORT_PCR310_INVE                            *((volatile unsigned int*)(0x42A79D24UL))
#define bM4_PORT_PCR310_INTE                            *((volatile unsigned int*)(0x42A79D30UL))
#define bM4_PORT_PCR310_DDIS                            *((volatile unsigned int*)(0x42A79D3CUL))
#define bM4_PORT_PFSR310_FSEL0                          *((volatile unsigned int*)(0x42A79D40UL))
#define bM4_PORT_PFSR310_FSEL1                          *((volatile unsigned int*)(0x42A79D44UL))
#define bM4_PORT_PFSR310_FSEL2                          *((volatile unsigned int*)(0x42A79D48UL))
#define bM4_PORT_PFSR310_FSEL3                          *((volatile unsigned int*)(0x42A79D4CUL))
#define bM4_PORT_PFSR310_BFE                            *((volatile unsigned int*)(0x42A79D60UL))
#define bM4_PORT_PCR311_POUT                            *((volatile unsigned int*)(0x42A79D80UL))
#define bM4_PORT_PCR311_POUTE                           *((volatile unsigned int*)(0x42A79D84UL))
#define bM4_PORT_PCR311_NOD                             *((volatile unsigned int*)(0x42A79D88UL))
#define bM4_PORT_PCR311_DRV0                            *((volatile unsigned int*)(0x42A79D90UL))
#define bM4_PORT_PCR311_DRV1                            *((volatile unsigned int*)(0x42A79D94UL))
#define bM4_PORT_PCR311_PUU                             *((volatile unsigned int*)(0x42A79D98UL))
#define bM4_PORT_PCR311_PIN                             *((volatile unsigned int*)(0x42A79DA0UL))
#define bM4_PORT_PCR311_INVE                            *((volatile unsigned int*)(0x42A79DA4UL))
#define bM4_PORT_PCR311_INTE                            *((volatile unsigned int*)(0x42A79DB0UL))
#define bM4_PORT_PCR311_DDIS                            *((volatile unsigned int*)(0x42A79DBCUL))
#define bM4_PORT_PFSR311_FSEL0                          *((volatile unsigned int*)(0x42A79DC0UL))
#define bM4_PORT_PFSR311_FSEL1                          *((volatile unsigned int*)(0x42A79DC4UL))
#define bM4_PORT_PFSR311_FSEL2                          *((volatile unsigned int*)(0x42A79DC8UL))
#define bM4_PORT_PFSR311_FSEL3                          *((volatile unsigned int*)(0x42A79DCCUL))
#define bM4_PORT_PFSR311_BFE                            *((volatile unsigned int*)(0x42A79DE0UL))
#define bM4_PORT_PCR312_POUT                            *((volatile unsigned int*)(0x42A79E00UL))
#define bM4_PORT_PCR312_POUTE                           *((volatile unsigned int*)(0x42A79E04UL))
#define bM4_PORT_PCR312_NOD                             *((volatile unsigned int*)(0x42A79E08UL))
#define bM4_PORT_PCR312_DRV0                            *((volatile unsigned int*)(0x42A79E10UL))
#define bM4_PORT_PCR312_DRV1                            *((volatile unsigned int*)(0x42A79E14UL))
#define bM4_PORT_PCR312_PUU                             *((volatile unsigned int*)(0x42A79E18UL))
#define bM4_PORT_PCR312_PIN                             *((volatile unsigned int*)(0x42A79E20UL))
#define bM4_PORT_PCR312_INVE                            *((volatile unsigned int*)(0x42A79E24UL))
#define bM4_PORT_PCR312_INTE                            *((volatile unsigned int*)(0x42A79E30UL))
#define bM4_PORT_PCR312_DDIS                            *((volatile unsigned int*)(0x42A79E3CUL))
#define bM4_PORT_PFSR312_FSEL0                          *((volatile unsigned int*)(0x42A79E40UL))
