RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_PORT_PFSR312_FSEL1                          *((volatile unsigned int*)(0x42A79E44UL))
#define bM4_PORT_PFSR312_FSEL2                          *((volatile unsigned int*)(0x42A79E48UL))
#define bM4_PORT_PFSR312_FSEL3                          *((volatile unsigned int*)(0x42A79E4CUL))
#define bM4_PORT_PFSR312_BFE                            *((volatile unsigned int*)(0x42A79E60UL))
#define bM4_PORT_PCR313_POUT                            *((volatile unsigned int*)(0x42A79E80UL))
#define bM4_PORT_PCR313_POUTE                           *((volatile unsigned int*)(0x42A79E84UL))
#define bM4_PORT_PCR313_NOD                             *((volatile unsigned int*)(0x42A79E88UL))
#define bM4_PORT_PCR313_DRV0                            *((volatile unsigned int*)(0x42A79E90UL))
#define bM4_PORT_PCR313_DRV1                            *((volatile unsigned int*)(0x42A79E94UL))
#define bM4_PORT_PCR313_PUU                             *((volatile unsigned int*)(0x42A79E98UL))
#define bM4_PORT_PCR313_PIN                             *((volatile unsigned int*)(0x42A79EA0UL))
#define bM4_PORT_PCR313_INVE                            *((volatile unsigned int*)(0x42A79EA4UL))
#define bM4_PORT_PCR313_INTE                            *((volatile unsigned int*)(0x42A79EB0UL))
#define bM4_PORT_PCR313_DDIS                            *((volatile unsigned int*)(0x42A79EBCUL))
#define bM4_PORT_PFSR313_FSEL0                          *((volatile unsigned int*)(0x42A79EC0UL))
#define bM4_PORT_PFSR313_FSEL1                          *((volatile unsigned int*)(0x42A79EC4UL))
#define bM4_PORT_PFSR313_FSEL2                          *((volatile unsigned int*)(0x42A79EC8UL))
#define bM4_PORT_PFSR313_FSEL3                          *((volatile unsigned int*)(0x42A79ECCUL))
#define bM4_PORT_PFSR313_BFE                            *((volatile unsigned int*)(0x42A79EE0UL))
#define bM4_PORT_PCR314_POUT                            *((volatile unsigned int*)(0x42A79F00UL))
#define bM4_PORT_PCR314_POUTE                           *((volatile unsigned int*)(0x42A79F04UL))
#define bM4_PORT_PCR314_NOD                             *((volatile unsigned int*)(0x42A79F08UL))
#define bM4_PORT_PCR314_DRV0                            *((volatile unsigned int*)(0x42A79F10UL))
#define bM4_PORT_PCR314_DRV1                            *((volatile unsigned int*)(0x42A79F14UL))
#define bM4_PORT_PCR314_PUU                             *((volatile unsigned int*)(0x42A79F18UL))
#define bM4_PORT_PCR314_PIN                             *((volatile unsigned int*)(0x42A79F20UL))
#define bM4_PORT_PCR314_INVE                            *((volatile unsigned int*)(0x42A79F24UL))
#define bM4_PORT_PCR314_INTE                            *((volatile unsigned int*)(0x42A79F30UL))
#define bM4_PORT_PCR314_DDIS                            *((volatile unsigned int*)(0x42A79F3CUL))
#define bM4_PORT_PFSR314_FSEL0                          *((volatile unsigned int*)(0x42A79F40UL))
#define bM4_PORT_PFSR314_FSEL1                          *((volatile unsigned int*)(0x42A79F44UL))
#define bM4_PORT_PFSR314_FSEL2                          *((volatile unsigned int*)(0x42A79F48UL))
#define bM4_PORT_PFSR314_FSEL3                          *((volatile unsigned int*)(0x42A79F4CUL))
#define bM4_PORT_PFSR314_BFE                            *((volatile unsigned int*)(0x42A79F60UL))
#define bM4_PORT_PCR315_POUT                            *((volatile unsigned int*)(0x42A79F80UL))
#define bM4_PORT_PCR315_POUTE                           *((volatile unsigned int*)(0x42A79F84UL))
#define bM4_PORT_PCR315_NOD                             *((volatile unsigned int*)(0x42A79F88UL))
#define bM4_PORT_PCR315_DRV0                            *((volatile unsigned int*)(0x42A79F90UL))
#define bM4_PORT_PCR315_DRV1                            *((volatile unsigned int*)(0x42A79F94UL))
#define bM4_PORT_PCR315_PUU                             *((volatile unsigned int*)(0x42A79F98UL))
#define bM4_PORT_PCR315_PIN                             *((volatile unsigned int*)(0x42A79FA0UL))
#define bM4_PORT_PCR315_INVE                            *((volatile unsigned int*)(0x42A79FA4UL))
#define bM4_PORT_PCR315_INTE                            *((volatile unsigned int*)(0x42A79FB0UL))
#define bM4_PORT_PCR315_DDIS                            *((volatile unsigned int*)(0x42A79FBCUL))
#define bM4_PORT_PFSR315_FSEL0                          *((volatile unsigned int*)(0x42A79FC0UL))
#define bM4_PORT_PFSR315_FSEL1                          *((volatile unsigned int*)(0x42A79FC4UL))
#define bM4_PORT_PFSR315_FSEL2                          *((volatile unsigned int*)(0x42A79FC8UL))
#define bM4_PORT_PFSR315_FSEL3                          *((volatile unsigned int*)(0x42A79FCCUL))
#define bM4_PORT_PFSR315_BFE                            *((volatile unsigned int*)(0x42A79FE0UL))
#define bM4_PORT_PCR400_POUT                            *((volatile unsigned int*)(0x42A7A000UL))
#define bM4_PORT_PCR400_POUTE                           *((volatile unsigned int*)(0x42A7A004UL))
#define bM4_PORT_PCR400_NOD                             *((volatile unsigned int*)(0x42A7A008UL))
#define bM4_PORT_PCR400_DRV0                            *((volatile unsigned int*)(0x42A7A010UL))
#define bM4_PORT_PCR400_DRV1                            *((volatile unsigned int*)(0x42A7A014UL))
#define bM4_PORT_PCR400_PUU                             *((volatile unsigned int*)(0x42A7A018UL))
#define bM4_PORT_PCR400_PIN                             *((volatile unsigned int*)(0x42A7A020UL))
#define bM4_PORT_PCR400_INVE                            *((volatile unsigned int*)(0x42A7A024UL))
#define bM4_PORT_PCR400_INTE                            *((volatile unsigned int*)(0x42A7A030UL))
#define bM4_PORT_PCR400_DDIS                            *((volatile unsigned int*)(0x42A7A03CUL))
#define bM4_PORT_PFSR400_FSEL0                          *((volatile unsigned int*)(0x42A7A040UL))
#define bM4_PORT_PFSR400_FSEL1                          *((volatile unsigned int*)(0x42A7A044UL))
#define bM4_PORT_PFSR400_FSEL2                          *((volatile unsigned int*)(0x42A7A048UL))
#define bM4_PORT_PFSR400_FSEL3                          *((volatile unsigned int*)(0x42A7A04CUL))
#define bM4_PORT_PFSR400_BFE                            *((volatile unsigned int*)(0x42A7A060UL))
#define bM4_PORT_PCR401_POUT                            *((volatile unsigned int*)(0x42A7A080UL))
#define bM4_PORT_PCR401_POUTE                           *((volatile unsigned int*)(0x42A7A084UL))
#define bM4_PORT_PCR401_NOD                             *((volatile unsigned int*)(0x42A7A088UL))
#define bM4_PORT_PCR401_DRV0                            *((volatile unsigned int*)(0x42A7A090UL))
#define bM4_PORT_PCR401_DRV1                            *((volatile unsigned int*)(0x42A7A094UL))
#define bM4_PORT_PCR401_PUU                             *((volatile unsigned int*)(0x42A7A098UL))
#define bM4_PORT_PCR401_PIN                             *((volatile unsigned int*)(0x42A7A0A0UL))
#define bM4_PORT_PCR401_INVE                            *((volatile unsigned int*)(0x42A7A0A4UL))
#define bM4_PORT_PCR401_INTE                            *((volatile unsigned int*)(0x42A7A0B0UL))
#define bM4_PORT_PCR401_DDIS                            *((volatile unsigned int*)(0x42A7A0BCUL))
#define bM4_PORT_PFSR401_FSEL0                          *((volatile unsigned int*)(0x42A7A0C0UL))
#define bM4_PORT_PFSR401_FSEL1                          *((volatile unsigned int*)(0x42A7A0C4UL))
#define bM4_PORT_PFSR401_FSEL2                          *((volatile unsigned int*)(0x42A7A0C8UL))
#define bM4_PORT_PFSR401_FSEL3                          *((volatile unsigned int*)(0x42A7A0CCUL))
#define bM4_PORT_PFSR401_BFE                            *((volatile unsigned int*)(0x42A7A0E0UL))
#define bM4_PORT_PCR402_POUT                            *((volatile unsigned int*)(0x42A7A100UL))
#define bM4_PORT_PCR402_POUTE                           *((volatile unsigned int*)(0x42A7A104UL))
#define bM4_PORT_PCR402_NOD                             *((volatile unsigned int*)(0x42A7A108UL))
#define bM4_PORT_PCR402_DRV0                            *((volatile unsigned int*)(0x42A7A110UL))
#define bM4_PORT_PCR402_DRV1                            *((volatile unsigned int*)(0x42A7A114UL))
#define bM4_PORT_PCR402_PUU                             *((volatile unsigned int*)(0x42A7A118UL))
#define bM4_PORT_PCR402_PIN                             *((volatile unsigned int*)(0x42A7A120UL))
#define bM4_PORT_PCR402_INVE                            *((volatile unsigned int*)(0x42A7A124UL))
#define bM4_PORT_PCR402_INTE                            *((volatile unsigned int*)(0x42A7A130UL))
#define bM4_PORT_PCR402_DDIS                            *((volatile unsigned int*)(0x42A7A13CUL))
#define bM4_PORT_PFSR402_FSEL0                          *((volatile unsigned int*)(0x42A7A140UL))
#define bM4_PORT_PFSR402_FSEL1                          *((volatile unsigned int*)(0x42A7A144UL))
#define bM4_PORT_PFSR402_FSEL2                          *((volatile unsigned int*)(0x42A7A148UL))
#define bM4_PORT_PFSR402_FSEL3                          *((volatile unsigned int*)(0x42A7A14CUL))
#define bM4_PORT_PFSR402_BFE                            *((volatile unsigned int*)(0x42A7A160UL))
#define bM4_PORT_PCR403_POUT                            *((volatile unsigned int*)(0x42A7A180UL))
#define bM4_PORT_PCR403_POUTE                           *((volatile unsigned int*)(0x42A7A184UL))
#define bM4_PORT_PCR403_NOD                             *((volatile unsigned int*)(0x42A7A188UL))
#define bM4_PORT_PCR403_DRV0                            *((volatile unsigned int*)(0x42A7A190UL))
#define bM4_PORT_PCR403_DRV1                            *((volatile unsigned int*)(0x42A7A194UL))
#define bM4_PORT_PCR403_PUU                             *((volatile unsigned int*)(0x42A7A198UL))
#define bM4_PORT_PCR403_PIN                             *((volatile unsigned int*)(0x42A7A1A0UL))
#define bM4_PORT_PCR403_INVE                            *((volatile unsigned int*)(0x42A7A1A4UL))
#define bM4_PORT_PCR403_INTE                            *((volatile unsigned int*)(0x42A7A1B0UL))
#define bM4_PORT_PCR403_DDIS                            *((volatile unsigned int*)(0x42A7A1BCUL))
#define bM4_PORT_PFSR403_FSEL0                          *((volatile unsigned int*)(0x42A7A1C0UL))
#define bM4_PORT_PFSR403_FSEL1                          *((volatile unsigned int*)(0x42A7A1C4UL))
#define bM4_PORT_PFSR403_FSEL2                          *((volatile unsigned int*)(0x42A7A1C8UL))
#define bM4_PORT_PFSR403_FSEL3                          *((volatile unsigned int*)(0x42A7A1CCUL))
#define bM4_PORT_PFSR403_BFE                            *((volatile unsigned int*)(0x42A7A1E0UL))
#define bM4_PORT_PCR404_POUT                            *((volatile unsigned int*)(0x42A7A200UL))
#define bM4_PORT_PCR404_POUTE                           *((volatile unsigned int*)(0x42A7A204UL))
#define bM4_PORT_PCR404_NOD                             *((volatile unsigned int*)(0x42A7A208UL))
#define bM4_PORT_PCR404_DRV0                            *((volatile unsigned int*)(0x42A7A210UL))
#define bM4_PORT_PCR404_DRV1                            *((volatile unsigned int*)(0x42A7A214UL))
#define bM4_PORT_PCR404_PUU                             *((volatile unsigned int*)(0x42A7A218UL))
#define bM4_PORT_PCR404_PIN                             *((volatile unsigned int*)(0x42A7A220UL))
#define bM4_PORT_PCR404_INVE                            *((volatile unsigned int*)(0x42A7A224UL))
#define bM4_PORT_PCR404_INTE                            *((volatile unsigned int*)(0x42A7A230UL))
#define bM4_PORT_PCR404_DDIS                            *((volatile unsigned int*)(0x42A7A23CUL))
#define bM4_PORT_PFSR404_FSEL0                          *((volatile unsigned int*)(0x42A7A240UL))
#define bM4_PORT_PFSR404_FSEL1                          *((volatile unsigned int*)(0x42A7A244UL))
#define bM4_PORT_PFSR404_FSEL2                          *((volatile unsigned int*)(0x42A7A248UL))
#define bM4_PORT_PFSR404_FSEL3                          *((volatile unsigned int*)(0x42A7A24CUL))
#define bM4_PORT_PFSR404_BFE                            *((volatile unsigned int*)(0x42A7A260UL))
#define bM4_PORT_PCR405_POUT                            *((volatile unsigned int*)(0x42A7A280UL))
#define bM4_PORT_PCR405_POUTE                           *((volatile unsigned int*)(0x42A7A284UL))
#define bM4_PORT_PCR405_NOD                             *((volatile unsigned int*)(0x42A7A288UL))
#define bM4_PORT_PCR405_DRV0                            *((volatile unsigned int*)(0x42A7A290UL))
#define bM4_PORT_PCR405_DRV1                            *((volatile unsigned int*)(0x42A7A294UL))
#define bM4_PORT_PCR405_PUU                             *((volatile unsigned int*)(0x42A7A298UL))
#define bM4_PORT_PCR405_PIN                             *((volatile unsigned int*)(0x42A7A2A0UL))
#define bM4_PORT_PCR405_INVE                            *((volatile unsigned int*)(0x42A7A2A4UL))
#define bM4_PORT_PCR405_INTE                            *((volatile unsigned int*)(0x42A7A2B0UL))
#define bM4_PORT_PCR405_DDIS                            *((volatile unsigned int*)(0x42A7A2BCUL))
#define bM4_PORT_PFSR405_FSEL0                          *((volatile unsigned int*)(0x42A7A2C0UL))
#define bM4_PORT_PFSR405_FSEL1                          *((volatile unsigned int*)(0x42A7A2C4UL))
#define bM4_PORT_PFSR405_FSEL2                          *((volatile unsigned int*)(0x42A7A2C8UL))
#define bM4_PORT_PFSR405_FSEL3                          *((volatile unsigned int*)(0x42A7A2CCUL))
#define bM4_PORT_PFSR405_BFE                            *((volatile unsigned int*)(0x42A7A2E0UL))
#define bM4_PORT_PCR406_POUT                            *((volatile unsigned int*)(0x42A7A300UL))
#define bM4_PORT_PCR406_POUTE                           *((volatile unsigned int*)(0x42A7A304UL))
#define bM4_PORT_PCR406_NOD                             *((volatile unsigned int*)(0x42A7A308UL))
#define bM4_PORT_PCR406_DRV0                            *((volatile unsigned int*)(0x42A7A310UL))
#define bM4_PORT_PCR406_DRV1                            *((volatile unsigned int*)(0x42A7A314UL))
#define bM4_PORT_PCR406_PUU                             *((volatile unsigned int*)(0x42A7A318UL))
#define bM4_PORT_PCR406_PIN                             *((volatile unsigned int*)(0x42A7A320UL))
#define bM4_PORT_PCR406_INVE                            *((volatile unsigned int*)(0x42A7A324UL))
#define bM4_PORT_PCR406_INTE                            *((volatile unsigned int*)(0x42A7A330UL))
#define bM4_PORT_PCR406_DDIS                            *((volatile unsigned int*)(0x42A7A33CUL))
#define bM4_PORT_PFSR406_FSEL0                          *((volatile unsigned int*)(0x42A7A340UL))
#define bM4_PORT_PFSR406_FSEL1                          *((volatile unsigned int*)(0x42A7A344UL))
#define bM4_PORT_PFSR406_FSEL2                          *((volatile unsigned int*)(0x42A7A348UL))
#define bM4_PORT_PFSR406_FSEL3                          *((volatile unsigned int*)(0x42A7A34CUL))
#define bM4_PORT_PFSR406_BFE                            *((volatile unsigned int*)(0x42A7A360UL))
#define bM4_PORT_PCR407_POUT                            *((volatile unsigned int*)(0x42A7A380UL))
#define bM4_PORT_PCR407_POUTE                           *((volatile unsigned int*)(0x42A7A384UL))
#define bM4_PORT_PCR407_NOD                             *((volatile unsigned int*)(0x42A7A388UL))
#define bM4_PORT_PCR407_DRV0                            *((volatile unsigned int*)(0x42A7A390UL))
#define bM4_PORT_PCR407_DRV1                            *((volatile unsigned int*)(0x42A7A394UL))
#define bM4_PORT_PCR407_PUU                             *((volatile unsigned int*)(0x42A7A398UL))
#define bM4_PORT_PCR407_PIN                             *((volatile unsigned int*)(0x42A7A3A0UL))
#define bM4_PORT_PCR407_INVE                            *((volatile unsigned int*)(0x42A7A3A4UL))
#define bM4_PORT_PCR407_INTE                            *((volatile unsigned int*)(0x42A7A3B0UL))
#define bM4_PORT_PCR407_DDIS                            *((volatile unsigned int*)(0x42A7A3BCUL))
#define bM4_PORT_PFSR407_FSEL0                          *((volatile unsigned int*)(0x42A7A3C0UL))
#define bM4_PORT_PFSR407_FSEL1                          *((volatile unsigned int*)(0x42A7A3C4UL))
#define bM4_PORT_PFSR407_FSEL2                          *((volatile unsigned int*)(0x42A7A3C8UL))
#define bM4_PORT_PFSR407_FSEL3                          *((volatile unsigned int*)(0x42A7A3CCUL))
#define bM4_PORT_PFSR407_BFE                            *((volatile unsigned int*)(0x42A7A3E0UL))
#define bM4_PORT_PCR408_POUT                            *((volatile unsigned int*)(0x42A7A400UL))
#define bM4_PORT_PCR408_POUTE                           *((volatile unsigned int*)(0x42A7A404UL))
#define bM4_PORT_PCR408_NOD                             *((volatile unsigned int*)(0x42A7A408UL))
#define bM4_PORT_PCR408_DRV0                            *((volatile unsigned int*)(0x42A7A410UL))
#define bM4_PORT_PCR408_DRV1                            *((volatile unsigned int*)(0x42A7A414UL))
#define bM4_PORT_PCR408_PUU                             *((volatile unsigned int*)(0x42A7A418UL))
#define bM4_PORT_PCR408_PIN                             *((volatile unsigned int*)(0x42A7A420UL))
#define bM4_PORT_PCR408_INVE                            *((volatile unsigned int*)(0x42A7A424UL))
#define bM4_PORT_PCR408_INTE                            *((volatile unsigned int*)(0x42A7A430UL))
#define bM4_PORT_PCR408_DDIS                            *((volatile unsigned int*)(0x42A7A43CUL))
#define bM4_PORT_PFSR408_FSEL0                          *((volatile unsigned int*)(0x42A7A440UL))
#define bM4_PORT_PFSR408_FSEL1                          *((volatile unsigned int*)(0x42A7A444UL))
#define bM4_PORT_PFSR408_FSEL2                          *((volatile unsigned int*)(0x42A7A448UL))
#define bM4_PORT_PFSR408_FSEL3                          *((volatile unsigned int*)(0x42A7A44CUL))
#define bM4_PORT_PFSR408_BFE                            *((volatile unsigned int*)(0x42A7A460UL))
#define bM4_PORT_PCR409_POUT                            *((volatile unsigned int*)(0x42A7A480UL))
#define bM4_PORT_PCR409_POUTE                           *((volatile unsigned int*)(0x42A7A484UL))
#define bM4_PORT_PCR409_NOD                             *((volatile unsigned int*)(0x42A7A488UL))
#define bM4_PORT_PCR409_DRV0                            *((volatile unsigned int*)(0x42A7A490UL))
#define bM4_PORT_PCR409_DRV1                            *((volatile unsigned int*)(0x42A7A494UL))
#define bM4_PORT_PCR409_PUU                             *((volatile unsigned int*)(0x42A7A498UL))
#define bM4_PORT_PCR409_PIN                             *((volatile unsigned int*)(0x42A7A4A0UL))
#define bM4_PORT_PCR409_INVE                            *((volatile unsigned int*)(0x42A7A4A4UL))
#define bM4_PORT_PCR409_INTE                            *((volatile unsigned int*)(0x42A7A4B0UL))
#define bM4_PORT_PCR409_DDIS                            *((volatile unsigned int*)(0x42A7A4BCUL))
#define bM4_PORT_PFSR409_FSEL0                          *((volatile unsigned int*)(0x42A7A4C0UL))
#define bM4_PORT_PFSR409_FSEL1                          *((volatile unsigned int*)(0x42A7A4C4UL))
#define bM4_PORT_PFSR409_FSEL2                          *((volatile unsigned int*)(0x42A7A4C8UL))
#define bM4_PORT_PFSR409_FSEL3                          *((volatile unsigned int*)(0x42A7A4CCUL))
#define bM4_PORT_PFSR409_BFE                            *((volatile unsigned int*)(0x42A7A4E0UL))
#define bM4_PORT_PCR410_POUT                            *((volatile unsigned int*)(0x42A7A500UL))
#define bM4_PORT_PCR410_POUTE                           *((volatile unsigned int*)(0x42A7A504UL))
#define bM4_PORT_PCR410_NOD                             *((volatile unsigned int*)(0x42A7A508UL))
#define bM4_PORT_PCR410_DRV0                            *((volatile unsigned int*)(0x42A7A510UL))
#define bM4_PORT_PCR410_DRV1                            *((volatile unsigned int*)(0x42A7A514UL))
#define bM4_PORT_PCR410_PUU                             *((volatile unsigned int*)(0x42A7A518UL))
#define bM4_PORT_PCR410_PIN                             *((volatile unsigned int*)(0x42A7A520UL))
#define bM4_PORT_PCR410_INVE                            *((volatile unsigned int*)(0x42A7A524UL))
#define bM4_PORT_PCR410_INTE                            *((volatile unsigned int*)(0x42A7A530UL))
#define bM4_PORT_PCR410_DDIS                            *((volatile unsigned int*)(0x42A7A53CUL))
#define bM4_PORT_PFSR410_FSEL0                          *((volatile unsigned int*)(0x42A7A540UL))
#define bM4_PORT_PFSR410_FSEL1                          *((volatile unsigned int*)(0x42A7A544UL))
#define bM4_PORT_PFSR410_FSEL2                          *((volatile unsigned int*)(0x42A7A548UL))
#define bM4_PORT_PFSR410_FSEL3                          *((volatile unsigned int*)(0x42A7A54CUL))
#define bM4_PORT_PFSR410_BFE                            *((volatile unsigned int*)(0x42A7A560UL))
#define bM4_PORT_PCR411_POUT                            *((volatile unsigned int*)(0x42A7A580UL))
#define bM4_PORT_PCR411_POUTE                           *((volatile unsigned int*)(0x42A7A584UL))
#define bM4_PORT_PCR411_NOD                             *((volatile unsigned int*)(0x42A7A588UL))
#define bM4_PORT_PCR411_DRV0                            *((volatile unsigned int*)(0x42A7A590UL))
#define bM4_PORT_PCR411_DRV1                            *((volatile unsigned int*)(0x42A7A594UL))
#define bM4_PORT_PCR411_PUU                             *((volatile unsigned int*)(0x42A7A598UL))
#define bM4_PORT_PCR411_PIN                             *((volatile unsigned int*)(0x42A7A5A0UL))
#define bM4_PORT_PCR411_INVE                            *((volatile unsigned int*)(0x42A7A5A4UL))
#define bM4_PORT_PCR411_INTE                            *((volatile unsigned int*)(0x42A7A5B0UL))
#define bM4_PORT_PCR411_DDIS                            *((volatile unsigned int*)(0x42A7A5BCUL))
#define bM4_PORT_PFSR411_FSEL0                          *((volatile unsigned int*)(0x42A7A5C0UL))
#define bM4_PORT_PFSR411_FSEL1                          *((volatile unsigned int*)(0x42A7A5C4UL))
#define bM4_PORT_PFSR411_FSEL2                          *((volatile unsigned int*)(0x42A7A5C8UL))
#define bM4_PORT_PFSR411_FSEL3                          *((volatile unsigned int*)(0x42A7A5CCUL))
#define bM4_PORT_PFSR411_BFE                            *((volatile unsigned int*)(0x42A7A5E0UL))
#define bM4_PORT_PCR412_POUT                            *((volatile unsigned int*)(0x42A7A600UL))
#define bM4_PORT_PCR412_POUTE                           *((volatile unsigned int*)(0x42A7A604UL))
#define bM4_PORT_PCR412_NOD                             *((volatile unsigned int*)(0x42A7A608UL))
#define bM4_PORT_PCR412_DRV0                            *((volatile unsigned int*)(0x42A7A610UL))
#define bM4_PORT_PCR412_DRV1                            *((volatile unsigned int*)(0x42A7A614UL))
#define bM4_PORT_PCR412_PUU                             *((volatile unsigned int*)(0x42A7A618UL))
#define bM4_PORT_PCR412_PIN                             *((volatile unsigned int*)(0x42A7A620UL))
#define bM4_PORT_PCR412_INVE                            *((volatile unsigned int*)(0x42A7A624UL))
#define bM4_PORT_PCR412_INTE                            *((volatile unsigned int*)(0x42A7A630UL))
#define bM4_PORT_PCR412_DDIS                            *((volatile unsigned int*)(0x42A7A63CUL))
#define bM4_PORT_PFSR412_FSEL0                          *((volatile unsigned int*)(0x42A7A640UL))
#define bM4_PORT_PFSR412_FSEL1                          *((volatile unsigned int*)(0x42A7A644UL))
#define bM4_PORT_PFSR412_FSEL2                          *((volatile unsigned int*)(0x42A7A648UL))
#define bM4_PORT_PFSR412_FSEL3                          *((volatile unsigned int*)(0x42A7A64CUL))
#define bM4_PORT_PFSR412_BFE                            *((volatile unsigned int*)(0x42A7A660UL))
