RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_PORT_PCR413_POUT                            *((volatile unsigned int*)(0x42A7A680UL))
#define bM4_PORT_PCR413_POUTE                           *((volatile unsigned int*)(0x42A7A684UL))
#define bM4_PORT_PCR413_NOD                             *((volatile unsigned int*)(0x42A7A688UL))
#define bM4_PORT_PCR413_DRV0                            *((volatile unsigned int*)(0x42A7A690UL))
#define bM4_PORT_PCR413_DRV1                            *((volatile unsigned int*)(0x42A7A694UL))
#define bM4_PORT_PCR413_PUU                             *((volatile unsigned int*)(0x42A7A698UL))
#define bM4_PORT_PCR413_PIN                             *((volatile unsigned int*)(0x42A7A6A0UL))
#define bM4_PORT_PCR413_INVE                            *((volatile unsigned int*)(0x42A7A6A4UL))
#define bM4_PORT_PCR413_INTE                            *((volatile unsigned int*)(0x42A7A6B0UL))
#define bM4_PORT_PCR413_DDIS                            *((volatile unsigned int*)(0x42A7A6BCUL))
#define bM4_PORT_PFSR413_FSEL0                          *((volatile unsigned int*)(0x42A7A6C0UL))
#define bM4_PORT_PFSR413_FSEL1                          *((volatile unsigned int*)(0x42A7A6C4UL))
#define bM4_PORT_PFSR413_FSEL2                          *((volatile unsigned int*)(0x42A7A6C8UL))
#define bM4_PORT_PFSR413_FSEL3                          *((volatile unsigned int*)(0x42A7A6CCUL))
#define bM4_PORT_PFSR413_BFE                            *((volatile unsigned int*)(0x42A7A6E0UL))
#define bM4_PORT_PCR414_POUT                            *((volatile unsigned int*)(0x42A7A700UL))
#define bM4_PORT_PCR414_POUTE                           *((volatile unsigned int*)(0x42A7A704UL))
#define bM4_PORT_PCR414_NOD                             *((volatile unsigned int*)(0x42A7A708UL))
#define bM4_PORT_PCR414_DRV0                            *((volatile unsigned int*)(0x42A7A710UL))
#define bM4_PORT_PCR414_DRV1                            *((volatile unsigned int*)(0x42A7A714UL))
#define bM4_PORT_PCR414_PUU                             *((volatile unsigned int*)(0x42A7A718UL))
#define bM4_PORT_PCR414_PIN                             *((volatile unsigned int*)(0x42A7A720UL))
#define bM4_PORT_PCR414_INVE                            *((volatile unsigned int*)(0x42A7A724UL))
#define bM4_PORT_PCR414_INTE                            *((volatile unsigned int*)(0x42A7A730UL))
#define bM4_PORT_PCR414_DDIS                            *((volatile unsigned int*)(0x42A7A73CUL))
#define bM4_PORT_PFSR414_FSEL0                          *((volatile unsigned int*)(0x42A7A740UL))
#define bM4_PORT_PFSR414_FSEL1                          *((volatile unsigned int*)(0x42A7A744UL))
#define bM4_PORT_PFSR414_FSEL2                          *((volatile unsigned int*)(0x42A7A748UL))
#define bM4_PORT_PFSR414_FSEL3                          *((volatile unsigned int*)(0x42A7A74CUL))
#define bM4_PORT_PFSR414_BFE                            *((volatile unsigned int*)(0x42A7A760UL))
#define bM4_PORT_PCR415_POUT                            *((volatile unsigned int*)(0x42A7A780UL))
#define bM4_PORT_PCR415_POUTE                           *((volatile unsigned int*)(0x42A7A784UL))
#define bM4_PORT_PCR415_NOD                             *((volatile unsigned int*)(0x42A7A788UL))
#define bM4_PORT_PCR415_DRV0                            *((volatile unsigned int*)(0x42A7A790UL))
#define bM4_PORT_PCR415_DRV1                            *((volatile unsigned int*)(0x42A7A794UL))
#define bM4_PORT_PCR415_PUU                             *((volatile unsigned int*)(0x42A7A798UL))
#define bM4_PORT_PCR415_PIN                             *((volatile unsigned int*)(0x42A7A7A0UL))
#define bM4_PORT_PCR415_INVE                            *((volatile unsigned int*)(0x42A7A7A4UL))
#define bM4_PORT_PCR415_INTE                            *((volatile unsigned int*)(0x42A7A7B0UL))
#define bM4_PORT_PCR415_DDIS                            *((volatile unsigned int*)(0x42A7A7BCUL))
#define bM4_PORT_PFSR415_FSEL0                          *((volatile unsigned int*)(0x42A7A7C0UL))
#define bM4_PORT_PFSR415_FSEL1                          *((volatile unsigned int*)(0x42A7A7C4UL))
#define bM4_PORT_PFSR415_FSEL2                          *((volatile unsigned int*)(0x42A7A7C8UL))
#define bM4_PORT_PFSR415_FSEL3                          *((volatile unsigned int*)(0x42A7A7CCUL))
#define bM4_PORT_PFSR415_BFE                            *((volatile unsigned int*)(0x42A7A7E0UL))
#define bM4_PORT_PCR500_POUT                            *((volatile unsigned int*)(0x42A7A800UL))
#define bM4_PORT_PCR500_POUTE                           *((volatile unsigned int*)(0x42A7A804UL))
#define bM4_PORT_PCR500_NOD                             *((volatile unsigned int*)(0x42A7A808UL))
#define bM4_PORT_PCR500_DRV0                            *((volatile unsigned int*)(0x42A7A810UL))
#define bM4_PORT_PCR500_DRV1                            *((volatile unsigned int*)(0x42A7A814UL))
#define bM4_PORT_PCR500_PUU                             *((volatile unsigned int*)(0x42A7A818UL))
#define bM4_PORT_PCR500_PIN                             *((volatile unsigned int*)(0x42A7A820UL))
#define bM4_PORT_PCR500_INVE                            *((volatile unsigned int*)(0x42A7A824UL))
#define bM4_PORT_PCR500_INTE                            *((volatile unsigned int*)(0x42A7A830UL))
#define bM4_PORT_PCR500_DDIS                            *((volatile unsigned int*)(0x42A7A83CUL))
#define bM4_PORT_PFSR500_FSEL0                          *((volatile unsigned int*)(0x42A7A840UL))
#define bM4_PORT_PFSR500_FSEL1                          *((volatile unsigned int*)(0x42A7A844UL))
#define bM4_PORT_PFSR500_FSEL2                          *((volatile unsigned int*)(0x42A7A848UL))
#define bM4_PORT_PFSR500_FSEL3                          *((volatile unsigned int*)(0x42A7A84CUL))
#define bM4_PORT_PFSR500_BFE                            *((volatile unsigned int*)(0x42A7A860UL))
#define bM4_PORT_PCR501_POUT                            *((volatile unsigned int*)(0x42A7A880UL))
#define bM4_PORT_PCR501_POUTE                           *((volatile unsigned int*)(0x42A7A884UL))
#define bM4_PORT_PCR501_NOD                             *((volatile unsigned int*)(0x42A7A888UL))
#define bM4_PORT_PCR501_DRV0                            *((volatile unsigned int*)(0x42A7A890UL))
#define bM4_PORT_PCR501_DRV1                            *((volatile unsigned int*)(0x42A7A894UL))
#define bM4_PORT_PCR501_PUU                             *((volatile unsigned int*)(0x42A7A898UL))
#define bM4_PORT_PCR501_PIN                             *((volatile unsigned int*)(0x42A7A8A0UL))
#define bM4_PORT_PCR501_INVE                            *((volatile unsigned int*)(0x42A7A8A4UL))
#define bM4_PORT_PCR501_INTE                            *((volatile unsigned int*)(0x42A7A8B0UL))
#define bM4_PORT_PCR501_DDIS                            *((volatile unsigned int*)(0x42A7A8BCUL))
#define bM4_PORT_PFSR501_FSEL0                          *((volatile unsigned int*)(0x42A7A8C0UL))
#define bM4_PORT_PFSR501_FSEL1                          *((volatile unsigned int*)(0x42A7A8C4UL))
#define bM4_PORT_PFSR501_FSEL2                          *((volatile unsigned int*)(0x42A7A8C8UL))
#define bM4_PORT_PFSR501_FSEL3                          *((volatile unsigned int*)(0x42A7A8CCUL))
#define bM4_PORT_PFSR501_BFE                            *((volatile unsigned int*)(0x42A7A8E0UL))
#define bM4_PORT_PCR502_POUT                            *((volatile unsigned int*)(0x42A7A900UL))
#define bM4_PORT_PCR502_POUTE                           *((volatile unsigned int*)(0x42A7A904UL))
#define bM4_PORT_PCR502_NOD                             *((volatile unsigned int*)(0x42A7A908UL))
#define bM4_PORT_PCR502_DRV0                            *((volatile unsigned int*)(0x42A7A910UL))
#define bM4_PORT_PCR502_DRV1                            *((volatile unsigned int*)(0x42A7A914UL))
#define bM4_PORT_PCR502_PUU                             *((volatile unsigned int*)(0x42A7A918UL))
#define bM4_PORT_PCR502_PIN                             *((volatile unsigned int*)(0x42A7A920UL))
#define bM4_PORT_PCR502_INVE                            *((volatile unsigned int*)(0x42A7A924UL))
#define bM4_PORT_PCR502_INTE                            *((volatile unsigned int*)(0x42A7A930UL))
#define bM4_PORT_PCR502_DDIS                            *((volatile unsigned int*)(0x42A7A93CUL))
#define bM4_PORT_PFSR502_FSEL0                          *((volatile unsigned int*)(0x42A7A940UL))
#define bM4_PORT_PFSR502_FSEL1                          *((volatile unsigned int*)(0x42A7A944UL))
#define bM4_PORT_PFSR502_FSEL2                          *((volatile unsigned int*)(0x42A7A948UL))
#define bM4_PORT_PFSR502_FSEL3                          *((volatile unsigned int*)(0x42A7A94CUL))
#define bM4_PORT_PFSR502_BFE                            *((volatile unsigned int*)(0x42A7A960UL))
#define bM4_PORT_PCR503_POUT                            *((volatile unsigned int*)(0x42A7A980UL))
#define bM4_PORT_PCR503_POUTE                           *((volatile unsigned int*)(0x42A7A984UL))
#define bM4_PORT_PCR503_NOD                             *((volatile unsigned int*)(0x42A7A988UL))
#define bM4_PORT_PCR503_DRV0                            *((volatile unsigned int*)(0x42A7A990UL))
#define bM4_PORT_PCR503_DRV1                            *((volatile unsigned int*)(0x42A7A994UL))
#define bM4_PORT_PCR503_PUU                             *((volatile unsigned int*)(0x42A7A998UL))
#define bM4_PORT_PCR503_PIN                             *((volatile unsigned int*)(0x42A7A9A0UL))
#define bM4_PORT_PCR503_INVE                            *((volatile unsigned int*)(0x42A7A9A4UL))
#define bM4_PORT_PCR503_INTE                            *((volatile unsigned int*)(0x42A7A9B0UL))
#define bM4_PORT_PCR503_DDIS                            *((volatile unsigned int*)(0x42A7A9BCUL))
#define bM4_PORT_PFSR503_FSEL0                          *((volatile unsigned int*)(0x42A7A9C0UL))
#define bM4_PORT_PFSR503_FSEL1                          *((volatile unsigned int*)(0x42A7A9C4UL))
#define bM4_PORT_PFSR503_FSEL2                          *((volatile unsigned int*)(0x42A7A9C8UL))
#define bM4_PORT_PFSR503_FSEL3                          *((volatile unsigned int*)(0x42A7A9CCUL))
#define bM4_PORT_PFSR503_BFE                            *((volatile unsigned int*)(0x42A7A9E0UL))
#define bM4_PORT_PCR504_POUT                            *((volatile unsigned int*)(0x42A7AA00UL))
#define bM4_PORT_PCR504_POUTE                           *((volatile unsigned int*)(0x42A7AA04UL))
#define bM4_PORT_PCR504_NOD                             *((volatile unsigned int*)(0x42A7AA08UL))
#define bM4_PORT_PCR504_DRV0                            *((volatile unsigned int*)(0x42A7AA10UL))
#define bM4_PORT_PCR504_DRV1                            *((volatile unsigned int*)(0x42A7AA14UL))
#define bM4_PORT_PCR504_PUU                             *((volatile unsigned int*)(0x42A7AA18UL))
#define bM4_PORT_PCR504_PIN                             *((volatile unsigned int*)(0x42A7AA20UL))
#define bM4_PORT_PCR504_INVE                            *((volatile unsigned int*)(0x42A7AA24UL))
#define bM4_PORT_PCR504_INTE                            *((volatile unsigned int*)(0x42A7AA30UL))
#define bM4_PORT_PCR504_DDIS                            *((volatile unsigned int*)(0x42A7AA3CUL))
#define bM4_PORT_PFSR504_FSEL0                          *((volatile unsigned int*)(0x42A7AA40UL))
#define bM4_PORT_PFSR504_FSEL1                          *((volatile unsigned int*)(0x42A7AA44UL))
#define bM4_PORT_PFSR504_FSEL2                          *((volatile unsigned int*)(0x42A7AA48UL))
#define bM4_PORT_PFSR504_FSEL3                          *((volatile unsigned int*)(0x42A7AA4CUL))
#define bM4_PORT_PFSR504_BFE                            *((volatile unsigned int*)(0x42A7AA60UL))
#define bM4_PORT_PCR505_POUT                            *((volatile unsigned int*)(0x42A7AA80UL))
#define bM4_PORT_PCR505_POUTE                           *((volatile unsigned int*)(0x42A7AA84UL))
#define bM4_PORT_PCR505_NOD                             *((volatile unsigned int*)(0x42A7AA88UL))
#define bM4_PORT_PCR505_DRV0                            *((volatile unsigned int*)(0x42A7AA90UL))
#define bM4_PORT_PCR505_DRV1                            *((volatile unsigned int*)(0x42A7AA94UL))
#define bM4_PORT_PCR505_PUU                             *((volatile unsigned int*)(0x42A7AA98UL))
#define bM4_PORT_PCR505_PIN                             *((volatile unsigned int*)(0x42A7AAA0UL))
#define bM4_PORT_PCR505_INVE                            *((volatile unsigned int*)(0x42A7AAA4UL))
#define bM4_PORT_PCR505_INTE                            *((volatile unsigned int*)(0x42A7AAB0UL))
#define bM4_PORT_PCR505_DDIS                            *((volatile unsigned int*)(0x42A7AABCUL))
#define bM4_PORT_PFSR505_FSEL0                          *((volatile unsigned int*)(0x42A7AAC0UL))
#define bM4_PORT_PFSR505_FSEL1                          *((volatile unsigned int*)(0x42A7AAC4UL))
#define bM4_PORT_PFSR505_FSEL2                          *((volatile unsigned int*)(0x42A7AAC8UL))
#define bM4_PORT_PFSR505_FSEL3                          *((volatile unsigned int*)(0x42A7AACCUL))
#define bM4_PORT_PFSR505_BFE                            *((volatile unsigned int*)(0x42A7AAE0UL))
#define bM4_PORT_PCR506_POUT                            *((volatile unsigned int*)(0x42A7AB00UL))
#define bM4_PORT_PCR506_POUTE                           *((volatile unsigned int*)(0x42A7AB04UL))
#define bM4_PORT_PCR506_NOD                             *((volatile unsigned int*)(0x42A7AB08UL))
#define bM4_PORT_PCR506_DRV0                            *((volatile unsigned int*)(0x42A7AB10UL))
#define bM4_PORT_PCR506_DRV1                            *((volatile unsigned int*)(0x42A7AB14UL))
#define bM4_PORT_PCR506_PUU                             *((volatile unsigned int*)(0x42A7AB18UL))
#define bM4_PORT_PCR506_PIN                             *((volatile unsigned int*)(0x42A7AB20UL))
#define bM4_PORT_PCR506_INVE                            *((volatile unsigned int*)(0x42A7AB24UL))
#define bM4_PORT_PCR506_INTE                            *((volatile unsigned int*)(0x42A7AB30UL))
#define bM4_PORT_PCR506_DDIS                            *((volatile unsigned int*)(0x42A7AB3CUL))
#define bM4_PORT_PFSR506_FSEL0                          *((volatile unsigned int*)(0x42A7AB40UL))
#define bM4_PORT_PFSR506_FSEL1                          *((volatile unsigned int*)(0x42A7AB44UL))
#define bM4_PORT_PFSR506_FSEL2                          *((volatile unsigned int*)(0x42A7AB48UL))
#define bM4_PORT_PFSR506_FSEL3                          *((volatile unsigned int*)(0x42A7AB4CUL))
#define bM4_PORT_PFSR506_BFE                            *((volatile unsigned int*)(0x42A7AB60UL))
#define bM4_PORT_PCR507_POUT                            *((volatile unsigned int*)(0x42A7AB80UL))
#define bM4_PORT_PCR507_POUTE                           *((volatile unsigned int*)(0x42A7AB84UL))
#define bM4_PORT_PCR507_NOD                             *((volatile unsigned int*)(0x42A7AB88UL))
#define bM4_PORT_PCR507_DRV0                            *((volatile unsigned int*)(0x42A7AB90UL))
#define bM4_PORT_PCR507_DRV1                            *((volatile unsigned int*)(0x42A7AB94UL))
#define bM4_PORT_PCR507_PUU                             *((volatile unsigned int*)(0x42A7AB98UL))
#define bM4_PORT_PCR507_PIN                             *((volatile unsigned int*)(0x42A7ABA0UL))
#define bM4_PORT_PCR507_INVE                            *((volatile unsigned int*)(0x42A7ABA4UL))
#define bM4_PORT_PCR507_INTE                            *((volatile unsigned int*)(0x42A7ABB0UL))
#define bM4_PORT_PCR507_DDIS                            *((volatile unsigned int*)(0x42A7ABBCUL))
#define bM4_PORT_PFSR507_FSEL0                          *((volatile unsigned int*)(0x42A7ABC0UL))
#define bM4_PORT_PFSR507_FSEL1                          *((volatile unsigned int*)(0x42A7ABC4UL))
#define bM4_PORT_PFSR507_FSEL2                          *((volatile unsigned int*)(0x42A7ABC8UL))
#define bM4_PORT_PFSR507_FSEL3                          *((volatile unsigned int*)(0x42A7ABCCUL))
#define bM4_PORT_PFSR507_BFE                            *((volatile unsigned int*)(0x42A7ABE0UL))
#define bM4_PORT_PCR508_POUT                            *((volatile unsigned int*)(0x42A7AC00UL))
#define bM4_PORT_PCR508_POUTE                           *((volatile unsigned int*)(0x42A7AC04UL))
#define bM4_PORT_PCR508_NOD                             *((volatile unsigned int*)(0x42A7AC08UL))
#define bM4_PORT_PCR508_DRV0                            *((volatile unsigned int*)(0x42A7AC10UL))
#define bM4_PORT_PCR508_DRV1                            *((volatile unsigned int*)(0x42A7AC14UL))
#define bM4_PORT_PCR508_PUU                             *((volatile unsigned int*)(0x42A7AC18UL))
#define bM4_PORT_PCR508_PIN                             *((volatile unsigned int*)(0x42A7AC20UL))
#define bM4_PORT_PCR508_INVE                            *((volatile unsigned int*)(0x42A7AC24UL))
#define bM4_PORT_PCR508_INTE                            *((volatile unsigned int*)(0x42A7AC30UL))
#define bM4_PORT_PCR508_DDIS                            *((volatile unsigned int*)(0x42A7AC3CUL))
#define bM4_PORT_PFSR508_FSEL0                          *((volatile unsigned int*)(0x42A7AC40UL))
#define bM4_PORT_PFSR508_FSEL1                          *((volatile unsigned int*)(0x42A7AC44UL))
#define bM4_PORT_PFSR508_FSEL2                          *((volatile unsigned int*)(0x42A7AC48UL))
#define bM4_PORT_PFSR508_FSEL3                          *((volatile unsigned int*)(0x42A7AC4CUL))
#define bM4_PORT_PFSR508_BFE                            *((volatile unsigned int*)(0x42A7AC60UL))
#define bM4_PORT_PCR509_POUT                            *((volatile unsigned int*)(0x42A7AC80UL))
#define bM4_PORT_PCR509_POUTE                           *((volatile unsigned int*)(0x42A7AC84UL))
#define bM4_PORT_PCR509_NOD                             *((volatile unsigned int*)(0x42A7AC88UL))
#define bM4_PORT_PCR509_DRV0                            *((volatile unsigned int*)(0x42A7AC90UL))
#define bM4_PORT_PCR509_DRV1                            *((volatile unsigned int*)(0x42A7AC94UL))
#define bM4_PORT_PCR509_PUU                             *((volatile unsigned int*)(0x42A7AC98UL))
#define bM4_PORT_PCR509_PIN                             *((volatile unsigned int*)(0x42A7ACA0UL))
#define bM4_PORT_PCR509_INVE                            *((volatile unsigned int*)(0x42A7ACA4UL))
#define bM4_PORT_PCR509_INTE                            *((volatile unsigned int*)(0x42A7ACB0UL))
#define bM4_PORT_PCR509_DDIS                            *((volatile unsigned int*)(0x42A7ACBCUL))
#define bM4_PORT_PFSR509_FSEL0                          *((volatile unsigned int*)(0x42A7ACC0UL))
#define bM4_PORT_PFSR509_FSEL1                          *((volatile unsigned int*)(0x42A7ACC4UL))
#define bM4_PORT_PFSR509_FSEL2                          *((volatile unsigned int*)(0x42A7ACC8UL))
#define bM4_PORT_PFSR509_FSEL3                          *((volatile unsigned int*)(0x42A7ACCCUL))
#define bM4_PORT_PFSR509_BFE                            *((volatile unsigned int*)(0x42A7ACE0UL))
#define bM4_PORT_PCR510_POUT                            *((volatile unsigned int*)(0x42A7AD00UL))
#define bM4_PORT_PCR510_POUTE                           *((volatile unsigned int*)(0x42A7AD04UL))
#define bM4_PORT_PCR510_NOD                             *((volatile unsigned int*)(0x42A7AD08UL))
#define bM4_PORT_PCR510_DRV0                            *((volatile unsigned int*)(0x42A7AD10UL))
#define bM4_PORT_PCR510_DRV1                            *((volatile unsigned int*)(0x42A7AD14UL))
#define bM4_PORT_PCR510_PUU                             *((volatile unsigned int*)(0x42A7AD18UL))
#define bM4_PORT_PCR510_PIN                             *((volatile unsigned int*)(0x42A7AD20UL))
#define bM4_PORT_PCR510_INVE                            *((volatile unsigned int*)(0x42A7AD24UL))
#define bM4_PORT_PCR510_INTE                            *((volatile unsigned int*)(0x42A7AD30UL))
#define bM4_PORT_PCR510_DDIS                            *((volatile unsigned int*)(0x42A7AD3CUL))
#define bM4_PORT_PFSR510_FSEL0                          *((volatile unsigned int*)(0x42A7AD40UL))
#define bM4_PORT_PFSR510_FSEL1                          *((volatile unsigned int*)(0x42A7AD44UL))
#define bM4_PORT_PFSR510_FSEL2                          *((volatile unsigned int*)(0x42A7AD48UL))
#define bM4_PORT_PFSR510_FSEL3                          *((volatile unsigned int*)(0x42A7AD4CUL))
#define bM4_PORT_PFSR510_BFE                            *((volatile unsigned int*)(0x42A7AD60UL))
#define bM4_PORT_PCR511_POUT                            *((volatile unsigned int*)(0x42A7AD80UL))
#define bM4_PORT_PCR511_POUTE                           *((volatile unsigned int*)(0x42A7AD84UL))
#define bM4_PORT_PCR511_NOD                             *((volatile unsigned int*)(0x42A7AD88UL))
#define bM4_PORT_PCR511_DRV0                            *((volatile unsigned int*)(0x42A7AD90UL))
#define bM4_PORT_PCR511_DRV1                            *((volatile unsigned int*)(0x42A7AD94UL))
#define bM4_PORT_PCR511_PUU                             *((volatile unsigned int*)(0x42A7AD98UL))
#define bM4_PORT_PCR511_PIN                             *((volatile unsigned int*)(0x42A7ADA0UL))
#define bM4_PORT_PCR511_INVE                            *((volatile unsigned int*)(0x42A7ADA4UL))
#define bM4_PORT_PCR511_INTE                            *((volatile unsigned int*)(0x42A7ADB0UL))
#define bM4_PORT_PCR511_DDIS                            *((volatile unsigned int*)(0x42A7ADBCUL))
#define bM4_PORT_PFSR511_FSEL0                          *((volatile unsigned int*)(0x42A7ADC0UL))
#define bM4_PORT_PFSR511_FSEL1                          *((volatile unsigned int*)(0x42A7ADC4UL))
#define bM4_PORT_PFSR511_FSEL2                          *((volatile unsigned int*)(0x42A7ADC8UL))
#define bM4_PORT_PFSR511_FSEL3                          *((volatile unsigned int*)(0x42A7ADCCUL))
#define bM4_PORT_PFSR511_BFE                            *((volatile unsigned int*)(0x42A7ADE0UL))
#define bM4_PORT_PCR512_POUT                            *((volatile unsigned int*)(0x42A7AE00UL))
#define bM4_PORT_PCR512_POUTE                           *((volatile unsigned int*)(0x42A7AE04UL))
#define bM4_PORT_PCR512_NOD                             *((volatile unsigned int*)(0x42A7AE08UL))
#define bM4_PORT_PCR512_DRV0                            *((volatile unsigned int*)(0x42A7AE10UL))
#define bM4_PORT_PCR512_DRV1                            *((volatile unsigned int*)(0x42A7AE14UL))
#define bM4_PORT_PCR512_PUU                             *((volatile unsigned int*)(0x42A7AE18UL))
#define bM4_PORT_PCR512_PIN                             *((volatile unsigned int*)(0x42A7AE20UL))
#define bM4_PORT_PCR512_INVE                            *((volatile unsigned int*)(0x42A7AE24UL))
#define bM4_PORT_PCR512_INTE                            *((volatile unsigned int*)(0x42A7AE30UL))
#define bM4_PORT_PCR512_DDIS                            *((volatile unsigned int*)(0x42A7AE3CUL))
#define bM4_PORT_PFSR512_FSEL0                          *((volatile unsigned int*)(0x42A7AE40UL))
#define bM4_PORT_PFSR512_FSEL1                          *((volatile unsigned int*)(0x42A7AE44UL))
#define bM4_PORT_PFSR512_FSEL2                          *((volatile unsigned int*)(0x42A7AE48UL))
#define bM4_PORT_PFSR512_FSEL3                          *((volatile unsigned int*)(0x42A7AE4CUL))
#define bM4_PORT_PFSR512_BFE                            *((volatile unsigned int*)(0x42A7AE60UL))
#define bM4_PORT_PCR513_POUT                            *((volatile unsigned int*)(0x42A7AE80UL))
#define bM4_PORT_PCR513_POUTE                           *((volatile unsigned int*)(0x42A7AE84UL))
#define bM4_PORT_PCR513_NOD                             *((volatile unsigned int*)(0x42A7AE88UL))
#define bM4_PORT_PCR513_DRV0                            *((volatile unsigned int*)(0x42A7AE90UL))
