RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_PORT_PCR513_DRV1                            *((volatile unsigned int*)(0x42A7AE94UL))
#define bM4_PORT_PCR513_PUU                             *((volatile unsigned int*)(0x42A7AE98UL))
#define bM4_PORT_PCR513_PIN                             *((volatile unsigned int*)(0x42A7AEA0UL))
#define bM4_PORT_PCR513_INVE                            *((volatile unsigned int*)(0x42A7AEA4UL))
#define bM4_PORT_PCR513_INTE                            *((volatile unsigned int*)(0x42A7AEB0UL))
#define bM4_PORT_PCR513_DDIS                            *((volatile unsigned int*)(0x42A7AEBCUL))
#define bM4_PORT_PFSR513_FSEL0                          *((volatile unsigned int*)(0x42A7AEC0UL))
#define bM4_PORT_PFSR513_FSEL1                          *((volatile unsigned int*)(0x42A7AEC4UL))
#define bM4_PORT_PFSR513_FSEL2                          *((volatile unsigned int*)(0x42A7AEC8UL))
#define bM4_PORT_PFSR513_FSEL3                          *((volatile unsigned int*)(0x42A7AECCUL))
#define bM4_PORT_PFSR513_BFE                            *((volatile unsigned int*)(0x42A7AEE0UL))
#define bM4_PORT_PCR514_POUT                            *((volatile unsigned int*)(0x42A7AF00UL))
#define bM4_PORT_PCR514_POUTE                           *((volatile unsigned int*)(0x42A7AF04UL))
#define bM4_PORT_PCR514_NOD                             *((volatile unsigned int*)(0x42A7AF08UL))
#define bM4_PORT_PCR514_DRV0                            *((volatile unsigned int*)(0x42A7AF10UL))
#define bM4_PORT_PCR514_DRV1                            *((volatile unsigned int*)(0x42A7AF14UL))
#define bM4_PORT_PCR514_PUU                             *((volatile unsigned int*)(0x42A7AF18UL))
#define bM4_PORT_PCR514_PIN                             *((volatile unsigned int*)(0x42A7AF20UL))
#define bM4_PORT_PCR514_INVE                            *((volatile unsigned int*)(0x42A7AF24UL))
#define bM4_PORT_PCR514_INTE                            *((volatile unsigned int*)(0x42A7AF30UL))
#define bM4_PORT_PCR514_DDIS                            *((volatile unsigned int*)(0x42A7AF3CUL))
#define bM4_PORT_PFSR514_FSEL0                          *((volatile unsigned int*)(0x42A7AF40UL))
#define bM4_PORT_PFSR514_FSEL1                          *((volatile unsigned int*)(0x42A7AF44UL))
#define bM4_PORT_PFSR514_FSEL2                          *((volatile unsigned int*)(0x42A7AF48UL))
#define bM4_PORT_PFSR514_FSEL3                          *((volatile unsigned int*)(0x42A7AF4CUL))
#define bM4_PORT_PFSR514_BFE                            *((volatile unsigned int*)(0x42A7AF60UL))
#define bM4_PORT_PCR515_POUT                            *((volatile unsigned int*)(0x42A7AF80UL))
#define bM4_PORT_PCR515_POUTE                           *((volatile unsigned int*)(0x42A7AF84UL))
#define bM4_PORT_PCR515_NOD                             *((volatile unsigned int*)(0x42A7AF88UL))
#define bM4_PORT_PCR515_DRV0                            *((volatile unsigned int*)(0x42A7AF90UL))
#define bM4_PORT_PCR515_DRV1                            *((volatile unsigned int*)(0x42A7AF94UL))
#define bM4_PORT_PCR515_PUU                             *((volatile unsigned int*)(0x42A7AF98UL))
#define bM4_PORT_PCR515_PIN                             *((volatile unsigned int*)(0x42A7AFA0UL))
#define bM4_PORT_PCR515_INVE                            *((volatile unsigned int*)(0x42A7AFA4UL))
#define bM4_PORT_PCR515_INTE                            *((volatile unsigned int*)(0x42A7AFB0UL))
#define bM4_PORT_PCR515_DDIS                            *((volatile unsigned int*)(0x42A7AFBCUL))
#define bM4_PORT_PFSR515_FSEL0                          *((volatile unsigned int*)(0x42A7AFC0UL))
#define bM4_PORT_PFSR515_FSEL1                          *((volatile unsigned int*)(0x42A7AFC4UL))
#define bM4_PORT_PFSR515_FSEL2                          *((volatile unsigned int*)(0x42A7AFC8UL))
#define bM4_PORT_PFSR515_FSEL3                          *((volatile unsigned int*)(0x42A7AFCCUL))
#define bM4_PORT_PFSR515_BFE                            *((volatile unsigned int*)(0x42A7AFE0UL))
#define bM4_PORT_PCR600_POUT                            *((volatile unsigned int*)(0x42A7B000UL))
#define bM4_PORT_PCR600_POUTE                           *((volatile unsigned int*)(0x42A7B004UL))
#define bM4_PORT_PCR600_NOD                             *((volatile unsigned int*)(0x42A7B008UL))
#define bM4_PORT_PCR600_DRV0                            *((volatile unsigned int*)(0x42A7B010UL))
#define bM4_PORT_PCR600_DRV1                            *((volatile unsigned int*)(0x42A7B014UL))
#define bM4_PORT_PCR600_PUU                             *((volatile unsigned int*)(0x42A7B018UL))
#define bM4_PORT_PCR600_PIN                             *((volatile unsigned int*)(0x42A7B020UL))
#define bM4_PORT_PCR600_INVE                            *((volatile unsigned int*)(0x42A7B024UL))
#define bM4_PORT_PCR600_INTE                            *((volatile unsigned int*)(0x42A7B030UL))
#define bM4_PORT_PCR600_DDIS                            *((volatile unsigned int*)(0x42A7B03CUL))
#define bM4_PORT_PFSR600_FSEL0                          *((volatile unsigned int*)(0x42A7B040UL))
#define bM4_PORT_PFSR600_FSEL1                          *((volatile unsigned int*)(0x42A7B044UL))
#define bM4_PORT_PFSR600_FSEL2                          *((volatile unsigned int*)(0x42A7B048UL))
#define bM4_PORT_PFSR600_FSEL3                          *((volatile unsigned int*)(0x42A7B04CUL))
#define bM4_PORT_PFSR600_BFE                            *((volatile unsigned int*)(0x42A7B060UL))
#define bM4_PORT_PCR601_POUT                            *((volatile unsigned int*)(0x42A7B080UL))
#define bM4_PORT_PCR601_POUTE                           *((volatile unsigned int*)(0x42A7B084UL))
#define bM4_PORT_PCR601_NOD                             *((volatile unsigned int*)(0x42A7B088UL))
#define bM4_PORT_PCR601_DRV0                            *((volatile unsigned int*)(0x42A7B090UL))
#define bM4_PORT_PCR601_DRV1                            *((volatile unsigned int*)(0x42A7B094UL))
#define bM4_PORT_PCR601_PUU                             *((volatile unsigned int*)(0x42A7B098UL))
#define bM4_PORT_PCR601_PIN                             *((volatile unsigned int*)(0x42A7B0A0UL))
#define bM4_PORT_PCR601_INVE                            *((volatile unsigned int*)(0x42A7B0A4UL))
#define bM4_PORT_PCR601_INTE                            *((volatile unsigned int*)(0x42A7B0B0UL))
#define bM4_PORT_PCR601_DDIS                            *((volatile unsigned int*)(0x42A7B0BCUL))
#define bM4_PORT_PFSR601_FSEL0                          *((volatile unsigned int*)(0x42A7B0C0UL))
#define bM4_PORT_PFSR601_FSEL1                          *((volatile unsigned int*)(0x42A7B0C4UL))
#define bM4_PORT_PFSR601_FSEL2                          *((volatile unsigned int*)(0x42A7B0C8UL))
#define bM4_PORT_PFSR601_FSEL3                          *((volatile unsigned int*)(0x42A7B0CCUL))
#define bM4_PORT_PFSR601_BFE                            *((volatile unsigned int*)(0x42A7B0E0UL))
#define bM4_PORT_PCR602_POUT                            *((volatile unsigned int*)(0x42A7B100UL))
#define bM4_PORT_PCR602_POUTE                           *((volatile unsigned int*)(0x42A7B104UL))
#define bM4_PORT_PCR602_NOD                             *((volatile unsigned int*)(0x42A7B108UL))
#define bM4_PORT_PCR602_DRV0                            *((volatile unsigned int*)(0x42A7B110UL))
#define bM4_PORT_PCR602_DRV1                            *((volatile unsigned int*)(0x42A7B114UL))
#define bM4_PORT_PCR602_PUU                             *((volatile unsigned int*)(0x42A7B118UL))
#define bM4_PORT_PCR602_PIN                             *((volatile unsigned int*)(0x42A7B120UL))
#define bM4_PORT_PCR602_INVE                            *((volatile unsigned int*)(0x42A7B124UL))
#define bM4_PORT_PCR602_INTE                            *((volatile unsigned int*)(0x42A7B130UL))
#define bM4_PORT_PCR602_DDIS                            *((volatile unsigned int*)(0x42A7B13CUL))
#define bM4_PORT_PFSR602_FSEL0                          *((volatile unsigned int*)(0x42A7B140UL))
#define bM4_PORT_PFSR602_FSEL1                          *((volatile unsigned int*)(0x42A7B144UL))
#define bM4_PORT_PFSR602_FSEL2                          *((volatile unsigned int*)(0x42A7B148UL))
#define bM4_PORT_PFSR602_FSEL3                          *((volatile unsigned int*)(0x42A7B14CUL))
#define bM4_PORT_PFSR602_BFE                            *((volatile unsigned int*)(0x42A7B160UL))
#define bM4_PORT_PCR603_POUT                            *((volatile unsigned int*)(0x42A7B180UL))
#define bM4_PORT_PCR603_POUTE                           *((volatile unsigned int*)(0x42A7B184UL))
#define bM4_PORT_PCR603_NOD                             *((volatile unsigned int*)(0x42A7B188UL))
#define bM4_PORT_PCR603_DRV0                            *((volatile unsigned int*)(0x42A7B190UL))
#define bM4_PORT_PCR603_DRV1                            *((volatile unsigned int*)(0x42A7B194UL))
#define bM4_PORT_PCR603_PUU                             *((volatile unsigned int*)(0x42A7B198UL))
#define bM4_PORT_PCR603_PIN                             *((volatile unsigned int*)(0x42A7B1A0UL))
#define bM4_PORT_PCR603_INVE                            *((volatile unsigned int*)(0x42A7B1A4UL))
#define bM4_PORT_PCR603_INTE                            *((volatile unsigned int*)(0x42A7B1B0UL))
#define bM4_PORT_PCR603_DDIS                            *((volatile unsigned int*)(0x42A7B1BCUL))
#define bM4_PORT_PFSR603_FSEL0                          *((volatile unsigned int*)(0x42A7B1C0UL))
#define bM4_PORT_PFSR603_FSEL1                          *((volatile unsigned int*)(0x42A7B1C4UL))
#define bM4_PORT_PFSR603_FSEL2                          *((volatile unsigned int*)(0x42A7B1C8UL))
#define bM4_PORT_PFSR603_FSEL3                          *((volatile unsigned int*)(0x42A7B1CCUL))
#define bM4_PORT_PFSR603_BFE                            *((volatile unsigned int*)(0x42A7B1E0UL))
#define bM4_PORT_PCR604_POUT                            *((volatile unsigned int*)(0x42A7B200UL))
#define bM4_PORT_PCR604_POUTE                           *((volatile unsigned int*)(0x42A7B204UL))
#define bM4_PORT_PCR604_NOD                             *((volatile unsigned int*)(0x42A7B208UL))
#define bM4_PORT_PCR604_DRV0                            *((volatile unsigned int*)(0x42A7B210UL))
#define bM4_PORT_PCR604_DRV1                            *((volatile unsigned int*)(0x42A7B214UL))
#define bM4_PORT_PCR604_PUU                             *((volatile unsigned int*)(0x42A7B218UL))
#define bM4_PORT_PCR604_PIN                             *((volatile unsigned int*)(0x42A7B220UL))
#define bM4_PORT_PCR604_INVE                            *((volatile unsigned int*)(0x42A7B224UL))
#define bM4_PORT_PCR604_INTE                            *((volatile unsigned int*)(0x42A7B230UL))
#define bM4_PORT_PCR604_DDIS                            *((volatile unsigned int*)(0x42A7B23CUL))
#define bM4_PORT_PFSR604_FSEL0                          *((volatile unsigned int*)(0x42A7B240UL))
#define bM4_PORT_PFSR604_FSEL1                          *((volatile unsigned int*)(0x42A7B244UL))
#define bM4_PORT_PFSR604_FSEL2                          *((volatile unsigned int*)(0x42A7B248UL))
#define bM4_PORT_PFSR604_FSEL3                          *((volatile unsigned int*)(0x42A7B24CUL))
#define bM4_PORT_PFSR604_BFE                            *((volatile unsigned int*)(0x42A7B260UL))
#define bM4_PORT_PCR605_POUT                            *((volatile unsigned int*)(0x42A7B280UL))
#define bM4_PORT_PCR605_POUTE                           *((volatile unsigned int*)(0x42A7B284UL))
#define bM4_PORT_PCR605_NOD                             *((volatile unsigned int*)(0x42A7B288UL))
#define bM4_PORT_PCR605_DRV0                            *((volatile unsigned int*)(0x42A7B290UL))
#define bM4_PORT_PCR605_DRV1                            *((volatile unsigned int*)(0x42A7B294UL))
#define bM4_PORT_PCR605_PUU                             *((volatile unsigned int*)(0x42A7B298UL))
#define bM4_PORT_PCR605_PIN                             *((volatile unsigned int*)(0x42A7B2A0UL))
#define bM4_PORT_PCR605_INVE                            *((volatile unsigned int*)(0x42A7B2A4UL))
#define bM4_PORT_PCR605_INTE                            *((volatile unsigned int*)(0x42A7B2B0UL))
#define bM4_PORT_PCR605_DDIS                            *((volatile unsigned int*)(0x42A7B2BCUL))
#define bM4_PORT_PFSR605_FSEL0                          *((volatile unsigned int*)(0x42A7B2C0UL))
#define bM4_PORT_PFSR605_FSEL1                          *((volatile unsigned int*)(0x42A7B2C4UL))
#define bM4_PORT_PFSR605_FSEL2                          *((volatile unsigned int*)(0x42A7B2C8UL))
#define bM4_PORT_PFSR605_FSEL3                          *((volatile unsigned int*)(0x42A7B2CCUL))
#define bM4_PORT_PFSR605_BFE                            *((volatile unsigned int*)(0x42A7B2E0UL))
#define bM4_PORT_PCR606_POUT                            *((volatile unsigned int*)(0x42A7B300UL))
#define bM4_PORT_PCR606_POUTE                           *((volatile unsigned int*)(0x42A7B304UL))
#define bM4_PORT_PCR606_NOD                             *((volatile unsigned int*)(0x42A7B308UL))
#define bM4_PORT_PCR606_DRV0                            *((volatile unsigned int*)(0x42A7B310UL))
#define bM4_PORT_PCR606_DRV1                            *((volatile unsigned int*)(0x42A7B314UL))
#define bM4_PORT_PCR606_PUU                             *((volatile unsigned int*)(0x42A7B318UL))
#define bM4_PORT_PCR606_PIN                             *((volatile unsigned int*)(0x42A7B320UL))
#define bM4_PORT_PCR606_INVE                            *((volatile unsigned int*)(0x42A7B324UL))
#define bM4_PORT_PCR606_INTE                            *((volatile unsigned int*)(0x42A7B330UL))
#define bM4_PORT_PCR606_DDIS                            *((volatile unsigned int*)(0x42A7B33CUL))
#define bM4_PORT_PFSR606_FSEL0                          *((volatile unsigned int*)(0x42A7B340UL))
#define bM4_PORT_PFSR606_FSEL1                          *((volatile unsigned int*)(0x42A7B344UL))
#define bM4_PORT_PFSR606_FSEL2                          *((volatile unsigned int*)(0x42A7B348UL))
#define bM4_PORT_PFSR606_FSEL3                          *((volatile unsigned int*)(0x42A7B34CUL))
#define bM4_PORT_PFSR606_BFE                            *((volatile unsigned int*)(0x42A7B360UL))
#define bM4_PORT_PCR607_POUT                            *((volatile unsigned int*)(0x42A7B380UL))
#define bM4_PORT_PCR607_POUTE                           *((volatile unsigned int*)(0x42A7B384UL))
#define bM4_PORT_PCR607_NOD                             *((volatile unsigned int*)(0x42A7B388UL))
#define bM4_PORT_PCR607_DRV0                            *((volatile unsigned int*)(0x42A7B390UL))
#define bM4_PORT_PCR607_DRV1                            *((volatile unsigned int*)(0x42A7B394UL))
#define bM4_PORT_PCR607_PUU                             *((volatile unsigned int*)(0x42A7B398UL))
#define bM4_PORT_PCR607_PIN                             *((volatile unsigned int*)(0x42A7B3A0UL))
#define bM4_PORT_PCR607_INVE                            *((volatile unsigned int*)(0x42A7B3A4UL))
#define bM4_PORT_PCR607_INTE                            *((volatile unsigned int*)(0x42A7B3B0UL))
#define bM4_PORT_PCR607_DDIS                            *((volatile unsigned int*)(0x42A7B3BCUL))
#define bM4_PORT_PFSR607_FSEL0                          *((volatile unsigned int*)(0x42A7B3C0UL))
#define bM4_PORT_PFSR607_FSEL1                          *((volatile unsigned int*)(0x42A7B3C4UL))
#define bM4_PORT_PFSR607_FSEL2                          *((volatile unsigned int*)(0x42A7B3C8UL))
#define bM4_PORT_PFSR607_FSEL3                          *((volatile unsigned int*)(0x42A7B3CCUL))
#define bM4_PORT_PFSR607_BFE                            *((volatile unsigned int*)(0x42A7B3E0UL))
#define bM4_PORT_PCR608_POUT                            *((volatile unsigned int*)(0x42A7B400UL))
#define bM4_PORT_PCR608_POUTE                           *((volatile unsigned int*)(0x42A7B404UL))
#define bM4_PORT_PCR608_NOD                             *((volatile unsigned int*)(0x42A7B408UL))
#define bM4_PORT_PCR608_DRV0                            *((volatile unsigned int*)(0x42A7B410UL))
#define bM4_PORT_PCR608_DRV1                            *((volatile unsigned int*)(0x42A7B414UL))
#define bM4_PORT_PCR608_PUU                             *((volatile unsigned int*)(0x42A7B418UL))
#define bM4_PORT_PCR608_PIN                             *((volatile unsigned int*)(0x42A7B420UL))
#define bM4_PORT_PCR608_INVE                            *((volatile unsigned int*)(0x42A7B424UL))
#define bM4_PORT_PCR608_INTE                            *((volatile unsigned int*)(0x42A7B430UL))
#define bM4_PORT_PCR608_DDIS                            *((volatile unsigned int*)(0x42A7B43CUL))
#define bM4_PORT_PFSR608_FSEL0                          *((volatile unsigned int*)(0x42A7B440UL))
#define bM4_PORT_PFSR608_FSEL1                          *((volatile unsigned int*)(0x42A7B444UL))
#define bM4_PORT_PFSR608_FSEL2                          *((volatile unsigned int*)(0x42A7B448UL))
#define bM4_PORT_PFSR608_FSEL3                          *((volatile unsigned int*)(0x42A7B44CUL))
#define bM4_PORT_PFSR608_BFE                            *((volatile unsigned int*)(0x42A7B460UL))
#define bM4_PORT_PCR609_POUT                            *((volatile unsigned int*)(0x42A7B480UL))
#define bM4_PORT_PCR609_POUTE                           *((volatile unsigned int*)(0x42A7B484UL))
#define bM4_PORT_PCR609_NOD                             *((volatile unsigned int*)(0x42A7B488UL))
#define bM4_PORT_PCR609_DRV0                            *((volatile unsigned int*)(0x42A7B490UL))
#define bM4_PORT_PCR609_DRV1                            *((volatile unsigned int*)(0x42A7B494UL))
#define bM4_PORT_PCR609_PUU                             *((volatile unsigned int*)(0x42A7B498UL))
#define bM4_PORT_PCR609_PIN                             *((volatile unsigned int*)(0x42A7B4A0UL))
#define bM4_PORT_PCR609_INVE                            *((volatile unsigned int*)(0x42A7B4A4UL))
#define bM4_PORT_PCR609_INTE                            *((volatile unsigned int*)(0x42A7B4B0UL))
#define bM4_PORT_PCR609_DDIS                            *((volatile unsigned int*)(0x42A7B4BCUL))
#define bM4_PORT_PFSR609_FSEL0                          *((volatile unsigned int*)(0x42A7B4C0UL))
#define bM4_PORT_PFSR609_FSEL1                          *((volatile unsigned int*)(0x42A7B4C4UL))
#define bM4_PORT_PFSR609_FSEL2                          *((volatile unsigned int*)(0x42A7B4C8UL))
#define bM4_PORT_PFSR609_FSEL3                          *((volatile unsigned int*)(0x42A7B4CCUL))
#define bM4_PORT_PFSR609_BFE                            *((volatile unsigned int*)(0x42A7B4E0UL))
#define bM4_PORT_PCR610_POUT                            *((volatile unsigned int*)(0x42A7B500UL))
#define bM4_PORT_PCR610_POUTE                           *((volatile unsigned int*)(0x42A7B504UL))
#define bM4_PORT_PCR610_NOD                             *((volatile unsigned int*)(0x42A7B508UL))
#define bM4_PORT_PCR610_DRV0                            *((volatile unsigned int*)(0x42A7B510UL))
#define bM4_PORT_PCR610_DRV1                            *((volatile unsigned int*)(0x42A7B514UL))
#define bM4_PORT_PCR610_PUU                             *((volatile unsigned int*)(0x42A7B518UL))
#define bM4_PORT_PCR610_PIN                             *((volatile unsigned int*)(0x42A7B520UL))
#define bM4_PORT_PCR610_INVE                            *((volatile unsigned int*)(0x42A7B524UL))
#define bM4_PORT_PCR610_INTE                            *((volatile unsigned int*)(0x42A7B530UL))
#define bM4_PORT_PCR610_DDIS                            *((volatile unsigned int*)(0x42A7B53CUL))
#define bM4_PORT_PFSR610_FSEL0                          *((volatile unsigned int*)(0x42A7B540UL))
#define bM4_PORT_PFSR610_FSEL1                          *((volatile unsigned int*)(0x42A7B544UL))
#define bM4_PORT_PFSR610_FSEL2                          *((volatile unsigned int*)(0x42A7B548UL))
#define bM4_PORT_PFSR610_FSEL3                          *((volatile unsigned int*)(0x42A7B54CUL))
#define bM4_PORT_PFSR610_BFE                            *((volatile unsigned int*)(0x42A7B560UL))
#define bM4_PORT_PCR611_POUT                            *((volatile unsigned int*)(0x42A7B580UL))
#define bM4_PORT_PCR611_POUTE                           *((volatile unsigned int*)(0x42A7B584UL))
#define bM4_PORT_PCR611_NOD                             *((volatile unsigned int*)(0x42A7B588UL))
#define bM4_PORT_PCR611_DRV0                            *((volatile unsigned int*)(0x42A7B590UL))
#define bM4_PORT_PCR611_DRV1                            *((volatile unsigned int*)(0x42A7B594UL))
#define bM4_PORT_PCR611_PUU                             *((volatile unsigned int*)(0x42A7B598UL))
#define bM4_PORT_PCR611_PIN                             *((volatile unsigned int*)(0x42A7B5A0UL))
#define bM4_PORT_PCR611_INVE                            *((volatile unsigned int*)(0x42A7B5A4UL))
#define bM4_PORT_PCR611_INTE                            *((volatile unsigned int*)(0x42A7B5B0UL))
#define bM4_PORT_PCR611_DDIS                            *((volatile unsigned int*)(0x42A7B5BCUL))
#define bM4_PORT_PFSR611_FSEL0                          *((volatile unsigned int*)(0x42A7B5C0UL))
#define bM4_PORT_PFSR611_FSEL1                          *((volatile unsigned int*)(0x42A7B5C4UL))
#define bM4_PORT_PFSR611_FSEL2                          *((volatile unsigned int*)(0x42A7B5C8UL))
#define bM4_PORT_PFSR611_FSEL3                          *((volatile unsigned int*)(0x42A7B5CCUL))
#define bM4_PORT_PFSR611_BFE                            *((volatile unsigned int*)(0x42A7B5E0UL))
#define bM4_PORT_PCR612_POUT                            *((volatile unsigned int*)(0x42A7B600UL))
#define bM4_PORT_PCR612_POUTE                           *((volatile unsigned int*)(0x42A7B604UL))
#define bM4_PORT_PCR612_NOD                             *((volatile unsigned int*)(0x42A7B608UL))
#define bM4_PORT_PCR612_DRV0                            *((volatile unsigned int*)(0x42A7B610UL))
#define bM4_PORT_PCR612_DRV1                            *((volatile unsigned int*)(0x42A7B614UL))
#define bM4_PORT_PCR612_PUU                             *((volatile unsigned int*)(0x42A7B618UL))
#define bM4_PORT_PCR612_PIN                             *((volatile unsigned int*)(0x42A7B620UL))
#define bM4_PORT_PCR612_INVE                            *((volatile unsigned int*)(0x42A7B624UL))
#define bM4_PORT_PCR612_INTE                            *((volatile unsigned int*)(0x42A7B630UL))
#define bM4_PORT_PCR612_DDIS                            *((volatile unsigned int*)(0x42A7B63CUL))
#define bM4_PORT_PFSR612_FSEL0                          *((volatile unsigned int*)(0x42A7B640UL))
#define bM4_PORT_PFSR612_FSEL1                          *((volatile unsigned int*)(0x42A7B644UL))
#define bM4_PORT_PFSR612_FSEL2                          *((volatile unsigned int*)(0x42A7B648UL))
#define bM4_PORT_PFSR612_FSEL3                          *((volatile unsigned int*)(0x42A7B64CUL))
#define bM4_PORT_PFSR612_BFE                            *((volatile unsigned int*)(0x42A7B660UL))
#define bM4_PORT_PCR613_POUT                            *((volatile unsigned int*)(0x42A7B680UL))
#define bM4_PORT_PCR613_POUTE                           *((volatile unsigned int*)(0x42A7B684UL))
#define bM4_PORT_PCR613_NOD                             *((volatile unsigned int*)(0x42A7B688UL))
#define bM4_PORT_PCR613_DRV0                            *((volatile unsigned int*)(0x42A7B690UL))
#define bM4_PORT_PCR613_DRV1                            *((volatile unsigned int*)(0x42A7B694UL))
#define bM4_PORT_PCR613_PUU                             *((volatile unsigned int*)(0x42A7B698UL))
#define bM4_PORT_PCR613_PIN                             *((volatile unsigned int*)(0x42A7B6A0UL))
#define bM4_PORT_PCR613_INVE                            *((volatile unsigned int*)(0x42A7B6A4UL))
