RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_PORT_PCR613_INTE                            *((volatile unsigned int*)(0x42A7B6B0UL))
#define bM4_PORT_PCR613_DDIS                            *((volatile unsigned int*)(0x42A7B6BCUL))
#define bM4_PORT_PFSR613_FSEL0                          *((volatile unsigned int*)(0x42A7B6C0UL))
#define bM4_PORT_PFSR613_FSEL1                          *((volatile unsigned int*)(0x42A7B6C4UL))
#define bM4_PORT_PFSR613_FSEL2                          *((volatile unsigned int*)(0x42A7B6C8UL))
#define bM4_PORT_PFSR613_FSEL3                          *((volatile unsigned int*)(0x42A7B6CCUL))
#define bM4_PORT_PFSR613_BFE                            *((volatile unsigned int*)(0x42A7B6E0UL))
#define bM4_PORT_PCR614_POUT                            *((volatile unsigned int*)(0x42A7B700UL))
#define bM4_PORT_PCR614_POUTE                           *((volatile unsigned int*)(0x42A7B704UL))
#define bM4_PORT_PCR614_NOD                             *((volatile unsigned int*)(0x42A7B708UL))
#define bM4_PORT_PCR614_DRV0                            *((volatile unsigned int*)(0x42A7B710UL))
#define bM4_PORT_PCR614_DRV1                            *((volatile unsigned int*)(0x42A7B714UL))
#define bM4_PORT_PCR614_PUU                             *((volatile unsigned int*)(0x42A7B718UL))
#define bM4_PORT_PCR614_PIN                             *((volatile unsigned int*)(0x42A7B720UL))
#define bM4_PORT_PCR614_INVE                            *((volatile unsigned int*)(0x42A7B724UL))
#define bM4_PORT_PCR614_INTE                            *((volatile unsigned int*)(0x42A7B730UL))
#define bM4_PORT_PCR614_DDIS                            *((volatile unsigned int*)(0x42A7B73CUL))
#define bM4_PORT_PFSR614_FSEL0                          *((volatile unsigned int*)(0x42A7B740UL))
#define bM4_PORT_PFSR614_FSEL1                          *((volatile unsigned int*)(0x42A7B744UL))
#define bM4_PORT_PFSR614_FSEL2                          *((volatile unsigned int*)(0x42A7B748UL))
#define bM4_PORT_PFSR614_FSEL3                          *((volatile unsigned int*)(0x42A7B74CUL))
#define bM4_PORT_PFSR614_BFE                            *((volatile unsigned int*)(0x42A7B760UL))
#define bM4_PORT_PCR615_POUT                            *((volatile unsigned int*)(0x42A7B780UL))
#define bM4_PORT_PCR615_POUTE                           *((volatile unsigned int*)(0x42A7B784UL))
#define bM4_PORT_PCR615_NOD                             *((volatile unsigned int*)(0x42A7B788UL))
#define bM4_PORT_PCR615_DRV0                            *((volatile unsigned int*)(0x42A7B790UL))
#define bM4_PORT_PCR615_DRV1                            *((volatile unsigned int*)(0x42A7B794UL))
#define bM4_PORT_PCR615_PUU                             *((volatile unsigned int*)(0x42A7B798UL))
#define bM4_PORT_PCR615_PIN                             *((volatile unsigned int*)(0x42A7B7A0UL))
#define bM4_PORT_PCR615_INVE                            *((volatile unsigned int*)(0x42A7B7A4UL))
#define bM4_PORT_PCR615_INTE                            *((volatile unsigned int*)(0x42A7B7B0UL))
#define bM4_PORT_PCR615_DDIS                            *((volatile unsigned int*)(0x42A7B7BCUL))
#define bM4_PORT_PFSR615_FSEL0                          *((volatile unsigned int*)(0x42A7B7C0UL))
#define bM4_PORT_PFSR615_FSEL1                          *((volatile unsigned int*)(0x42A7B7C4UL))
#define bM4_PORT_PFSR615_FSEL2                          *((volatile unsigned int*)(0x42A7B7C8UL))
#define bM4_PORT_PFSR615_FSEL3                          *((volatile unsigned int*)(0x42A7B7CCUL))
#define bM4_PORT_PFSR615_BFE                            *((volatile unsigned int*)(0x42A7B7E0UL))
#define bM4_PORT_PCR700_POUT                            *((volatile unsigned int*)(0x42A7B800UL))
#define bM4_PORT_PCR700_POUTE                           *((volatile unsigned int*)(0x42A7B804UL))
#define bM4_PORT_PCR700_NOD                             *((volatile unsigned int*)(0x42A7B808UL))
#define bM4_PORT_PCR700_DRV0                            *((volatile unsigned int*)(0x42A7B810UL))
#define bM4_PORT_PCR700_DRV1                            *((volatile unsigned int*)(0x42A7B814UL))
#define bM4_PORT_PCR700_PUU                             *((volatile unsigned int*)(0x42A7B818UL))
#define bM4_PORT_PCR700_PIN                             *((volatile unsigned int*)(0x42A7B820UL))
#define bM4_PORT_PCR700_INVE                            *((volatile unsigned int*)(0x42A7B824UL))
#define bM4_PORT_PCR700_INTE                            *((volatile unsigned int*)(0x42A7B830UL))
#define bM4_PORT_PCR700_DDIS                            *((volatile unsigned int*)(0x42A7B83CUL))
#define bM4_PORT_PFSR700_FSEL0                          *((volatile unsigned int*)(0x42A7B840UL))
#define bM4_PORT_PFSR700_FSEL1                          *((volatile unsigned int*)(0x42A7B844UL))
#define bM4_PORT_PFSR700_FSEL2                          *((volatile unsigned int*)(0x42A7B848UL))
#define bM4_PORT_PFSR700_FSEL3                          *((volatile unsigned int*)(0x42A7B84CUL))
#define bM4_PORT_PFSR700_BFE                            *((volatile unsigned int*)(0x42A7B860UL))
#define bM4_PORT_PCR701_POUT                            *((volatile unsigned int*)(0x42A7B880UL))
#define bM4_PORT_PCR701_POUTE                           *((volatile unsigned int*)(0x42A7B884UL))
#define bM4_PORT_PCR701_NOD                             *((volatile unsigned int*)(0x42A7B888UL))
#define bM4_PORT_PCR701_DRV0                            *((volatile unsigned int*)(0x42A7B890UL))
#define bM4_PORT_PCR701_DRV1                            *((volatile unsigned int*)(0x42A7B894UL))
#define bM4_PORT_PCR701_PUU                             *((volatile unsigned int*)(0x42A7B898UL))
#define bM4_PORT_PCR701_PIN                             *((volatile unsigned int*)(0x42A7B8A0UL))
#define bM4_PORT_PCR701_INVE                            *((volatile unsigned int*)(0x42A7B8A4UL))
#define bM4_PORT_PCR701_INTE                            *((volatile unsigned int*)(0x42A7B8B0UL))
#define bM4_PORT_PCR701_DDIS                            *((volatile unsigned int*)(0x42A7B8BCUL))
#define bM4_PORT_PFSR701_FSEL0                          *((volatile unsigned int*)(0x42A7B8C0UL))
#define bM4_PORT_PFSR701_FSEL1                          *((volatile unsigned int*)(0x42A7B8C4UL))
#define bM4_PORT_PFSR701_FSEL2                          *((volatile unsigned int*)(0x42A7B8C8UL))
#define bM4_PORT_PFSR701_FSEL3                          *((volatile unsigned int*)(0x42A7B8CCUL))
#define bM4_PORT_PFSR701_BFE                            *((volatile unsigned int*)(0x42A7B8E0UL))
#define bM4_PORT_PCR702_POUT                            *((volatile unsigned int*)(0x42A7B900UL))
#define bM4_PORT_PCR702_POUTE                           *((volatile unsigned int*)(0x42A7B904UL))
#define bM4_PORT_PCR702_NOD                             *((volatile unsigned int*)(0x42A7B908UL))
#define bM4_PORT_PCR702_DRV0                            *((volatile unsigned int*)(0x42A7B910UL))
#define bM4_PORT_PCR702_DRV1                            *((volatile unsigned int*)(0x42A7B914UL))
#define bM4_PORT_PCR702_PUU                             *((volatile unsigned int*)(0x42A7B918UL))
#define bM4_PORT_PCR702_PIN                             *((volatile unsigned int*)(0x42A7B920UL))
#define bM4_PORT_PCR702_INVE                            *((volatile unsigned int*)(0x42A7B924UL))
#define bM4_PORT_PCR702_INTE                            *((volatile unsigned int*)(0x42A7B930UL))
#define bM4_PORT_PCR702_DDIS                            *((volatile unsigned int*)(0x42A7B93CUL))
#define bM4_PORT_PFSR702_FSEL0                          *((volatile unsigned int*)(0x42A7B940UL))
#define bM4_PORT_PFSR702_FSEL1                          *((volatile unsigned int*)(0x42A7B944UL))
#define bM4_PORT_PFSR702_FSEL2                          *((volatile unsigned int*)(0x42A7B948UL))
#define bM4_PORT_PFSR702_FSEL3                          *((volatile unsigned int*)(0x42A7B94CUL))
#define bM4_PORT_PFSR702_BFE                            *((volatile unsigned int*)(0x42A7B960UL))
#define bM4_PORT_PCR703_POUT                            *((volatile unsigned int*)(0x42A7B980UL))
#define bM4_PORT_PCR703_POUTE                           *((volatile unsigned int*)(0x42A7B984UL))
#define bM4_PORT_PCR703_NOD                             *((volatile unsigned int*)(0x42A7B988UL))
#define bM4_PORT_PCR703_DRV0                            *((volatile unsigned int*)(0x42A7B990UL))
#define bM4_PORT_PCR703_DRV1                            *((volatile unsigned int*)(0x42A7B994UL))
#define bM4_PORT_PCR703_PUU                             *((volatile unsigned int*)(0x42A7B998UL))
#define bM4_PORT_PCR703_PIN                             *((volatile unsigned int*)(0x42A7B9A0UL))
#define bM4_PORT_PCR703_INVE                            *((volatile unsigned int*)(0x42A7B9A4UL))
#define bM4_PORT_PCR703_INTE                            *((volatile unsigned int*)(0x42A7B9B0UL))
#define bM4_PORT_PCR703_DDIS                            *((volatile unsigned int*)(0x42A7B9BCUL))
#define bM4_PORT_PFSR703_FSEL0                          *((volatile unsigned int*)(0x42A7B9C0UL))
#define bM4_PORT_PFSR703_FSEL1                          *((volatile unsigned int*)(0x42A7B9C4UL))
#define bM4_PORT_PFSR703_FSEL2                          *((volatile unsigned int*)(0x42A7B9C8UL))
#define bM4_PORT_PFSR703_FSEL3                          *((volatile unsigned int*)(0x42A7B9CCUL))
#define bM4_PORT_PFSR703_BFE                            *((volatile unsigned int*)(0x42A7B9E0UL))
#define bM4_PORT_PCR704_POUT                            *((volatile unsigned int*)(0x42A7BA00UL))
#define bM4_PORT_PCR704_POUTE                           *((volatile unsigned int*)(0x42A7BA04UL))
#define bM4_PORT_PCR704_NOD                             *((volatile unsigned int*)(0x42A7BA08UL))
#define bM4_PORT_PCR704_DRV0                            *((volatile unsigned int*)(0x42A7BA10UL))
#define bM4_PORT_PCR704_DRV1                            *((volatile unsigned int*)(0x42A7BA14UL))
#define bM4_PORT_PCR704_PUU                             *((volatile unsigned int*)(0x42A7BA18UL))
#define bM4_PORT_PCR704_PIN                             *((volatile unsigned int*)(0x42A7BA20UL))
#define bM4_PORT_PCR704_INVE                            *((volatile unsigned int*)(0x42A7BA24UL))
#define bM4_PORT_PCR704_INTE                            *((volatile unsigned int*)(0x42A7BA30UL))
#define bM4_PORT_PCR704_DDIS                            *((volatile unsigned int*)(0x42A7BA3CUL))
#define bM4_PORT_PFSR704_FSEL0                          *((volatile unsigned int*)(0x42A7BA40UL))
#define bM4_PORT_PFSR704_FSEL1                          *((volatile unsigned int*)(0x42A7BA44UL))
#define bM4_PORT_PFSR704_FSEL2                          *((volatile unsigned int*)(0x42A7BA48UL))
#define bM4_PORT_PFSR704_FSEL3                          *((volatile unsigned int*)(0x42A7BA4CUL))
#define bM4_PORT_PFSR704_BFE                            *((volatile unsigned int*)(0x42A7BA60UL))
#define bM4_RTC_CR0_RESET                               *((volatile unsigned int*)(0x42974000UL))
#define bM4_RTC_CR1_PRDS0                               *((volatile unsigned int*)(0x42974080UL))
#define bM4_RTC_CR1_PRDS1                               *((volatile unsigned int*)(0x42974084UL))
#define bM4_RTC_CR1_PRDS2                               *((volatile unsigned int*)(0x42974088UL))
#define bM4_RTC_CR1_AMPM                                *((volatile unsigned int*)(0x4297408CUL))
#define bM4_RTC_CR1_ONEHZOE                             *((volatile unsigned int*)(0x42974094UL))
#define bM4_RTC_CR1_ONEHZSEL                            *((volatile unsigned int*)(0x42974098UL))
#define bM4_RTC_CR1_START                               *((volatile unsigned int*)(0x4297409CUL))
#define bM4_RTC_CR2_WAIT                                *((volatile unsigned int*)(0x42974100UL))
#define bM4_RTC_CR2_WAITF                               *((volatile unsigned int*)(0x42974104UL))
#define bM4_RTC_CR2_PRDF                                *((volatile unsigned int*)(0x42974108UL))
#define bM4_RTC_CR2_ALMF                                *((volatile unsigned int*)(0x4297410CUL))
#define bM4_RTC_CR2_CRIE                                *((volatile unsigned int*)(0x42974110UL))
#define bM4_RTC_CR2_PRDIE                               *((volatile unsigned int*)(0x42974114UL))
#define bM4_RTC_CR2_ALMIE                               *((volatile unsigned int*)(0x42974118UL))
#define bM4_RTC_CR2_ALME                                *((volatile unsigned int*)(0x4297411CUL))
#define bM4_RTC_CR3_XTAL32EN                            *((volatile unsigned int*)(0x42974180UL))
#define bM4_RTC_CR3_LRCEN                               *((volatile unsigned int*)(0x42974190UL))
#define bM4_RTC_CR3_RCKSEL                              *((volatile unsigned int*)(0x4297419CUL))
#define bM4_RTC_SEC_SECU0                               *((volatile unsigned int*)(0x42974200UL))
#define bM4_RTC_SEC_SECU1                               *((volatile unsigned int*)(0x42974204UL))
#define bM4_RTC_SEC_SECU2                               *((volatile unsigned int*)(0x42974208UL))
#define bM4_RTC_SEC_SECU3                               *((volatile unsigned int*)(0x4297420CUL))
#define bM4_RTC_SEC_SECD0                               *((volatile unsigned int*)(0x42974210UL))
#define bM4_RTC_SEC_SECD1                               *((volatile unsigned int*)(0x42974214UL))
#define bM4_RTC_SEC_SECD2                               *((volatile unsigned int*)(0x42974218UL))
#define bM4_RTC_MIN_MINU0                               *((volatile unsigned int*)(0x42974280UL))
#define bM4_RTC_MIN_MINU1                               *((volatile unsigned int*)(0x42974284UL))
#define bM4_RTC_MIN_MINU2                               *((volatile unsigned int*)(0x42974288UL))
#define bM4_RTC_MIN_MINU3                               *((volatile unsigned int*)(0x4297428CUL))
#define bM4_RTC_MIN_MIND0                               *((volatile unsigned int*)(0x42974290UL))
#define bM4_RTC_MIN_MIND1                               *((volatile unsigned int*)(0x42974294UL))
#define bM4_RTC_MIN_MIND2                               *((volatile unsigned int*)(0x42974298UL))
#define bM4_RTC_HOUR_HOURU0                             *((volatile unsigned int*)(0x42974300UL))
#define bM4_RTC_HOUR_HOURU1                             *((volatile unsigned int*)(0x42974304UL))
#define bM4_RTC_HOUR_HOURU2                             *((volatile unsigned int*)(0x42974308UL))
#define bM4_RTC_HOUR_HOURU3                             *((volatile unsigned int*)(0x4297430CUL))
#define bM4_RTC_HOUR_HOURD0                             *((volatile unsigned int*)(0x42974310UL))
#define bM4_RTC_HOUR_HOURD1                             *((volatile unsigned int*)(0x42974314UL))
#define bM4_RTC_WEEK_WEEK0                              *((volatile unsigned int*)(0x42974380UL))
#define bM4_RTC_WEEK_WEEK1                              *((volatile unsigned int*)(0x42974384UL))
#define bM4_RTC_WEEK_WEEK2                              *((volatile unsigned int*)(0x42974388UL))
#define bM4_RTC_DAY_DAYU0                               *((volatile unsigned int*)(0x42974400UL))
#define bM4_RTC_DAY_DAYU1                               *((volatile unsigned int*)(0x42974404UL))
#define bM4_RTC_DAY_DAYU2                               *((volatile unsigned int*)(0x42974408UL))
#define bM4_RTC_DAY_DAYU3                               *((volatile unsigned int*)(0x4297440CUL))
#define bM4_RTC_DAY_DAYD0                               *((volatile unsigned int*)(0x42974410UL))
#define bM4_RTC_DAY_DAYD1                               *((volatile unsigned int*)(0x42974414UL))
#define bM4_RTC_MON_MON0                                *((volatile unsigned int*)(0x42974480UL))
#define bM4_RTC_MON_MON1                                *((volatile unsigned int*)(0x42974484UL))
#define bM4_RTC_MON_MON2                                *((volatile unsigned int*)(0x42974488UL))
#define bM4_RTC_MON_MON3                                *((volatile unsigned int*)(0x4297448CUL))
#define bM4_RTC_MON_MON4                                *((volatile unsigned int*)(0x42974490UL))
#define bM4_RTC_YEAR_YEARU0                             *((volatile unsigned int*)(0x42974500UL))
#define bM4_RTC_YEAR_YEARU1                             *((volatile unsigned int*)(0x42974504UL))
#define bM4_RTC_YEAR_YEARU2                             *((volatile unsigned int*)(0x42974508UL))
#define bM4_RTC_YEAR_YEARU3                             *((volatile unsigned int*)(0x4297450CUL))
#define bM4_RTC_YEAR_YEARD0                             *((volatile unsigned int*)(0x42974510UL))
#define bM4_RTC_YEAR_YEARD1                             *((volatile unsigned int*)(0x42974514UL))
#define bM4_RTC_YEAR_YEARD2                             *((volatile unsigned int*)(0x42974518UL))
#define bM4_RTC_YEAR_YEARD3                             *((volatile unsigned int*)(0x4297451CUL))
#define bM4_RTC_ALMMIN_ALMMINU0                         *((volatile unsigned int*)(0x42974580UL))
#define bM4_RTC_ALMMIN_ALMMINU1                         *((volatile unsigned int*)(0x42974584UL))
#define bM4_RTC_ALMMIN_ALMMINU2                         *((volatile unsigned int*)(0x42974588UL))
#define bM4_RTC_ALMMIN_ALMMINU3                         *((volatile unsigned int*)(0x4297458CUL))
#define bM4_RTC_ALMMIN_ALMMIND0                         *((volatile unsigned int*)(0x42974590UL))
#define bM4_RTC_ALMMIN_ALMMIND1                         *((volatile unsigned int*)(0x42974594UL))
#define bM4_RTC_ALMMIN_ALMMIND2                         *((volatile unsigned int*)(0x42974598UL))
#define bM4_RTC_ALMHOUR_ALMHOURU0                       *((volatile unsigned int*)(0x42974600UL))
#define bM4_RTC_ALMHOUR_ALMHOURU1                       *((volatile unsigned int*)(0x42974604UL))
#define bM4_RTC_ALMHOUR_ALMHOURU2                       *((volatile unsigned int*)(0x42974608UL))
#define bM4_RTC_ALMHOUR_ALMHOURU3                       *((volatile unsigned int*)(0x4297460CUL))
#define bM4_RTC_ALMHOUR_ALMHOURD0                       *((volatile unsigned int*)(0x42974610UL))
#define bM4_RTC_ALMHOUR_ALMHOURD1                       *((volatile unsigned int*)(0x42974614UL))
#define bM4_RTC_ALMWEEK_ALMWEEK0                        *((volatile unsigned int*)(0x42974680UL))
#define bM4_RTC_ALMWEEK_ALMWEEK1                        *((volatile unsigned int*)(0x42974684UL))
#define bM4_RTC_ALMWEEK_ALMWEEK2                        *((volatile unsigned int*)(0x42974688UL))
#define bM4_RTC_ALMWEEK_ALMWEEK3                        *((volatile unsigned int*)(0x4297468CUL))
#define bM4_RTC_ALMWEEK_ALMWEEK4                        *((volatile unsigned int*)(0x42974690UL))
#define bM4_RTC_ALMWEEK_ALMWEEK5                        *((volatile unsigned int*)(0x42974694UL))
#define bM4_RTC_ALMWEEK_ALMWEEK6                        *((volatile unsigned int*)(0x42974698UL))
#define bM4_RTC_ERRCRA_CR8                              *((volatile unsigned int*)(0x42974700UL))
#define bM4_RTC_ERRCRA_CREEN                            *((volatile unsigned int*)(0x4297471CUL))
#define bM4_RTC_TPCR0_TPCR00                            *((volatile unsigned int*)(0x42974800UL))
#define bM4_RTC_TPCR0_TPCR01                            *((volatile unsigned int*)(0x42974804UL))
#define bM4_RTC_TPCR0_TPNF00                            *((volatile unsigned int*)(0x42974808UL))
#define bM4_RTC_TPCR0_TPNF01                            *((volatile unsigned int*)(0x4297480CUL))
#define bM4_RTC_TPCR0_TPRSTE0                           *((volatile unsigned int*)(0x42974810UL))
#define bM4_RTC_TPCR0_TPIE0                             *((volatile unsigned int*)(0x42974814UL))
#define bM4_RTC_TPCR0_TSTPE0                            *((volatile unsigned int*)(0x42974818UL))
#define bM4_RTC_TPCR0_TPEN0                             *((volatile unsigned int*)(0x4297481CUL))
#define bM4_RTC_TPCR1_TPCR10                            *((volatile unsigned int*)(0x42974880UL))
#define bM4_RTC_TPCR1_TPCR11                            *((volatile unsigned int*)(0x42974884UL))
#define bM4_RTC_TPCR1_TPNF10                            *((volatile unsigned int*)(0x42974888UL))
#define bM4_RTC_TPCR1_TPNF11                            *((volatile unsigned int*)(0x4297488CUL))
#define bM4_RTC_TPCR1_TPRSTE1                           *((volatile unsigned int*)(0x42974890UL))
#define bM4_RTC_TPCR1_TPIE1                             *((volatile unsigned int*)(0x42974894UL))
#define bM4_RTC_TPCR1_TSTPE1                            *((volatile unsigned int*)(0x42974898UL))
#define bM4_RTC_TPCR1_TPEN1                             *((volatile unsigned int*)(0x4297489CUL))
#define bM4_RTC_TPSR_TPF0                               *((volatile unsigned int*)(0x42974900UL))
#define bM4_RTC_TPSR_TPF1                               *((volatile unsigned int*)(0x42974904UL))
#define bM4_RTC_TPSR_TPOVF                              *((volatile unsigned int*)(0x42974908UL))
#define bM4_RTC_SECTP_SECTPU0                           *((volatile unsigned int*)(0x42974980UL))
#define bM4_RTC_SECTP_SECTPU1                           *((volatile unsigned int*)(0x42974984UL))
#define bM4_RTC_SECTP_SECTPU2                           *((volatile unsigned int*)(0x42974988UL))
#define bM4_RTC_SECTP_SECTPU3                           *((volatile unsigned int*)(0x4297498CUL))
#define bM4_RTC_SECTP_SECTPD0                           *((volatile unsigned int*)(0x42974990UL))
#define bM4_RTC_SECTP_SECTPD1                           *((volatile unsigned int*)(0x42974994UL))
#define bM4_RTC_SECTP_SECTPD2                           *((volatile unsigned int*)(0x42974998UL))
#define bM4_RTC_MINTP_MINTPU0                           *((volatile unsigned int*)(0x42974A00UL))
#define bM4_RTC_MINTP_MINTPU1                           *((volatile unsigned int*)(0x42974A04UL))
#define bM4_RTC_MINTP_MINTPU2                           *((volatile unsigned int*)(0x42974A08UL))
#define bM4_RTC_MINTP_MINTPU3                           *((volatile unsigned int*)(0x42974A0CUL))
#define bM4_RTC_MINTP_MINTPD0                           *((volatile unsigned int*)(0x42974A10UL))
#define bM4_RTC_MINTP_MINTPD1                           *((volatile unsigned int*)(0x42974A14UL))
#define bM4_RTC_MINTP_MINTPD2                           *((volatile unsigned int*)(0x42974A18UL))
#define bM4_RTC_HOURTP_HOURTPU0                         *((volatile unsigned int*)(0x42974A80UL))
#define bM4_RTC_HOURTP_HOURTPU1                         *((volatile unsigned int*)(0x42974A84UL))
#define bM4_RTC_HOURTP_HOURTPU2                         *((volatile unsigned int*)(0x42974A88UL))
#define bM4_RTC_HOURTP_HOURTPU3                         *((volatile unsigned int*)(0x42974A8CUL))
#define bM4_RTC_HOURTP_HOURTPD0                         *((volatile unsigned int*)(0x42974A90UL))
#define bM4_RTC_HOURTP_HOURTPD1                         *((volatile unsigned int*)(0x42974A94UL))
#define bM4_RTC_DAYTP_DAYTPU0                           *((volatile unsigned int*)(0x42974B00UL))
#define bM4_RTC_DAYTP_DAYTPU1                           *((volatile unsigned int*)(0x42974B04UL))
#define bM4_RTC_DAYTP_DAYTPU2                           *((volatile unsigned int*)(0x42974B08UL))
#define bM4_RTC_DAYTP_DAYTPU3                           *((volatile unsigned int*)(0x42974B0CUL))
#define bM4_RTC_DAYTP_DAYTPD0                           *((volatile unsigned int*)(0x42974B10UL))
#define bM4_RTC_DAYTP_DAYTPD1                           *((volatile unsigned int*)(0x42974B14UL))
#define bM4_RTC_MONTP_MONTPU0                           *((volatile unsigned int*)(0x42974B80UL))
#define bM4_RTC_MONTP_MONTPU1                           *((volatile unsigned int*)(0x42974B84UL))
#define bM4_RTC_MONTP_MONTPU2                           *((volatile unsigned int*)(0x42974B88UL))
#define bM4_RTC_MONTP_MONTPU3                           *((volatile unsigned int*)(0x42974B8CUL))
