RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_RTC_MONTP_MONTPD0                           *((volatile unsigned int*)(0x42974B90UL))
#define bM4_RTC_MONTP_MONTPD1                           *((volatile unsigned int*)(0x42974B94UL))
#define bM4_SDIOC_CTL_CLKDIV0                           *((volatile unsigned int*)(0x42218000UL))
#define bM4_SDIOC_CTL_CLKDIV1                           *((volatile unsigned int*)(0x42218004UL))
#define bM4_SDIOC_CTL_CLKDIV2                           *((volatile unsigned int*)(0x42218008UL))
#define bM4_SDIOC_CTL_CLKDIV3                           *((volatile unsigned int*)(0x4221800CUL))
#define bM4_SDIOC_CTL_CLKDIV4                           *((volatile unsigned int*)(0x42218010UL))
#define bM4_SDIOC_CTL_CLKDIV5                           *((volatile unsigned int*)(0x42218014UL))
#define bM4_SDIOC_CTL_CLKDIV6                           *((volatile unsigned int*)(0x42218018UL))
#define bM4_SDIOC_CTL_CLKDIV7                           *((volatile unsigned int*)(0x4221801CUL))
#define bM4_SDIOC_CTL_CKO                               *((volatile unsigned int*)(0x42218020UL))
#define bM4_SDIOC_CTL_ATCK                              *((volatile unsigned int*)(0x42218024UL))
#define bM4_SDIOC_CTL_CDTO0                             *((volatile unsigned int*)(0x42218040UL))
#define bM4_SDIOC_CTL_CDTO1                             *((volatile unsigned int*)(0x42218044UL))
#define bM4_SDIOC_CTL_CDTO2                             *((volatile unsigned int*)(0x42218048UL))
#define bM4_SDIOC_CTL_CDTO3                             *((volatile unsigned int*)(0x4221804CUL))
#define bM4_SDIOC_CTL_TO0                               *((volatile unsigned int*)(0x42218050UL))
#define bM4_SDIOC_CTL_TO1                               *((volatile unsigned int*)(0x42218054UL))
#define bM4_SDIOC_CTL_TO2                               *((volatile unsigned int*)(0x42218058UL))
#define bM4_SDIOC_CTL_TO3                               *((volatile unsigned int*)(0x4221805CUL))
#define bM4_SDIOC_CTL_TOMSK                             *((volatile unsigned int*)(0x42218060UL))
#define bM4_SDIOC_CTL_WIDTH0                            *((volatile unsigned int*)(0x42218078UL))
#define bM4_SDIOC_CTL_WIDTH1                            *((volatile unsigned int*)(0x4221807CUL))
#define bM4_SDIOC_CMD_CMDIDX0                           *((volatile unsigned int*)(0x42218080UL))
#define bM4_SDIOC_CMD_CMDIDX1                           *((volatile unsigned int*)(0x42218084UL))
#define bM4_SDIOC_CMD_CMDIDX2                           *((volatile unsigned int*)(0x42218088UL))
#define bM4_SDIOC_CMD_CMDIDX3                           *((volatile unsigned int*)(0x4221808CUL))
#define bM4_SDIOC_CMD_CMDIDX4                           *((volatile unsigned int*)(0x42218090UL))
#define bM4_SDIOC_CMD_CMDIDX5                           *((volatile unsigned int*)(0x42218094UL))
#define bM4_SDIOC_CMD_ACMD                              *((volatile unsigned int*)(0x42218098UL))
#define bM4_SDIOC_CMD_RESV                              *((volatile unsigned int*)(0x422180FCUL))
#define bM4_SDIOC_RESP3_RESP30                          *((volatile unsigned int*)(0x42218300UL))
#define bM4_SDIOC_RESP3_RESP31                          *((volatile unsigned int*)(0x42218304UL))
#define bM4_SDIOC_RESP3_RESP32                          *((volatile unsigned int*)(0x42218308UL))
#define bM4_SDIOC_RESP3_RESP33                          *((volatile unsigned int*)(0x4221830CUL))
#define bM4_SDIOC_RESP3_RESP34                          *((volatile unsigned int*)(0x42218310UL))
#define bM4_SDIOC_RESP3_RESP35                          *((volatile unsigned int*)(0x42218314UL))
#define bM4_SDIOC_RESP3_RESP36                          *((volatile unsigned int*)(0x42218318UL))
#define bM4_SDIOC_RESP3_RESP37                          *((volatile unsigned int*)(0x4221831CUL))
#define bM4_SDIOC_RESP3_RESP38                          *((volatile unsigned int*)(0x42218320UL))
#define bM4_SDIOC_RESP3_RESP39                          *((volatile unsigned int*)(0x42218324UL))
#define bM4_SDIOC_RESP3_RESP310                         *((volatile unsigned int*)(0x42218328UL))
#define bM4_SDIOC_RESP3_RESP311                         *((volatile unsigned int*)(0x4221832CUL))
#define bM4_SDIOC_RESP3_RESP312                         *((volatile unsigned int*)(0x42218330UL))
#define bM4_SDIOC_RESP3_RESP313                         *((volatile unsigned int*)(0x42218334UL))
#define bM4_SDIOC_RESP3_RESP314                         *((volatile unsigned int*)(0x42218338UL))
#define bM4_SDIOC_RESP3_RESP315                         *((volatile unsigned int*)(0x4221833CUL))
#define bM4_SDIOC_RESP3_RESP316                         *((volatile unsigned int*)(0x42218340UL))
#define bM4_SDIOC_RESP3_RESP317                         *((volatile unsigned int*)(0x42218344UL))
#define bM4_SDIOC_RESP3_RESP318                         *((volatile unsigned int*)(0x42218348UL))
#define bM4_SDIOC_RESP3_RESP319                         *((volatile unsigned int*)(0x4221834CUL))
#define bM4_SDIOC_RESP3_RESP320                         *((volatile unsigned int*)(0x42218350UL))
#define bM4_SDIOC_RESP3_RESP321                         *((volatile unsigned int*)(0x42218354UL))
#define bM4_SDIOC_RESP3_RESP322                         *((volatile unsigned int*)(0x42218358UL))
#define bM4_SDIOC_RESP3_RESP323                         *((volatile unsigned int*)(0x4221835CUL))
#define bM4_SDIOC_RESP3_RESV                            *((volatile unsigned int*)(0x4221837CUL))
#define bM4_SDIOC_TEC_TRANSTP                           *((volatile unsigned int*)(0x42218380UL))
#define bM4_SDIOC_TEC_ATS                               *((volatile unsigned int*)(0x422183A0UL))
#define bM4_SDIOC_TEC_RESV                              *((volatile unsigned int*)(0x422183FCUL))
#define bM4_SDIOC_BLKLEN_BLKLEN0                        *((volatile unsigned int*)(0x42218480UL))
#define bM4_SDIOC_BLKLEN_BLKLEN1                        *((volatile unsigned int*)(0x42218484UL))
#define bM4_SDIOC_BLKLEN_BLKLEN2                        *((volatile unsigned int*)(0x42218488UL))
#define bM4_SDIOC_BLKLEN_BLKLEN3                        *((volatile unsigned int*)(0x4221848CUL))
#define bM4_SDIOC_BLKLEN_BLKLEN4                        *((volatile unsigned int*)(0x42218490UL))
#define bM4_SDIOC_BLKLEN_BLKLEN5                        *((volatile unsigned int*)(0x42218494UL))
#define bM4_SDIOC_BLKLEN_BLKLEN6                        *((volatile unsigned int*)(0x42218498UL))
#define bM4_SDIOC_BLKLEN_BLKLEN7                        *((volatile unsigned int*)(0x4221849CUL))
#define bM4_SDIOC_BLKLEN_BLKLEN8                        *((volatile unsigned int*)(0x422184A0UL))
#define bM4_SDIOC_BLKLEN_BLKLEN9                        *((volatile unsigned int*)(0x422184A4UL))
#define bM4_SDIOC_BLKLEN_RESV                           *((volatile unsigned int*)(0x422184FCUL))
#define bM4_SDIOC_INTST_RESPEND                         *((volatile unsigned int*)(0x42218500UL))
#define bM4_SDIOC_INTST_ACSEND                          *((volatile unsigned int*)(0x42218504UL))
#define bM4_SDIOC_INTST_BFF                             *((volatile unsigned int*)(0x42218508UL))
#define bM4_SDIOC_INTST_BFE                             *((volatile unsigned int*)(0x4221850CUL))
#define bM4_SDIOC_INTST_SDCDRM                          *((volatile unsigned int*)(0x42218510UL))
#define bM4_SDIOC_INTST_SDCDIN                          *((volatile unsigned int*)(0x42218514UL))
#define bM4_SDIOC_INTST_SDCDST                          *((volatile unsigned int*)(0x42218518UL))
#define bM4_SDIOC_INTST_SDWPST                          *((volatile unsigned int*)(0x4221851CUL))
#define bM4_SDIOC_INTST_SDDT3RM                         *((volatile unsigned int*)(0x42218520UL))
#define bM4_SDIOC_INTST_SDDT3IN                         *((volatile unsigned int*)(0x42218524UL))
#define bM4_SDIOC_INTST_SDDT3ST                         *((volatile unsigned int*)(0x42218528UL))
#define bM4_SDIOC_INTST_CMDERR                          *((volatile unsigned int*)(0x42218540UL))
#define bM4_SDIOC_INTST_CRCERR                          *((volatile unsigned int*)(0x42218544UL))
#define bM4_SDIOC_INTST_ENDERR                          *((volatile unsigned int*)(0x42218548UL))
#define bM4_SDIOC_INTST_DATTO                           *((volatile unsigned int*)(0x4221854CUL))
#define bM4_SDIOC_INTST_BFWERR                          *((volatile unsigned int*)(0x42218550UL))
#define bM4_SDIOC_INTST_BFRERR                          *((volatile unsigned int*)(0x42218554UL))
#define bM4_SDIOC_INTST_RESPTO                          *((volatile unsigned int*)(0x42218558UL))
#define bM4_SDIOC_INTST_DTOST                           *((volatile unsigned int*)(0x4221855CUL))
#define bM4_SDIOC_INTST_CMDBSY                          *((volatile unsigned int*)(0x42218560UL))
#define bM4_SDIOC_INTST_ACSERR                          *((volatile unsigned int*)(0x42218564UL))
#define bM4_SDIOC_INTST_SDCKEN                          *((volatile unsigned int*)(0x42218568UL))
#define bM4_SDIOC_INTST_RESV                            *((volatile unsigned int*)(0x4221857CUL))
#define bM4_SDIOC_INTMSK_RESPENDMSK                     *((volatile unsigned int*)(0x42218580UL))
#define bM4_SDIOC_INTMSK_ACSENDMSK                      *((volatile unsigned int*)(0x42218584UL))
#define bM4_SDIOC_INTMSK_BFFMSK                         *((volatile unsigned int*)(0x42218588UL))
#define bM4_SDIOC_INTMSK_BFEMSK                         *((volatile unsigned int*)(0x4221858CUL))
#define bM4_SDIOC_INTMSK_SDCDRMMSK                      *((volatile unsigned int*)(0x42218590UL))
#define bM4_SDIOC_INTMSK_SDCDINMSK                      *((volatile unsigned int*)(0x42218594UL))
#define bM4_SDIOC_INTMSK_SDDT3RMMSK                     *((volatile unsigned int*)(0x422185A0UL))
#define bM4_SDIOC_INTMSK_SDDT3INMSK                     *((volatile unsigned int*)(0x422185A4UL))
#define bM4_SDIOC_INTMSK_CMDERRMSK                      *((volatile unsigned int*)(0x422185C0UL))
#define bM4_SDIOC_INTMSK_CRCERRMSK                      *((volatile unsigned int*)(0x422185C4UL))
#define bM4_SDIOC_INTMSK_ENDERRMSK                      *((volatile unsigned int*)(0x422185C8UL))
#define bM4_SDIOC_INTMSK_DATTOMSK                       *((volatile unsigned int*)(0x422185CCUL))
#define bM4_SDIOC_INTMSK_BFWERRMSK                      *((volatile unsigned int*)(0x422185D0UL))
#define bM4_SDIOC_INTMSK_BFRERRMSK                      *((volatile unsigned int*)(0x422185D4UL))
#define bM4_SDIOC_INTMSK_RESPTOMSK                      *((volatile unsigned int*)(0x422185D8UL))
#define bM4_SDIOC_INTMSK_ACSERRMSK                      *((volatile unsigned int*)(0x422185E4UL))
#define bM4_SDIOC_INTMSK_RESV                           *((volatile unsigned int*)(0x422185FCUL))
#define bM4_SDIOC_IOMODE_IOINTEN                        *((volatile unsigned int*)(0x42218700UL))
#define bM4_SDIOC_IOMODE_RDWAIT                         *((volatile unsigned int*)(0x42218704UL))
#define bM4_SDIOC_IOMODE_RESV                           *((volatile unsigned int*)(0x4221877CUL))
#define bM4_SDIOC_IOINTST_IOINTST                       *((volatile unsigned int*)(0x42218780UL))
#define bM4_SDIOC_IOINTST_RESV                          *((volatile unsigned int*)(0x422187FCUL))
#define bM4_SDIOC_IOMSK_IOINTSTMSK                      *((volatile unsigned int*)(0x42218800UL))
#define bM4_SDIOC_IOMSK_RESV                            *((volatile unsigned int*)(0x4221887CUL))
#define bM4_SDIOC_DMAEN_DMAEN                           *((volatile unsigned int*)(0x42218980UL))
#define bM4_SDIOC_DMAEN_RESV                            *((volatile unsigned int*)(0x422189FCUL))
#define bM4_SMI_CR_EIOE                                 *((volatile unsigned int*)(0x42AA0000UL))
#define bM4_SMI_CR_IIE                                  *((volatile unsigned int*)(0x42AA0004UL))
#define bM4_SMI_CR_EIE                                  *((volatile unsigned int*)(0x42AA0008UL))
#define bM4_SMI_CR_B8BIT                                *((volatile unsigned int*)(0x42AA0020UL))
#define bM4_SMI_CR_ENB                                  *((volatile unsigned int*)(0x42AA0040UL))
#define bM4_SMI_CR_RESV                                 *((volatile unsigned int*)(0x42AA0060UL))
#define bM4_SMI_SR_ESF                                  *((volatile unsigned int*)(0x42AA0080UL))
#define bM4_SMI_SR_ISF                                  *((volatile unsigned int*)(0x42AA0084UL))
#define bM4_SMI_SR_EIF                                  *((volatile unsigned int*)(0x42AA0088UL))
#define bM4_SMI_SR_IIF                                  *((volatile unsigned int*)(0x42AA008CUL))
#define bM4_SMI_SR_EF                                   *((volatile unsigned int*)(0x42AA0090UL))
#define bM4_SMI_SCR_ISC                                 *((volatile unsigned int*)(0x42AA0104UL))
#define bM4_SMI_SCR_CEF                                 *((volatile unsigned int*)(0x42AA0110UL))
#define bM4_SPI_CR_SPIMDS                               *((volatile unsigned int*)(0x42380080UL))
#define bM4_SPI_CR_TXMDS                                *((volatile unsigned int*)(0x42380084UL))
#define bM4_SPI_CR_MSTR                                 *((volatile unsigned int*)(0x4238008CUL))
#define bM4_SPI_CR_SPLPBK                               *((volatile unsigned int*)(0x42380090UL))
#define bM4_SPI_CR_SPLPBK2                              *((volatile unsigned int*)(0x42380094UL))
#define bM4_SPI_CR_SPE                                  *((volatile unsigned int*)(0x42380098UL))
#define bM4_SPI_CR_SCKASTPE                             *((volatile unsigned int*)(0x4238009CUL))
#define bM4_SPI_CR_EIE                                  *((volatile unsigned int*)(0x423800A0UL))
#define bM4_SPI_CR_TXIE                                 *((volatile unsigned int*)(0x423800A4UL))
#define bM4_SPI_CR_RXIE                                 *((volatile unsigned int*)(0x423800A8UL))
#define bM4_SPI_CR_IDIE                                 *((volatile unsigned int*)(0x423800ACUL))
#define bM4_SPI_CR_MODFE                                *((volatile unsigned int*)(0x423800B0UL))
#define bM4_SPI_CR_PATE                                 *((volatile unsigned int*)(0x423800B4UL))
#define bM4_SPI_CR_PAOE                                 *((volatile unsigned int*)(0x423800B8UL))
#define bM4_SPI_CR_PAE                                  *((volatile unsigned int*)(0x423800BCUL))
#define bM4_SPI_OCR_MOIFE                               *((volatile unsigned int*)(0x42380100UL))
#define bM4_SPI_OCR_MOIFV                               *((volatile unsigned int*)(0x42380104UL))
#define bM4_SPI_OCR_SPOM                                *((volatile unsigned int*)(0x42380108UL))
#define bM4_SPI_OCR_SLSEL0                              *((volatile unsigned int*)(0x4238010CUL))
#define bM4_SPI_OCR_SLSEL1                              *((volatile unsigned int*)(0x42380110UL))
#define bM4_SPI_OCR_SPTDDL0                             *((volatile unsigned int*)(0x42380114UL))
#define bM4_SPI_OCR_SPTDDL1                             *((volatile unsigned int*)(0x42380118UL))
#define bM4_SPI_OCR_SPTDDL2                             *((volatile unsigned int*)(0x4238011CUL))
#define bM4_SPI_FCR_FRN0                                *((volatile unsigned int*)(0x42380180UL))
#define bM4_SPI_FCR_FRN1                                *((volatile unsigned int*)(0x42380184UL))
#define bM4_SPI_FCR_SPLW                                *((volatile unsigned int*)(0x42380190UL))
#define bM4_SPI_FCR_SPBYT                               *((volatile unsigned int*)(0x42380194UL))
#define bM4_SPI_FCR_SPRDTD                              *((volatile unsigned int*)(0x42380198UL))
#define bM4_SPI_FCR_SPWRAL                              *((volatile unsigned int*)(0x4238019CUL))
#define bM4_SPI_FCR_SS0PV                               *((volatile unsigned int*)(0x423801A0UL))
#define bM4_SPI_FCR_SS1PV                               *((volatile unsigned int*)(0x423801A4UL))
#define bM4_SPI_FCR_SS2PV                               *((volatile unsigned int*)(0x423801A8UL))
#define bM4_SPI_FCR_SS3PV                               *((volatile unsigned int*)(0x423801ACUL))
#define bM4_SPI_FCR_SS4PV                               *((volatile unsigned int*)(0x423801B0UL))
#define bM4_SPI_FCR_SS5PV                               *((volatile unsigned int*)(0x423801B4UL))
#define bM4_SPI_FCR_SS6PV                               *((volatile unsigned int*)(0x423801B8UL))
#define bM4_SPI_FCR_SS7PV                               *((volatile unsigned int*)(0x423801BCUL))
#define bM4_SPI_FCR_CMRSL0                              *((volatile unsigned int*)(0x423801C0UL))
#define bM4_SPI_FCR_CMRSL1                              *((volatile unsigned int*)(0x423801C4UL))
#define bM4_SPI_FCR_CMRSL2                              *((volatile unsigned int*)(0x423801C8UL))
#define bM4_SPI_FCR_SCKDL0                              *((volatile unsigned int*)(0x423801D0UL))
#define bM4_SPI_FCR_SCKDL1                              *((volatile unsigned int*)(0x423801D4UL))
#define bM4_SPI_FCR_SCKDL2                              *((volatile unsigned int*)(0x423801D8UL))
#define bM4_SPI_FCR_SSDL0                               *((volatile unsigned int*)(0x423801E0UL))
#define bM4_SPI_FCR_SSDL1                               *((volatile unsigned int*)(0x423801E4UL))
#define bM4_SPI_FCR_SSDL2                               *((volatile unsigned int*)(0x423801E8UL))
#define bM4_SPI_FCR_NXTDL0                              *((volatile unsigned int*)(0x423801F0UL))
#define bM4_SPI_FCR_NXTDL1                              *((volatile unsigned int*)(0x423801F4UL))
#define bM4_SPI_FCR_NXTDL2                              *((volatile unsigned int*)(0x423801F8UL))
#define bM4_SPI_SR_OVRERF                               *((volatile unsigned int*)(0x42380280UL))
#define bM4_SPI_SR_IDLNF                                *((volatile unsigned int*)(0x42380284UL))
#define bM4_SPI_SR_MODFERF                              *((volatile unsigned int*)(0x42380288UL))
#define bM4_SPI_SR_PERF                                 *((volatile unsigned int*)(0x4238028CUL))
#define bM4_SPI_SR_UDRERF                               *((volatile unsigned int*)(0x42380290UL))
#define bM4_SPI_SR_TDEF                                 *((volatile unsigned int*)(0x42380294UL))
#define bM4_SPI_SR_RDFF                                 *((volatile unsigned int*)(0x4238029CUL))
#define bM4_SPI_SR_CMRSP0                               *((volatile unsigned int*)(0x423802A0UL))
#define bM4_SPI_SR_CMRSP1                               *((volatile unsigned int*)(0x423802A4UL))
#define bM4_SPI_SR_CMRSP2                               *((volatile unsigned int*)(0x423802A8UL))
#define bM4_SPI_SR_ERRCM0                               *((volatile unsigned int*)(0x423802B0UL))
#define bM4_SPI_SR_ERRCM1                               *((volatile unsigned int*)(0x423802B4UL))
#define bM4_SPI_SR_ERRCM2                               *((volatile unsigned int*)(0x423802B8UL))
#define bM4_SPI_CMR0_CPHA                               *((volatile unsigned int*)(0x42380300UL))
#define bM4_SPI_CMR0_CPOL                               *((volatile unsigned int*)(0x42380304UL))
#define bM4_SPI_CMR0_BRDIV0                             *((volatile unsigned int*)(0x42380308UL))
#define bM4_SPI_CMR0_BRDIV1                             *((volatile unsigned int*)(0x4238030CUL))
#define bM4_SPI_CMR0_SSA0                               *((volatile unsigned int*)(0x42380310UL))
#define bM4_SPI_CMR0_SSA1                               *((volatile unsigned int*)(0x42380314UL))
#define bM4_SPI_CMR0_SSA2                               *((volatile unsigned int*)(0x42380318UL))
#define bM4_SPI_CMR0_BURST                              *((volatile unsigned int*)(0x4238031CUL))
#define bM4_SPI_CMR0_SPB0                               *((volatile unsigned int*)(0x42380320UL))
#define bM4_SPI_CMR0_SPB1                               *((volatile unsigned int*)(0x42380324UL))
#define bM4_SPI_CMR0_SPB2                               *((volatile unsigned int*)(0x42380328UL))
#define bM4_SPI_CMR0_SPB3                               *((volatile unsigned int*)(0x4238032CUL))
#define bM4_SPI_CMR0_LSBF                               *((volatile unsigned int*)(0x42380330UL))
#define bM4_SPI_CMR0_NXTDLE                             *((volatile unsigned int*)(0x42380334UL))
#define bM4_SPI_CMR0_SSDLE                              *((volatile unsigned int*)(0x42380338UL))
#define bM4_SPI_CMR0_SCKDLE                             *((volatile unsigned int*)(0x4238033CUL))
#define bM4_SPI_CMR1_CPHA                               *((volatile unsigned int*)(0x42380380UL))
#define bM4_SPI_CMR1_CPOL                               *((volatile unsigned int*)(0x42380384UL))
#define bM4_SPI_CMR1_BRDIV0                             *((volatile unsigned int*)(0x42380388UL))
#define bM4_SPI_CMR1_BRDIV1                             *((volatile unsigned int*)(0x4238038CUL))
#define bM4_SPI_CMR1_SSA0                               *((volatile unsigned int*)(0x42380390UL))
#define bM4_SPI_CMR1_SSA1                               *((volatile unsigned int*)(0x42380394UL))
#define bM4_SPI_CMR1_SSA2                               *((volatile unsigned int*)(0x42380398UL))
#define bM4_SPI_CMR1_BURST                              *((volatile unsigned int*)(0x4238039CUL))
#define bM4_SPI_CMR1_SPB0                               *((volatile unsigned int*)(0x423803A0UL))
#define bM4_SPI_CMR1_SPB1                               *((volatile unsigned int*)(0x423803A4UL))
#define bM4_SPI_CMR1_SPB2                               *((volatile unsigned int*)(0x423803A8UL))
#define bM4_SPI_CMR1_SPB3                               *((volatile unsigned int*)(0x423803ACUL))
#define bM4_SPI_CMR1_LSBF                               *((volatile unsigned int*)(0x423803B0UL))
#define bM4_SPI_CMR1_NXTDLE                             *((volatile unsigned int*)(0x423803B4UL))
#define bM4_SPI_CMR1_SSDLE                              *((volatile unsigned int*)(0x423803B8UL))
#define bM4_SPI_CMR1_SCKDLE                             *((volatile unsigned int*)(0x423803BCUL))
#define bM4_SPI_CMR2_CPHA                               *((volatile unsigned int*)(0x42380400UL))
#define bM4_SPI_CMR2_CPOL                               *((volatile unsigned int*)(0x42380404UL))
#define bM4_SPI_CMR2_BRDIV0                             *((volatile unsigned int*)(0x42380408UL))
#define bM4_SPI_CMR2_BRDIV1                             *((volatile unsigned int*)(0x4238040CUL))
#define bM4_SPI_CMR2_SSA0                               *((volatile unsigned int*)(0x42380410UL))
#define bM4_SPI_CMR2_SSA1                               *((volatile unsigned int*)(0x42380414UL))
#define bM4_SPI_CMR2_SSA2                               *((volatile unsigned int*)(0x42380418UL))
#define bM4_SPI_CMR2_BURST                              *((volatile unsigned int*)(0x4238041CUL))
#define bM4_SPI_CMR2_SPB0                               *((volatile unsigned int*)(0x42380420UL))
#define bM4_SPI_CMR2_SPB1                               *((volatile unsigned int*)(0x42380424UL))
#define bM4_SPI_CMR2_SPB2                               *((volatile unsigned int*)(0x42380428UL))
#define bM4_SPI_CMR2_SPB3                               *((volatile unsigned int*)(0x4238042CUL))
#define bM4_SPI_CMR2_LSBF                               *((volatile unsigned int*)(0x42380430UL))
#define bM4_SPI_CMR2_NXTDLE                             *((volatile unsigned int*)(0x42380434UL))
#define bM4_SPI_CMR2_SSDLE                              *((volatile unsigned int*)(0x42380438UL))
#define bM4_SPI_CMR2_SCKDLE                             *((volatile unsigned int*)(0x4238043CUL))
#define bM4_SPI_CMR3_CPHA                               *((volatile unsigned int*)(0x42380480UL))
#define bM4_SPI_CMR3_CPOL                               *((volatile unsigned int*)(0x42380484UL))
