RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_SPI_CMR3_BRDIV0                             *((volatile unsigned int*)(0x42380488UL))
#define bM4_SPI_CMR3_BRDIV1                             *((volatile unsigned int*)(0x4238048CUL))
#define bM4_SPI_CMR3_SSA0                               *((volatile unsigned int*)(0x42380490UL))
#define bM4_SPI_CMR3_SSA1                               *((volatile unsigned int*)(0x42380494UL))
#define bM4_SPI_CMR3_SSA2                               *((volatile unsigned int*)(0x42380498UL))
#define bM4_SPI_CMR3_BURST                              *((volatile unsigned int*)(0x4238049CUL))
#define bM4_SPI_CMR3_SPB0                               *((volatile unsigned int*)(0x423804A0UL))
#define bM4_SPI_CMR3_SPB1                               *((volatile unsigned int*)(0x423804A4UL))
#define bM4_SPI_CMR3_SPB2                               *((volatile unsigned int*)(0x423804A8UL))
#define bM4_SPI_CMR3_SPB3                               *((volatile unsigned int*)(0x423804ACUL))
#define bM4_SPI_CMR3_LSBF                               *((volatile unsigned int*)(0x423804B0UL))
#define bM4_SPI_CMR3_NXTDLE                             *((volatile unsigned int*)(0x423804B4UL))
#define bM4_SPI_CMR3_SSDLE                              *((volatile unsigned int*)(0x423804B8UL))
#define bM4_SPI_CMR3_SCKDLE                             *((volatile unsigned int*)(0x423804BCUL))
#define bM4_SPI_DCR2_BYSW                               *((volatile unsigned int*)(0x42380720UL))
#define bM4_SPI_PR_BUSSIZ                               *((volatile unsigned int*)(0x42380790UL))
#define bM4_SPI_PR_BUFNUM0                              *((volatile unsigned int*)(0x423807A0UL))
#define bM4_SPI_PR_BUFNUM1                              *((volatile unsigned int*)(0x423807A4UL))
#define bM4_SPI_PR_BUFNUM2                              *((volatile unsigned int*)(0x423807A8UL))
#define bM4_SPI_PR_CMDNUM0                              *((volatile unsigned int*)(0x423807B0UL))
#define bM4_SPI_PR_CMDNUM1                              *((volatile unsigned int*)(0x423807B4UL))
#define bM4_SPI_PR_CMDNUM2                              *((volatile unsigned int*)(0x423807B8UL))
#define bM4_SPI_PR_CMDNUM3                              *((volatile unsigned int*)(0x423807BCUL))
#define bM4_SRAMC_WTCR_SRAMSYSRWT0                      *((volatile unsigned int*)(0x42A10000UL))
#define bM4_SRAMC_WTCR_SRAMSYSRWT1                      *((volatile unsigned int*)(0x42A10004UL))
#define bM4_SRAMC_WTCR_SRAMSYSRWT2                      *((volatile unsigned int*)(0x42A10008UL))
#define bM4_SRAMC_WTCR_SRAMSYSWWT0                      *((volatile unsigned int*)(0x42A10010UL))
#define bM4_SRAMC_WTCR_SRAMSYSWWT1                      *((volatile unsigned int*)(0x42A10014UL))
#define bM4_SRAMC_WTCR_SRAMSYSWWT2                      *((volatile unsigned int*)(0x42A10018UL))
#define bM4_SRAMC_WTCR_SRAMECCRWT0                      *((volatile unsigned int*)(0x42A10020UL))
#define bM4_SRAMC_WTCR_SRAMECCRWT1                      *((volatile unsigned int*)(0x42A10024UL))
#define bM4_SRAMC_WTCR_SRAMECCRWT2                      *((volatile unsigned int*)(0x42A10028UL))
#define bM4_SRAMC_WTCR_SRAMECCWWT0                      *((volatile unsigned int*)(0x42A10030UL))
#define bM4_SRAMC_WTCR_SRAMECCWWT1                      *((volatile unsigned int*)(0x42A10034UL))
#define bM4_SRAMC_WTCR_SRAMECCWWT2                      *((volatile unsigned int*)(0x42A10038UL))
#define bM4_SRAMC_WTCR_SRAMHSRWT0                       *((volatile unsigned int*)(0x42A10040UL))
#define bM4_SRAMC_WTCR_SRAMHSRWT1                       *((volatile unsigned int*)(0x42A10044UL))
#define bM4_SRAMC_WTCR_SRAMHSRWT2                       *((volatile unsigned int*)(0x42A10048UL))
#define bM4_SRAMC_WTCR_SRAMHSWWT0                       *((volatile unsigned int*)(0x42A10050UL))
#define bM4_SRAMC_WTCR_SRAMHSWWT1                       *((volatile unsigned int*)(0x42A10054UL))
#define bM4_SRAMC_WTCR_SRAMHSWWT2                       *((volatile unsigned int*)(0x42A10058UL))
#define bM4_SRAMC_WTCR_SRAMBKRWT0                       *((volatile unsigned int*)(0x42A10060UL))
#define bM4_SRAMC_WTCR_SRAMBKRWT1                       *((volatile unsigned int*)(0x42A10064UL))
#define bM4_SRAMC_WTCR_SRAMBKRWT2                       *((volatile unsigned int*)(0x42A10068UL))
#define bM4_SRAMC_WTCR_SRAMBKWWT0                       *((volatile unsigned int*)(0x42A10070UL))
#define bM4_SRAMC_WTCR_SRAMBKWWT1                       *((volatile unsigned int*)(0x42A10074UL))
#define bM4_SRAMC_WTCR_SRAMBKWWT2                       *((volatile unsigned int*)(0x42A10078UL))
#define bM4_SRAMC_WTPR_WTPRC                            *((volatile unsigned int*)(0x42A10080UL))
#define bM4_SRAMC_WTPR_WTPRKW0                          *((volatile unsigned int*)(0x42A10084UL))
#define bM4_SRAMC_WTPR_WTPRKW1                          *((volatile unsigned int*)(0x42A10088UL))
#define bM4_SRAMC_WTPR_WTPRKW2                          *((volatile unsigned int*)(0x42A1008CUL))
#define bM4_SRAMC_WTPR_WTPRKW3                          *((volatile unsigned int*)(0x42A10090UL))
#define bM4_SRAMC_WTPR_WTPRKW4                          *((volatile unsigned int*)(0x42A10094UL))
#define bM4_SRAMC_WTPR_WTPRKW5                          *((volatile unsigned int*)(0x42A10098UL))
#define bM4_SRAMC_WTPR_WTPRKW6                          *((volatile unsigned int*)(0x42A1009CUL))
#define bM4_SRAMC_CKCR_PYOAD                            *((volatile unsigned int*)(0x42A10100UL))
#define bM4_SRAMC_CKCR_ECCOAD                           *((volatile unsigned int*)(0x42A10140UL))
#define bM4_SRAMC_CKCR_ECCMOD0                          *((volatile unsigned int*)(0x42A10160UL))
#define bM4_SRAMC_CKCR_ECCMOD1                          *((volatile unsigned int*)(0x42A10164UL))
#define bM4_SRAMC_CKPR_CKPRC                            *((volatile unsigned int*)(0x42A10180UL))
#define bM4_SRAMC_CKPR_CKPRKW0                          *((volatile unsigned int*)(0x42A10184UL))
#define bM4_SRAMC_CKPR_CKPRKW1                          *((volatile unsigned int*)(0x42A10188UL))
#define bM4_SRAMC_CKPR_CKPRKW2                          *((volatile unsigned int*)(0x42A1018CUL))
#define bM4_SRAMC_CKPR_CKPRKW3                          *((volatile unsigned int*)(0x42A10190UL))
#define bM4_SRAMC_CKPR_CKPRKW4                          *((volatile unsigned int*)(0x42A10194UL))
#define bM4_SRAMC_CKPR_CKPRKW5                          *((volatile unsigned int*)(0x42A10198UL))
#define bM4_SRAMC_CKPR_CKPRKW6                          *((volatile unsigned int*)(0x42A1019CUL))
#define bM4_SRAMC_CKSR_SRAMECC1ERR                      *((volatile unsigned int*)(0x42A10200UL))
#define bM4_SRAMC_CKSR_SRAMECC2ERR                      *((volatile unsigned int*)(0x42A10204UL))
#define bM4_SRAMC_CKSR_SRAMSYSPYERR                     *((volatile unsigned int*)(0x42A10208UL))
#define bM4_SRAMC_CKSR_SRAMHSPYERR                      *((volatile unsigned int*)(0x42A1020CUL))
#define bM4_SRAMC_CKSR_SRAMBKPYERR                      *((volatile unsigned int*)(0x42A10210UL))
#define bM4_SWDT_SR_CNT0                                *((volatile unsigned int*)(0x42928080UL))
#define bM4_SWDT_SR_CNT1                                *((volatile unsigned int*)(0x42928084UL))
#define bM4_SWDT_SR_CNT2                                *((volatile unsigned int*)(0x42928088UL))
#define bM4_SWDT_SR_CNT3                                *((volatile unsigned int*)(0x4292808CUL))
#define bM4_SWDT_SR_CNT4                                *((volatile unsigned int*)(0x42928090UL))
#define bM4_SWDT_SR_CNT5                                *((volatile unsigned int*)(0x42928094UL))
#define bM4_SWDT_SR_CNT6                                *((volatile unsigned int*)(0x42928098UL))
#define bM4_SWDT_SR_CNT7                                *((volatile unsigned int*)(0x4292809CUL))
#define bM4_SWDT_SR_CNT8                                *((volatile unsigned int*)(0x429280A0UL))
#define bM4_SWDT_SR_CNT9                                *((volatile unsigned int*)(0x429280A4UL))
#define bM4_SWDT_SR_CNT10                               *((volatile unsigned int*)(0x429280A8UL))
#define bM4_SWDT_SR_CNT11                               *((volatile unsigned int*)(0x429280ACUL))
#define bM4_SWDT_SR_CNT12                               *((volatile unsigned int*)(0x429280B0UL))
#define bM4_SWDT_SR_CNT13                               *((volatile unsigned int*)(0x429280B4UL))
#define bM4_SWDT_SR_CNT14                               *((volatile unsigned int*)(0x429280B8UL))
#define bM4_SWDT_SR_CNT15                               *((volatile unsigned int*)(0x429280BCUL))
#define bM4_SWDT_SR_UDF                                 *((volatile unsigned int*)(0x429280C0UL))
#define bM4_SWDT_SR_REF                                 *((volatile unsigned int*)(0x429280C4UL))
#define bM4_SWDT_SR_RESV                                *((volatile unsigned int*)(0x429280E0UL))
#define bM4_SYSREG_PWRC3_EXBUSOE                        *((volatile unsigned int*)(0x42A801B8UL))
#define bM4_SYSREG_PWRC3_STOP                           *((volatile unsigned int*)(0x42A801BCUL))
#define bM4_SYSREG_CMU_ADCKSEL_ADCKSEL0                 *((volatile unsigned int*)(0x42A80200UL))
#define bM4_SYSREG_CMU_ADCKSEL_ADCKSEL1                 *((volatile unsigned int*)(0x42A80204UL))
#define bM4_SYSREG_CMU_ADCKSEL_ADCKSEL2                 *((volatile unsigned int*)(0x42A80208UL))
#define bM4_SYSREG_CMU_ADCKSEL_CANCKSEL                 *((volatile unsigned int*)(0x42A80220UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK0S0                    *((volatile unsigned int*)(0x42A80400UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK0S1                    *((volatile unsigned int*)(0x42A80404UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK0S2                    *((volatile unsigned int*)(0x42A80408UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK1S0                    *((volatile unsigned int*)(0x42A80410UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK1S1                    *((volatile unsigned int*)(0x42A80414UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK1S2                    *((volatile unsigned int*)(0x42A80418UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK2S0                    *((volatile unsigned int*)(0x42A80420UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK2S1                    *((volatile unsigned int*)(0x42A80424UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK2S2                    *((volatile unsigned int*)(0x42A80428UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK3S0                    *((volatile unsigned int*)(0x42A80430UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK3S1                    *((volatile unsigned int*)(0x42A80434UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK3S2                    *((volatile unsigned int*)(0x42A80438UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK4S0                    *((volatile unsigned int*)(0x42A80440UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK4S1                    *((volatile unsigned int*)(0x42A80444UL))
#define bM4_SYSREG_CMU_SCFGR_PCLK4S2                    *((volatile unsigned int*)(0x42A80448UL))
#define bM4_SYSREG_CMU_SCFGR_EXCKS0                     *((volatile unsigned int*)(0x42A80450UL))
#define bM4_SYSREG_CMU_SCFGR_EXCKS1                     *((volatile unsigned int*)(0x42A80454UL))
#define bM4_SYSREG_CMU_SCFGR_EXCKS2                     *((volatile unsigned int*)(0x42A80458UL))
#define bM4_SYSREG_CMU_SCFGR_HCLKS0                     *((volatile unsigned int*)(0x42A80460UL))
#define bM4_SYSREG_CMU_SCFGR_HCLKS1                     *((volatile unsigned int*)(0x42A80464UL))
#define bM4_SYSREG_CMU_SCFGR_HCLKS2                     *((volatile unsigned int*)(0x42A80468UL))
#define bM4_SYSREG_CMU_UFSCKCFGR_USBCKS0                *((volatile unsigned int*)(0x42A80490UL))
#define bM4_SYSREG_CMU_UFSCKCFGR_USBCKS1                *((volatile unsigned int*)(0x42A80494UL))
#define bM4_SYSREG_CMU_UFSCKCFGR_USBCKS2                *((volatile unsigned int*)(0x42A80498UL))
#define bM4_SYSREG_CMU_UFSCKCFGR_USBCKS3                *((volatile unsigned int*)(0x42A8049CUL))
#define bM4_SYSREG_CMU_CKSWR_CKSW0                      *((volatile unsigned int*)(0x42A804C0UL))
#define bM4_SYSREG_CMU_CKSWR_CKSW1                      *((volatile unsigned int*)(0x42A804C4UL))
#define bM4_SYSREG_CMU_CKSWR_CKSW2                      *((volatile unsigned int*)(0x42A804C8UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLM0                   *((volatile unsigned int*)(0x42A80500UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLM1                   *((volatile unsigned int*)(0x42A80504UL))
#define bM4_SYSREG_CMU_PLLCFGR_PLLSRC                   *((volatile unsigned int*)(0x42A80510UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLP0                   *((volatile unsigned int*)(0x42A80514UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLP1                   *((volatile unsigned int*)(0x42A80518UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLP2                   *((volatile unsigned int*)(0x42A8051CUL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN0                   *((volatile unsigned int*)(0x42A80520UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN1                   *((volatile unsigned int*)(0x42A80524UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN2                   *((volatile unsigned int*)(0x42A80528UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN3                   *((volatile unsigned int*)(0x42A8052CUL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN4                   *((volatile unsigned int*)(0x42A80530UL))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLN5                   *((volatile unsigned int*)(0x42A80534UL))
#define bM4_SYSREG_CMU_PLLCR_MPLLOFF                    *((volatile unsigned int*)(0x42A80540UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLM0                  *((volatile unsigned int*)(0x42A80580UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLM1                  *((volatile unsigned int*)(0x42A80584UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLP0                  *((volatile unsigned int*)(0x42A80594UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLP1                  *((volatile unsigned int*)(0x42A80598UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLP2                  *((volatile unsigned int*)(0x42A8059CUL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN0                  *((volatile unsigned int*)(0x42A805A0UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN1                  *((volatile unsigned int*)(0x42A805A4UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN2                  *((volatile unsigned int*)(0x42A805A8UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN3                  *((volatile unsigned int*)(0x42A805ACUL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN4                  *((volatile unsigned int*)(0x42A805B0UL))
#define bM4_SYSREG_CMU_UPLLCFGR_UPLLN5                  *((volatile unsigned int*)(0x42A805B4UL))
#define bM4_SYSREG_CMU_UPLLCR_UPLLOFF                   *((volatile unsigned int*)(0x42A805C0UL))
#define bM4_SYSREG_CMU_XTALCR_XTALSTP                   *((volatile unsigned int*)(0x42A80640UL))
#define bM4_SYSREG_CMU_HRCCR_HRCSTP                     *((volatile unsigned int*)(0x42A806C0UL))
#define bM4_SYSREG_CMU_MRCCR_MRCSTP                     *((volatile unsigned int*)(0x42A80700UL))
#define bM4_SYSREG_CMU_OSCSTBSR_HRCSTBF                 *((volatile unsigned int*)(0x42A80780UL))
#define bM4_SYSREG_CMU_OSCSTBSR_XTALSTBF                *((volatile unsigned int*)(0x42A8078CUL))
#define bM4_SYSREG_CMU_OSCSTBSR_MPLLSTBF                *((volatile unsigned int*)(0x42A80794UL))
#define bM4_SYSREG_CMU_OSCSTBSR_UPLLSTBF                *((volatile unsigned int*)(0x42A80798UL))
#define bM4_SYSREG_CMU_MCOCFGR_MCOSEL0                  *((volatile unsigned int*)(0x42A807C0UL))
#define bM4_SYSREG_CMU_MCOCFGR_MCOSEL1                  *((volatile unsigned int*)(0x42A807C4UL))
#define bM4_SYSREG_CMU_MCOCFGR_MCOSEL2                  *((volatile unsigned int*)(0x42A807C8UL))
#define bM4_SYSREG_CMU_MCOCFGR_MCOSEL3                  *((volatile unsigned int*)(0x42A807CCUL))
#define bM4_SYSREG_CMU_MCOCFGR_MCODIV0                  *((volatile unsigned int*)(0x42A807D0UL))
#define bM4_SYSREG_CMU_MCOCFGR_MCODIV1                  *((volatile unsigned int*)(0x42A807D4UL))
#define bM4_SYSREG_CMU_MCOCFGR_MCODIV2                  *((volatile unsigned int*)(0x42A807D8UL))
#define bM4_SYSREG_CMU_MCOCFGR_MCOEN                    *((volatile unsigned int*)(0x42A807DCUL))
#define bM4_SYSREG_CMU_TPIUCKCFGR_TPIUCKS0              *((volatile unsigned int*)(0x42A807E0UL))
#define bM4_SYSREG_CMU_TPIUCKCFGR_TPIUCKS1              *((volatile unsigned int*)(0x42A807E4UL))
#define bM4_SYSREG_CMU_TPIUCKCFGR_TPIUCKS2              *((volatile unsigned int*)(0x42A807E8UL))
#define bM4_SYSREG_CMU_TPIUCKCFGR_TPIUCKS3              *((volatile unsigned int*)(0x42A807ECUL))
#define bM4_SYSREG_CMU_TPIUCKCFGR_TPIUCKOE              *((volatile unsigned int*)(0x42A807FCUL))
#define bM4_SYSREG_CMU_XTALSTDCR_XTALSTDIE              *((volatile unsigned int*)(0x42A80800UL))
#define bM4_SYSREG_CMU_XTALSTDCR_XTALSTDRE              *((volatile unsigned int*)(0x42A80804UL))
#define bM4_SYSREG_CMU_XTALSTDCR_XTALSTDRIS             *((volatile unsigned int*)(0x42A80808UL))
#define bM4_SYSREG_CMU_XTALSTDCR_XTALSTDE               *((volatile unsigned int*)(0x42A8081CUL))
#define bM4_SYSREG_CMU_XTALSTDSR_XTALSTDF               *((volatile unsigned int*)(0x42A80820UL))
#define bM4_SYSREG_CMU_XTALSTBCR_XTALSTB0               *((volatile unsigned int*)(0x42A81440UL))
#define bM4_SYSREG_CMU_XTALSTBCR_XTALSTB1               *((volatile unsigned int*)(0x42A81444UL))
#define bM4_SYSREG_CMU_XTALSTBCR_XTALSTB2               *((volatile unsigned int*)(0x42A81448UL))
#define bM4_SYSREG_CMU_XTALSTBCR_XTALSTB3               *((volatile unsigned int*)(0x42A8144CUL))
#define bM4_SYSREG_RSTF0_PORF                           *((volatile unsigned int*)(0x42A81800UL))
#define bM4_SYSREG_RSTF0_PINRF                          *((volatile unsigned int*)(0x42A81804UL))
#define bM4_SYSREG_RSTF0_VD0RF                          *((volatile unsigned int*)(0x42A81808UL))
#define bM4_SYSREG_RSTF0_VD1RF                          *((volatile unsigned int*)(0x42A8180CUL))
#define bM4_SYSREG_RSTF0_VD2RF                          *((volatile unsigned int*)(0x42A81810UL))
#define bM4_SYSREG_RSTF0_WDRF                           *((volatile unsigned int*)(0x42A81814UL))
#define bM4_SYSREG_RSTF0_SWDRF                          *((volatile unsigned int*)(0x42A81818UL))
#define bM4_SYSREG_RSTF0_PDRF                           *((volatile unsigned int*)(0x42A8181CUL))
#define bM4_SYSREG_RSTF0_SWRF                           *((volatile unsigned int*)(0x42A81820UL))
#define bM4_SYSREG_RSTF0_MPUERF                         *((volatile unsigned int*)(0x42A81824UL))
#define bM4_SYSREG_RSTF0_RAPERF                         *((volatile unsigned int*)(0x42A81828UL))
#define bM4_SYSREG_RSTF0_RAECRF                         *((volatile unsigned int*)(0x42A8182CUL))
#define bM4_SYSREG_RSTF0_CKFERF                         *((volatile unsigned int*)(0x42A81830UL))
#define bM4_SYSREG_RSTF0_XTALERF                        *((volatile unsigned int*)(0x42A81834UL))
#define bM4_SYSREG_RSTF0_MULTIRF                        *((volatile unsigned int*)(0x42A81838UL))
#define bM4_SYSREG_RSTF0_CLRF                           *((volatile unsigned int*)(0x42A8183CUL))
#define bM4_SYSREG_VDUICR_VDU1NMIS                      *((volatile unsigned int*)(0x42A81C00UL))
#define bM4_SYSREG_VDUICR_VDU1EDGS0                     *((volatile unsigned int*)(0x42A81C04UL))
#define bM4_SYSREG_VDUICR_VDU1EDGS1                     *((volatile unsigned int*)(0x42A81C08UL))
#define bM4_SYSREG_VDUICR_VDU2NMIS                      *((volatile unsigned int*)(0x42A81C10UL))
#define bM4_SYSREG_VDUICR_VDU2EDGS0                     *((volatile unsigned int*)(0x42A81C14UL))
#define bM4_SYSREG_VDUICR_VDU2EDGS1                     *((volatile unsigned int*)(0x42A81C18UL))
#define bM4_SYSREG_VDUDSR_VDU1DETST                     *((volatile unsigned int*)(0x42A81C20UL))
#define bM4_SYSREG_VDUDSR_VDU1DETFLG                    *((volatile unsigned int*)(0x42A81C24UL))
#define bM4_SYSREG_VDUDSR_VDU2DETST                     *((volatile unsigned int*)(0x42A81C30UL))
#define bM4_SYSREG_VDUDSR_VDU2DETFLG                    *((volatile unsigned int*)(0x42A81C34UL))
#define bM4_SYSREG_FPRC_FPRCB0                          *((volatile unsigned int*)(0x42A87FC0UL))
#define bM4_SYSREG_FPRC_FPRCB1                          *((volatile unsigned int*)(0x42A87FC4UL))
#define bM4_SYSREG_FPRC_FPRCB2                          *((volatile unsigned int*)(0x42A87FC8UL))
#define bM4_SYSREG_FPRC_FPRCB3                          *((volatile unsigned int*)(0x42A87FCCUL))
#define bM4_SYSREG_FPRC_FPRCB4                          *((volatile unsigned int*)(0x42A87FD0UL))
#define bM4_SYSREG_FPRC_FPRCB5                          *((volatile unsigned int*)(0x42A87FD4UL))
#define bM4_SYSREG_FPRC_FPRCB6                          *((volatile unsigned int*)(0x42A87FD8UL))
#define bM4_SYSREG_FPRC_FPRCB7                          *((volatile unsigned int*)(0x42A87FDCUL))
#define bM4_SYSREG_FPRC_FPRCWE0                         *((volatile unsigned int*)(0x42A87FE0UL))
#define bM4_SYSREG_FPRC_FPRCWE1                         *((volatile unsigned int*)(0x42A87FE4UL))
#define bM4_SYSREG_FPRC_FPRCWE2                         *((volatile unsigned int*)(0x42A87FE8UL))
#define bM4_SYSREG_FPRC_FPRCWE3                         *((volatile unsigned int*)(0x42A87FECUL))
#define bM4_SYSREG_FPRC_FPRCWE4                         *((volatile unsigned int*)(0x42A87FF0UL))
#define bM4_SYSREG_FPRC_FPRCWE5                         *((volatile unsigned int*)(0x42A87FF4UL))
#define bM4_SYSREG_FPRC_FPRCWE6                         *((volatile unsigned int*)(0x42A87FF8UL))
#define bM4_SYSREG_FPRC_FPRCWE7                         *((volatile unsigned int*)(0x42A87FFCUL))
#define bM4_SYSREG_PWRC0_PDNMD0                         *((volatile unsigned int*)(0x42A88000UL))
#define bM4_SYSREG_PWRC0_PDNMD1                         *((volatile unsigned int*)(0x42A88004UL))
#define bM4_SYSREG_PWRC0_IORTN                          *((volatile unsigned int*)(0x42A88018UL))
#define bM4_SYSREG_PWRC0_PWDN                           *((volatile unsigned int*)(0x42A8801CUL))
#define bM4_SYSREG_PWRC1_VDDSCM                         *((volatile unsigned int*)(0x42A88024UL))
#define bM4_SYSREG_PWRC1_PWRCHGFLG                      *((volatile unsigned int*)(0x42A8802CUL))
#define bM4_SYSREG_PWRC2_RUNMODESEL0                    *((volatile unsigned int*)(0x42A88040UL))
#define bM4_SYSREG_PWRC2_RUNMODESEL1                    *((volatile unsigned int*)(0x42A88044UL))
#define bM4_SYSREG_PWRC2_RUNMODESEL2                    *((volatile unsigned int*)(0x42A88048UL))
#define bM4_SYSREG_PWRC2_RUNMODESEL3                    *((volatile unsigned int*)(0x42A8804CUL))
#define bM4_SYSREG_PWRC2_STPMDS0                        *((volatile unsigned int*)(0x42A88054UL))
#define bM4_SYSREG_PWRC2_STPMDS1                        *((volatile unsigned int*)(0x42A88058UL))
#define bM4_SYSREG_PWRC2_STPMDS2                        *((volatile unsigned int*)(0x42A8805CUL))
#define bM4_SYSREG_PDWKE0_PTWKE0                        *((volatile unsigned int*)(0x42A88080UL))
#define bM4_SYSREG_PDWKE0_PTWKE1                        *((volatile unsigned int*)(0x42A88084UL))
#define bM4_SYSREG_PDWKE0_PTWKE2                        *((volatile unsigned int*)(0x42A88088UL))
#define bM4_SYSREG_PDWKE0_PTWKE3                        *((volatile unsigned int*)(0x42A8808CUL))
#define bM4_SYSREG_PDWKE0_PTWKE4                        *((volatile unsigned int*)(0x42A88090UL))
#define bM4_SYSREG_PDWKE0_PTWKE5                        *((volatile unsigned int*)(0x42A88094UL))
#define bM4_SYSREG_PDWKE0_PTWKE6                        *((volatile unsigned int*)(0x42A88098UL))
#define bM4_SYSREG_PDWKE0_PTWKE7                        *((volatile unsigned int*)(0x42A8809CUL))
#define bM4_SYSREG_PDWKE1_PTWKE8                        *((volatile unsigned int*)(0x42A880A0UL))
#define bM4_SYSREG_PDWKE1_PTWKE9                        *((volatile unsigned int*)(0x42A880A4UL))
