RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_SYSREG_PDWKE1_PTWKE10                       *((volatile unsigned int*)(0x42A880A8UL))
#define bM4_SYSREG_PDWKE1_PTWKE11                       *((volatile unsigned int*)(0x42A880ACUL))
#define bM4_SYSREG_PDWKE1_PTWKE12                       *((volatile unsigned int*)(0x42A880B0UL))
#define bM4_SYSREG_PDWKE1_PTWKE13                       *((volatile unsigned int*)(0x42A880B4UL))
#define bM4_SYSREG_PDWKE1_PTWKE14                       *((volatile unsigned int*)(0x42A880B8UL))
#define bM4_SYSREG_PDWKE1_PTWKE15                       *((volatile unsigned int*)(0x42A880BCUL))
#define bM4_SYSREG_PDWKE2_VD1WKE                        *((volatile unsigned int*)(0x42A880C0UL))
#define bM4_SYSREG_PDWKE2_VD2WKE                        *((volatile unsigned int*)(0x42A880C4UL))
#define bM4_SYSREG_PDWKE2_RTCPRDWKE                     *((volatile unsigned int*)(0x42A880C8UL))
#define bM4_SYSREG_PDWKE2_RTCALMWKE                     *((volatile unsigned int*)(0x42A880CCUL))
#define bM4_SYSREG_PDWKE2_NMIWKE                        *((volatile unsigned int*)(0x42A880D0UL))
#define bM4_SYSREG_PDWKES0_PTWK0EG                      *((volatile unsigned int*)(0x42A88100UL))
#define bM4_SYSREG_PDWKES0_PTWK1EG                      *((volatile unsigned int*)(0x42A88104UL))
#define bM4_SYSREG_PDWKES0_PTWK2EG                      *((volatile unsigned int*)(0x42A88108UL))
#define bM4_SYSREG_PDWKES0_PTWK3EG                      *((volatile unsigned int*)(0x42A8810CUL))
#define bM4_SYSREG_PDWKES0_PTWK4EG                      *((volatile unsigned int*)(0x42A88110UL))
#define bM4_SYSREG_PDWKES0_PTWK5EG                      *((volatile unsigned int*)(0x42A88114UL))
#define bM4_SYSREG_PDWKES0_PTWK6EG                      *((volatile unsigned int*)(0x42A88118UL))
#define bM4_SYSREG_PDWKES0_PTWK7EG                      *((volatile unsigned int*)(0x42A8811CUL))
#define bM4_SYSREG_PDWKES1_PTWK8EG                      *((volatile unsigned int*)(0x42A88120UL))
#define bM4_SYSREG_PDWKES1_PTWK9EG                      *((volatile unsigned int*)(0x42A88124UL))
#define bM4_SYSREG_PDWKES1_PTWK10EG                     *((volatile unsigned int*)(0x42A88128UL))
#define bM4_SYSREG_PDWKES1_PTWK11EG                     *((volatile unsigned int*)(0x42A8812CUL))
#define bM4_SYSREG_PDWKES1_PTWK12EG                     *((volatile unsigned int*)(0x42A88130UL))
#define bM4_SYSREG_PDWKES1_PTWK13EG                     *((volatile unsigned int*)(0x42A88134UL))
#define bM4_SYSREG_PDWKES1_PTWK14EG                     *((volatile unsigned int*)(0x42A88138UL))
#define bM4_SYSREG_PDWKES1_PTWK15EG                     *((volatile unsigned int*)(0x42A8813CUL))
#define bM4_SYSREG_PDWKES2_NMIEG                        *((volatile unsigned int*)(0x42A88150UL))
#define bM4_SYSREG_PDWKFLG0_PTWKFLG0                    *((volatile unsigned int*)(0x42A88160UL))
#define bM4_SYSREG_PDWKFLG0_PTWKFLG1                    *((volatile unsigned int*)(0x42A88164UL))
#define bM4_SYSREG_PDWKFLG0_PTWKFLG2                    *((volatile unsigned int*)(0x42A88168UL))
#define bM4_SYSREG_PDWKFLG0_PTWKFLG3                    *((volatile unsigned int*)(0x42A8816CUL))
#define bM4_SYSREG_PDWKFLG0_PTWKFLG4                    *((volatile unsigned int*)(0x42A88170UL))
#define bM4_SYSREG_PDWKFLG0_PTWKFLG5                    *((volatile unsigned int*)(0x42A88174UL))
#define bM4_SYSREG_PDWKFLG0_PTWKFLG6                    *((volatile unsigned int*)(0x42A88178UL))
#define bM4_SYSREG_PDWKFLG0_PTWKFLG7                    *((volatile unsigned int*)(0x42A8817CUL))
#define bM4_SYSREG_PDWKFLG1_PTWKFLG8                    *((volatile unsigned int*)(0x42A88180UL))
#define bM4_SYSREG_PDWKFLG1_PTWKFLG9                    *((volatile unsigned int*)(0x42A88184UL))
#define bM4_SYSREG_PDWKFLG1_PTWKFLG10                   *((volatile unsigned int*)(0x42A88188UL))
#define bM4_SYSREG_PDWKFLG1_PTWKFLG11                   *((volatile unsigned int*)(0x42A8818CUL))
#define bM4_SYSREG_PDWKFLG1_PTWKFLG12                   *((volatile unsigned int*)(0x42A88190UL))
#define bM4_SYSREG_PDWKFLG1_PTWKFLG13                   *((volatile unsigned int*)(0x42A88194UL))
#define bM4_SYSREG_PDWKFLG1_PTWKFLG14                   *((volatile unsigned int*)(0x42A88198UL))
#define bM4_SYSREG_PDWKFLG1_PTWKFLG15                   *((volatile unsigned int*)(0x42A8819CUL))
#define bM4_SYSREG_PDWKFLG2_VD1WKFLG                    *((volatile unsigned int*)(0x42A881A0UL))
#define bM4_SYSREG_PDWKFLG2_VD2WKFLG                    *((volatile unsigned int*)(0x42A881A4UL))
#define bM4_SYSREG_PDWKFLG2_RTCPRDWKFLG                 *((volatile unsigned int*)(0x42A881A8UL))
#define bM4_SYSREG_PDWKFLG2_RTCALMWKFLG                 *((volatile unsigned int*)(0x42A881ACUL))
#define bM4_SYSREG_PDWKFLG2_NMIWKFLG                    *((volatile unsigned int*)(0x42A881B0UL))
#define bM4_SYSREG_CMU_XTALCFGR_FRCUT                   *((volatile unsigned int*)(0x42A88200UL))
#define bM4_SYSREG_CMU_XTALCFGR_XTALDRV0                *((volatile unsigned int*)(0x42A88210UL))
#define bM4_SYSREG_CMU_XTALCFGR_XTALDRV1                *((volatile unsigned int*)(0x42A88214UL))
#define bM4_SYSREG_CMU_XTALCFGR_XTALMS                  *((volatile unsigned int*)(0x42A88218UL))
#define bM4_SYSREG_CMU_XTALCFGR_SUPDRV                  *((volatile unsigned int*)(0x42A8821CUL))
#define bM4_SYSREG_VDUCR0_EXVCCINEN                     *((volatile unsigned int*)(0x42A88240UL))
#define bM4_SYSREG_VDUCR0_EXREFINEN                     *((volatile unsigned int*)(0x42A88244UL))
#define bM4_SYSREG_VDUCR0_VDU0EN                        *((volatile unsigned int*)(0x42A88250UL))
#define bM4_SYSREG_VDUCR0_VDU1EN                        *((volatile unsigned int*)(0x42A88254UL))
#define bM4_SYSREG_VDUCR0_VDU2EN                        *((volatile unsigned int*)(0x42A88258UL))
#define bM4_SYSREG_VDUCR0_VDU0CMPOE                     *((volatile unsigned int*)(0x42A8825CUL))
#define bM4_SYSREG_VDUCR1_VDU1IRE                       *((volatile unsigned int*)(0x42A88260UL))
#define bM4_SYSREG_VDUCR1_VDU1IRS                       *((volatile unsigned int*)(0x42A88264UL))
#define bM4_SYSREG_VDUCR1_VDU1CMPOE                     *((volatile unsigned int*)(0x42A88268UL))
#define bM4_SYSREG_VDUCR1_VDU2IRE                       *((volatile unsigned int*)(0x42A88270UL))
#define bM4_SYSREG_VDUCR1_VDU2IRS                       *((volatile unsigned int*)(0x42A88274UL))
#define bM4_SYSREG_VDUCR1_VDU2CMPOE                     *((volatile unsigned int*)(0x42A88278UL))
#define bM4_SYSREG_VDUFCR_VDU1NFDIS                     *((volatile unsigned int*)(0x42A88280UL))
#define bM4_SYSREG_VDUFCR_VDU1NFCKS0                    *((volatile unsigned int*)(0x42A88284UL))
#define bM4_SYSREG_VDUFCR_VDU1NFCKS1                    *((volatile unsigned int*)(0x42A88288UL))
#define bM4_SYSREG_VDUFCR_VDU2NFDIS                     *((volatile unsigned int*)(0x42A88290UL))
#define bM4_SYSREG_VDUFCR_VDU2NFCKS0                    *((volatile unsigned int*)(0x42A88294UL))
#define bM4_SYSREG_VDUFCR_VDU2NFCKS1                    *((volatile unsigned int*)(0x42A88298UL))
#define bM4_SYSREG_VDULCR_VDU1LVL0                      *((volatile unsigned int*)(0x42A882A0UL))
#define bM4_SYSREG_VDULCR_VDU1LVL1                      *((volatile unsigned int*)(0x42A882A4UL))
#define bM4_SYSREG_VDULCR_VDU1LVL2                      *((volatile unsigned int*)(0x42A882A8UL))
#define bM4_SYSREG_VDULCR_VDU2LVL0                      *((volatile unsigned int*)(0x42A882B0UL))
#define bM4_SYSREG_VDULCR_VDU2LVL1                      *((volatile unsigned int*)(0x42A882B4UL))
#define bM4_SYSREG_VDULCR_VDU2LVL2                      *((volatile unsigned int*)(0x42A882B8UL))
#define bM4_SYSREG_VDUCSR_VDU0CMPST                     *((volatile unsigned int*)(0x42A882C0UL))
#define bM4_SYSREG_VDUCSR_VDU1CMPST                     *((volatile unsigned int*)(0x42A882C4UL))
#define bM4_SYSREG_VDUCSR_VDU2CMPST                     *((volatile unsigned int*)(0x42A882C8UL))
#define bM4_SYSREG_BATMC_VBATREFSEL                     *((volatile unsigned int*)(0x42A882E0UL))
#define bM4_SYSREG_BATMC_VBATME                         *((volatile unsigned int*)(0x42A882E4UL))
#define bM4_SYSREG_BATMC_VBATMON                        *((volatile unsigned int*)(0x42A882F0UL))
#define bM4_TMR00_BCONR_CSTA                            *((volatile unsigned int*)(0x42480200UL))
#define bM4_TMR00_BCONR_CAPMDA                          *((volatile unsigned int*)(0x42480204UL))
#define bM4_TMR00_BCONR_INTENA                          *((volatile unsigned int*)(0x42480208UL))
#define bM4_TMR00_BCONR_CKDIVA0                         *((volatile unsigned int*)(0x42480210UL))
#define bM4_TMR00_BCONR_CKDIVA1                         *((volatile unsigned int*)(0x42480214UL))
#define bM4_TMR00_BCONR_CKDIVA2                         *((volatile unsigned int*)(0x42480218UL))
#define bM4_TMR00_BCONR_CKDIVA3                         *((volatile unsigned int*)(0x4248021CUL))
#define bM4_TMR00_BCONR_SYNSA                           *((volatile unsigned int*)(0x42480220UL))
#define bM4_TMR00_BCONR_SYNCLKA                         *((volatile unsigned int*)(0x42480224UL))
#define bM4_TMR00_BCONR_ASYNCLKA                        *((volatile unsigned int*)(0x42480228UL))
#define bM4_TMR00_BCONR_HSTAA                           *((volatile unsigned int*)(0x42480230UL))
#define bM4_TMR00_BCONR_HSTPA                           *((volatile unsigned int*)(0x42480234UL))
#define bM4_TMR00_BCONR_HCLEA                           *((volatile unsigned int*)(0x42480238UL))
#define bM4_TMR00_BCONR_HICPA                           *((volatile unsigned int*)(0x4248023CUL))
#define bM4_TMR00_BCONR_CSTB                            *((volatile unsigned int*)(0x42480240UL))
#define bM4_TMR00_BCONR_CAPMDB                          *((volatile unsigned int*)(0x42480244UL))
#define bM4_TMR00_BCONR_INTENB                          *((volatile unsigned int*)(0x42480248UL))
#define bM4_TMR00_BCONR_CKDIVB0                         *((volatile unsigned int*)(0x42480250UL))
#define bM4_TMR00_BCONR_CKDIVB1                         *((volatile unsigned int*)(0x42480254UL))
#define bM4_TMR00_BCONR_CKDIVB2                         *((volatile unsigned int*)(0x42480258UL))
#define bM4_TMR00_BCONR_CKDIVB3                         *((volatile unsigned int*)(0x4248025CUL))
#define bM4_TMR00_BCONR_SYNSB                           *((volatile unsigned int*)(0x42480260UL))
#define bM4_TMR00_BCONR_SYNCLKB                         *((volatile unsigned int*)(0x42480264UL))
#define bM4_TMR00_BCONR_ASYNCLKB                        *((volatile unsigned int*)(0x42480268UL))
#define bM4_TMR00_BCONR_HSTAB                           *((volatile unsigned int*)(0x42480270UL))
#define bM4_TMR00_BCONR_HSTPB                           *((volatile unsigned int*)(0x42480274UL))
#define bM4_TMR00_BCONR_HCLEB                           *((volatile unsigned int*)(0x42480278UL))
#define bM4_TMR00_BCONR_HICPB                           *((volatile unsigned int*)(0x4248027CUL))
#define bM4_TMR00_STFLR_CMAF                            *((volatile unsigned int*)(0x42480280UL))
#define bM4_TMR00_STFLR_CMBF                            *((volatile unsigned int*)(0x424802C0UL))
#define bM4_TMR00_STFLR_RESV                            *((volatile unsigned int*)(0x424802E0UL))
#define bM4_TMR01_BCONR_CSTA                            *((volatile unsigned int*)(0x42488200UL))
#define bM4_TMR01_BCONR_CAPMDA                          *((volatile unsigned int*)(0x42488204UL))
#define bM4_TMR01_BCONR_INTENA                          *((volatile unsigned int*)(0x42488208UL))
#define bM4_TMR01_BCONR_CKDIVA0                         *((volatile unsigned int*)(0x42488210UL))
#define bM4_TMR01_BCONR_CKDIVA1                         *((volatile unsigned int*)(0x42488214UL))
#define bM4_TMR01_BCONR_CKDIVA2                         *((volatile unsigned int*)(0x42488218UL))
#define bM4_TMR01_BCONR_CKDIVA3                         *((volatile unsigned int*)(0x4248821CUL))
#define bM4_TMR01_BCONR_SYNSA                           *((volatile unsigned int*)(0x42488220UL))
#define bM4_TMR01_BCONR_SYNCLKA                         *((volatile unsigned int*)(0x42488224UL))
#define bM4_TMR01_BCONR_ASYNCLKA                        *((volatile unsigned int*)(0x42488228UL))
#define bM4_TMR01_BCONR_HSTAA                           *((volatile unsigned int*)(0x42488230UL))
#define bM4_TMR01_BCONR_HSTPA                           *((volatile unsigned int*)(0x42488234UL))
#define bM4_TMR01_BCONR_HCLEA                           *((volatile unsigned int*)(0x42488238UL))
#define bM4_TMR01_BCONR_HICPA                           *((volatile unsigned int*)(0x4248823CUL))
#define bM4_TMR01_BCONR_CSTB                            *((volatile unsigned int*)(0x42488240UL))
#define bM4_TMR01_BCONR_CAPMDB                          *((volatile unsigned int*)(0x42488244UL))
#define bM4_TMR01_BCONR_INTENB                          *((volatile unsigned int*)(0x42488248UL))
#define bM4_TMR01_BCONR_CKDIVB0                         *((volatile unsigned int*)(0x42488250UL))
#define bM4_TMR01_BCONR_CKDIVB1                         *((volatile unsigned int*)(0x42488254UL))
#define bM4_TMR01_BCONR_CKDIVB2                         *((volatile unsigned int*)(0x42488258UL))
#define bM4_TMR01_BCONR_CKDIVB3                         *((volatile unsigned int*)(0x4248825CUL))
#define bM4_TMR01_BCONR_SYNSB                           *((volatile unsigned int*)(0x42488260UL))
#define bM4_TMR01_BCONR_SYNCLKB                         *((volatile unsigned int*)(0x42488264UL))
#define bM4_TMR01_BCONR_ASYNCLKB                        *((volatile unsigned int*)(0x42488268UL))
#define bM4_TMR01_BCONR_HSTAB                           *((volatile unsigned int*)(0x42488270UL))
#define bM4_TMR01_BCONR_HSTPB                           *((volatile unsigned int*)(0x42488274UL))
#define bM4_TMR01_BCONR_HCLEB                           *((volatile unsigned int*)(0x42488278UL))
#define bM4_TMR01_BCONR_HICPB                           *((volatile unsigned int*)(0x4248827CUL))
#define bM4_TMR01_STFLR_CMAF                            *((volatile unsigned int*)(0x42488280UL))
#define bM4_TMR01_STFLR_CMBF                            *((volatile unsigned int*)(0x424882C0UL))
#define bM4_TMR01_STFLR_RESV                            *((volatile unsigned int*)(0x424882E0UL))
#define bM4_TMR20_BCONR_CSTA                            *((volatile unsigned int*)(0x422A0200UL))
#define bM4_TMR20_BCONR_SYNSA                           *((volatile unsigned int*)(0x422A020CUL))
#define bM4_TMR20_BCONR_CKDIVA0                         *((volatile unsigned int*)(0x422A0210UL))
#define bM4_TMR20_BCONR_CKDIVA1                         *((volatile unsigned int*)(0x422A0214UL))
#define bM4_TMR20_BCONR_CKDIVA2                         *((volatile unsigned int*)(0x422A0218UL))
#define bM4_TMR20_BCONR_CKDIVA3                         *((volatile unsigned int*)(0x422A021CUL))
#define bM4_TMR20_BCONR_SYNSCLKA0                       *((volatile unsigned int*)(0x422A0220UL))
#define bM4_TMR20_BCONR_SYNSCLKA1                       *((volatile unsigned int*)(0x422A0224UL))
#define bM4_TMR20_BCONR_ASYNSCLKA0                      *((volatile unsigned int*)(0x422A0228UL))
#define bM4_TMR20_BCONR_ASYNSCLKA1                      *((volatile unsigned int*)(0x422A022CUL))
#define bM4_TMR20_BCONR_CSTB                            *((volatile unsigned int*)(0x422A0240UL))
#define bM4_TMR20_BCONR_SYNSB                           *((volatile unsigned int*)(0x422A024CUL))
#define bM4_TMR20_BCONR_CKDIVB0                         *((volatile unsigned int*)(0x422A0250UL))
#define bM4_TMR20_BCONR_CKDIVB1                         *((volatile unsigned int*)(0x422A0254UL))
#define bM4_TMR20_BCONR_CKDIVB2                         *((volatile unsigned int*)(0x422A0258UL))
#define bM4_TMR20_BCONR_CKDIVB3                         *((volatile unsigned int*)(0x422A025CUL))
#define bM4_TMR20_BCONR_SYNSCLKB0                       *((volatile unsigned int*)(0x422A0260UL))
#define bM4_TMR20_BCONR_SYNSCLKB1                       *((volatile unsigned int*)(0x422A0264UL))
#define bM4_TMR20_BCONR_ASYNSCLKB0                      *((volatile unsigned int*)(0x422A0268UL))
#define bM4_TMR20_BCONR_ASYNSCLKB1                      *((volatile unsigned int*)(0x422A026CUL))
#define bM4_TMR20_ICONR_INTENA                          *((volatile unsigned int*)(0x422A0280UL))
#define bM4_TMR20_ICONR_INTENB                          *((volatile unsigned int*)(0x422A02C0UL))
#define bM4_TMR20_ICONR_RESV                            *((volatile unsigned int*)(0x422A02E0UL))
#define bM4_TMR20_PCONR_CAPMDA                          *((volatile unsigned int*)(0x422A0300UL))
#define bM4_TMR20_PCONR_STACA                           *((volatile unsigned int*)(0x422A0304UL))
#define bM4_TMR20_PCONR_STPCA                           *((volatile unsigned int*)(0x422A0308UL))
#define bM4_TMR20_PCONR_STASTPSA                        *((volatile unsigned int*)(0x422A030CUL))
#define bM4_TMR20_PCONR_CMPCA0                          *((volatile unsigned int*)(0x422A0310UL))
#define bM4_TMR20_PCONR_CMPCA1                          *((volatile unsigned int*)(0x422A0314UL))
#define bM4_TMR20_PCONR_OUTENA                          *((volatile unsigned int*)(0x422A0320UL))
#define bM4_TMR20_PCONR_NOFIENA                         *((volatile unsigned int*)(0x422A0330UL))
#define bM4_TMR20_PCONR_NOFICKA0                        *((volatile unsigned int*)(0x422A0334UL))
#define bM4_TMR20_PCONR_NOFICKA1                        *((volatile unsigned int*)(0x422A0338UL))
#define bM4_TMR20_PCONR_CAPMDB                          *((volatile unsigned int*)(0x422A0340UL))
#define bM4_TMR20_PCONR_STACB                           *((volatile unsigned int*)(0x422A0344UL))
#define bM4_TMR20_PCONR_STPCB                           *((volatile unsigned int*)(0x422A0348UL))
#define bM4_TMR20_PCONR_STASTPSB                        *((volatile unsigned int*)(0x422A034CUL))
#define bM4_TMR20_PCONR_CMPCB0                          *((volatile unsigned int*)(0x422A0350UL))
#define bM4_TMR20_PCONR_CMPCB1                          *((volatile unsigned int*)(0x422A0354UL))
#define bM4_TMR20_PCONR_OUTENB                          *((volatile unsigned int*)(0x422A0360UL))
#define bM4_TMR20_PCONR_NOFIENB                         *((volatile unsigned int*)(0x422A0370UL))
#define bM4_TMR20_PCONR_NOFICKB0                        *((volatile unsigned int*)(0x422A0374UL))
#define bM4_TMR20_PCONR_NOFICKB1                        *((volatile unsigned int*)(0x422A0378UL))
#define bM4_TMR20_HCONR_HSTAA0                          *((volatile unsigned int*)(0x422A0380UL))
#define bM4_TMR20_HCONR_HSTAA1                          *((volatile unsigned int*)(0x422A0384UL))
#define bM4_TMR20_HCONR_HSTAA2                          *((volatile unsigned int*)(0x422A0388UL))
#define bM4_TMR20_HCONR_HSTPA0                          *((volatile unsigned int*)(0x422A0390UL))
#define bM4_TMR20_HCONR_HSTPA1                          *((volatile unsigned int*)(0x422A0394UL))
#define bM4_TMR20_HCONR_HSTPA2                          *((volatile unsigned int*)(0x422A0398UL))
#define bM4_TMR20_HCONR_HCLEA0                          *((volatile unsigned int*)(0x422A03A0UL))
#define bM4_TMR20_HCONR_HCLEA1                          *((volatile unsigned int*)(0x422A03A4UL))
#define bM4_TMR20_HCONR_HCLEA2                          *((volatile unsigned int*)(0x422A03A8UL))
#define bM4_TMR20_HCONR_HICPA0                          *((volatile unsigned int*)(0x422A03B0UL))
#define bM4_TMR20_HCONR_HICPA1                          *((volatile unsigned int*)(0x422A03B4UL))
#define bM4_TMR20_HCONR_HICPA2                          *((volatile unsigned int*)(0x422A03B8UL))
#define bM4_TMR20_HCONR_HSTAB0                          *((volatile unsigned int*)(0x422A03C0UL))
#define bM4_TMR20_HCONR_HSTAB1                          *((volatile unsigned int*)(0x422A03C4UL))
#define bM4_TMR20_HCONR_HSTAB2                          *((volatile unsigned int*)(0x422A03C8UL))
#define bM4_TMR20_HCONR_HSTPB0                          *((volatile unsigned int*)(0x422A03D0UL))
#define bM4_TMR20_HCONR_HSTPB1                          *((volatile unsigned int*)(0x422A03D4UL))
#define bM4_TMR20_HCONR_HSTPB2                          *((volatile unsigned int*)(0x422A03D8UL))
#define bM4_TMR20_HCONR_HCLEB0                          *((volatile unsigned int*)(0x422A03E0UL))
#define bM4_TMR20_HCONR_HCLEB1                          *((volatile unsigned int*)(0x422A03E4UL))
#define bM4_TMR20_HCONR_HCLEB2                          *((volatile unsigned int*)(0x422A03E8UL))
#define bM4_TMR20_HCONR_HICPB0                          *((volatile unsigned int*)(0x422A03F0UL))
#define bM4_TMR20_HCONR_HICPB1                          *((volatile unsigned int*)(0x422A03F4UL))
#define bM4_TMR20_HCONR_HICPB2                          *((volatile unsigned int*)(0x422A03F8UL))
#define bM4_TMR20_STFLR_CMAF                            *((volatile unsigned int*)(0x422A0400UL))
#define bM4_TMR20_STFLR_CMBF                            *((volatile unsigned int*)(0x422A0440UL))
#define bM4_TMR20_STFLR_RESV                            *((volatile unsigned int*)(0x422A0460UL))
#define bM4_TMR21_BCONR_CSTA                            *((volatile unsigned int*)(0x422A8200UL))
#define bM4_TMR21_BCONR_SYNSA                           *((volatile unsigned int*)(0x422A820CUL))
#define bM4_TMR21_BCONR_CKDIVA0                         *((volatile unsigned int*)(0x422A8210UL))
#define bM4_TMR21_BCONR_CKDIVA1                         *((volatile unsigned int*)(0x422A8214UL))
#define bM4_TMR21_BCONR_CKDIVA2                         *((volatile unsigned int*)(0x422A8218UL))
#define bM4_TMR21_BCONR_CKDIVA3                         *((volatile unsigned int*)(0x422A821CUL))
#define bM4_TMR21_BCONR_SYNSCLKA0                       *((volatile unsigned int*)(0x422A8220UL))
#define bM4_TMR21_BCONR_SYNSCLKA1                       *((volatile unsigned int*)(0x422A8224UL))
#define bM4_TMR21_BCONR_ASYNSCLKA0                      *((volatile unsigned int*)(0x422A8228UL))
#define bM4_TMR21_BCONR_ASYNSCLKA1                      *((volatile unsigned int*)(0x422A822CUL))
#define bM4_TMR21_BCONR_CSTB                            *((volatile unsigned int*)(0x422A8240UL))
#define bM4_TMR21_BCONR_SYNSB                           *((volatile unsigned int*)(0x422A824CUL))
#define bM4_TMR21_BCONR_CKDIVB0                         *((volatile unsigned int*)(0x422A8250UL))
#define bM4_TMR21_BCONR_CKDIVB1                         *((volatile unsigned int*)(0x422A8254UL))
#define bM4_TMR21_BCONR_CKDIVB2                         *((volatile unsigned int*)(0x422A8258UL))
#define bM4_TMR21_BCONR_CKDIVB3                         *((volatile unsigned int*)(0x422A825CUL))
#define bM4_TMR21_BCONR_SYNSCLKB0                       *((volatile unsigned int*)(0x422A8260UL))
#define bM4_TMR21_BCONR_SYNSCLKB1                       *((volatile unsigned int*)(0x422A8264UL))
#define bM4_TMR21_BCONR_ASYNSCLKB0                      *((volatile unsigned int*)(0x422A8268UL))
#define bM4_TMR21_BCONR_ASYNSCLKB1                      *((volatile unsigned int*)(0x422A826CUL))
#define bM4_TMR21_ICONR_INTENA                          *((volatile unsigned int*)(0x422A8280UL))
#define bM4_TMR21_ICONR_INTENB                          *((volatile unsigned int*)(0x422A82C0UL))
#define bM4_TMR21_ICONR_RESV                            *((volatile unsigned int*)(0x422A82E0UL))
#define bM4_TMR21_PCONR_CAPMDA                          *((volatile unsigned int*)(0x422A8300UL))
#define bM4_TMR21_PCONR_STACA                           *((volatile unsigned int*)(0x422A8304UL))
#define bM4_TMR21_PCONR_STPCA                           *((volatile unsigned int*)(0x422A8308UL))
#define bM4_TMR21_PCONR_STASTPSA                        *((volatile unsigned int*)(0x422A830CUL))
#define bM4_TMR21_PCONR_CMPCA0                          *((volatile unsigned int*)(0x422A8310UL))
