RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR21_PCONR_CMPCA1                          *((volatile unsigned int*)(0x422A8314UL))
#define bM4_TMR21_PCONR_OUTENA                          *((volatile unsigned int*)(0x422A8320UL))
#define bM4_TMR21_PCONR_NOFIENA                         *((volatile unsigned int*)(0x422A8330UL))
#define bM4_TMR21_PCONR_NOFICKA0                        *((volatile unsigned int*)(0x422A8334UL))
#define bM4_TMR21_PCONR_NOFICKA1                        *((volatile unsigned int*)(0x422A8338UL))
#define bM4_TMR21_PCONR_CAPMDB                          *((volatile unsigned int*)(0x422A8340UL))
#define bM4_TMR21_PCONR_STACB                           *((volatile unsigned int*)(0x422A8344UL))
#define bM4_TMR21_PCONR_STPCB                           *((volatile unsigned int*)(0x422A8348UL))
#define bM4_TMR21_PCONR_STASTPSB                        *((volatile unsigned int*)(0x422A834CUL))
#define bM4_TMR21_PCONR_CMPCB0                          *((volatile unsigned int*)(0x422A8350UL))
#define bM4_TMR21_PCONR_CMPCB1                          *((volatile unsigned int*)(0x422A8354UL))
#define bM4_TMR21_PCONR_OUTENB                          *((volatile unsigned int*)(0x422A8360UL))
#define bM4_TMR21_PCONR_NOFIENB                         *((volatile unsigned int*)(0x422A8370UL))
#define bM4_TMR21_PCONR_NOFICKB0                        *((volatile unsigned int*)(0x422A8374UL))
#define bM4_TMR21_PCONR_NOFICKB1                        *((volatile unsigned int*)(0x422A8378UL))
#define bM4_TMR21_HCONR_HSTAA0                          *((volatile unsigned int*)(0x422A8380UL))
#define bM4_TMR21_HCONR_HSTAA1                          *((volatile unsigned int*)(0x422A8384UL))
#define bM4_TMR21_HCONR_HSTAA2                          *((volatile unsigned int*)(0x422A8388UL))
#define bM4_TMR21_HCONR_HSTPA0                          *((volatile unsigned int*)(0x422A8390UL))
#define bM4_TMR21_HCONR_HSTPA1                          *((volatile unsigned int*)(0x422A8394UL))
#define bM4_TMR21_HCONR_HSTPA2                          *((volatile unsigned int*)(0x422A8398UL))
#define bM4_TMR21_HCONR_HCLEA0                          *((volatile unsigned int*)(0x422A83A0UL))
#define bM4_TMR21_HCONR_HCLEA1                          *((volatile unsigned int*)(0x422A83A4UL))
#define bM4_TMR21_HCONR_HCLEA2                          *((volatile unsigned int*)(0x422A83A8UL))
#define bM4_TMR21_HCONR_HICPA0                          *((volatile unsigned int*)(0x422A83B0UL))
#define bM4_TMR21_HCONR_HICPA1                          *((volatile unsigned int*)(0x422A83B4UL))
#define bM4_TMR21_HCONR_HICPA2                          *((volatile unsigned int*)(0x422A83B8UL))
#define bM4_TMR21_HCONR_HSTAB0                          *((volatile unsigned int*)(0x422A83C0UL))
#define bM4_TMR21_HCONR_HSTAB1                          *((volatile unsigned int*)(0x422A83C4UL))
#define bM4_TMR21_HCONR_HSTAB2                          *((volatile unsigned int*)(0x422A83C8UL))
#define bM4_TMR21_HCONR_HSTPB0                          *((volatile unsigned int*)(0x422A83D0UL))
#define bM4_TMR21_HCONR_HSTPB1                          *((volatile unsigned int*)(0x422A83D4UL))
#define bM4_TMR21_HCONR_HSTPB2                          *((volatile unsigned int*)(0x422A83D8UL))
#define bM4_TMR21_HCONR_HCLEB0                          *((volatile unsigned int*)(0x422A83E0UL))
#define bM4_TMR21_HCONR_HCLEB1                          *((volatile unsigned int*)(0x422A83E4UL))
#define bM4_TMR21_HCONR_HCLEB2                          *((volatile unsigned int*)(0x422A83E8UL))
#define bM4_TMR21_HCONR_HICPB0                          *((volatile unsigned int*)(0x422A83F0UL))
#define bM4_TMR21_HCONR_HICPB1                          *((volatile unsigned int*)(0x422A83F4UL))
#define bM4_TMR21_HCONR_HICPB2                          *((volatile unsigned int*)(0x422A83F8UL))
#define bM4_TMR21_STFLR_CMAF                            *((volatile unsigned int*)(0x422A8400UL))
#define bM4_TMR21_STFLR_CMBF                            *((volatile unsigned int*)(0x422A8440UL))
#define bM4_TMR21_STFLR_RESV                            *((volatile unsigned int*)(0x422A8460UL))
#define bM4_TMR22_BCONR_CSTA                            *((volatile unsigned int*)(0x422B0200UL))
#define bM4_TMR22_BCONR_SYNSA                           *((volatile unsigned int*)(0x422B020CUL))
#define bM4_TMR22_BCONR_CKDIVA0                         *((volatile unsigned int*)(0x422B0210UL))
#define bM4_TMR22_BCONR_CKDIVA1                         *((volatile unsigned int*)(0x422B0214UL))
#define bM4_TMR22_BCONR_CKDIVA2                         *((volatile unsigned int*)(0x422B0218UL))
#define bM4_TMR22_BCONR_CKDIVA3                         *((volatile unsigned int*)(0x422B021CUL))
#define bM4_TMR22_BCONR_SYNSCLKA0                       *((volatile unsigned int*)(0x422B0220UL))
#define bM4_TMR22_BCONR_SYNSCLKA1                       *((volatile unsigned int*)(0x422B0224UL))
#define bM4_TMR22_BCONR_ASYNSCLKA0                      *((volatile unsigned int*)(0x422B0228UL))
#define bM4_TMR22_BCONR_ASYNSCLKA1                      *((volatile unsigned int*)(0x422B022CUL))
#define bM4_TMR22_BCONR_CSTB                            *((volatile unsigned int*)(0x422B0240UL))
#define bM4_TMR22_BCONR_SYNSB                           *((volatile unsigned int*)(0x422B024CUL))
#define bM4_TMR22_BCONR_CKDIVB0                         *((volatile unsigned int*)(0x422B0250UL))
#define bM4_TMR22_BCONR_CKDIVB1                         *((volatile unsigned int*)(0x422B0254UL))
#define bM4_TMR22_BCONR_CKDIVB2                         *((volatile unsigned int*)(0x422B0258UL))
#define bM4_TMR22_BCONR_CKDIVB3                         *((volatile unsigned int*)(0x422B025CUL))
#define bM4_TMR22_BCONR_SYNSCLKB0                       *((volatile unsigned int*)(0x422B0260UL))
#define bM4_TMR22_BCONR_SYNSCLKB1                       *((volatile unsigned int*)(0x422B0264UL))
#define bM4_TMR22_BCONR_ASYNSCLKB0                      *((volatile unsigned int*)(0x422B0268UL))
#define bM4_TMR22_BCONR_ASYNSCLKB1                      *((volatile unsigned int*)(0x422B026CUL))
#define bM4_TMR22_ICONR_INTENA                          *((volatile unsigned int*)(0x422B0280UL))
#define bM4_TMR22_ICONR_INTENB                          *((volatile unsigned int*)(0x422B02C0UL))
#define bM4_TMR22_ICONR_RESV                            *((volatile unsigned int*)(0x422B02E0UL))
#define bM4_TMR22_PCONR_CAPMDA                          *((volatile unsigned int*)(0x422B0300UL))
#define bM4_TMR22_PCONR_STACA                           *((volatile unsigned int*)(0x422B0304UL))
#define bM4_TMR22_PCONR_STPCA                           *((volatile unsigned int*)(0x422B0308UL))
#define bM4_TMR22_PCONR_STASTPSA                        *((volatile unsigned int*)(0x422B030CUL))
#define bM4_TMR22_PCONR_CMPCA0                          *((volatile unsigned int*)(0x422B0310UL))
#define bM4_TMR22_PCONR_CMPCA1                          *((volatile unsigned int*)(0x422B0314UL))
#define bM4_TMR22_PCONR_OUTENA                          *((volatile unsigned int*)(0x422B0320UL))
#define bM4_TMR22_PCONR_NOFIENA                         *((volatile unsigned int*)(0x422B0330UL))
#define bM4_TMR22_PCONR_NOFICKA0                        *((volatile unsigned int*)(0x422B0334UL))
#define bM4_TMR22_PCONR_NOFICKA1                        *((volatile unsigned int*)(0x422B0338UL))
#define bM4_TMR22_PCONR_CAPMDB                          *((volatile unsigned int*)(0x422B0340UL))
#define bM4_TMR22_PCONR_STACB                           *((volatile unsigned int*)(0x422B0344UL))
#define bM4_TMR22_PCONR_STPCB                           *((volatile unsigned int*)(0x422B0348UL))
#define bM4_TMR22_PCONR_STASTPSB                        *((volatile unsigned int*)(0x422B034CUL))
#define bM4_TMR22_PCONR_CMPCB0                          *((volatile unsigned int*)(0x422B0350UL))
#define bM4_TMR22_PCONR_CMPCB1                          *((volatile unsigned int*)(0x422B0354UL))
#define bM4_TMR22_PCONR_OUTENB                          *((volatile unsigned int*)(0x422B0360UL))
#define bM4_TMR22_PCONR_NOFIENB                         *((volatile unsigned int*)(0x422B0370UL))
#define bM4_TMR22_PCONR_NOFICKB0                        *((volatile unsigned int*)(0x422B0374UL))
#define bM4_TMR22_PCONR_NOFICKB1                        *((volatile unsigned int*)(0x422B0378UL))
#define bM4_TMR22_HCONR_HSTAA0                          *((volatile unsigned int*)(0x422B0380UL))
#define bM4_TMR22_HCONR_HSTAA1                          *((volatile unsigned int*)(0x422B0384UL))
#define bM4_TMR22_HCONR_HSTAA2                          *((volatile unsigned int*)(0x422B0388UL))
#define bM4_TMR22_HCONR_HSTPA0                          *((volatile unsigned int*)(0x422B0390UL))
#define bM4_TMR22_HCONR_HSTPA1                          *((volatile unsigned int*)(0x422B0394UL))
#define bM4_TMR22_HCONR_HSTPA2                          *((volatile unsigned int*)(0x422B0398UL))
#define bM4_TMR22_HCONR_HCLEA0                          *((volatile unsigned int*)(0x422B03A0UL))
#define bM4_TMR22_HCONR_HCLEA1                          *((volatile unsigned int*)(0x422B03A4UL))
#define bM4_TMR22_HCONR_HCLEA2                          *((volatile unsigned int*)(0x422B03A8UL))
#define bM4_TMR22_HCONR_HICPA0                          *((volatile unsigned int*)(0x422B03B0UL))
#define bM4_TMR22_HCONR_HICPA1                          *((volatile unsigned int*)(0x422B03B4UL))
#define bM4_TMR22_HCONR_HICPA2                          *((volatile unsigned int*)(0x422B03B8UL))
#define bM4_TMR22_HCONR_HSTAB0                          *((volatile unsigned int*)(0x422B03C0UL))
#define bM4_TMR22_HCONR_HSTAB1                          *((volatile unsigned int*)(0x422B03C4UL))
#define bM4_TMR22_HCONR_HSTAB2                          *((volatile unsigned int*)(0x422B03C8UL))
#define bM4_TMR22_HCONR_HSTPB0                          *((volatile unsigned int*)(0x422B03D0UL))
#define bM4_TMR22_HCONR_HSTPB1                          *((volatile unsigned int*)(0x422B03D4UL))
#define bM4_TMR22_HCONR_HSTPB2                          *((volatile unsigned int*)(0x422B03D8UL))
#define bM4_TMR22_HCONR_HCLEB0                          *((volatile unsigned int*)(0x422B03E0UL))
#define bM4_TMR22_HCONR_HCLEB1                          *((volatile unsigned int*)(0x422B03E4UL))
#define bM4_TMR22_HCONR_HCLEB2                          *((volatile unsigned int*)(0x422B03E8UL))
#define bM4_TMR22_HCONR_HICPB0                          *((volatile unsigned int*)(0x422B03F0UL))
#define bM4_TMR22_HCONR_HICPB1                          *((volatile unsigned int*)(0x422B03F4UL))
#define bM4_TMR22_HCONR_HICPB2                          *((volatile unsigned int*)(0x422B03F8UL))
#define bM4_TMR22_STFLR_CMAF                            *((volatile unsigned int*)(0x422B0400UL))
#define bM4_TMR22_STFLR_CMBF                            *((volatile unsigned int*)(0x422B0440UL))
#define bM4_TMR22_STFLR_RESV                            *((volatile unsigned int*)(0x422B0460UL))
#define bM4_TMR23_BCONR_CSTA                            *((volatile unsigned int*)(0x422B8200UL))
#define bM4_TMR23_BCONR_SYNSA                           *((volatile unsigned int*)(0x422B820CUL))
#define bM4_TMR23_BCONR_CKDIVA0                         *((volatile unsigned int*)(0x422B8210UL))
#define bM4_TMR23_BCONR_CKDIVA1                         *((volatile unsigned int*)(0x422B8214UL))
#define bM4_TMR23_BCONR_CKDIVA2                         *((volatile unsigned int*)(0x422B8218UL))
#define bM4_TMR23_BCONR_CKDIVA3                         *((volatile unsigned int*)(0x422B821CUL))
#define bM4_TMR23_BCONR_SYNSCLKA0                       *((volatile unsigned int*)(0x422B8220UL))
#define bM4_TMR23_BCONR_SYNSCLKA1                       *((volatile unsigned int*)(0x422B8224UL))
#define bM4_TMR23_BCONR_ASYNSCLKA0                      *((volatile unsigned int*)(0x422B8228UL))
#define bM4_TMR23_BCONR_ASYNSCLKA1                      *((volatile unsigned int*)(0x422B822CUL))
#define bM4_TMR23_BCONR_CSTB                            *((volatile unsigned int*)(0x422B8240UL))
#define bM4_TMR23_BCONR_SYNSB                           *((volatile unsigned int*)(0x422B824CUL))
#define bM4_TMR23_BCONR_CKDIVB0                         *((volatile unsigned int*)(0x422B8250UL))
#define bM4_TMR23_BCONR_CKDIVB1                         *((volatile unsigned int*)(0x422B8254UL))
#define bM4_TMR23_BCONR_CKDIVB2                         *((volatile unsigned int*)(0x422B8258UL))
#define bM4_TMR23_BCONR_CKDIVB3                         *((volatile unsigned int*)(0x422B825CUL))
#define bM4_TMR23_BCONR_SYNSCLKB0                       *((volatile unsigned int*)(0x422B8260UL))
#define bM4_TMR23_BCONR_SYNSCLKB1                       *((volatile unsigned int*)(0x422B8264UL))
#define bM4_TMR23_BCONR_ASYNSCLKB0                      *((volatile unsigned int*)(0x422B8268UL))
#define bM4_TMR23_BCONR_ASYNSCLKB1                      *((volatile unsigned int*)(0x422B826CUL))
#define bM4_TMR23_ICONR_INTENA                          *((volatile unsigned int*)(0x422B8280UL))
#define bM4_TMR23_ICONR_INTENB                          *((volatile unsigned int*)(0x422B82C0UL))
#define bM4_TMR23_ICONR_RESV                            *((volatile unsigned int*)(0x422B82E0UL))
#define bM4_TMR23_PCONR_CAPMDA                          *((volatile unsigned int*)(0x422B8300UL))
#define bM4_TMR23_PCONR_STACA                           *((volatile unsigned int*)(0x422B8304UL))
#define bM4_TMR23_PCONR_STPCA                           *((volatile unsigned int*)(0x422B8308UL))
#define bM4_TMR23_PCONR_STASTPSA                        *((volatile unsigned int*)(0x422B830CUL))
#define bM4_TMR23_PCONR_CMPCA0                          *((volatile unsigned int*)(0x422B8310UL))
#define bM4_TMR23_PCONR_CMPCA1                          *((volatile unsigned int*)(0x422B8314UL))
#define bM4_TMR23_PCONR_OUTENA                          *((volatile unsigned int*)(0x422B8320UL))
#define bM4_TMR23_PCONR_NOFIENA                         *((volatile unsigned int*)(0x422B8330UL))
#define bM4_TMR23_PCONR_NOFICKA0                        *((volatile unsigned int*)(0x422B8334UL))
#define bM4_TMR23_PCONR_NOFICKA1                        *((volatile unsigned int*)(0x422B8338UL))
#define bM4_TMR23_PCONR_CAPMDB                          *((volatile unsigned int*)(0x422B8340UL))
#define bM4_TMR23_PCONR_STACB                           *((volatile unsigned int*)(0x422B8344UL))
#define bM4_TMR23_PCONR_STPCB                           *((volatile unsigned int*)(0x422B8348UL))
#define bM4_TMR23_PCONR_STASTPSB                        *((volatile unsigned int*)(0x422B834CUL))
#define bM4_TMR23_PCONR_CMPCB0                          *((volatile unsigned int*)(0x422B8350UL))
#define bM4_TMR23_PCONR_CMPCB1                          *((volatile unsigned int*)(0x422B8354UL))
#define bM4_TMR23_PCONR_OUTENB                          *((volatile unsigned int*)(0x422B8360UL))
#define bM4_TMR23_PCONR_NOFIENB                         *((volatile unsigned int*)(0x422B8370UL))
#define bM4_TMR23_PCONR_NOFICKB0                        *((volatile unsigned int*)(0x422B8374UL))
#define bM4_TMR23_PCONR_NOFICKB1                        *((volatile unsigned int*)(0x422B8378UL))
#define bM4_TMR23_HCONR_HSTAA0                          *((volatile unsigned int*)(0x422B8380UL))
#define bM4_TMR23_HCONR_HSTAA1                          *((volatile unsigned int*)(0x422B8384UL))
#define bM4_TMR23_HCONR_HSTAA2                          *((volatile unsigned int*)(0x422B8388UL))
#define bM4_TMR23_HCONR_HSTPA0                          *((volatile unsigned int*)(0x422B8390UL))
#define bM4_TMR23_HCONR_HSTPA1                          *((volatile unsigned int*)(0x422B8394UL))
#define bM4_TMR23_HCONR_HSTPA2                          *((volatile unsigned int*)(0x422B8398UL))
#define bM4_TMR23_HCONR_HCLEA0                          *((volatile unsigned int*)(0x422B83A0UL))
#define bM4_TMR23_HCONR_HCLEA1                          *((volatile unsigned int*)(0x422B83A4UL))
#define bM4_TMR23_HCONR_HCLEA2                          *((volatile unsigned int*)(0x422B83A8UL))
#define bM4_TMR23_HCONR_HICPA0                          *((volatile unsigned int*)(0x422B83B0UL))
#define bM4_TMR23_HCONR_HICPA1                          *((volatile unsigned int*)(0x422B83B4UL))
#define bM4_TMR23_HCONR_HICPA2                          *((volatile unsigned int*)(0x422B83B8UL))
#define bM4_TMR23_HCONR_HSTAB0                          *((volatile unsigned int*)(0x422B83C0UL))
#define bM4_TMR23_HCONR_HSTAB1                          *((volatile unsigned int*)(0x422B83C4UL))
#define bM4_TMR23_HCONR_HSTAB2                          *((volatile unsigned int*)(0x422B83C8UL))
#define bM4_TMR23_HCONR_HSTPB0                          *((volatile unsigned int*)(0x422B83D0UL))
#define bM4_TMR23_HCONR_HSTPB1                          *((volatile unsigned int*)(0x422B83D4UL))
#define bM4_TMR23_HCONR_HSTPB2                          *((volatile unsigned int*)(0x422B83D8UL))
#define bM4_TMR23_HCONR_HCLEB0                          *((volatile unsigned int*)(0x422B83E0UL))
#define bM4_TMR23_HCONR_HCLEB1                          *((volatile unsigned int*)(0x422B83E4UL))
#define bM4_TMR23_HCONR_HCLEB2                          *((volatile unsigned int*)(0x422B83E8UL))
#define bM4_TMR23_HCONR_HICPB0                          *((volatile unsigned int*)(0x422B83F0UL))
#define bM4_TMR23_HCONR_HICPB1                          *((volatile unsigned int*)(0x422B83F4UL))
#define bM4_TMR23_HCONR_HICPB2                          *((volatile unsigned int*)(0x422B83F8UL))
#define bM4_TMR23_STFLR_CMAF                            *((volatile unsigned int*)(0x422B8400UL))
#define bM4_TMR23_STFLR_CMBF                            *((volatile unsigned int*)(0x422B8440UL))
#define bM4_TMR23_STFLR_RESV                            *((volatile unsigned int*)(0x422B8460UL))
#define bM4_TMR40_OCSRU_OCEHU                           *((volatile unsigned int*)(0x42490300UL))
#define bM4_TMR40_OCSRU_OCELU                           *((volatile unsigned int*)(0x42490304UL))
#define bM4_TMR40_OCSRU_OCPHU                           *((volatile unsigned int*)(0x42490308UL))
#define bM4_TMR40_OCSRU_OCPLU                           *((volatile unsigned int*)(0x4249030CUL))
#define bM4_TMR40_OCSRU_OCIEHU                          *((volatile unsigned int*)(0x42490310UL))
#define bM4_TMR40_OCSRU_OCIELU                          *((volatile unsigned int*)(0x42490314UL))
#define bM4_TMR40_OCSRU_OCFHU                           *((volatile unsigned int*)(0x42490318UL))
#define bM4_TMR40_OCSRU_OCFLU                           *((volatile unsigned int*)(0x4249031CUL))
#define bM4_TMR40_OCERU_CHBUFENU0                       *((volatile unsigned int*)(0x42490340UL))
#define bM4_TMR40_OCERU_CHBUFENU1                       *((volatile unsigned int*)(0x42490344UL))
#define bM4_TMR40_OCERU_CLBUFENU0                       *((volatile unsigned int*)(0x42490348UL))
#define bM4_TMR40_OCERU_CLBUFENU1                       *((volatile unsigned int*)(0x4249034CUL))
#define bM4_TMR40_OCERU_MHBUFENU0                       *((volatile unsigned int*)(0x42490350UL))
#define bM4_TMR40_OCERU_MHBUFENU1                       *((volatile unsigned int*)(0x42490354UL))
#define bM4_TMR40_OCERU_MLBUFENU0                       *((volatile unsigned int*)(0x42490358UL))
#define bM4_TMR40_OCERU_MLBUFENU1                       *((volatile unsigned int*)(0x4249035CUL))
#define bM4_TMR40_OCERU_LMCHU                           *((volatile unsigned int*)(0x42490360UL))
#define bM4_TMR40_OCERU_LMCLU                           *((volatile unsigned int*)(0x42490364UL))
#define bM4_TMR40_OCERU_LMMHU                           *((volatile unsigned int*)(0x42490368UL))
#define bM4_TMR40_OCERU_LMMLU                           *((volatile unsigned int*)(0x4249036CUL))
#define bM4_TMR40_OCERU_MCECHU                          *((volatile unsigned int*)(0x42490370UL))
#define bM4_TMR40_OCERU_MCECLU                          *((volatile unsigned int*)(0x42490374UL))
#define bM4_TMR40_OCSRV_OCEHV                           *((volatile unsigned int*)(0x42490380UL))
#define bM4_TMR40_OCSRV_OCELV                           *((volatile unsigned int*)(0x42490384UL))
#define bM4_TMR40_OCSRV_OCPHV                           *((volatile unsigned int*)(0x42490388UL))
#define bM4_TMR40_OCSRV_OCPLV                           *((volatile unsigned int*)(0x4249038CUL))
#define bM4_TMR40_OCSRV_OCIEHV                          *((volatile unsigned int*)(0x42490390UL))
#define bM4_TMR40_OCSRV_OCIELV                          *((volatile unsigned int*)(0x42490394UL))
#define bM4_TMR40_OCSRV_OCFHV                           *((volatile unsigned int*)(0x42490398UL))
#define bM4_TMR40_OCSRV_OCFLV                           *((volatile unsigned int*)(0x4249039CUL))
#define bM4_TMR40_OCERV_CHBUFENV0                       *((volatile unsigned int*)(0x424903C0UL))
#define bM4_TMR40_OCERV_CHBUFENV1                       *((volatile unsigned int*)(0x424903C4UL))
#define bM4_TMR40_OCERV_CLBUFENV0                       *((volatile unsigned int*)(0x424903C8UL))
#define bM4_TMR40_OCERV_CLBUFENV1                       *((volatile unsigned int*)(0x424903CCUL))
#define bM4_TMR40_OCERV_MHBUFENV0                       *((volatile unsigned int*)(0x424903D0UL))
#define bM4_TMR40_OCERV_MHBUFENV1                       *((volatile unsigned int*)(0x424903D4UL))
#define bM4_TMR40_OCERV_MLBUFENV0                       *((volatile unsigned int*)(0x424903D8UL))
#define bM4_TMR40_OCERV_MLBUFENV1                       *((volatile unsigned int*)(0x424903DCUL))
#define bM4_TMR40_OCERV_LMCHV                           *((volatile unsigned int*)(0x424903E0UL))
#define bM4_TMR40_OCERV_LMCLV                           *((volatile unsigned int*)(0x424903E4UL))
#define bM4_TMR40_OCERV_LMMHV                           *((volatile unsigned int*)(0x424903E8UL))
#define bM4_TMR40_OCERV_LMMLV                           *((volatile unsigned int*)(0x424903ECUL))
#define bM4_TMR40_OCERV_MCECHV                          *((volatile unsigned int*)(0x424903F0UL))
#define bM4_TMR40_OCERV_MCECLV                          *((volatile unsigned int*)(0x424903F4UL))
#define bM4_TMR40_OCSRW_OCEHW                           *((volatile unsigned int*)(0x42490400UL))
#define bM4_TMR40_OCSRW_OCELW                           *((volatile unsigned int*)(0x42490404UL))
#define bM4_TMR40_OCSRW_OCPHW                           *((volatile unsigned int*)(0x42490408UL))
#define bM4_TMR40_OCSRW_OCPLW                           *((volatile unsigned int*)(0x4249040CUL))
#define bM4_TMR40_OCSRW_OCIEHW                          *((volatile unsigned int*)(0x42490410UL))
#define bM4_TMR40_OCSRW_OCIELW                          *((volatile unsigned int*)(0x42490414UL))
#define bM4_TMR40_OCSRW_OCFHW                           *((volatile unsigned int*)(0x42490418UL))
#define bM4_TMR40_OCSRW_OCFLW                           *((volatile unsigned int*)(0x4249041CUL))
#define bM4_TMR40_OCERW_CHBUFENW0                       *((volatile unsigned int*)(0x42490440UL))
#define bM4_TMR40_OCERW_CHBUFENW1                       *((volatile unsigned int*)(0x42490444UL))
#define bM4_TMR40_OCERW_CLBUFENW0                       *((volatile unsigned int*)(0x42490448UL))
#define bM4_TMR40_OCERW_CLBUFENW1                       *((volatile unsigned int*)(0x4249044CUL))
#define bM4_TMR40_OCERW_MHBUFENW0                       *((volatile unsigned int*)(0x42490450UL))
#define bM4_TMR40_OCERW_MHBUFENW1                       *((volatile unsigned int*)(0x42490454UL))
#define bM4_TMR40_OCERW_MLBUFENW0                       *((volatile unsigned int*)(0x42490458UL))
#define bM4_TMR40_OCERW_MLBUFENW1                       *((volatile unsigned int*)(0x4249045CUL))
#define bM4_TMR40_OCERW_LMCHW                           *((volatile unsigned int*)(0x42490460UL))
#define bM4_TMR40_OCERW_LMCLW                           *((volatile unsigned int*)(0x42490464UL))
