RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR40_OCERW_LMMHW                           *((volatile unsigned int*)(0x42490468UL))
#define bM4_TMR40_OCERW_LMMLW                           *((volatile unsigned int*)(0x4249046CUL))
#define bM4_TMR40_OCERW_MCECHW                          *((volatile unsigned int*)(0x42490470UL))
#define bM4_TMR40_OCERW_MCECLW                          *((volatile unsigned int*)(0x42490474UL))
#define bM4_TMR40_OCMRUH_OCFDCHUH                       *((volatile unsigned int*)(0x42490480UL))
#define bM4_TMR40_OCMRUH_OCFPKHUH                       *((volatile unsigned int*)(0x42490484UL))
#define bM4_TMR40_OCMRUH_OCFUCHUH                       *((volatile unsigned int*)(0x42490488UL))
#define bM4_TMR40_OCMRUH_OCFZRHUH                       *((volatile unsigned int*)(0x4249048CUL))
#define bM4_TMR40_OCMRUH_OPDCHUH0                       *((volatile unsigned int*)(0x42490490UL))
#define bM4_TMR40_OCMRUH_OPDCHUH1                       *((volatile unsigned int*)(0x42490494UL))
#define bM4_TMR40_OCMRUH_OPPKHUH0                       *((volatile unsigned int*)(0x42490498UL))
#define bM4_TMR40_OCMRUH_OPPKHUH1                       *((volatile unsigned int*)(0x4249049CUL))
#define bM4_TMR40_OCMRUH_OPUCHUH0                       *((volatile unsigned int*)(0x424904A0UL))
#define bM4_TMR40_OCMRUH_OPUCHUH1                       *((volatile unsigned int*)(0x424904A4UL))
#define bM4_TMR40_OCMRUH_OPZRHUH0                       *((volatile unsigned int*)(0x424904A8UL))
#define bM4_TMR40_OCMRUH_OPZRHUH1                       *((volatile unsigned int*)(0x424904ACUL))
#define bM4_TMR40_OCMRUH_OPNPKHUH0                      *((volatile unsigned int*)(0x424904B0UL))
#define bM4_TMR40_OCMRUH_OPNPKHUH1                      *((volatile unsigned int*)(0x424904B4UL))
#define bM4_TMR40_OCMRUH_OPNZRHUH0                      *((volatile unsigned int*)(0x424904B8UL))
#define bM4_TMR40_OCMRUH_OPNZRHUH1                      *((volatile unsigned int*)(0x424904BCUL))
#define bM4_TMR40_OCMRUL_OCFDCLUL                       *((volatile unsigned int*)(0x42490500UL))
#define bM4_TMR40_OCMRUL_OCFPKLUL                       *((volatile unsigned int*)(0x42490504UL))
#define bM4_TMR40_OCMRUL_OCFUCLUL                       *((volatile unsigned int*)(0x42490508UL))
#define bM4_TMR40_OCMRUL_OCFZRLUL                       *((volatile unsigned int*)(0x4249050CUL))
#define bM4_TMR40_OCMRUL_OPDCLUL0                       *((volatile unsigned int*)(0x42490510UL))
#define bM4_TMR40_OCMRUL_OPDCLUL1                       *((volatile unsigned int*)(0x42490514UL))
#define bM4_TMR40_OCMRUL_OPPKLUL0                       *((volatile unsigned int*)(0x42490518UL))
#define bM4_TMR40_OCMRUL_OPPKLUL1                       *((volatile unsigned int*)(0x4249051CUL))
#define bM4_TMR40_OCMRUL_OPUCLUL0                       *((volatile unsigned int*)(0x42490520UL))
#define bM4_TMR40_OCMRUL_OPUCLUL1                       *((volatile unsigned int*)(0x42490524UL))
#define bM4_TMR40_OCMRUL_OPZRLUL0                       *((volatile unsigned int*)(0x42490528UL))
#define bM4_TMR40_OCMRUL_OPZRLUL1                       *((volatile unsigned int*)(0x4249052CUL))
#define bM4_TMR40_OCMRUL_OPNPKLUL0                      *((volatile unsigned int*)(0x42490530UL))
#define bM4_TMR40_OCMRUL_OPNPKLUL1                      *((volatile unsigned int*)(0x42490534UL))
#define bM4_TMR40_OCMRUL_OPNZRLUL0                      *((volatile unsigned int*)(0x42490538UL))
#define bM4_TMR40_OCMRUL_OPNZRLUL1                      *((volatile unsigned int*)(0x4249053CUL))
#define bM4_TMR40_OCMRUL_EOPNDCLUL0                     *((volatile unsigned int*)(0x42490540UL))
#define bM4_TMR40_OCMRUL_EOPNDCLUL1                     *((volatile unsigned int*)(0x42490544UL))
#define bM4_TMR40_OCMRUL_EOPNUCLUL0                     *((volatile unsigned int*)(0x42490548UL))
#define bM4_TMR40_OCMRUL_EOPNUCLUL1                     *((volatile unsigned int*)(0x4249054CUL))
#define bM4_TMR40_OCMRUL_EOPDCLUL0                      *((volatile unsigned int*)(0x42490550UL))
#define bM4_TMR40_OCMRUL_EOPDCLUL1                      *((volatile unsigned int*)(0x42490554UL))
#define bM4_TMR40_OCMRUL_EOPPKLUL0                      *((volatile unsigned int*)(0x42490558UL))
#define bM4_TMR40_OCMRUL_EOPPKLUL1                      *((volatile unsigned int*)(0x4249055CUL))
#define bM4_TMR40_OCMRUL_EOPUCLUL0                      *((volatile unsigned int*)(0x42490560UL))
#define bM4_TMR40_OCMRUL_EOPUCLUL1                      *((volatile unsigned int*)(0x42490564UL))
#define bM4_TMR40_OCMRUL_EOPZRLUL0                      *((volatile unsigned int*)(0x42490568UL))
#define bM4_TMR40_OCMRUL_EOPZRLUL1                      *((volatile unsigned int*)(0x4249056CUL))
#define bM4_TMR40_OCMRUL_EOPNPKLUL0                     *((volatile unsigned int*)(0x42490570UL))
#define bM4_TMR40_OCMRUL_EOPNPKLUL1                     *((volatile unsigned int*)(0x42490574UL))
#define bM4_TMR40_OCMRUL_EOPNZRLUL0                     *((volatile unsigned int*)(0x42490578UL))
#define bM4_TMR40_OCMRUL_EOPNZRLUL1                     *((volatile unsigned int*)(0x4249057CUL))
#define bM4_TMR40_OCMRVH_OCFDCHVH                       *((volatile unsigned int*)(0x42490580UL))
#define bM4_TMR40_OCMRVH_OCFPKHVH                       *((volatile unsigned int*)(0x42490584UL))
#define bM4_TMR40_OCMRVH_OCFUCHVH                       *((volatile unsigned int*)(0x42490588UL))
#define bM4_TMR40_OCMRVH_OCFZRHVH                       *((volatile unsigned int*)(0x4249058CUL))
#define bM4_TMR40_OCMRVH_OPDCHVH0                       *((volatile unsigned int*)(0x42490590UL))
#define bM4_TMR40_OCMRVH_OPDCHVH1                       *((volatile unsigned int*)(0x42490594UL))
#define bM4_TMR40_OCMRVH_OPPKHVH0                       *((volatile unsigned int*)(0x42490598UL))
#define bM4_TMR40_OCMRVH_OPPKHVH1                       *((volatile unsigned int*)(0x4249059CUL))
#define bM4_TMR40_OCMRVH_OPUCHVH0                       *((volatile unsigned int*)(0x424905A0UL))
#define bM4_TMR40_OCMRVH_OPUCHVH1                       *((volatile unsigned int*)(0x424905A4UL))
#define bM4_TMR40_OCMRVH_OPZRHVH0                       *((volatile unsigned int*)(0x424905A8UL))
#define bM4_TMR40_OCMRVH_OPZRHVH1                       *((volatile unsigned int*)(0x424905ACUL))
#define bM4_TMR40_OCMRVH_OPNPKHVH0                      *((volatile unsigned int*)(0x424905B0UL))
#define bM4_TMR40_OCMRVH_OPNPKHVH1                      *((volatile unsigned int*)(0x424905B4UL))
#define bM4_TMR40_OCMRVH_OPNZRHVH0                      *((volatile unsigned int*)(0x424905B8UL))
#define bM4_TMR40_OCMRVH_OPNZRHVH1                      *((volatile unsigned int*)(0x424905BCUL))
#define bM4_TMR40_OCMRVL_OCFDCLVL                       *((volatile unsigned int*)(0x42490600UL))
#define bM4_TMR40_OCMRVL_OCFPKLVL                       *((volatile unsigned int*)(0x42490604UL))
#define bM4_TMR40_OCMRVL_OCFUCLVL                       *((volatile unsigned int*)(0x42490608UL))
#define bM4_TMR40_OCMRVL_OCFZRLVL                       *((volatile unsigned int*)(0x4249060CUL))
#define bM4_TMR40_OCMRVL_OPDCLVL0                       *((volatile unsigned int*)(0x42490610UL))
#define bM4_TMR40_OCMRVL_OPDCLVL1                       *((volatile unsigned int*)(0x42490614UL))
#define bM4_TMR40_OCMRVL_OPPKLVL0                       *((volatile unsigned int*)(0x42490618UL))
#define bM4_TMR40_OCMRVL_OPPKLVL1                       *((volatile unsigned int*)(0x4249061CUL))
#define bM4_TMR40_OCMRVL_OPUCLVL0                       *((volatile unsigned int*)(0x42490620UL))
#define bM4_TMR40_OCMRVL_OPUCLVL1                       *((volatile unsigned int*)(0x42490624UL))
#define bM4_TMR40_OCMRVL_OPZRLVL0                       *((volatile unsigned int*)(0x42490628UL))
#define bM4_TMR40_OCMRVL_OPZRLVL1                       *((volatile unsigned int*)(0x4249062CUL))
#define bM4_TMR40_OCMRVL_OPNPKLVL0                      *((volatile unsigned int*)(0x42490630UL))
#define bM4_TMR40_OCMRVL_OPNPKLVL1                      *((volatile unsigned int*)(0x42490634UL))
#define bM4_TMR40_OCMRVL_OPNZRLVL0                      *((volatile unsigned int*)(0x42490638UL))
#define bM4_TMR40_OCMRVL_OPNZRLVL1                      *((volatile unsigned int*)(0x4249063CUL))
#define bM4_TMR40_OCMRVL_EOPNDCLVL0                     *((volatile unsigned int*)(0x42490640UL))
#define bM4_TMR40_OCMRVL_EOPNDCLVL1                     *((volatile unsigned int*)(0x42490644UL))
#define bM4_TMR40_OCMRVL_EOPNUCLVL0                     *((volatile unsigned int*)(0x42490648UL))
#define bM4_TMR40_OCMRVL_EOPNUCLVL1                     *((volatile unsigned int*)(0x4249064CUL))
#define bM4_TMR40_OCMRVL_EOPDCLVL0                      *((volatile unsigned int*)(0x42490650UL))
#define bM4_TMR40_OCMRVL_EOPDCLVL1                      *((volatile unsigned int*)(0x42490654UL))
#define bM4_TMR40_OCMRVL_EOPPKLVL0                      *((volatile unsigned int*)(0x42490658UL))
#define bM4_TMR40_OCMRVL_EOPPKLVL1                      *((volatile unsigned int*)(0x4249065CUL))
#define bM4_TMR40_OCMRVL_EOPUCLVL0                      *((volatile unsigned int*)(0x42490660UL))
#define bM4_TMR40_OCMRVL_EOPUCLVL1                      *((volatile unsigned int*)(0x42490664UL))
#define bM4_TMR40_OCMRVL_EOPZRLVL0                      *((volatile unsigned int*)(0x42490668UL))
#define bM4_TMR40_OCMRVL_EOPZRLVL1                      *((volatile unsigned int*)(0x4249066CUL))
#define bM4_TMR40_OCMRVL_EOPNPKLVL0                     *((volatile unsigned int*)(0x42490670UL))
#define bM4_TMR40_OCMRVL_EOPNPKLVL1                     *((volatile unsigned int*)(0x42490674UL))
#define bM4_TMR40_OCMRVL_EOPNZRLVL0                     *((volatile unsigned int*)(0x42490678UL))
#define bM4_TMR40_OCMRVL_EOPNZRLVL1                     *((volatile unsigned int*)(0x4249067CUL))
#define bM4_TMR40_OCMRWH_OCFDCHWH                       *((volatile unsigned int*)(0x42490680UL))
#define bM4_TMR40_OCMRWH_OCFPKHWH                       *((volatile unsigned int*)(0x42490684UL))
#define bM4_TMR40_OCMRWH_OCFUCHWH                       *((volatile unsigned int*)(0x42490688UL))
#define bM4_TMR40_OCMRWH_OCFZRHWH                       *((volatile unsigned int*)(0x4249068CUL))
#define bM4_TMR40_OCMRWH_OPDCHWH0                       *((volatile unsigned int*)(0x42490690UL))
#define bM4_TMR40_OCMRWH_OPDCHWH1                       *((volatile unsigned int*)(0x42490694UL))
#define bM4_TMR40_OCMRWH_OPPKHWH0                       *((volatile unsigned int*)(0x42490698UL))
#define bM4_TMR40_OCMRWH_OPPKHWH1                       *((volatile unsigned int*)(0x4249069CUL))
#define bM4_TMR40_OCMRWH_OPUCHWH0                       *((volatile unsigned int*)(0x424906A0UL))
#define bM4_TMR40_OCMRWH_OPUCHWH1                       *((volatile unsigned int*)(0x424906A4UL))
#define bM4_TMR40_OCMRWH_OPZRHWH0                       *((volatile unsigned int*)(0x424906A8UL))
#define bM4_TMR40_OCMRWH_OPZRHWH1                       *((volatile unsigned int*)(0x424906ACUL))
#define bM4_TMR40_OCMRWH_OPNPKHWH0                      *((volatile unsigned int*)(0x424906B0UL))
#define bM4_TMR40_OCMRWH_OPNPKHWH1                      *((volatile unsigned int*)(0x424906B4UL))
#define bM4_TMR40_OCMRWH_OPNZRHWH0                      *((volatile unsigned int*)(0x424906B8UL))
#define bM4_TMR40_OCMRWH_OPNZRHWH1                      *((volatile unsigned int*)(0x424906BCUL))
#define bM4_TMR40_OCMRWL_OCFDCLWL                       *((volatile unsigned int*)(0x42490700UL))
#define bM4_TMR40_OCMRWL_OCFPKLWL                       *((volatile unsigned int*)(0x42490704UL))
#define bM4_TMR40_OCMRWL_OCFUCLWL                       *((volatile unsigned int*)(0x42490708UL))
#define bM4_TMR40_OCMRWL_OCFZRLWL                       *((volatile unsigned int*)(0x4249070CUL))
#define bM4_TMR40_OCMRWL_OPDCLWL0                       *((volatile unsigned int*)(0x42490710UL))
#define bM4_TMR40_OCMRWL_OPDCLWL1                       *((volatile unsigned int*)(0x42490714UL))
#define bM4_TMR40_OCMRWL_OPPKLWL0                       *((volatile unsigned int*)(0x42490718UL))
#define bM4_TMR40_OCMRWL_OPPKLWL1                       *((volatile unsigned int*)(0x4249071CUL))
#define bM4_TMR40_OCMRWL_OPUCLWL0                       *((volatile unsigned int*)(0x42490720UL))
#define bM4_TMR40_OCMRWL_OPUCLWL1                       *((volatile unsigned int*)(0x42490724UL))
#define bM4_TMR40_OCMRWL_OPZRLWL0                       *((volatile unsigned int*)(0x42490728UL))
#define bM4_TMR40_OCMRWL_OPZRLWL1                       *((volatile unsigned int*)(0x4249072CUL))
#define bM4_TMR40_OCMRWL_OPNPKLWL0                      *((volatile unsigned int*)(0x42490730UL))
#define bM4_TMR40_OCMRWL_OPNPKLWL1                      *((volatile unsigned int*)(0x42490734UL))
#define bM4_TMR40_OCMRWL_OPNZRLWL0                      *((volatile unsigned int*)(0x42490738UL))
#define bM4_TMR40_OCMRWL_OPNZRLWL1                      *((volatile unsigned int*)(0x4249073CUL))
#define bM4_TMR40_OCMRWL_EOPNDCLWL0                     *((volatile unsigned int*)(0x42490740UL))
#define bM4_TMR40_OCMRWL_EOPNDCLWL1                     *((volatile unsigned int*)(0x42490744UL))
#define bM4_TMR40_OCMRWL_EOPNUCLWL0                     *((volatile unsigned int*)(0x42490748UL))
#define bM4_TMR40_OCMRWL_EOPNUCLWL1                     *((volatile unsigned int*)(0x4249074CUL))
#define bM4_TMR40_OCMRWL_EOPDCLWL0                      *((volatile unsigned int*)(0x42490750UL))
#define bM4_TMR40_OCMRWL_EOPDCLWL1                      *((volatile unsigned int*)(0x42490754UL))
#define bM4_TMR40_OCMRWL_EOPPKLWL0                      *((volatile unsigned int*)(0x42490758UL))
#define bM4_TMR40_OCMRWL_EOPPKLWL1                      *((volatile unsigned int*)(0x4249075CUL))
#define bM4_TMR40_OCMRWL_EOPUCLWL0                      *((volatile unsigned int*)(0x42490760UL))
#define bM4_TMR40_OCMRWL_EOPUCLWL1                      *((volatile unsigned int*)(0x42490764UL))
#define bM4_TMR40_OCMRWL_EOPZRLWL0                      *((volatile unsigned int*)(0x42490768UL))
#define bM4_TMR40_OCMRWL_EOPZRLWL1                      *((volatile unsigned int*)(0x4249076CUL))
#define bM4_TMR40_OCMRWL_EOPNPKLWL0                     *((volatile unsigned int*)(0x42490770UL))
#define bM4_TMR40_OCMRWL_EOPNPKLWL1                     *((volatile unsigned int*)(0x42490774UL))
#define bM4_TMR40_OCMRWL_EOPNZRLWL0                     *((volatile unsigned int*)(0x42490778UL))
#define bM4_TMR40_OCMRWL_EOPNZRLWL1                     *((volatile unsigned int*)(0x4249077CUL))
#define bM4_TMR40_CCSR_CKDIV0                           *((volatile unsigned int*)(0x42490900UL))
#define bM4_TMR40_CCSR_CKDIV1                           *((volatile unsigned int*)(0x42490904UL))
#define bM4_TMR40_CCSR_CKDIV2                           *((volatile unsigned int*)(0x42490908UL))
#define bM4_TMR40_CCSR_CKDIV3                           *((volatile unsigned int*)(0x4249090CUL))
#define bM4_TMR40_CCSR_CLEAR                            *((volatile unsigned int*)(0x42490910UL))
#define bM4_TMR40_CCSR_MODE                             *((volatile unsigned int*)(0x42490914UL))
#define bM4_TMR40_CCSR_STOP                             *((volatile unsigned int*)(0x42490918UL))
#define bM4_TMR40_CCSR_BUFEN                            *((volatile unsigned int*)(0x4249091CUL))
#define bM4_TMR40_CCSR_IRQPEN                           *((volatile unsigned int*)(0x42490920UL))
#define bM4_TMR40_CCSR_IRQPF                            *((volatile unsigned int*)(0x42490924UL))
#define bM4_TMR40_CCSR_IRQZEN                           *((volatile unsigned int*)(0x42490934UL))
#define bM4_TMR40_CCSR_TRQZF                            *((volatile unsigned int*)(0x42490938UL))
#define bM4_TMR40_CCSR_ECKEN                            *((volatile unsigned int*)(0x4249093CUL))
#define bM4_TMR40_CVPR_ZIM0                             *((volatile unsigned int*)(0x42490940UL))
#define bM4_TMR40_CVPR_ZIM1                             *((volatile unsigned int*)(0x42490944UL))
#define bM4_TMR40_CVPR_ZIM2                             *((volatile unsigned int*)(0x42490948UL))
#define bM4_TMR40_CVPR_ZIM3                             *((volatile unsigned int*)(0x4249094CUL))
#define bM4_TMR40_CVPR_PIM0                             *((volatile unsigned int*)(0x42490950UL))
#define bM4_TMR40_CVPR_PIM1                             *((volatile unsigned int*)(0x42490954UL))
#define bM4_TMR40_CVPR_PIM2                             *((volatile unsigned int*)(0x42490958UL))
#define bM4_TMR40_CVPR_PIM3                             *((volatile unsigned int*)(0x4249095CUL))
#define bM4_TMR40_CVPR_ZIC0                             *((volatile unsigned int*)(0x42490960UL))
#define bM4_TMR40_CVPR_ZIC1                             *((volatile unsigned int*)(0x42490964UL))
#define bM4_TMR40_CVPR_ZIC2                             *((volatile unsigned int*)(0x42490968UL))
#define bM4_TMR40_CVPR_ZIC3                             *((volatile unsigned int*)(0x4249096CUL))
#define bM4_TMR40_CVPR_PIC0                             *((volatile unsigned int*)(0x42490970UL))
#define bM4_TMR40_CVPR_PIC1                             *((volatile unsigned int*)(0x42490974UL))
#define bM4_TMR40_CVPR_PIC2                             *((volatile unsigned int*)(0x42490978UL))
#define bM4_TMR40_CVPR_PIC3                             *((volatile unsigned int*)(0x4249097CUL))
#define bM4_TMR40_POCRU_DIVCKU0                         *((volatile unsigned int*)(0x42491300UL))
#define bM4_TMR40_POCRU_DIVCKU1                         *((volatile unsigned int*)(0x42491304UL))
#define bM4_TMR40_POCRU_DIVCKU2                         *((volatile unsigned int*)(0x42491308UL))
#define bM4_TMR40_POCRU_DIVCKU3                         *((volatile unsigned int*)(0x4249130CUL))
#define bM4_TMR40_POCRU_PWMMDU0                         *((volatile unsigned int*)(0x42491310UL))
#define bM4_TMR40_POCRU_PWMMDU1                         *((volatile unsigned int*)(0x42491314UL))
#define bM4_TMR40_POCRU_LVLSU0                          *((volatile unsigned int*)(0x42491318UL))
#define bM4_TMR40_POCRU_LVLSU1                          *((volatile unsigned int*)(0x4249131CUL))
#define bM4_TMR40_POCRV_DIVCKV0                         *((volatile unsigned int*)(0x42491380UL))
#define bM4_TMR40_POCRV_DIVCKV1                         *((volatile unsigned int*)(0x42491384UL))
#define bM4_TMR40_POCRV_DIVCKV2                         *((volatile unsigned int*)(0x42491388UL))
#define bM4_TMR40_POCRV_DIVCKV3                         *((volatile unsigned int*)(0x4249138CUL))
#define bM4_TMR40_POCRV_PWMMDV0                         *((volatile unsigned int*)(0x42491390UL))
#define bM4_TMR40_POCRV_PWMMDV1                         *((volatile unsigned int*)(0x42491394UL))
#define bM4_TMR40_POCRV_LVLSV0                          *((volatile unsigned int*)(0x42491398UL))
#define bM4_TMR40_POCRV_LVLSV1                          *((volatile unsigned int*)(0x4249139CUL))
#define bM4_TMR40_POCRW_DIVCKW0                         *((volatile unsigned int*)(0x42491400UL))
#define bM4_TMR40_POCRW_DIVCKW1                         *((volatile unsigned int*)(0x42491404UL))
#define bM4_TMR40_POCRW_DIVCKW2                         *((volatile unsigned int*)(0x42491408UL))
#define bM4_TMR40_POCRW_DIVCKW3                         *((volatile unsigned int*)(0x4249140CUL))
#define bM4_TMR40_POCRW_PWMMDW0                         *((volatile unsigned int*)(0x42491410UL))
#define bM4_TMR40_POCRW_PWMMDW1                         *((volatile unsigned int*)(0x42491414UL))
#define bM4_TMR40_POCRW_LVLSW0                          *((volatile unsigned int*)(0x42491418UL))
#define bM4_TMR40_POCRW_LVLSW1                          *((volatile unsigned int*)(0x4249141CUL))
#define bM4_TMR40_RCSR_RTIDU                            *((volatile unsigned int*)(0x42491480UL))
#define bM4_TMR40_RCSR_RTIDV                            *((volatile unsigned int*)(0x42491484UL))
#define bM4_TMR40_RCSR_RTIDW                            *((volatile unsigned int*)(0x42491488UL))
#define bM4_TMR40_RCSR_RTIFU                            *((volatile unsigned int*)(0x42491490UL))
#define bM4_TMR40_RCSR_RTICU                            *((volatile unsigned int*)(0x42491494UL))
#define bM4_TMR40_RCSR_RTEU                             *((volatile unsigned int*)(0x42491498UL))
#define bM4_TMR40_RCSR_RSTU                             *((volatile unsigned int*)(0x4249149CUL))
#define bM4_TMR40_RCSR_RTIFV                            *((volatile unsigned int*)(0x424914A0UL))
#define bM4_TMR40_RCSR_RTICV                            *((volatile unsigned int*)(0x424914A4UL))
#define bM4_TMR40_RCSR_RTEV                             *((volatile unsigned int*)(0x424914A8UL))
#define bM4_TMR40_RCSR_RSTV                             *((volatile unsigned int*)(0x424914ACUL))
#define bM4_TMR40_RCSR_RTIFW                            *((volatile unsigned int*)(0x424914B0UL))
#define bM4_TMR40_RCSR_RTICW                            *((volatile unsigned int*)(0x424914B4UL))
#define bM4_TMR40_RCSR_RTEW                             *((volatile unsigned int*)(0x424914B8UL))
#define bM4_TMR40_RCSR_RSTW                             *((volatile unsigned int*)(0x424914BCUL))
#define bM4_TMR40_SCSRUH_BUFENUH0                       *((volatile unsigned int*)(0x42491900UL))
#define bM4_TMR40_SCSRUH_BUFENUH1                       *((volatile unsigned int*)(0x42491904UL))
#define bM4_TMR40_SCSRUH_EVTOSUH0                       *((volatile unsigned int*)(0x42491908UL))
#define bM4_TMR40_SCSRUH_EVTOSUH1                       *((volatile unsigned int*)(0x4249190CUL))
#define bM4_TMR40_SCSRUH_EVTOSUH2                       *((volatile unsigned int*)(0x42491910UL))
#define bM4_TMR40_SCSRUH_LMCUH                          *((volatile unsigned int*)(0x42491914UL))
#define bM4_TMR40_SCSRUH_EVTMSUH                        *((volatile unsigned int*)(0x42491920UL))
#define bM4_TMR40_SCSRUH_EVTDSUH                        *((volatile unsigned int*)(0x42491924UL))
#define bM4_TMR40_SCSRUH_DENUH                          *((volatile unsigned int*)(0x42491930UL))
#define bM4_TMR40_SCSRUH_PENUH                          *((volatile unsigned int*)(0x42491934UL))
#define bM4_TMR40_SCSRUH_UENUH                          *((volatile unsigned int*)(0x42491938UL))
#define bM4_TMR40_SCSRUH_ZENUH                          *((volatile unsigned int*)(0x4249193CUL))
#define bM4_TMR40_SCMRUH_AMCUH0                         *((volatile unsigned int*)(0x42491940UL))
#define bM4_TMR40_SCMRUH_AMCUH1                         *((volatile unsigned int*)(0x42491944UL))
#define bM4_TMR40_SCMRUH_AMCUH2                         *((volatile unsigned int*)(0x42491948UL))
#define bM4_TMR40_SCMRUH_AMCUH3                         *((volatile unsigned int*)(0x4249194CUL))
#define bM4_TMR40_SCMRUH_MZCEUH                         *((volatile unsigned int*)(0x42491958UL))
#define bM4_TMR40_SCMRUH_MPCEUH                         *((volatile unsigned int*)(0x4249195CUL))
#define bM4_TMR40_SCSRUL_BUFENUL0                       *((volatile unsigned int*)(0x42491980UL))
#define bM4_TMR40_SCSRUL_BUFENUL1                       *((volatile unsigned int*)(0x42491984UL))
#define bM4_TMR40_SCSRUL_EVTOSUL0                       *((volatile unsigned int*)(0x42491988UL))
#define bM4_TMR40_SCSRUL_EVTOSUL1                       *((volatile unsigned int*)(0x4249198CUL))
#define bM4_TMR40_SCSRUL_EVTOSUL2                       *((volatile unsigned int*)(0x42491990UL))
#define bM4_TMR40_SCSRUL_LMCUL                          *((volatile unsigned int*)(0x42491994UL))
#define bM4_TMR40_SCSRUL_EVTMSUL                        *((volatile unsigned int*)(0x424919A0UL))
#define bM4_TMR40_SCSRUL_EVTDSUL                        *((volatile unsigned int*)(0x424919A4UL))
#define bM4_TMR40_SCSRUL_DENUL                          *((volatile unsigned int*)(0x424919B0UL))
#define bM4_TMR40_SCSRUL_PENUL                          *((volatile unsigned int*)(0x424919B4UL))
