RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR40_SCSRUL_UENUL                          *((volatile unsigned int*)(0x424919B8UL))
#define bM4_TMR40_SCSRUL_ZENUL                          *((volatile unsigned int*)(0x424919BCUL))
#define bM4_TMR40_SCMRUL_AMCUL0                         *((volatile unsigned int*)(0x424919C0UL))
#define bM4_TMR40_SCMRUL_AMCUL1                         *((volatile unsigned int*)(0x424919C4UL))
#define bM4_TMR40_SCMRUL_AMCUL2                         *((volatile unsigned int*)(0x424919C8UL))
#define bM4_TMR40_SCMRUL_AMCUL3                         *((volatile unsigned int*)(0x424919CCUL))
#define bM4_TMR40_SCMRUL_MZCEUL                         *((volatile unsigned int*)(0x424919D8UL))
#define bM4_TMR40_SCMRUL_MPCEUL                         *((volatile unsigned int*)(0x424919DCUL))
#define bM4_TMR40_SCSRVH_BUFENVH0                       *((volatile unsigned int*)(0x42491A00UL))
#define bM4_TMR40_SCSRVH_BUFENVH1                       *((volatile unsigned int*)(0x42491A04UL))
#define bM4_TMR40_SCSRVH_EVTOSVH0                       *((volatile unsigned int*)(0x42491A08UL))
#define bM4_TMR40_SCSRVH_EVTOSVH1                       *((volatile unsigned int*)(0x42491A0CUL))
#define bM4_TMR40_SCSRVH_EVTOSVH2                       *((volatile unsigned int*)(0x42491A10UL))
#define bM4_TMR40_SCSRVH_LMCVH                          *((volatile unsigned int*)(0x42491A14UL))
#define bM4_TMR40_SCSRVH_EVTMSVH                        *((volatile unsigned int*)(0x42491A20UL))
#define bM4_TMR40_SCSRVH_EVTDSVH                        *((volatile unsigned int*)(0x42491A24UL))
#define bM4_TMR40_SCSRVH_DENVH                          *((volatile unsigned int*)(0x42491A30UL))
#define bM4_TMR40_SCSRVH_PENVH                          *((volatile unsigned int*)(0x42491A34UL))
#define bM4_TMR40_SCSRVH_UENVH                          *((volatile unsigned int*)(0x42491A38UL))
#define bM4_TMR40_SCSRVH_ZENVH                          *((volatile unsigned int*)(0x42491A3CUL))
#define bM4_TMR40_SCMRVH_AMCVH0                         *((volatile unsigned int*)(0x42491A40UL))
#define bM4_TMR40_SCMRVH_AMCVH1                         *((volatile unsigned int*)(0x42491A44UL))
#define bM4_TMR40_SCMRVH_AMCVH2                         *((volatile unsigned int*)(0x42491A48UL))
#define bM4_TMR40_SCMRVH_AMCVH3                         *((volatile unsigned int*)(0x42491A4CUL))
#define bM4_TMR40_SCMRVH_MZCEVH                         *((volatile unsigned int*)(0x42491A58UL))
#define bM4_TMR40_SCMRVH_MPCEVH                         *((volatile unsigned int*)(0x42491A5CUL))
#define bM4_TMR40_SCSRVL_BUFENVL0                       *((volatile unsigned int*)(0x42491A80UL))
#define bM4_TMR40_SCSRVL_BUFENVL1                       *((volatile unsigned int*)(0x42491A84UL))
#define bM4_TMR40_SCSRVL_EVTOSVL0                       *((volatile unsigned int*)(0x42491A88UL))
#define bM4_TMR40_SCSRVL_EVTOSVL1                       *((volatile unsigned int*)(0x42491A8CUL))
#define bM4_TMR40_SCSRVL_EVTOSVL2                       *((volatile unsigned int*)(0x42491A90UL))
#define bM4_TMR40_SCSRVL_LMCVL                          *((volatile unsigned int*)(0x42491A94UL))
#define bM4_TMR40_SCSRVL_EVTMSVL                        *((volatile unsigned int*)(0x42491AA0UL))
#define bM4_TMR40_SCSRVL_EVTDSVL                        *((volatile unsigned int*)(0x42491AA4UL))
#define bM4_TMR40_SCSRVL_DENVL                          *((volatile unsigned int*)(0x42491AB0UL))
#define bM4_TMR40_SCSRVL_PENVL                          *((volatile unsigned int*)(0x42491AB4UL))
#define bM4_TMR40_SCSRVL_UENVL                          *((volatile unsigned int*)(0x42491AB8UL))
#define bM4_TMR40_SCSRVL_ZENVL                          *((volatile unsigned int*)(0x42491ABCUL))
#define bM4_TMR40_SCMRVL_AMCVL0                         *((volatile unsigned int*)(0x42491AC0UL))
#define bM4_TMR40_SCMRVL_AMCVL1                         *((volatile unsigned int*)(0x42491AC4UL))
#define bM4_TMR40_SCMRVL_AMCVL2                         *((volatile unsigned int*)(0x42491AC8UL))
#define bM4_TMR40_SCMRVL_AMCVL3                         *((volatile unsigned int*)(0x42491ACCUL))
#define bM4_TMR40_SCMRVL_MZCEVL                         *((volatile unsigned int*)(0x42491AD8UL))
#define bM4_TMR40_SCMRVL_MPCEVL                         *((volatile unsigned int*)(0x42491ADCUL))
#define bM4_TMR40_SCSRWH_BUFENWH0                       *((volatile unsigned int*)(0x42491B00UL))
#define bM4_TMR40_SCSRWH_BUFENWH1                       *((volatile unsigned int*)(0x42491B04UL))
#define bM4_TMR40_SCSRWH_EVTOSWH0                       *((volatile unsigned int*)(0x42491B08UL))
#define bM4_TMR40_SCSRWH_EVTOSWH1                       *((volatile unsigned int*)(0x42491B0CUL))
#define bM4_TMR40_SCSRWH_EVTOSWH2                       *((volatile unsigned int*)(0x42491B10UL))
#define bM4_TMR40_SCSRWH_LMCWH                          *((volatile unsigned int*)(0x42491B14UL))
#define bM4_TMR40_SCSRWH_EVTMSWH                        *((volatile unsigned int*)(0x42491B20UL))
#define bM4_TMR40_SCSRWH_EVTDSWH                        *((volatile unsigned int*)(0x42491B24UL))
#define bM4_TMR40_SCSRWH_DENWH                          *((volatile unsigned int*)(0x42491B30UL))
#define bM4_TMR40_SCSRWH_PENWH                          *((volatile unsigned int*)(0x42491B34UL))
#define bM4_TMR40_SCSRWH_UENWH                          *((volatile unsigned int*)(0x42491B38UL))
#define bM4_TMR40_SCSRWH_ZENWH                          *((volatile unsigned int*)(0x42491B3CUL))
#define bM4_TMR40_SCMRWH_AMCWH0                         *((volatile unsigned int*)(0x42491B40UL))
#define bM4_TMR40_SCMRWH_AMCWH1                         *((volatile unsigned int*)(0x42491B44UL))
#define bM4_TMR40_SCMRWH_AMCWH2                         *((volatile unsigned int*)(0x42491B48UL))
#define bM4_TMR40_SCMRWH_AMCWH3                         *((volatile unsigned int*)(0x42491B4CUL))
#define bM4_TMR40_SCMRWH_MZCEWH                         *((volatile unsigned int*)(0x42491B58UL))
#define bM4_TMR40_SCMRWH_MPCEWH                         *((volatile unsigned int*)(0x42491B5CUL))
#define bM4_TMR40_SCSRWL_BUFENWL0                       *((volatile unsigned int*)(0x42491B80UL))
#define bM4_TMR40_SCSRWL_BUFENWL1                       *((volatile unsigned int*)(0x42491B84UL))
#define bM4_TMR40_SCSRWL_EVTOSWL0                       *((volatile unsigned int*)(0x42491B88UL))
#define bM4_TMR40_SCSRWL_EVTOSWL1                       *((volatile unsigned int*)(0x42491B8CUL))
#define bM4_TMR40_SCSRWL_EVTOSWL2                       *((volatile unsigned int*)(0x42491B90UL))
#define bM4_TMR40_SCSRWL_LMCWL                          *((volatile unsigned int*)(0x42491B94UL))
#define bM4_TMR40_SCSRWL_EVTMSWL                        *((volatile unsigned int*)(0x42491BA0UL))
#define bM4_TMR40_SCSRWL_EVTDSWL                        *((volatile unsigned int*)(0x42491BA4UL))
#define bM4_TMR40_SCSRWL_DENWL                          *((volatile unsigned int*)(0x42491BB0UL))
#define bM4_TMR40_SCSRWL_PENWL                          *((volatile unsigned int*)(0x42491BB4UL))
#define bM4_TMR40_SCSRWL_UENWL                          *((volatile unsigned int*)(0x42491BB8UL))
#define bM4_TMR40_SCSRWL_ZENWL                          *((volatile unsigned int*)(0x42491BBCUL))
#define bM4_TMR40_SCMRWL_AMCWL0                         *((volatile unsigned int*)(0x42491BC0UL))
#define bM4_TMR40_SCMRWL_AMCWL1                         *((volatile unsigned int*)(0x42491BC4UL))
#define bM4_TMR40_SCMRWL_AMCWL2                         *((volatile unsigned int*)(0x42491BC8UL))
#define bM4_TMR40_SCMRWL_AMCWL3                         *((volatile unsigned int*)(0x42491BCCUL))
#define bM4_TMR40_SCMRWL_MZCEWL                         *((volatile unsigned int*)(0x42491BD8UL))
#define bM4_TMR40_SCMRWL_MPCEWL                         *((volatile unsigned int*)(0x42491BDCUL))
#define bM4_TMR40_ECSR_HOLD                             *((volatile unsigned int*)(0x42491E1CUL))
#define bM4_TMR40_ECER_EMBVAL0                          *((volatile unsigned int*)(0x42AA8600UL))
#define bM4_TMR40_ECER_EMBVAL1                          *((volatile unsigned int*)(0x42AA8604UL))
#define bM4_TMR41_OCSRU_OCEHU                           *((volatile unsigned int*)(0x42498300UL))
#define bM4_TMR41_OCSRU_OCELU                           *((volatile unsigned int*)(0x42498304UL))
#define bM4_TMR41_OCSRU_OCPHU                           *((volatile unsigned int*)(0x42498308UL))
#define bM4_TMR41_OCSRU_OCPLU                           *((volatile unsigned int*)(0x4249830CUL))
#define bM4_TMR41_OCSRU_OCIEHU                          *((volatile unsigned int*)(0x42498310UL))
#define bM4_TMR41_OCSRU_OCIELU                          *((volatile unsigned int*)(0x42498314UL))
#define bM4_TMR41_OCSRU_OCFHU                           *((volatile unsigned int*)(0x42498318UL))
#define bM4_TMR41_OCSRU_OCFLU                           *((volatile unsigned int*)(0x4249831CUL))
#define bM4_TMR41_OCERU_CHBUFENU0                       *((volatile unsigned int*)(0x42498340UL))
#define bM4_TMR41_OCERU_CHBUFENU1                       *((volatile unsigned int*)(0x42498344UL))
#define bM4_TMR41_OCERU_CLBUFENU0                       *((volatile unsigned int*)(0x42498348UL))
#define bM4_TMR41_OCERU_CLBUFENU1                       *((volatile unsigned int*)(0x4249834CUL))
#define bM4_TMR41_OCERU_MHBUFENU0                       *((volatile unsigned int*)(0x42498350UL))
#define bM4_TMR41_OCERU_MHBUFENU1                       *((volatile unsigned int*)(0x42498354UL))
#define bM4_TMR41_OCERU_MLBUFENU0                       *((volatile unsigned int*)(0x42498358UL))
#define bM4_TMR41_OCERU_MLBUFENU1                       *((volatile unsigned int*)(0x4249835CUL))
#define bM4_TMR41_OCERU_LMCHU                           *((volatile unsigned int*)(0x42498360UL))
#define bM4_TMR41_OCERU_LMCLU                           *((volatile unsigned int*)(0x42498364UL))
#define bM4_TMR41_OCERU_LMMHU                           *((volatile unsigned int*)(0x42498368UL))
#define bM4_TMR41_OCERU_LMMLU                           *((volatile unsigned int*)(0x4249836CUL))
#define bM4_TMR41_OCERU_MCECHU                          *((volatile unsigned int*)(0x42498370UL))
#define bM4_TMR41_OCERU_MCECLU                          *((volatile unsigned int*)(0x42498374UL))
#define bM4_TMR41_OCSRV_OCEHV                           *((volatile unsigned int*)(0x42498380UL))
#define bM4_TMR41_OCSRV_OCELV                           *((volatile unsigned int*)(0x42498384UL))
#define bM4_TMR41_OCSRV_OCPHV                           *((volatile unsigned int*)(0x42498388UL))
#define bM4_TMR41_OCSRV_OCPLV                           *((volatile unsigned int*)(0x4249838CUL))
#define bM4_TMR41_OCSRV_OCIEHV                          *((volatile unsigned int*)(0x42498390UL))
#define bM4_TMR41_OCSRV_OCIELV                          *((volatile unsigned int*)(0x42498394UL))
#define bM4_TMR41_OCSRV_OCFHV                           *((volatile unsigned int*)(0x42498398UL))
#define bM4_TMR41_OCSRV_OCFLV                           *((volatile unsigned int*)(0x4249839CUL))
#define bM4_TMR41_OCERV_CHBUFENV0                       *((volatile unsigned int*)(0x424983C0UL))
#define bM4_TMR41_OCERV_CHBUFENV1                       *((volatile unsigned int*)(0x424983C4UL))
#define bM4_TMR41_OCERV_CLBUFENV0                       *((volatile unsigned int*)(0x424983C8UL))
#define bM4_TMR41_OCERV_CLBUFENV1                       *((volatile unsigned int*)(0x424983CCUL))
#define bM4_TMR41_OCERV_MHBUFENV0                       *((volatile unsigned int*)(0x424983D0UL))
#define bM4_TMR41_OCERV_MHBUFENV1                       *((volatile unsigned int*)(0x424983D4UL))
#define bM4_TMR41_OCERV_MLBUFENV0                       *((volatile unsigned int*)(0x424983D8UL))
#define bM4_TMR41_OCERV_MLBUFENV1                       *((volatile unsigned int*)(0x424983DCUL))
#define bM4_TMR41_OCERV_LMCHV                           *((volatile unsigned int*)(0x424983E0UL))
#define bM4_TMR41_OCERV_LMCLV                           *((volatile unsigned int*)(0x424983E4UL))
#define bM4_TMR41_OCERV_LMMHV                           *((volatile unsigned int*)(0x424983E8UL))
#define bM4_TMR41_OCERV_LMMLV                           *((volatile unsigned int*)(0x424983ECUL))
#define bM4_TMR41_OCERV_MCECHV                          *((volatile unsigned int*)(0x424983F0UL))
#define bM4_TMR41_OCERV_MCECLV                          *((volatile unsigned int*)(0x424983F4UL))
#define bM4_TMR41_OCSRW_OCEHW                           *((volatile unsigned int*)(0x42498400UL))
#define bM4_TMR41_OCSRW_OCELW                           *((volatile unsigned int*)(0x42498404UL))
#define bM4_TMR41_OCSRW_OCPHW                           *((volatile unsigned int*)(0x42498408UL))
#define bM4_TMR41_OCSRW_OCPLW                           *((volatile unsigned int*)(0x4249840CUL))
#define bM4_TMR41_OCSRW_OCIEHW                          *((volatile unsigned int*)(0x42498410UL))
#define bM4_TMR41_OCSRW_OCIELW                          *((volatile unsigned int*)(0x42498414UL))
#define bM4_TMR41_OCSRW_OCFHW                           *((volatile unsigned int*)(0x42498418UL))
#define bM4_TMR41_OCSRW_OCFLW                           *((volatile unsigned int*)(0x4249841CUL))
#define bM4_TMR41_OCERW_CHBUFENW0                       *((volatile unsigned int*)(0x42498440UL))
#define bM4_TMR41_OCERW_CHBUFENW1                       *((volatile unsigned int*)(0x42498444UL))
#define bM4_TMR41_OCERW_CLBUFENW0                       *((volatile unsigned int*)(0x42498448UL))
#define bM4_TMR41_OCERW_CLBUFENW1                       *((volatile unsigned int*)(0x4249844CUL))
#define bM4_TMR41_OCERW_MHBUFENW0                       *((volatile unsigned int*)(0x42498450UL))
#define bM4_TMR41_OCERW_MHBUFENW1                       *((volatile unsigned int*)(0x42498454UL))
#define bM4_TMR41_OCERW_MLBUFENW0                       *((volatile unsigned int*)(0x42498458UL))
#define bM4_TMR41_OCERW_MLBUFENW1                       *((volatile unsigned int*)(0x4249845CUL))
#define bM4_TMR41_OCERW_LMCHW                           *((volatile unsigned int*)(0x42498460UL))
#define bM4_TMR41_OCERW_LMCLW                           *((volatile unsigned int*)(0x42498464UL))
#define bM4_TMR41_OCERW_LMMHW                           *((volatile unsigned int*)(0x42498468UL))
#define bM4_TMR41_OCERW_LMMLW                           *((volatile unsigned int*)(0x4249846CUL))
#define bM4_TMR41_OCERW_MCECHW                          *((volatile unsigned int*)(0x42498470UL))
#define bM4_TMR41_OCERW_MCECLW                          *((volatile unsigned int*)(0x42498474UL))
#define bM4_TMR41_OCMRUH_OCFDCHUH                       *((volatile unsigned int*)(0x42498480UL))
#define bM4_TMR41_OCMRUH_OCFPKHUH                       *((volatile unsigned int*)(0x42498484UL))
#define bM4_TMR41_OCMRUH_OCFUCHUH                       *((volatile unsigned int*)(0x42498488UL))
#define bM4_TMR41_OCMRUH_OCFZRHUH                       *((volatile unsigned int*)(0x4249848CUL))
#define bM4_TMR41_OCMRUH_OPDCHUH0                       *((volatile unsigned int*)(0x42498490UL))
#define bM4_TMR41_OCMRUH_OPDCHUH1                       *((volatile unsigned int*)(0x42498494UL))
#define bM4_TMR41_OCMRUH_OPPKHUH0                       *((volatile unsigned int*)(0x42498498UL))
#define bM4_TMR41_OCMRUH_OPPKHUH1                       *((volatile unsigned int*)(0x4249849CUL))
#define bM4_TMR41_OCMRUH_OPUCHUH0                       *((volatile unsigned int*)(0x424984A0UL))
#define bM4_TMR41_OCMRUH_OPUCHUH1                       *((volatile unsigned int*)(0x424984A4UL))
#define bM4_TMR41_OCMRUH_OPZRHUH0                       *((volatile unsigned int*)(0x424984A8UL))
#define bM4_TMR41_OCMRUH_OPZRHUH1                       *((volatile unsigned int*)(0x424984ACUL))
#define bM4_TMR41_OCMRUH_OPNPKHUH0                      *((volatile unsigned int*)(0x424984B0UL))
#define bM4_TMR41_OCMRUH_OPNPKHUH1                      *((volatile unsigned int*)(0x424984B4UL))
#define bM4_TMR41_OCMRUH_OPNZRHUH0                      *((volatile unsigned int*)(0x424984B8UL))
#define bM4_TMR41_OCMRUH_OPNZRHUH1                      *((volatile unsigned int*)(0x424984BCUL))
#define bM4_TMR41_OCMRUL_OCFDCLUL                       *((volatile unsigned int*)(0x42498500UL))
#define bM4_TMR41_OCMRUL_OCFPKLUL                       *((volatile unsigned int*)(0x42498504UL))
#define bM4_TMR41_OCMRUL_OCFUCLUL                       *((volatile unsigned int*)(0x42498508UL))
#define bM4_TMR41_OCMRUL_OCFZRLUL                       *((volatile unsigned int*)(0x4249850CUL))
#define bM4_TMR41_OCMRUL_OPDCLUL0                       *((volatile unsigned int*)(0x42498510UL))
#define bM4_TMR41_OCMRUL_OPDCLUL1                       *((volatile unsigned int*)(0x42498514UL))
#define bM4_TMR41_OCMRUL_OPPKLUL0                       *((volatile unsigned int*)(0x42498518UL))
#define bM4_TMR41_OCMRUL_OPPKLUL1                       *((volatile unsigned int*)(0x4249851CUL))
#define bM4_TMR41_OCMRUL_OPUCLUL0                       *((volatile unsigned int*)(0x42498520UL))
#define bM4_TMR41_OCMRUL_OPUCLUL1                       *((volatile unsigned int*)(0x42498524UL))
#define bM4_TMR41_OCMRUL_OPZRLUL0                       *((volatile unsigned int*)(0x42498528UL))
#define bM4_TMR41_OCMRUL_OPZRLUL1                       *((volatile unsigned int*)(0x4249852CUL))
#define bM4_TMR41_OCMRUL_OPNPKLUL0                      *((volatile unsigned int*)(0x42498530UL))
#define bM4_TMR41_OCMRUL_OPNPKLUL1                      *((volatile unsigned int*)(0x42498534UL))
#define bM4_TMR41_OCMRUL_OPNZRLUL0                      *((volatile unsigned int*)(0x42498538UL))
#define bM4_TMR41_OCMRUL_OPNZRLUL1                      *((volatile unsigned int*)(0x4249853CUL))
#define bM4_TMR41_OCMRUL_EOPNDCLUL0                     *((volatile unsigned int*)(0x42498540UL))
#define bM4_TMR41_OCMRUL_EOPNDCLUL1                     *((volatile unsigned int*)(0x42498544UL))
#define bM4_TMR41_OCMRUL_EOPNUCLUL0                     *((volatile unsigned int*)(0x42498548UL))
#define bM4_TMR41_OCMRUL_EOPNUCLUL1                     *((volatile unsigned int*)(0x4249854CUL))
#define bM4_TMR41_OCMRUL_EOPDCLUL0                      *((volatile unsigned int*)(0x42498550UL))
#define bM4_TMR41_OCMRUL_EOPDCLUL1                      *((volatile unsigned int*)(0x42498554UL))
#define bM4_TMR41_OCMRUL_EOPPKLUL0                      *((volatile unsigned int*)(0x42498558UL))
#define bM4_TMR41_OCMRUL_EOPPKLUL1                      *((volatile unsigned int*)(0x4249855CUL))
#define bM4_TMR41_OCMRUL_EOPUCLUL0                      *((volatile unsigned int*)(0x42498560UL))
#define bM4_TMR41_OCMRUL_EOPUCLUL1                      *((volatile unsigned int*)(0x42498564UL))
#define bM4_TMR41_OCMRUL_EOPZRLUL0                      *((volatile unsigned int*)(0x42498568UL))
#define bM4_TMR41_OCMRUL_EOPZRLUL1                      *((volatile unsigned int*)(0x4249856CUL))
#define bM4_TMR41_OCMRUL_EOPNPKLUL0                     *((volatile unsigned int*)(0x42498570UL))
#define bM4_TMR41_OCMRUL_EOPNPKLUL1                     *((volatile unsigned int*)(0x42498574UL))
#define bM4_TMR41_OCMRUL_EOPNZRLUL0                     *((volatile unsigned int*)(0x42498578UL))
#define bM4_TMR41_OCMRUL_EOPNZRLUL1                     *((volatile unsigned int*)(0x4249857CUL))
#define bM4_TMR41_OCMRVH_OCFDCHVH                       *((volatile unsigned int*)(0x42498580UL))
#define bM4_TMR41_OCMRVH_OCFPKHVH                       *((volatile unsigned int*)(0x42498584UL))
#define bM4_TMR41_OCMRVH_OCFUCHVH                       *((volatile unsigned int*)(0x42498588UL))
#define bM4_TMR41_OCMRVH_OCFZRHVH                       *((volatile unsigned int*)(0x4249858CUL))
#define bM4_TMR41_OCMRVH_OPDCHVH0                       *((volatile unsigned int*)(0x42498590UL))
#define bM4_TMR41_OCMRVH_OPDCHVH1                       *((volatile unsigned int*)(0x42498594UL))
#define bM4_TMR41_OCMRVH_OPPKHVH0                       *((volatile unsigned int*)(0x42498598UL))
#define bM4_TMR41_OCMRVH_OPPKHVH1                       *((volatile unsigned int*)(0x4249859CUL))
#define bM4_TMR41_OCMRVH_OPUCHVH0                       *((volatile unsigned int*)(0x424985A0UL))
#define bM4_TMR41_OCMRVH_OPUCHVH1                       *((volatile unsigned int*)(0x424985A4UL))
#define bM4_TMR41_OCMRVH_OPZRHVH0                       *((volatile unsigned int*)(0x424985A8UL))
#define bM4_TMR41_OCMRVH_OPZRHVH1                       *((volatile unsigned int*)(0x424985ACUL))
#define bM4_TMR41_OCMRVH_OPNPKHVH0                      *((volatile unsigned int*)(0x424985B0UL))
#define bM4_TMR41_OCMRVH_OPNPKHVH1                      *((volatile unsigned int*)(0x424985B4UL))
#define bM4_TMR41_OCMRVH_OPNZRHVH0                      *((volatile unsigned int*)(0x424985B8UL))
#define bM4_TMR41_OCMRVH_OPNZRHVH1                      *((volatile unsigned int*)(0x424985BCUL))
#define bM4_TMR41_OCMRVL_OCFDCLVL                       *((volatile unsigned int*)(0x42498600UL))
#define bM4_TMR41_OCMRVL_OCFPKLVL                       *((volatile unsigned int*)(0x42498604UL))
#define bM4_TMR41_OCMRVL_OCFUCLVL                       *((volatile unsigned int*)(0x42498608UL))
#define bM4_TMR41_OCMRVL_OCFZRLVL                       *((volatile unsigned int*)(0x4249860CUL))
#define bM4_TMR41_OCMRVL_OPDCLVL0                       *((volatile unsigned int*)(0x42498610UL))
#define bM4_TMR41_OCMRVL_OPDCLVL1                       *((volatile unsigned int*)(0x42498614UL))
#define bM4_TMR41_OCMRVL_OPPKLVL0                       *((volatile unsigned int*)(0x42498618UL))
#define bM4_TMR41_OCMRVL_OPPKLVL1                       *((volatile unsigned int*)(0x4249861CUL))
#define bM4_TMR41_OCMRVL_OPUCLVL0                       *((volatile unsigned int*)(0x42498620UL))
#define bM4_TMR41_OCMRVL_OPUCLVL1                       *((volatile unsigned int*)(0x42498624UL))
#define bM4_TMR41_OCMRVL_OPZRLVL0                       *((volatile unsigned int*)(0x42498628UL))
#define bM4_TMR41_OCMRVL_OPZRLVL1                       *((volatile unsigned int*)(0x4249862CUL))
#define bM4_TMR41_OCMRVL_OPNPKLVL0                      *((volatile unsigned int*)(0x42498630UL))
#define bM4_TMR41_OCMRVL_OPNPKLVL1                      *((volatile unsigned int*)(0x42498634UL))
#define bM4_TMR41_OCMRVL_OPNZRLVL0                      *((volatile unsigned int*)(0x42498638UL))
#define bM4_TMR41_OCMRVL_OPNZRLVL1                      *((volatile unsigned int*)(0x4249863CUL))
#define bM4_TMR41_OCMRVL_EOPNDCLVL0                     *((volatile unsigned int*)(0x42498640UL))
#define bM4_TMR41_OCMRVL_EOPNDCLVL1                     *((volatile unsigned int*)(0x42498644UL))
#define bM4_TMR41_OCMRVL_EOPNUCLVL0                     *((volatile unsigned int*)(0x42498648UL))
#define bM4_TMR41_OCMRVL_EOPNUCLVL1                     *((volatile unsigned int*)(0x4249864CUL))
#define bM4_TMR41_OCMRVL_EOPDCLVL0                      *((volatile unsigned int*)(0x42498650UL))
#define bM4_TMR41_OCMRVL_EOPDCLVL1                      *((volatile unsigned int*)(0x42498654UL))
#define bM4_TMR41_OCMRVL_EOPPKLVL0                      *((volatile unsigned int*)(0x42498658UL))
#define bM4_TMR41_OCMRVL_EOPPKLVL1                      *((volatile unsigned int*)(0x4249865CUL))
#define bM4_TMR41_OCMRVL_EOPUCLVL0                      *((volatile unsigned int*)(0x42498660UL))
#define bM4_TMR41_OCMRVL_EOPUCLVL1                      *((volatile unsigned int*)(0x42498664UL))
#define bM4_TMR41_OCMRVL_EOPZRLVL0                      *((volatile unsigned int*)(0x42498668UL))
#define bM4_TMR41_OCMRVL_EOPZRLVL1                      *((volatile unsigned int*)(0x4249866CUL))
#define bM4_TMR41_OCMRVL_EOPNPKLVL0                     *((volatile unsigned int*)(0x42498670UL))
#define bM4_TMR41_OCMRVL_EOPNPKLVL1                     *((volatile unsigned int*)(0x42498674UL))
#define bM4_TMR41_OCMRVL_EOPNZRLVL0                     *((volatile unsigned int*)(0x42498678UL))
