RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR60_ICONR_INTEND                          *((volatile unsigned int*)(0x42300A8CUL))
#define bM4_TMR60_ICONR_INTENE                          *((volatile unsigned int*)(0x42300A90UL))
#define bM4_TMR60_ICONR_INTENF                          *((volatile unsigned int*)(0x42300A94UL))
#define bM4_TMR60_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42300A98UL))
#define bM4_TMR60_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42300A9CUL))
#define bM4_TMR60_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42300AA0UL))
#define bM4_TMR60_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42300AC0UL))
#define bM4_TMR60_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42300AC4UL))
#define bM4_TMR60_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42300AC8UL))
#define bM4_TMR60_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42300ACCUL))
#define bM4_TMR60_ICONR_RESV                            *((volatile unsigned int*)(0x42300AE0UL))
#define bM4_TMR60_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42300B00UL))
#define bM4_TMR60_PCONR_STACA                           *((volatile unsigned int*)(0x42300B04UL))
#define bM4_TMR60_PCONR_STPCA                           *((volatile unsigned int*)(0x42300B08UL))
#define bM4_TMR60_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42300B0CUL))
#define bM4_TMR60_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42300B10UL))
#define bM4_TMR60_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42300B14UL))
#define bM4_TMR60_PCONR_PERCA0                          *((volatile unsigned int*)(0x42300B18UL))
#define bM4_TMR60_PCONR_PERCA1                          *((volatile unsigned int*)(0x42300B1CUL))
#define bM4_TMR60_PCONR_OUTENA                          *((volatile unsigned int*)(0x42300B20UL))
#define bM4_TMR60_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42300B24UL))
#define bM4_TMR60_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42300B28UL))
#define bM4_TMR60_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42300B2CUL))
#define bM4_TMR60_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42300B30UL))
#define bM4_TMR60_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42300B40UL))
#define bM4_TMR60_PCONR_STACB                           *((volatile unsigned int*)(0x42300B44UL))
#define bM4_TMR60_PCONR_STPCB                           *((volatile unsigned int*)(0x42300B48UL))
#define bM4_TMR60_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42300B4CUL))
#define bM4_TMR60_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42300B50UL))
#define bM4_TMR60_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42300B54UL))
#define bM4_TMR60_PCONR_PERCB0                          *((volatile unsigned int*)(0x42300B58UL))
#define bM4_TMR60_PCONR_PERCB1                          *((volatile unsigned int*)(0x42300B5CUL))
#define bM4_TMR60_PCONR_OUTENB                          *((volatile unsigned int*)(0x42300B60UL))
#define bM4_TMR60_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42300B64UL))
#define bM4_TMR60_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42300B68UL))
#define bM4_TMR60_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42300B6CUL))
#define bM4_TMR60_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42300B70UL))
#define bM4_TMR60_BCONR_BENA                            *((volatile unsigned int*)(0x42300B80UL))
#define bM4_TMR60_BCONR_BSEA                            *((volatile unsigned int*)(0x42300B84UL))
#define bM4_TMR60_BCONR_BENB                            *((volatile unsigned int*)(0x42300B88UL))
#define bM4_TMR60_BCONR_BSEB                            *((volatile unsigned int*)(0x42300B8CUL))
#define bM4_TMR60_BCONR_BENP                            *((volatile unsigned int*)(0x42300BA0UL))
#define bM4_TMR60_BCONR_BSEP                            *((volatile unsigned int*)(0x42300BA4UL))
#define bM4_TMR60_BCONR_BENSPA                          *((volatile unsigned int*)(0x42300BC0UL))
#define bM4_TMR60_BCONR_BSESPA                          *((volatile unsigned int*)(0x42300BC4UL))
#define bM4_TMR60_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42300BD0UL))
#define bM4_TMR60_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42300BD4UL))
#define bM4_TMR60_BCONR_BENSPB                          *((volatile unsigned int*)(0x42300BE0UL))
#define bM4_TMR60_BCONR_BSESPB                          *((volatile unsigned int*)(0x42300BE4UL))
#define bM4_TMR60_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42300BF0UL))
#define bM4_TMR60_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42300BF4UL))
#define bM4_TMR60_DCONR_DTCEN                           *((volatile unsigned int*)(0x42300C00UL))
#define bM4_TMR60_DCONR_DTBENU                          *((volatile unsigned int*)(0x42300C10UL))
#define bM4_TMR60_DCONR_DTBEND                          *((volatile unsigned int*)(0x42300C14UL))
#define bM4_TMR60_DCONR_SEPA                            *((volatile unsigned int*)(0x42300C20UL))
#define bM4_TMR60_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42300D00UL))
#define bM4_TMR60_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42300D04UL))
#define bM4_TMR60_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42300D08UL))
#define bM4_TMR60_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42300D10UL))
#define bM4_TMR60_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42300D14UL))
#define bM4_TMR60_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42300D18UL))
#define bM4_TMR60_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42300D40UL))
#define bM4_TMR60_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42300D44UL))
#define bM4_TMR60_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42300D48UL))
#define bM4_TMR60_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42300D50UL))
#define bM4_TMR60_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42300D54UL))
#define bM4_TMR60_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42300D58UL))
#define bM4_TMR60_FCONR_NOFIENTC                        *((volatile unsigned int*)(0x42300D60UL))
#define bM4_TMR60_FCONR_NOFICKTC0                       *((volatile unsigned int*)(0x42300D64UL))
#define bM4_TMR60_FCONR_NOFICKTC1                       *((volatile unsigned int*)(0x42300D68UL))
#define bM4_TMR60_FCONR_NOFIENTD                        *((volatile unsigned int*)(0x42300D70UL))
#define bM4_TMR60_FCONR_NOFICKTD0                       *((volatile unsigned int*)(0x42300D74UL))
#define bM4_TMR60_FCONR_NOFICKTD1                       *((volatile unsigned int*)(0x42300D78UL))
#define bM4_TMR60_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42300DA0UL))
#define bM4_TMR60_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42300DA4UL))
#define bM4_TMR60_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42300DC0UL))
#define bM4_TMR60_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42300DC4UL))
#define bM4_TMR60_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42300DC8UL))
#define bM4_TMR60_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42300DCCUL))
#define bM4_TMR60_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42300DD0UL))
#define bM4_TMR60_VPERR_RESV                            *((volatile unsigned int*)(0x42300DE0UL))
#define bM4_TMR60_STFLR_CMAF                            *((volatile unsigned int*)(0x42300E00UL))
#define bM4_TMR60_STFLR_CMBF                            *((volatile unsigned int*)(0x42300E04UL))
#define bM4_TMR60_STFLR_CMCF                            *((volatile unsigned int*)(0x42300E08UL))
#define bM4_TMR60_STFLR_CMDF                            *((volatile unsigned int*)(0x42300E0CUL))
#define bM4_TMR60_STFLR_CMEF                            *((volatile unsigned int*)(0x42300E10UL))
#define bM4_TMR60_STFLR_CMFF                            *((volatile unsigned int*)(0x42300E14UL))
#define bM4_TMR60_STFLR_OVFF                            *((volatile unsigned int*)(0x42300E18UL))
#define bM4_TMR60_STFLR_UDFF                            *((volatile unsigned int*)(0x42300E1CUL))
#define bM4_TMR60_STFLR_DTEF                            *((volatile unsigned int*)(0x42300E20UL))
#define bM4_TMR60_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42300E24UL))
#define bM4_TMR60_STFLR_CMSADF                          *((volatile unsigned int*)(0x42300E28UL))
#define bM4_TMR60_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42300E2CUL))
#define bM4_TMR60_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42300E30UL))
#define bM4_TMR60_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42300E54UL))
#define bM4_TMR60_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42300E58UL))
#define bM4_TMR60_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42300E5CUL))
#define bM4_TMR60_STFLR_DIRF                            *((volatile unsigned int*)(0x42300E7CUL))
#define bM4_TMR60_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42300E80UL))
#define bM4_TMR60_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42300E84UL))
#define bM4_TMR60_HSTAR_HSTA2                           *((volatile unsigned int*)(0x42300E88UL))
#define bM4_TMR60_HSTAR_HSTA3                           *((volatile unsigned int*)(0x42300E8CUL))
#define bM4_TMR60_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42300E90UL))
#define bM4_TMR60_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42300E94UL))
#define bM4_TMR60_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42300E98UL))
#define bM4_TMR60_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42300E9CUL))
#define bM4_TMR60_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42300EA0UL))
#define bM4_TMR60_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42300EA4UL))
#define bM4_TMR60_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42300EA8UL))
#define bM4_TMR60_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42300EACUL))
#define bM4_TMR60_HSTAR_HSTA12                          *((volatile unsigned int*)(0x42300EB0UL))
#define bM4_TMR60_HSTAR_HSTA13                          *((volatile unsigned int*)(0x42300EB4UL))
#define bM4_TMR60_HSTAR_HSTA14                          *((volatile unsigned int*)(0x42300EB8UL))
#define bM4_TMR60_HSTAR_HSTA15                          *((volatile unsigned int*)(0x42300EBCUL))
#define bM4_TMR60_HSTAR_STARTS                          *((volatile unsigned int*)(0x42300EFCUL))
#define bM4_TMR60_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42300F00UL))
#define bM4_TMR60_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42300F04UL))
#define bM4_TMR60_HSTPR_HSTP2                           *((volatile unsigned int*)(0x42300F08UL))
#define bM4_TMR60_HSTPR_HSTP3                           *((volatile unsigned int*)(0x42300F0CUL))
#define bM4_TMR60_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42300F10UL))
#define bM4_TMR60_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42300F14UL))
#define bM4_TMR60_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42300F18UL))
#define bM4_TMR60_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42300F1CUL))
#define bM4_TMR60_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42300F20UL))
#define bM4_TMR60_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42300F24UL))
#define bM4_TMR60_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42300F28UL))
#define bM4_TMR60_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42300F2CUL))
#define bM4_TMR60_HSTPR_HSTP12                          *((volatile unsigned int*)(0x42300F30UL))
#define bM4_TMR60_HSTPR_HSTP13                          *((volatile unsigned int*)(0x42300F34UL))
#define bM4_TMR60_HSTPR_HSTP14                          *((volatile unsigned int*)(0x42300F38UL))
#define bM4_TMR60_HSTPR_HSTP15                          *((volatile unsigned int*)(0x42300F3CUL))
#define bM4_TMR60_HSTPR_STOPS                           *((volatile unsigned int*)(0x42300F7CUL))
#define bM4_TMR60_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42300F80UL))
#define bM4_TMR60_HCLRR_HCLE1                           *((volatile unsigned int*)(0x42300F84UL))
#define bM4_TMR60_HCLRR_HCLE2                           *((volatile unsigned int*)(0x42300F88UL))
#define bM4_TMR60_HCLRR_HCLE3                           *((volatile unsigned int*)(0x42300F8CUL))
#define bM4_TMR60_HCLRR_HCLE4                           *((volatile unsigned int*)(0x42300F90UL))
#define bM4_TMR60_HCLRR_HCLE5                           *((volatile unsigned int*)(0x42300F94UL))
#define bM4_TMR60_HCLRR_HCLE6                           *((volatile unsigned int*)(0x42300F98UL))
#define bM4_TMR60_HCLRR_HCLE7                           *((volatile unsigned int*)(0x42300F9CUL))
#define bM4_TMR60_HCLRR_HCLE8                           *((volatile unsigned int*)(0x42300FA0UL))
#define bM4_TMR60_HCLRR_HCLE9                           *((volatile unsigned int*)(0x42300FA4UL))
#define bM4_TMR60_HCLRR_HCLE10                          *((volatile unsigned int*)(0x42300FA8UL))
#define bM4_TMR60_HCLRR_HCLE11                          *((volatile unsigned int*)(0x42300FACUL))
#define bM4_TMR60_HCLRR_HCLE12                          *((volatile unsigned int*)(0x42300FB0UL))
#define bM4_TMR60_HCLRR_HCLE13                          *((volatile unsigned int*)(0x42300FB4UL))
#define bM4_TMR60_HCLRR_HCLE14                          *((volatile unsigned int*)(0x42300FB8UL))
#define bM4_TMR60_HCLRR_HCLE15                          *((volatile unsigned int*)(0x42300FBCUL))
#define bM4_TMR60_HCLRR_CLEARS                          *((volatile unsigned int*)(0x42300FFCUL))
#define bM4_TMR60_HCPAR_HCPA0                           *((volatile unsigned int*)(0x42301000UL))
#define bM4_TMR60_HCPAR_HCPA1                           *((volatile unsigned int*)(0x42301004UL))
#define bM4_TMR60_HCPAR_HCPA2                           *((volatile unsigned int*)(0x42301008UL))
#define bM4_TMR60_HCPAR_HCPA3                           *((volatile unsigned int*)(0x4230100CUL))
#define bM4_TMR60_HCPAR_HCPA4                           *((volatile unsigned int*)(0x42301010UL))
#define bM4_TMR60_HCPAR_HCPA5                           *((volatile unsigned int*)(0x42301014UL))
#define bM4_TMR60_HCPAR_HCPA6                           *((volatile unsigned int*)(0x42301018UL))
#define bM4_TMR60_HCPAR_HCPA7                           *((volatile unsigned int*)(0x4230101CUL))
#define bM4_TMR60_HCPAR_HCPA8                           *((volatile unsigned int*)(0x42301020UL))
#define bM4_TMR60_HCPAR_HCPA9                           *((volatile unsigned int*)(0x42301024UL))
#define bM4_TMR60_HCPAR_HCPA10                          *((volatile unsigned int*)(0x42301028UL))
#define bM4_TMR60_HCPAR_HCPA11                          *((volatile unsigned int*)(0x4230102CUL))
#define bM4_TMR60_HCPAR_HCPA12                          *((volatile unsigned int*)(0x42301030UL))
#define bM4_TMR60_HCPAR_HCPA13                          *((volatile unsigned int*)(0x42301034UL))
#define bM4_TMR60_HCPAR_HCPA14                          *((volatile unsigned int*)(0x42301038UL))
#define bM4_TMR60_HCPAR_HCPA15                          *((volatile unsigned int*)(0x4230103CUL))
#define bM4_TMR60_HCPBR_HCPB0                           *((volatile unsigned int*)(0x42301080UL))
#define bM4_TMR60_HCPBR_HCPB1                           *((volatile unsigned int*)(0x42301084UL))
#define bM4_TMR60_HCPBR_HCPB2                           *((volatile unsigned int*)(0x42301088UL))
#define bM4_TMR60_HCPBR_HCPB3                           *((volatile unsigned int*)(0x4230108CUL))
#define bM4_TMR60_HCPBR_HCPB4                           *((volatile unsigned int*)(0x42301090UL))
#define bM4_TMR60_HCPBR_HCPB5                           *((volatile unsigned int*)(0x42301094UL))
#define bM4_TMR60_HCPBR_HCPB6                           *((volatile unsigned int*)(0x42301098UL))
#define bM4_TMR60_HCPBR_HCPB7                           *((volatile unsigned int*)(0x4230109CUL))
#define bM4_TMR60_HCPBR_HCPB8                           *((volatile unsigned int*)(0x423010A0UL))
#define bM4_TMR60_HCPBR_HCPB9                           *((volatile unsigned int*)(0x423010A4UL))
#define bM4_TMR60_HCPBR_HCPB10                          *((volatile unsigned int*)(0x423010A8UL))
#define bM4_TMR60_HCPBR_HCPB11                          *((volatile unsigned int*)(0x423010ACUL))
#define bM4_TMR60_HCPBR_HCPB12                          *((volatile unsigned int*)(0x423010B0UL))
#define bM4_TMR60_HCPBR_HCPB13                          *((volatile unsigned int*)(0x423010B4UL))
#define bM4_TMR60_HCPBR_HCPB14                          *((volatile unsigned int*)(0x423010B8UL))
#define bM4_TMR60_HCPBR_HCPB15                          *((volatile unsigned int*)(0x423010BCUL))
#define bM4_TMR60_HCUPR_HCUP0                           *((volatile unsigned int*)(0x42301100UL))
#define bM4_TMR60_HCUPR_HCUP1                           *((volatile unsigned int*)(0x42301104UL))
#define bM4_TMR60_HCUPR_HCUP2                           *((volatile unsigned int*)(0x42301108UL))
#define bM4_TMR60_HCUPR_HCUP3                           *((volatile unsigned int*)(0x4230110CUL))
#define bM4_TMR60_HCUPR_HCUP4                           *((volatile unsigned int*)(0x42301110UL))
#define bM4_TMR60_HCUPR_HCUP5                           *((volatile unsigned int*)(0x42301114UL))
#define bM4_TMR60_HCUPR_HCUP6                           *((volatile unsigned int*)(0x42301118UL))
#define bM4_TMR60_HCUPR_HCUP7                           *((volatile unsigned int*)(0x4230111CUL))
#define bM4_TMR60_HCUPR_HCUP8                           *((volatile unsigned int*)(0x42301120UL))
#define bM4_TMR60_HCUPR_HCUP9                           *((volatile unsigned int*)(0x42301124UL))
#define bM4_TMR60_HCUPR_HCUP10                          *((volatile unsigned int*)(0x42301128UL))
#define bM4_TMR60_HCUPR_HCUP11                          *((volatile unsigned int*)(0x4230112CUL))
#define bM4_TMR60_HCUPR_HCUP12                          *((volatile unsigned int*)(0x42301130UL))
#define bM4_TMR60_HCUPR_HCUP13                          *((volatile unsigned int*)(0x42301134UL))
#define bM4_TMR60_HCUPR_HCUP14                          *((volatile unsigned int*)(0x42301138UL))
#define bM4_TMR60_HCUPR_HCUP15                          *((volatile unsigned int*)(0x4230113CUL))
#define bM4_TMR60_HCUPR_HCUP16                          *((volatile unsigned int*)(0x42301140UL))
#define bM4_TMR60_HCUPR_HCUP17                          *((volatile unsigned int*)(0x42301144UL))
#define bM4_TMR60_HCUPR_HCUP18                          *((volatile unsigned int*)(0x42301148UL))
#define bM4_TMR60_HCUPR_HCUP19                          *((volatile unsigned int*)(0x4230114CUL))
#define bM4_TMR60_HCUPR_RESV                            *((volatile unsigned int*)(0x42301160UL))
#define bM4_TMR60_HCDOR_HCDO0                           *((volatile unsigned int*)(0x42301180UL))
#define bM4_TMR60_HCDOR_HCDO1                           *((volatile unsigned int*)(0x42301184UL))
#define bM4_TMR60_HCDOR_HCDO2                           *((volatile unsigned int*)(0x42301188UL))
#define bM4_TMR60_HCDOR_HCDO3                           *((volatile unsigned int*)(0x4230118CUL))
#define bM4_TMR60_HCDOR_HCDO4                           *((volatile unsigned int*)(0x42301190UL))
#define bM4_TMR60_HCDOR_HCDO5                           *((volatile unsigned int*)(0x42301194UL))
#define bM4_TMR60_HCDOR_HCDO6                           *((volatile unsigned int*)(0x42301198UL))
#define bM4_TMR60_HCDOR_HCDO7                           *((volatile unsigned int*)(0x4230119CUL))
#define bM4_TMR60_HCDOR_HCDO8                           *((volatile unsigned int*)(0x423011A0UL))
#define bM4_TMR60_HCDOR_HCDO9                           *((volatile unsigned int*)(0x423011A4UL))
#define bM4_TMR60_HCDOR_HCDO10                          *((volatile unsigned int*)(0x423011A8UL))
#define bM4_TMR60_HCDOR_HCDO11                          *((volatile unsigned int*)(0x423011ACUL))
#define bM4_TMR60_HCDOR_HCDO12                          *((volatile unsigned int*)(0x423011B0UL))
#define bM4_TMR60_HCDOR_HCDO13                          *((volatile unsigned int*)(0x423011B4UL))
#define bM4_TMR60_HCDOR_HCDO14                          *((volatile unsigned int*)(0x423011B8UL))
#define bM4_TMR60_HCDOR_HCDO15                          *((volatile unsigned int*)(0x423011BCUL))
#define bM4_TMR60_HCDOR_HCDO16                          *((volatile unsigned int*)(0x423011C0UL))
#define bM4_TMR60_HCDOR_HCDO17                          *((volatile unsigned int*)(0x423011C4UL))
#define bM4_TMR60_HCDOR_HCDO18                          *((volatile unsigned int*)(0x423011C8UL))
#define bM4_TMR60_HCDOR_HCDO19                          *((volatile unsigned int*)(0x423011CCUL))
#define bM4_TMR60_HCDOR_RESV                            *((volatile unsigned int*)(0x423011E0UL))
#define bM4_TMR60_SSTAR_SSTA0                           *((volatile unsigned int*)(0x42307E80UL))
#define bM4_TMR60_SSTAR_SSTA1                           *((volatile unsigned int*)(0x42307E84UL))
#define bM4_TMR60_SSTAR_SSTA2                           *((volatile unsigned int*)(0x42307E88UL))
#define bM4_TMR60_SSTAR_SSTA3                           *((volatile unsigned int*)(0x42307E8CUL))
#define bM4_TMR60_SSTAR_SSTA4                           *((volatile unsigned int*)(0x42307E90UL))
#define bM4_TMR60_SSTAR_SSTA5                           *((volatile unsigned int*)(0x42307E94UL))
#define bM4_TMR60_SSTAR_SSTA6                           *((volatile unsigned int*)(0x42307E98UL))
#define bM4_TMR60_SSTAR_SSTA7                           *((volatile unsigned int*)(0x42307E9CUL))
#define bM4_TMR60_SSTAR_SSTA8                           *((volatile unsigned int*)(0x42307EA0UL))
#define bM4_TMR60_SSTAR_SSTA9                           *((volatile unsigned int*)(0x42307EA4UL))
#define bM4_TMR60_SSTAR_RESV                            *((volatile unsigned int*)(0x42307EE0UL))
#define bM4_TMR60_SSTPR_SSTP0                           *((volatile unsigned int*)(0x42307F00UL))
#define bM4_TMR60_SSTPR_SSTP1                           *((volatile unsigned int*)(0x42307F04UL))
#define bM4_TMR60_SSTPR_SSTP2                           *((volatile unsigned int*)(0x42307F08UL))
#define bM4_TMR60_SSTPR_SSTP3                           *((volatile unsigned int*)(0x42307F0CUL))
#define bM4_TMR60_SSTPR_SSTP4                           *((volatile unsigned int*)(0x42307F10UL))
#define bM4_TMR60_SSTPR_SSTP5                           *((volatile unsigned int*)(0x42307F14UL))
#define bM4_TMR60_SSTPR_SSTP6                           *((volatile unsigned int*)(0x42307F18UL))
#define bM4_TMR60_SSTPR_SSTP7                           *((volatile unsigned int*)(0x42307F1CUL))
#define bM4_TMR60_SSTPR_SSTP8                           *((volatile unsigned int*)(0x42307F20UL))
#define bM4_TMR60_SSTPR_SSTP9                           *((volatile unsigned int*)(0x42307F24UL))
