RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR60_SSTPR_RESV                            *((volatile unsigned int*)(0x42307F60UL))
#define bM4_TMR60_SCLRR_SCLE0                           *((volatile unsigned int*)(0x42307F80UL))
#define bM4_TMR60_SCLRR_SCLE1                           *((volatile unsigned int*)(0x42307F84UL))
#define bM4_TMR60_SCLRR_SCLE2                           *((volatile unsigned int*)(0x42307F88UL))
#define bM4_TMR60_SCLRR_SCLE3                           *((volatile unsigned int*)(0x42307F8CUL))
#define bM4_TMR60_SCLRR_SCLE4                           *((volatile unsigned int*)(0x42307F90UL))
#define bM4_TMR60_SCLRR_SCLE5                           *((volatile unsigned int*)(0x42307F94UL))
#define bM4_TMR60_SCLRR_SCLE6                           *((volatile unsigned int*)(0x42307F98UL))
#define bM4_TMR60_SCLRR_SCLE7                           *((volatile unsigned int*)(0x42307F9CUL))
#define bM4_TMR60_SCLRR_SCLE8                           *((volatile unsigned int*)(0x42307FA0UL))
#define bM4_TMR60_SCLRR_SCLE9                           *((volatile unsigned int*)(0x42307FA4UL))
#define bM4_TMR60_SCLRR_RESV                            *((volatile unsigned int*)(0x42307FE0UL))
#define bM4_TMR61_GCONR_START                           *((volatile unsigned int*)(0x42308A00UL))
#define bM4_TMR61_GCONR_MODE0                           *((volatile unsigned int*)(0x42308A04UL))
#define bM4_TMR61_GCONR_MODE1                           *((volatile unsigned int*)(0x42308A08UL))
#define bM4_TMR61_GCONR_MODE2                           *((volatile unsigned int*)(0x42308A0CUL))
#define bM4_TMR61_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42308A10UL))
#define bM4_TMR61_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42308A14UL))
#define bM4_TMR61_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42308A18UL))
#define bM4_TMR61_GCONR_DIR                             *((volatile unsigned int*)(0x42308A20UL))
#define bM4_TMR61_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42308A40UL))
#define bM4_TMR61_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42308A44UL))
#define bM4_TMR61_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42308A48UL))
#define bM4_TMR61_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42308A4CUL))
#define bM4_TMR61_GCONR_RESV                            *((volatile unsigned int*)(0x42308A60UL))
#define bM4_TMR61_ICONR_INTENA                          *((volatile unsigned int*)(0x42308A80UL))
#define bM4_TMR61_ICONR_INTENB                          *((volatile unsigned int*)(0x42308A84UL))
#define bM4_TMR61_ICONR_INTENC                          *((volatile unsigned int*)(0x42308A88UL))
#define bM4_TMR61_ICONR_INTEND                          *((volatile unsigned int*)(0x42308A8CUL))
#define bM4_TMR61_ICONR_INTENE                          *((volatile unsigned int*)(0x42308A90UL))
#define bM4_TMR61_ICONR_INTENF                          *((volatile unsigned int*)(0x42308A94UL))
#define bM4_TMR61_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42308A98UL))
#define bM4_TMR61_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42308A9CUL))
#define bM4_TMR61_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42308AA0UL))
#define bM4_TMR61_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42308AC0UL))
#define bM4_TMR61_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42308AC4UL))
#define bM4_TMR61_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42308AC8UL))
#define bM4_TMR61_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42308ACCUL))
#define bM4_TMR61_ICONR_RESV                            *((volatile unsigned int*)(0x42308AE0UL))
#define bM4_TMR61_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42308B00UL))
#define bM4_TMR61_PCONR_STACA                           *((volatile unsigned int*)(0x42308B04UL))
#define bM4_TMR61_PCONR_STPCA                           *((volatile unsigned int*)(0x42308B08UL))
#define bM4_TMR61_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42308B0CUL))
#define bM4_TMR61_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42308B10UL))
#define bM4_TMR61_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42308B14UL))
#define bM4_TMR61_PCONR_PERCA0                          *((volatile unsigned int*)(0x42308B18UL))
#define bM4_TMR61_PCONR_PERCA1                          *((volatile unsigned int*)(0x42308B1CUL))
#define bM4_TMR61_PCONR_OUTENA                          *((volatile unsigned int*)(0x42308B20UL))
#define bM4_TMR61_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42308B24UL))
#define bM4_TMR61_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42308B28UL))
#define bM4_TMR61_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42308B2CUL))
#define bM4_TMR61_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42308B30UL))
#define bM4_TMR61_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42308B40UL))
#define bM4_TMR61_PCONR_STACB                           *((volatile unsigned int*)(0x42308B44UL))
#define bM4_TMR61_PCONR_STPCB                           *((volatile unsigned int*)(0x42308B48UL))
#define bM4_TMR61_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42308B4CUL))
#define bM4_TMR61_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42308B50UL))
#define bM4_TMR61_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42308B54UL))
#define bM4_TMR61_PCONR_PERCB0                          *((volatile unsigned int*)(0x42308B58UL))
#define bM4_TMR61_PCONR_PERCB1                          *((volatile unsigned int*)(0x42308B5CUL))
#define bM4_TMR61_PCONR_OUTENB                          *((volatile unsigned int*)(0x42308B60UL))
#define bM4_TMR61_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42308B64UL))
#define bM4_TMR61_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42308B68UL))
#define bM4_TMR61_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42308B6CUL))
#define bM4_TMR61_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42308B70UL))
#define bM4_TMR61_BCONR_BENA                            *((volatile unsigned int*)(0x42308B80UL))
#define bM4_TMR61_BCONR_BSEA                            *((volatile unsigned int*)(0x42308B84UL))
#define bM4_TMR61_BCONR_BENB                            *((volatile unsigned int*)(0x42308B88UL))
#define bM4_TMR61_BCONR_BSEB                            *((volatile unsigned int*)(0x42308B8CUL))
#define bM4_TMR61_BCONR_BENP                            *((volatile unsigned int*)(0x42308BA0UL))
#define bM4_TMR61_BCONR_BSEP                            *((volatile unsigned int*)(0x42308BA4UL))
#define bM4_TMR61_BCONR_BENSPA                          *((volatile unsigned int*)(0x42308BC0UL))
#define bM4_TMR61_BCONR_BSESPA                          *((volatile unsigned int*)(0x42308BC4UL))
#define bM4_TMR61_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42308BD0UL))
#define bM4_TMR61_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42308BD4UL))
#define bM4_TMR61_BCONR_BENSPB                          *((volatile unsigned int*)(0x42308BE0UL))
#define bM4_TMR61_BCONR_BSESPB                          *((volatile unsigned int*)(0x42308BE4UL))
#define bM4_TMR61_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42308BF0UL))
#define bM4_TMR61_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42308BF4UL))
#define bM4_TMR61_DCONR_DTCEN                           *((volatile unsigned int*)(0x42308C00UL))
#define bM4_TMR61_DCONR_DTBENU                          *((volatile unsigned int*)(0x42308C10UL))
#define bM4_TMR61_DCONR_DTBEND                          *((volatile unsigned int*)(0x42308C14UL))
#define bM4_TMR61_DCONR_SEPA                            *((volatile unsigned int*)(0x42308C20UL))
#define bM4_TMR61_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42308D00UL))
#define bM4_TMR61_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42308D04UL))
#define bM4_TMR61_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42308D08UL))
#define bM4_TMR61_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42308D10UL))
#define bM4_TMR61_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42308D14UL))
#define bM4_TMR61_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42308D18UL))
#define bM4_TMR61_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42308D40UL))
#define bM4_TMR61_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42308D44UL))
#define bM4_TMR61_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42308D48UL))
#define bM4_TMR61_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42308D50UL))
#define bM4_TMR61_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42308D54UL))
#define bM4_TMR61_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42308D58UL))
#define bM4_TMR61_FCONR_NOFIENTC                        *((volatile unsigned int*)(0x42308D60UL))
#define bM4_TMR61_FCONR_NOFICKTC0                       *((volatile unsigned int*)(0x42308D64UL))
#define bM4_TMR61_FCONR_NOFICKTC1                       *((volatile unsigned int*)(0x42308D68UL))
#define bM4_TMR61_FCONR_NOFIENTD                        *((volatile unsigned int*)(0x42308D70UL))
#define bM4_TMR61_FCONR_NOFICKTD0                       *((volatile unsigned int*)(0x42308D74UL))
#define bM4_TMR61_FCONR_NOFICKTD1                       *((volatile unsigned int*)(0x42308D78UL))
#define bM4_TMR61_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42308DA0UL))
#define bM4_TMR61_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42308DA4UL))
#define bM4_TMR61_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42308DC0UL))
#define bM4_TMR61_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42308DC4UL))
#define bM4_TMR61_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42308DC8UL))
#define bM4_TMR61_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42308DCCUL))
#define bM4_TMR61_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42308DD0UL))
#define bM4_TMR61_VPERR_RESV                            *((volatile unsigned int*)(0x42308DE0UL))
#define bM4_TMR61_STFLR_CMAF                            *((volatile unsigned int*)(0x42308E00UL))
#define bM4_TMR61_STFLR_CMBF                            *((volatile unsigned int*)(0x42308E04UL))
#define bM4_TMR61_STFLR_CMCF                            *((volatile unsigned int*)(0x42308E08UL))
#define bM4_TMR61_STFLR_CMDF                            *((volatile unsigned int*)(0x42308E0CUL))
#define bM4_TMR61_STFLR_CMEF                            *((volatile unsigned int*)(0x42308E10UL))
#define bM4_TMR61_STFLR_CMFF                            *((volatile unsigned int*)(0x42308E14UL))
#define bM4_TMR61_STFLR_OVFF                            *((volatile unsigned int*)(0x42308E18UL))
#define bM4_TMR61_STFLR_UDFF                            *((volatile unsigned int*)(0x42308E1CUL))
#define bM4_TMR61_STFLR_DTEF                            *((volatile unsigned int*)(0x42308E20UL))
#define bM4_TMR61_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42308E24UL))
#define bM4_TMR61_STFLR_CMSADF                          *((volatile unsigned int*)(0x42308E28UL))
#define bM4_TMR61_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42308E2CUL))
#define bM4_TMR61_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42308E30UL))
#define bM4_TMR61_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42308E54UL))
#define bM4_TMR61_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42308E58UL))
#define bM4_TMR61_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42308E5CUL))
#define bM4_TMR61_STFLR_DIRF                            *((volatile unsigned int*)(0x42308E7CUL))
#define bM4_TMR61_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42308E80UL))
#define bM4_TMR61_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42308E84UL))
#define bM4_TMR61_HSTAR_HSTA2                           *((volatile unsigned int*)(0x42308E88UL))
#define bM4_TMR61_HSTAR_HSTA3                           *((volatile unsigned int*)(0x42308E8CUL))
#define bM4_TMR61_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42308E90UL))
#define bM4_TMR61_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42308E94UL))
#define bM4_TMR61_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42308E98UL))
#define bM4_TMR61_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42308E9CUL))
#define bM4_TMR61_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42308EA0UL))
#define bM4_TMR61_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42308EA4UL))
#define bM4_TMR61_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42308EA8UL))
#define bM4_TMR61_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42308EACUL))
#define bM4_TMR61_HSTAR_HSTA12                          *((volatile unsigned int*)(0x42308EB0UL))
#define bM4_TMR61_HSTAR_HSTA13                          *((volatile unsigned int*)(0x42308EB4UL))
#define bM4_TMR61_HSTAR_HSTA14                          *((volatile unsigned int*)(0x42308EB8UL))
#define bM4_TMR61_HSTAR_HSTA15                          *((volatile unsigned int*)(0x42308EBCUL))
#define bM4_TMR61_HSTAR_STARTS                          *((volatile unsigned int*)(0x42308EFCUL))
#define bM4_TMR61_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42308F00UL))
#define bM4_TMR61_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42308F04UL))
#define bM4_TMR61_HSTPR_HSTP2                           *((volatile unsigned int*)(0x42308F08UL))
#define bM4_TMR61_HSTPR_HSTP3                           *((volatile unsigned int*)(0x42308F0CUL))
#define bM4_TMR61_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42308F10UL))
#define bM4_TMR61_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42308F14UL))
#define bM4_TMR61_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42308F18UL))
#define bM4_TMR61_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42308F1CUL))
#define bM4_TMR61_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42308F20UL))
#define bM4_TMR61_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42308F24UL))
#define bM4_TMR61_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42308F28UL))
#define bM4_TMR61_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42308F2CUL))
#define bM4_TMR61_HSTPR_HSTP12                          *((volatile unsigned int*)(0x42308F30UL))
#define bM4_TMR61_HSTPR_HSTP13                          *((volatile unsigned int*)(0x42308F34UL))
#define bM4_TMR61_HSTPR_HSTP14                          *((volatile unsigned int*)(0x42308F38UL))
#define bM4_TMR61_HSTPR_HSTP15                          *((volatile unsigned int*)(0x42308F3CUL))
#define bM4_TMR61_HSTPR_STOPS                           *((volatile unsigned int*)(0x42308F7CUL))
#define bM4_TMR61_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42308F80UL))
#define bM4_TMR61_HCLRR_HCLE1                           *((volatile unsigned int*)(0x42308F84UL))
#define bM4_TMR61_HCLRR_HCLE2                           *((volatile unsigned int*)(0x42308F88UL))
#define bM4_TMR61_HCLRR_HCLE3                           *((volatile unsigned int*)(0x42308F8CUL))
#define bM4_TMR61_HCLRR_HCLE4                           *((volatile unsigned int*)(0x42308F90UL))
#define bM4_TMR61_HCLRR_HCLE5                           *((volatile unsigned int*)(0x42308F94UL))
#define bM4_TMR61_HCLRR_HCLE6                           *((volatile unsigned int*)(0x42308F98UL))
#define bM4_TMR61_HCLRR_HCLE7                           *((volatile unsigned int*)(0x42308F9CUL))
#define bM4_TMR61_HCLRR_HCLE8                           *((volatile unsigned int*)(0x42308FA0UL))
#define bM4_TMR61_HCLRR_HCLE9                           *((volatile unsigned int*)(0x42308FA4UL))
#define bM4_TMR61_HCLRR_HCLE10                          *((volatile unsigned int*)(0x42308FA8UL))
#define bM4_TMR61_HCLRR_HCLE11                          *((volatile unsigned int*)(0x42308FACUL))
#define bM4_TMR61_HCLRR_HCLE12                          *((volatile unsigned int*)(0x42308FB0UL))
#define bM4_TMR61_HCLRR_HCLE13                          *((volatile unsigned int*)(0x42308FB4UL))
#define bM4_TMR61_HCLRR_HCLE14                          *((volatile unsigned int*)(0x42308FB8UL))
#define bM4_TMR61_HCLRR_HCLE15                          *((volatile unsigned int*)(0x42308FBCUL))
#define bM4_TMR61_HCLRR_CLEARS                          *((volatile unsigned int*)(0x42308FFCUL))
#define bM4_TMR61_HCPAR_HCPA0                           *((volatile unsigned int*)(0x42309000UL))
#define bM4_TMR61_HCPAR_HCPA1                           *((volatile unsigned int*)(0x42309004UL))
#define bM4_TMR61_HCPAR_HCPA2                           *((volatile unsigned int*)(0x42309008UL))
#define bM4_TMR61_HCPAR_HCPA3                           *((volatile unsigned int*)(0x4230900CUL))
#define bM4_TMR61_HCPAR_HCPA4                           *((volatile unsigned int*)(0x42309010UL))
#define bM4_TMR61_HCPAR_HCPA5                           *((volatile unsigned int*)(0x42309014UL))
#define bM4_TMR61_HCPAR_HCPA6                           *((volatile unsigned int*)(0x42309018UL))
#define bM4_TMR61_HCPAR_HCPA7                           *((volatile unsigned int*)(0x4230901CUL))
#define bM4_TMR61_HCPAR_HCPA8                           *((volatile unsigned int*)(0x42309020UL))
#define bM4_TMR61_HCPAR_HCPA9                           *((volatile unsigned int*)(0x42309024UL))
#define bM4_TMR61_HCPAR_HCPA10                          *((volatile unsigned int*)(0x42309028UL))
#define bM4_TMR61_HCPAR_HCPA11                          *((volatile unsigned int*)(0x4230902CUL))
#define bM4_TMR61_HCPAR_HCPA12                          *((volatile unsigned int*)(0x42309030UL))
#define bM4_TMR61_HCPAR_HCPA13                          *((volatile unsigned int*)(0x42309034UL))
#define bM4_TMR61_HCPAR_HCPA14                          *((volatile unsigned int*)(0x42309038UL))
#define bM4_TMR61_HCPAR_HCPA15                          *((volatile unsigned int*)(0x4230903CUL))
#define bM4_TMR61_HCPBR_HCPB0                           *((volatile unsigned int*)(0x42309080UL))
#define bM4_TMR61_HCPBR_HCPB1                           *((volatile unsigned int*)(0x42309084UL))
#define bM4_TMR61_HCPBR_HCPB2                           *((volatile unsigned int*)(0x42309088UL))
#define bM4_TMR61_HCPBR_HCPB3                           *((volatile unsigned int*)(0x4230908CUL))
#define bM4_TMR61_HCPBR_HCPB4                           *((volatile unsigned int*)(0x42309090UL))
#define bM4_TMR61_HCPBR_HCPB5                           *((volatile unsigned int*)(0x42309094UL))
#define bM4_TMR61_HCPBR_HCPB6                           *((volatile unsigned int*)(0x42309098UL))
#define bM4_TMR61_HCPBR_HCPB7                           *((volatile unsigned int*)(0x4230909CUL))
#define bM4_TMR61_HCPBR_HCPB8                           *((volatile unsigned int*)(0x423090A0UL))
#define bM4_TMR61_HCPBR_HCPB9                           *((volatile unsigned int*)(0x423090A4UL))
#define bM4_TMR61_HCPBR_HCPB10                          *((volatile unsigned int*)(0x423090A8UL))
#define bM4_TMR61_HCPBR_HCPB11                          *((volatile unsigned int*)(0x423090ACUL))
#define bM4_TMR61_HCPBR_HCPB12                          *((volatile unsigned int*)(0x423090B0UL))
#define bM4_TMR61_HCPBR_HCPB13                          *((volatile unsigned int*)(0x423090B4UL))
#define bM4_TMR61_HCPBR_HCPB14                          *((volatile unsigned int*)(0x423090B8UL))
#define bM4_TMR61_HCPBR_HCPB15                          *((volatile unsigned int*)(0x423090BCUL))
#define bM4_TMR61_HCUPR_HCUP0                           *((volatile unsigned int*)(0x42309100UL))
#define bM4_TMR61_HCUPR_HCUP1                           *((volatile unsigned int*)(0x42309104UL))
#define bM4_TMR61_HCUPR_HCUP2                           *((volatile unsigned int*)(0x42309108UL))
#define bM4_TMR61_HCUPR_HCUP3                           *((volatile unsigned int*)(0x4230910CUL))
#define bM4_TMR61_HCUPR_HCUP4                           *((volatile unsigned int*)(0x42309110UL))
#define bM4_TMR61_HCUPR_HCUP5                           *((volatile unsigned int*)(0x42309114UL))
#define bM4_TMR61_HCUPR_HCUP6                           *((volatile unsigned int*)(0x42309118UL))
#define bM4_TMR61_HCUPR_HCUP7                           *((volatile unsigned int*)(0x4230911CUL))
#define bM4_TMR61_HCUPR_HCUP8                           *((volatile unsigned int*)(0x42309120UL))
#define bM4_TMR61_HCUPR_HCUP9                           *((volatile unsigned int*)(0x42309124UL))
#define bM4_TMR61_HCUPR_HCUP10                          *((volatile unsigned int*)(0x42309128UL))
#define bM4_TMR61_HCUPR_HCUP11                          *((volatile unsigned int*)(0x4230912CUL))
#define bM4_TMR61_HCUPR_HCUP12                          *((volatile unsigned int*)(0x42309130UL))
#define bM4_TMR61_HCUPR_HCUP13                          *((volatile unsigned int*)(0x42309134UL))
#define bM4_TMR61_HCUPR_HCUP14                          *((volatile unsigned int*)(0x42309138UL))
#define bM4_TMR61_HCUPR_HCUP15                          *((volatile unsigned int*)(0x4230913CUL))
#define bM4_TMR61_HCUPR_HCUP16                          *((volatile unsigned int*)(0x42309140UL))
#define bM4_TMR61_HCUPR_HCUP17                          *((volatile unsigned int*)(0x42309144UL))
#define bM4_TMR61_HCUPR_HCUP18                          *((volatile unsigned int*)(0x42309148UL))
#define bM4_TMR61_HCUPR_HCUP19                          *((volatile unsigned int*)(0x4230914CUL))
#define bM4_TMR61_HCUPR_RESV                            *((volatile unsigned int*)(0x42309160UL))
#define bM4_TMR61_HCDOR_HCDO0                           *((volatile unsigned int*)(0x42309180UL))
#define bM4_TMR61_HCDOR_HCDO1                           *((volatile unsigned int*)(0x42309184UL))
#define bM4_TMR61_HCDOR_HCDO2                           *((volatile unsigned int*)(0x42309188UL))
#define bM4_TMR61_HCDOR_HCDO3                           *((volatile unsigned int*)(0x4230918CUL))
#define bM4_TMR61_HCDOR_HCDO4                           *((volatile unsigned int*)(0x42309190UL))
#define bM4_TMR61_HCDOR_HCDO5                           *((volatile unsigned int*)(0x42309194UL))
#define bM4_TMR61_HCDOR_HCDO6                           *((volatile unsigned int*)(0x42309198UL))
#define bM4_TMR61_HCDOR_HCDO7                           *((volatile unsigned int*)(0x4230919CUL))
#define bM4_TMR61_HCDOR_HCDO8                           *((volatile unsigned int*)(0x423091A0UL))
#define bM4_TMR61_HCDOR_HCDO9                           *((volatile unsigned int*)(0x423091A4UL))
#define bM4_TMR61_HCDOR_HCDO10                          *((volatile unsigned int*)(0x423091A8UL))
#define bM4_TMR61_HCDOR_HCDO11                          *((volatile unsigned int*)(0x423091ACUL))
#define bM4_TMR61_HCDOR_HCDO12                          *((volatile unsigned int*)(0x423091B0UL))
#define bM4_TMR61_HCDOR_HCDO13                          *((volatile unsigned int*)(0x423091B4UL))
