RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR61_HCDOR_HCDO14                          *((volatile unsigned int*)(0x423091B8UL))
#define bM4_TMR61_HCDOR_HCDO15                          *((volatile unsigned int*)(0x423091BCUL))
#define bM4_TMR61_HCDOR_HCDO16                          *((volatile unsigned int*)(0x423091C0UL))
#define bM4_TMR61_HCDOR_HCDO17                          *((volatile unsigned int*)(0x423091C4UL))
#define bM4_TMR61_HCDOR_HCDO18                          *((volatile unsigned int*)(0x423091C8UL))
#define bM4_TMR61_HCDOR_HCDO19                          *((volatile unsigned int*)(0x423091CCUL))
#define bM4_TMR61_HCDOR_RESV                            *((volatile unsigned int*)(0x423091E0UL))
#define bM4_TMR61_SSTAR_SSTA0                           *((volatile unsigned int*)(0x4230FE80UL))
#define bM4_TMR61_SSTAR_SSTA1                           *((volatile unsigned int*)(0x4230FE84UL))
#define bM4_TMR61_SSTAR_SSTA2                           *((volatile unsigned int*)(0x4230FE88UL))
#define bM4_TMR61_SSTAR_SSTA3                           *((volatile unsigned int*)(0x4230FE8CUL))
#define bM4_TMR61_SSTAR_SSTA4                           *((volatile unsigned int*)(0x4230FE90UL))
#define bM4_TMR61_SSTAR_SSTA5                           *((volatile unsigned int*)(0x4230FE94UL))
#define bM4_TMR61_SSTAR_SSTA6                           *((volatile unsigned int*)(0x4230FE98UL))
#define bM4_TMR61_SSTAR_SSTA7                           *((volatile unsigned int*)(0x4230FE9CUL))
#define bM4_TMR61_SSTAR_SSTA8                           *((volatile unsigned int*)(0x4230FEA0UL))
#define bM4_TMR61_SSTAR_SSTA9                           *((volatile unsigned int*)(0x4230FEA4UL))
#define bM4_TMR61_SSTAR_RESV                            *((volatile unsigned int*)(0x4230FEE0UL))
#define bM4_TMR61_SSTPR_SSTP0                           *((volatile unsigned int*)(0x4230FF00UL))
#define bM4_TMR61_SSTPR_SSTP1                           *((volatile unsigned int*)(0x4230FF04UL))
#define bM4_TMR61_SSTPR_SSTP2                           *((volatile unsigned int*)(0x4230FF08UL))
#define bM4_TMR61_SSTPR_SSTP3                           *((volatile unsigned int*)(0x4230FF0CUL))
#define bM4_TMR61_SSTPR_SSTP4                           *((volatile unsigned int*)(0x4230FF10UL))
#define bM4_TMR61_SSTPR_SSTP5                           *((volatile unsigned int*)(0x4230FF14UL))
#define bM4_TMR61_SSTPR_SSTP6                           *((volatile unsigned int*)(0x4230FF18UL))
#define bM4_TMR61_SSTPR_SSTP7                           *((volatile unsigned int*)(0x4230FF1CUL))
#define bM4_TMR61_SSTPR_SSTP8                           *((volatile unsigned int*)(0x4230FF20UL))
#define bM4_TMR61_SSTPR_SSTP9                           *((volatile unsigned int*)(0x4230FF24UL))
#define bM4_TMR61_SSTPR_RESV                            *((volatile unsigned int*)(0x4230FF60UL))
#define bM4_TMR61_SCLRR_SCLE0                           *((volatile unsigned int*)(0x4230FF80UL))
#define bM4_TMR61_SCLRR_SCLE1                           *((volatile unsigned int*)(0x4230FF84UL))
#define bM4_TMR61_SCLRR_SCLE2                           *((volatile unsigned int*)(0x4230FF88UL))
#define bM4_TMR61_SCLRR_SCLE3                           *((volatile unsigned int*)(0x4230FF8CUL))
#define bM4_TMR61_SCLRR_SCLE4                           *((volatile unsigned int*)(0x4230FF90UL))
#define bM4_TMR61_SCLRR_SCLE5                           *((volatile unsigned int*)(0x4230FF94UL))
#define bM4_TMR61_SCLRR_SCLE6                           *((volatile unsigned int*)(0x4230FF98UL))
#define bM4_TMR61_SCLRR_SCLE7                           *((volatile unsigned int*)(0x4230FF9CUL))
#define bM4_TMR61_SCLRR_SCLE8                           *((volatile unsigned int*)(0x4230FFA0UL))
#define bM4_TMR61_SCLRR_SCLE9                           *((volatile unsigned int*)(0x4230FFA4UL))
#define bM4_TMR61_SCLRR_RESV                            *((volatile unsigned int*)(0x4230FFE0UL))
#define bM4_TMR62_GCONR_START                           *((volatile unsigned int*)(0x42310A00UL))
#define bM4_TMR62_GCONR_MODE0                           *((volatile unsigned int*)(0x42310A04UL))
#define bM4_TMR62_GCONR_MODE1                           *((volatile unsigned int*)(0x42310A08UL))
#define bM4_TMR62_GCONR_MODE2                           *((volatile unsigned int*)(0x42310A0CUL))
#define bM4_TMR62_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42310A10UL))
#define bM4_TMR62_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42310A14UL))
#define bM4_TMR62_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42310A18UL))
#define bM4_TMR62_GCONR_DIR                             *((volatile unsigned int*)(0x42310A20UL))
#define bM4_TMR62_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42310A40UL))
#define bM4_TMR62_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42310A44UL))
#define bM4_TMR62_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42310A48UL))
#define bM4_TMR62_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42310A4CUL))
#define bM4_TMR62_GCONR_RESV                            *((volatile unsigned int*)(0x42310A60UL))
#define bM4_TMR62_ICONR_INTENA                          *((volatile unsigned int*)(0x42310A80UL))
#define bM4_TMR62_ICONR_INTENB                          *((volatile unsigned int*)(0x42310A84UL))
#define bM4_TMR62_ICONR_INTENC                          *((volatile unsigned int*)(0x42310A88UL))
#define bM4_TMR62_ICONR_INTEND                          *((volatile unsigned int*)(0x42310A8CUL))
#define bM4_TMR62_ICONR_INTENE                          *((volatile unsigned int*)(0x42310A90UL))
#define bM4_TMR62_ICONR_INTENF                          *((volatile unsigned int*)(0x42310A94UL))
#define bM4_TMR62_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42310A98UL))
#define bM4_TMR62_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42310A9CUL))
#define bM4_TMR62_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42310AA0UL))
#define bM4_TMR62_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42310AC0UL))
#define bM4_TMR62_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42310AC4UL))
#define bM4_TMR62_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42310AC8UL))
#define bM4_TMR62_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42310ACCUL))
#define bM4_TMR62_ICONR_RESV                            *((volatile unsigned int*)(0x42310AE0UL))
#define bM4_TMR62_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42310B00UL))
#define bM4_TMR62_PCONR_STACA                           *((volatile unsigned int*)(0x42310B04UL))
#define bM4_TMR62_PCONR_STPCA                           *((volatile unsigned int*)(0x42310B08UL))
#define bM4_TMR62_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42310B0CUL))
#define bM4_TMR62_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42310B10UL))
#define bM4_TMR62_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42310B14UL))
#define bM4_TMR62_PCONR_PERCA0                          *((volatile unsigned int*)(0x42310B18UL))
#define bM4_TMR62_PCONR_PERCA1                          *((volatile unsigned int*)(0x42310B1CUL))
#define bM4_TMR62_PCONR_OUTENA                          *((volatile unsigned int*)(0x42310B20UL))
#define bM4_TMR62_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42310B24UL))
#define bM4_TMR62_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42310B28UL))
#define bM4_TMR62_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42310B2CUL))
#define bM4_TMR62_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42310B30UL))
#define bM4_TMR62_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42310B40UL))
#define bM4_TMR62_PCONR_STACB                           *((volatile unsigned int*)(0x42310B44UL))
#define bM4_TMR62_PCONR_STPCB                           *((volatile unsigned int*)(0x42310B48UL))
#define bM4_TMR62_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42310B4CUL))
#define bM4_TMR62_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42310B50UL))
#define bM4_TMR62_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42310B54UL))
#define bM4_TMR62_PCONR_PERCB0                          *((volatile unsigned int*)(0x42310B58UL))
#define bM4_TMR62_PCONR_PERCB1                          *((volatile unsigned int*)(0x42310B5CUL))
#define bM4_TMR62_PCONR_OUTENB                          *((volatile unsigned int*)(0x42310B60UL))
#define bM4_TMR62_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42310B64UL))
#define bM4_TMR62_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42310B68UL))
#define bM4_TMR62_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42310B6CUL))
#define bM4_TMR62_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42310B70UL))
#define bM4_TMR62_BCONR_BENA                            *((volatile unsigned int*)(0x42310B80UL))
#define bM4_TMR62_BCONR_BSEA                            *((volatile unsigned int*)(0x42310B84UL))
#define bM4_TMR62_BCONR_BENB                            *((volatile unsigned int*)(0x42310B88UL))
#define bM4_TMR62_BCONR_BSEB                            *((volatile unsigned int*)(0x42310B8CUL))
#define bM4_TMR62_BCONR_BENP                            *((volatile unsigned int*)(0x42310BA0UL))
#define bM4_TMR62_BCONR_BSEP                            *((volatile unsigned int*)(0x42310BA4UL))
#define bM4_TMR62_BCONR_BENSPA                          *((volatile unsigned int*)(0x42310BC0UL))
#define bM4_TMR62_BCONR_BSESPA                          *((volatile unsigned int*)(0x42310BC4UL))
#define bM4_TMR62_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42310BD0UL))
#define bM4_TMR62_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42310BD4UL))
#define bM4_TMR62_BCONR_BENSPB                          *((volatile unsigned int*)(0x42310BE0UL))
#define bM4_TMR62_BCONR_BSESPB                          *((volatile unsigned int*)(0x42310BE4UL))
#define bM4_TMR62_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42310BF0UL))
#define bM4_TMR62_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42310BF4UL))
#define bM4_TMR62_DCONR_DTCEN                           *((volatile unsigned int*)(0x42310C00UL))
#define bM4_TMR62_DCONR_DTBENU                          *((volatile unsigned int*)(0x42310C10UL))
#define bM4_TMR62_DCONR_DTBEND                          *((volatile unsigned int*)(0x42310C14UL))
#define bM4_TMR62_DCONR_SEPA                            *((volatile unsigned int*)(0x42310C20UL))
#define bM4_TMR62_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42310D00UL))
#define bM4_TMR62_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42310D04UL))
#define bM4_TMR62_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42310D08UL))
#define bM4_TMR62_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42310D10UL))
#define bM4_TMR62_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42310D14UL))
#define bM4_TMR62_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42310D18UL))
#define bM4_TMR62_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42310D40UL))
#define bM4_TMR62_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42310D44UL))
#define bM4_TMR62_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42310D48UL))
#define bM4_TMR62_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42310D50UL))
#define bM4_TMR62_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42310D54UL))
#define bM4_TMR62_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42310D58UL))
#define bM4_TMR62_FCONR_NOFIENTC                        *((volatile unsigned int*)(0x42310D60UL))
#define bM4_TMR62_FCONR_NOFICKTC0                       *((volatile unsigned int*)(0x42310D64UL))
#define bM4_TMR62_FCONR_NOFICKTC1                       *((volatile unsigned int*)(0x42310D68UL))
#define bM4_TMR62_FCONR_NOFIENTD                        *((volatile unsigned int*)(0x42310D70UL))
#define bM4_TMR62_FCONR_NOFICKTD0                       *((volatile unsigned int*)(0x42310D74UL))
#define bM4_TMR62_FCONR_NOFICKTD1                       *((volatile unsigned int*)(0x42310D78UL))
#define bM4_TMR62_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42310DA0UL))
#define bM4_TMR62_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42310DA4UL))
#define bM4_TMR62_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42310DC0UL))
#define bM4_TMR62_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42310DC4UL))
#define bM4_TMR62_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42310DC8UL))
#define bM4_TMR62_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42310DCCUL))
#define bM4_TMR62_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42310DD0UL))
#define bM4_TMR62_VPERR_RESV                            *((volatile unsigned int*)(0x42310DE0UL))
#define bM4_TMR62_STFLR_CMAF                            *((volatile unsigned int*)(0x42310E00UL))
#define bM4_TMR62_STFLR_CMBF                            *((volatile unsigned int*)(0x42310E04UL))
#define bM4_TMR62_STFLR_CMCF                            *((volatile unsigned int*)(0x42310E08UL))
#define bM4_TMR62_STFLR_CMDF                            *((volatile unsigned int*)(0x42310E0CUL))
#define bM4_TMR62_STFLR_CMEF                            *((volatile unsigned int*)(0x42310E10UL))
#define bM4_TMR62_STFLR_CMFF                            *((volatile unsigned int*)(0x42310E14UL))
#define bM4_TMR62_STFLR_OVFF                            *((volatile unsigned int*)(0x42310E18UL))
#define bM4_TMR62_STFLR_UDFF                            *((volatile unsigned int*)(0x42310E1CUL))
#define bM4_TMR62_STFLR_DTEF                            *((volatile unsigned int*)(0x42310E20UL))
#define bM4_TMR62_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42310E24UL))
#define bM4_TMR62_STFLR_CMSADF                          *((volatile unsigned int*)(0x42310E28UL))
#define bM4_TMR62_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42310E2CUL))
#define bM4_TMR62_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42310E30UL))
#define bM4_TMR62_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42310E54UL))
#define bM4_TMR62_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42310E58UL))
#define bM4_TMR62_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42310E5CUL))
#define bM4_TMR62_STFLR_DIRF                            *((volatile unsigned int*)(0x42310E7CUL))
#define bM4_TMR62_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42310E80UL))
#define bM4_TMR62_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42310E84UL))
#define bM4_TMR62_HSTAR_HSTA2                           *((volatile unsigned int*)(0x42310E88UL))
#define bM4_TMR62_HSTAR_HSTA3                           *((volatile unsigned int*)(0x42310E8CUL))
#define bM4_TMR62_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42310E90UL))
#define bM4_TMR62_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42310E94UL))
#define bM4_TMR62_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42310E98UL))
#define bM4_TMR62_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42310E9CUL))
#define bM4_TMR62_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42310EA0UL))
#define bM4_TMR62_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42310EA4UL))
#define bM4_TMR62_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42310EA8UL))
#define bM4_TMR62_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42310EACUL))
#define bM4_TMR62_HSTAR_HSTA12                          *((volatile unsigned int*)(0x42310EB0UL))
#define bM4_TMR62_HSTAR_HSTA13                          *((volatile unsigned int*)(0x42310EB4UL))
#define bM4_TMR62_HSTAR_HSTA14                          *((volatile unsigned int*)(0x42310EB8UL))
#define bM4_TMR62_HSTAR_HSTA15                          *((volatile unsigned int*)(0x42310EBCUL))
#define bM4_TMR62_HSTAR_STARTS                          *((volatile unsigned int*)(0x42310EFCUL))
#define bM4_TMR62_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42310F00UL))
#define bM4_TMR62_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42310F04UL))
#define bM4_TMR62_HSTPR_HSTP2                           *((volatile unsigned int*)(0x42310F08UL))
#define bM4_TMR62_HSTPR_HSTP3                           *((volatile unsigned int*)(0x42310F0CUL))
#define bM4_TMR62_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42310F10UL))
#define bM4_TMR62_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42310F14UL))
#define bM4_TMR62_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42310F18UL))
#define bM4_TMR62_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42310F1CUL))
#define bM4_TMR62_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42310F20UL))
#define bM4_TMR62_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42310F24UL))
#define bM4_TMR62_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42310F28UL))
#define bM4_TMR62_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42310F2CUL))
#define bM4_TMR62_HSTPR_HSTP12                          *((volatile unsigned int*)(0x42310F30UL))
#define bM4_TMR62_HSTPR_HSTP13                          *((volatile unsigned int*)(0x42310F34UL))
#define bM4_TMR62_HSTPR_HSTP14                          *((volatile unsigned int*)(0x42310F38UL))
#define bM4_TMR62_HSTPR_HSTP15                          *((volatile unsigned int*)(0x42310F3CUL))
#define bM4_TMR62_HSTPR_STOPS                           *((volatile unsigned int*)(0x42310F7CUL))
#define bM4_TMR62_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42310F80UL))
#define bM4_TMR62_HCLRR_HCLE1                           *((volatile unsigned int*)(0x42310F84UL))
#define bM4_TMR62_HCLRR_HCLE2                           *((volatile unsigned int*)(0x42310F88UL))
#define bM4_TMR62_HCLRR_HCLE3                           *((volatile unsigned int*)(0x42310F8CUL))
#define bM4_TMR62_HCLRR_HCLE4                           *((volatile unsigned int*)(0x42310F90UL))
#define bM4_TMR62_HCLRR_HCLE5                           *((volatile unsigned int*)(0x42310F94UL))
#define bM4_TMR62_HCLRR_HCLE6                           *((volatile unsigned int*)(0x42310F98UL))
#define bM4_TMR62_HCLRR_HCLE7                           *((volatile unsigned int*)(0x42310F9CUL))
#define bM4_TMR62_HCLRR_HCLE8                           *((volatile unsigned int*)(0x42310FA0UL))
#define bM4_TMR62_HCLRR_HCLE9                           *((volatile unsigned int*)(0x42310FA4UL))
#define bM4_TMR62_HCLRR_HCLE10                          *((volatile unsigned int*)(0x42310FA8UL))
#define bM4_TMR62_HCLRR_HCLE11                          *((volatile unsigned int*)(0x42310FACUL))
#define bM4_TMR62_HCLRR_HCLE12                          *((volatile unsigned int*)(0x42310FB0UL))
#define bM4_TMR62_HCLRR_HCLE13                          *((volatile unsigned int*)(0x42310FB4UL))
#define bM4_TMR62_HCLRR_HCLE14                          *((volatile unsigned int*)(0x42310FB8UL))
#define bM4_TMR62_HCLRR_HCLE15                          *((volatile unsigned int*)(0x42310FBCUL))
#define bM4_TMR62_HCLRR_CLEARS                          *((volatile unsigned int*)(0x42310FFCUL))
#define bM4_TMR62_HCPAR_HCPA0                           *((volatile unsigned int*)(0x42311000UL))
#define bM4_TMR62_HCPAR_HCPA1                           *((volatile unsigned int*)(0x42311004UL))
#define bM4_TMR62_HCPAR_HCPA2                           *((volatile unsigned int*)(0x42311008UL))
#define bM4_TMR62_HCPAR_HCPA3                           *((volatile unsigned int*)(0x4231100CUL))
#define bM4_TMR62_HCPAR_HCPA4                           *((volatile unsigned int*)(0x42311010UL))
#define bM4_TMR62_HCPAR_HCPA5                           *((volatile unsigned int*)(0x42311014UL))
#define bM4_TMR62_HCPAR_HCPA6                           *((volatile unsigned int*)(0x42311018UL))
#define bM4_TMR62_HCPAR_HCPA7                           *((volatile unsigned int*)(0x4231101CUL))
#define bM4_TMR62_HCPAR_HCPA8                           *((volatile unsigned int*)(0x42311020UL))
#define bM4_TMR62_HCPAR_HCPA9                           *((volatile unsigned int*)(0x42311024UL))
#define bM4_TMR62_HCPAR_HCPA10                          *((volatile unsigned int*)(0x42311028UL))
#define bM4_TMR62_HCPAR_HCPA11                          *((volatile unsigned int*)(0x4231102CUL))
#define bM4_TMR62_HCPAR_HCPA12                          *((volatile unsigned int*)(0x42311030UL))
#define bM4_TMR62_HCPAR_HCPA13                          *((volatile unsigned int*)(0x42311034UL))
#define bM4_TMR62_HCPAR_HCPA14                          *((volatile unsigned int*)(0x42311038UL))
#define bM4_TMR62_HCPAR_HCPA15                          *((volatile unsigned int*)(0x4231103CUL))
#define bM4_TMR62_HCPBR_HCPB0                           *((volatile unsigned int*)(0x42311080UL))
#define bM4_TMR62_HCPBR_HCPB1                           *((volatile unsigned int*)(0x42311084UL))
#define bM4_TMR62_HCPBR_HCPB2                           *((volatile unsigned int*)(0x42311088UL))
#define bM4_TMR62_HCPBR_HCPB3                           *((volatile unsigned int*)(0x4231108CUL))
#define bM4_TMR62_HCPBR_HCPB4                           *((volatile unsigned int*)(0x42311090UL))
#define bM4_TMR62_HCPBR_HCPB5                           *((volatile unsigned int*)(0x42311094UL))
#define bM4_TMR62_HCPBR_HCPB6                           *((volatile unsigned int*)(0x42311098UL))
#define bM4_TMR62_HCPBR_HCPB7                           *((volatile unsigned int*)(0x4231109CUL))
#define bM4_TMR62_HCPBR_HCPB8                           *((volatile unsigned int*)(0x423110A0UL))
#define bM4_TMR62_HCPBR_HCPB9                           *((volatile unsigned int*)(0x423110A4UL))
#define bM4_TMR62_HCPBR_HCPB10                          *((volatile unsigned int*)(0x423110A8UL))
#define bM4_TMR62_HCPBR_HCPB11                          *((volatile unsigned int*)(0x423110ACUL))
#define bM4_TMR62_HCPBR_HCPB12                          *((volatile unsigned int*)(0x423110B0UL))
#define bM4_TMR62_HCPBR_HCPB13                          *((volatile unsigned int*)(0x423110B4UL))
#define bM4_TMR62_HCPBR_HCPB14                          *((volatile unsigned int*)(0x423110B8UL))
#define bM4_TMR62_HCPBR_HCPB15                          *((volatile unsigned int*)(0x423110BCUL))
#define bM4_TMR62_HCUPR_HCUP0                           *((volatile unsigned int*)(0x42311100UL))
#define bM4_TMR62_HCUPR_HCUP1                           *((volatile unsigned int*)(0x42311104UL))
#define bM4_TMR62_HCUPR_HCUP2                           *((volatile unsigned int*)(0x42311108UL))
#define bM4_TMR62_HCUPR_HCUP3                           *((volatile unsigned int*)(0x4231110CUL))
#define bM4_TMR62_HCUPR_HCUP4                           *((volatile unsigned int*)(0x42311110UL))
#define bM4_TMR62_HCUPR_HCUP5                           *((volatile unsigned int*)(0x42311114UL))
#define bM4_TMR62_HCUPR_HCUP6                           *((volatile unsigned int*)(0x42311118UL))
