RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR62_HCUPR_HCUP7                           *((volatile unsigned int*)(0x4231111CUL))
#define bM4_TMR62_HCUPR_HCUP8                           *((volatile unsigned int*)(0x42311120UL))
#define bM4_TMR62_HCUPR_HCUP9                           *((volatile unsigned int*)(0x42311124UL))
#define bM4_TMR62_HCUPR_HCUP10                          *((volatile unsigned int*)(0x42311128UL))
#define bM4_TMR62_HCUPR_HCUP11                          *((volatile unsigned int*)(0x4231112CUL))
#define bM4_TMR62_HCUPR_HCUP12                          *((volatile unsigned int*)(0x42311130UL))
#define bM4_TMR62_HCUPR_HCUP13                          *((volatile unsigned int*)(0x42311134UL))
#define bM4_TMR62_HCUPR_HCUP14                          *((volatile unsigned int*)(0x42311138UL))
#define bM4_TMR62_HCUPR_HCUP15                          *((volatile unsigned int*)(0x4231113CUL))
#define bM4_TMR62_HCUPR_HCUP16                          *((volatile unsigned int*)(0x42311140UL))
#define bM4_TMR62_HCUPR_HCUP17                          *((volatile unsigned int*)(0x42311144UL))
#define bM4_TMR62_HCUPR_HCUP18                          *((volatile unsigned int*)(0x42311148UL))
#define bM4_TMR62_HCUPR_HCUP19                          *((volatile unsigned int*)(0x4231114CUL))
#define bM4_TMR62_HCUPR_RESV                            *((volatile unsigned int*)(0x42311160UL))
#define bM4_TMR62_HCDOR_HCDO0                           *((volatile unsigned int*)(0x42311180UL))
#define bM4_TMR62_HCDOR_HCDO1                           *((volatile unsigned int*)(0x42311184UL))
#define bM4_TMR62_HCDOR_HCDO2                           *((volatile unsigned int*)(0x42311188UL))
#define bM4_TMR62_HCDOR_HCDO3                           *((volatile unsigned int*)(0x4231118CUL))
#define bM4_TMR62_HCDOR_HCDO4                           *((volatile unsigned int*)(0x42311190UL))
#define bM4_TMR62_HCDOR_HCDO5                           *((volatile unsigned int*)(0x42311194UL))
#define bM4_TMR62_HCDOR_HCDO6                           *((volatile unsigned int*)(0x42311198UL))
#define bM4_TMR62_HCDOR_HCDO7                           *((volatile unsigned int*)(0x4231119CUL))
#define bM4_TMR62_HCDOR_HCDO8                           *((volatile unsigned int*)(0x423111A0UL))
#define bM4_TMR62_HCDOR_HCDO9                           *((volatile unsigned int*)(0x423111A4UL))
#define bM4_TMR62_HCDOR_HCDO10                          *((volatile unsigned int*)(0x423111A8UL))
#define bM4_TMR62_HCDOR_HCDO11                          *((volatile unsigned int*)(0x423111ACUL))
#define bM4_TMR62_HCDOR_HCDO12                          *((volatile unsigned int*)(0x423111B0UL))
#define bM4_TMR62_HCDOR_HCDO13                          *((volatile unsigned int*)(0x423111B4UL))
#define bM4_TMR62_HCDOR_HCDO14                          *((volatile unsigned int*)(0x423111B8UL))
#define bM4_TMR62_HCDOR_HCDO15                          *((volatile unsigned int*)(0x423111BCUL))
#define bM4_TMR62_HCDOR_HCDO16                          *((volatile unsigned int*)(0x423111C0UL))
#define bM4_TMR62_HCDOR_HCDO17                          *((volatile unsigned int*)(0x423111C4UL))
#define bM4_TMR62_HCDOR_HCDO18                          *((volatile unsigned int*)(0x423111C8UL))
#define bM4_TMR62_HCDOR_HCDO19                          *((volatile unsigned int*)(0x423111CCUL))
#define bM4_TMR62_HCDOR_RESV                            *((volatile unsigned int*)(0x423111E0UL))
#define bM4_TMR62_SSTAR_SSTA0                           *((volatile unsigned int*)(0x42317E80UL))
#define bM4_TMR62_SSTAR_SSTA1                           *((volatile unsigned int*)(0x42317E84UL))
#define bM4_TMR62_SSTAR_SSTA2                           *((volatile unsigned int*)(0x42317E88UL))
#define bM4_TMR62_SSTAR_SSTA3                           *((volatile unsigned int*)(0x42317E8CUL))
#define bM4_TMR62_SSTAR_SSTA4                           *((volatile unsigned int*)(0x42317E90UL))
#define bM4_TMR62_SSTAR_SSTA5                           *((volatile unsigned int*)(0x42317E94UL))
#define bM4_TMR62_SSTAR_SSTA6                           *((volatile unsigned int*)(0x42317E98UL))
#define bM4_TMR62_SSTAR_SSTA7                           *((volatile unsigned int*)(0x42317E9CUL))
#define bM4_TMR62_SSTAR_SSTA8                           *((volatile unsigned int*)(0x42317EA0UL))
#define bM4_TMR62_SSTAR_SSTA9                           *((volatile unsigned int*)(0x42317EA4UL))
#define bM4_TMR62_SSTAR_RESV                            *((volatile unsigned int*)(0x42317EE0UL))
#define bM4_TMR62_SSTPR_SSTP0                           *((volatile unsigned int*)(0x42317F00UL))
#define bM4_TMR62_SSTPR_SSTP1                           *((volatile unsigned int*)(0x42317F04UL))
#define bM4_TMR62_SSTPR_SSTP2                           *((volatile unsigned int*)(0x42317F08UL))
#define bM4_TMR62_SSTPR_SSTP3                           *((volatile unsigned int*)(0x42317F0CUL))
#define bM4_TMR62_SSTPR_SSTP4                           *((volatile unsigned int*)(0x42317F10UL))
#define bM4_TMR62_SSTPR_SSTP5                           *((volatile unsigned int*)(0x42317F14UL))
#define bM4_TMR62_SSTPR_SSTP6                           *((volatile unsigned int*)(0x42317F18UL))
#define bM4_TMR62_SSTPR_SSTP7                           *((volatile unsigned int*)(0x42317F1CUL))
#define bM4_TMR62_SSTPR_SSTP8                           *((volatile unsigned int*)(0x42317F20UL))
#define bM4_TMR62_SSTPR_SSTP9                           *((volatile unsigned int*)(0x42317F24UL))
#define bM4_TMR62_SSTPR_RESV                            *((volatile unsigned int*)(0x42317F60UL))
#define bM4_TMR62_SCLRR_SCLE0                           *((volatile unsigned int*)(0x42317F80UL))
#define bM4_TMR62_SCLRR_SCLE1                           *((volatile unsigned int*)(0x42317F84UL))
#define bM4_TMR62_SCLRR_SCLE2                           *((volatile unsigned int*)(0x42317F88UL))
#define bM4_TMR62_SCLRR_SCLE3                           *((volatile unsigned int*)(0x42317F8CUL))
#define bM4_TMR62_SCLRR_SCLE4                           *((volatile unsigned int*)(0x42317F90UL))
#define bM4_TMR62_SCLRR_SCLE5                           *((volatile unsigned int*)(0x42317F94UL))
#define bM4_TMR62_SCLRR_SCLE6                           *((volatile unsigned int*)(0x42317F98UL))
#define bM4_TMR62_SCLRR_SCLE7                           *((volatile unsigned int*)(0x42317F9CUL))
#define bM4_TMR62_SCLRR_SCLE8                           *((volatile unsigned int*)(0x42317FA0UL))
#define bM4_TMR62_SCLRR_SCLE9                           *((volatile unsigned int*)(0x42317FA4UL))
#define bM4_TMR62_SCLRR_RESV                            *((volatile unsigned int*)(0x42317FE0UL))
#define bM4_TMR63_GCONR_START                           *((volatile unsigned int*)(0x42318A00UL))
#define bM4_TMR63_GCONR_MODE0                           *((volatile unsigned int*)(0x42318A04UL))
#define bM4_TMR63_GCONR_MODE1                           *((volatile unsigned int*)(0x42318A08UL))
#define bM4_TMR63_GCONR_MODE2                           *((volatile unsigned int*)(0x42318A0CUL))
#define bM4_TMR63_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42318A10UL))
#define bM4_TMR63_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42318A14UL))
#define bM4_TMR63_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42318A18UL))
#define bM4_TMR63_GCONR_DIR                             *((volatile unsigned int*)(0x42318A20UL))
#define bM4_TMR63_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42318A40UL))
#define bM4_TMR63_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42318A44UL))
#define bM4_TMR63_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42318A48UL))
#define bM4_TMR63_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42318A4CUL))
#define bM4_TMR63_GCONR_RESV                            *((volatile unsigned int*)(0x42318A60UL))
#define bM4_TMR63_ICONR_INTENA                          *((volatile unsigned int*)(0x42318A80UL))
#define bM4_TMR63_ICONR_INTENB                          *((volatile unsigned int*)(0x42318A84UL))
#define bM4_TMR63_ICONR_INTENC                          *((volatile unsigned int*)(0x42318A88UL))
#define bM4_TMR63_ICONR_INTEND                          *((volatile unsigned int*)(0x42318A8CUL))
#define bM4_TMR63_ICONR_INTENE                          *((volatile unsigned int*)(0x42318A90UL))
#define bM4_TMR63_ICONR_INTENF                          *((volatile unsigned int*)(0x42318A94UL))
#define bM4_TMR63_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42318A98UL))
#define bM4_TMR63_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42318A9CUL))
#define bM4_TMR63_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42318AA0UL))
#define bM4_TMR63_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42318AC0UL))
#define bM4_TMR63_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42318AC4UL))
#define bM4_TMR63_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42318AC8UL))
#define bM4_TMR63_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42318ACCUL))
#define bM4_TMR63_ICONR_RESV                            *((volatile unsigned int*)(0x42318AE0UL))
#define bM4_TMR63_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42318B00UL))
#define bM4_TMR63_PCONR_STACA                           *((volatile unsigned int*)(0x42318B04UL))
#define bM4_TMR63_PCONR_STPCA                           *((volatile unsigned int*)(0x42318B08UL))
#define bM4_TMR63_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42318B0CUL))
#define bM4_TMR63_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42318B10UL))
#define bM4_TMR63_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42318B14UL))
#define bM4_TMR63_PCONR_PERCA0                          *((volatile unsigned int*)(0x42318B18UL))
#define bM4_TMR63_PCONR_PERCA1                          *((volatile unsigned int*)(0x42318B1CUL))
#define bM4_TMR63_PCONR_OUTENA                          *((volatile unsigned int*)(0x42318B20UL))
#define bM4_TMR63_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42318B24UL))
#define bM4_TMR63_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42318B28UL))
#define bM4_TMR63_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42318B2CUL))
#define bM4_TMR63_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42318B30UL))
#define bM4_TMR63_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42318B40UL))
#define bM4_TMR63_PCONR_STACB                           *((volatile unsigned int*)(0x42318B44UL))
#define bM4_TMR63_PCONR_STPCB                           *((volatile unsigned int*)(0x42318B48UL))
#define bM4_TMR63_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42318B4CUL))
#define bM4_TMR63_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42318B50UL))
#define bM4_TMR63_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42318B54UL))
#define bM4_TMR63_PCONR_PERCB0                          *((volatile unsigned int*)(0x42318B58UL))
#define bM4_TMR63_PCONR_PERCB1                          *((volatile unsigned int*)(0x42318B5CUL))
#define bM4_TMR63_PCONR_OUTENB                          *((volatile unsigned int*)(0x42318B60UL))
#define bM4_TMR63_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42318B64UL))
#define bM4_TMR63_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42318B68UL))
#define bM4_TMR63_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42318B6CUL))
#define bM4_TMR63_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42318B70UL))
#define bM4_TMR63_BCONR_BENA                            *((volatile unsigned int*)(0x42318B80UL))
#define bM4_TMR63_BCONR_BSEA                            *((volatile unsigned int*)(0x42318B84UL))
#define bM4_TMR63_BCONR_BENB                            *((volatile unsigned int*)(0x42318B88UL))
#define bM4_TMR63_BCONR_BSEB                            *((volatile unsigned int*)(0x42318B8CUL))
#define bM4_TMR63_BCONR_BENP                            *((volatile unsigned int*)(0x42318BA0UL))
#define bM4_TMR63_BCONR_BSEP                            *((volatile unsigned int*)(0x42318BA4UL))
#define bM4_TMR63_BCONR_BENSPA                          *((volatile unsigned int*)(0x42318BC0UL))
#define bM4_TMR63_BCONR_BSESPA                          *((volatile unsigned int*)(0x42318BC4UL))
#define bM4_TMR63_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42318BD0UL))
#define bM4_TMR63_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42318BD4UL))
#define bM4_TMR63_BCONR_BENSPB                          *((volatile unsigned int*)(0x42318BE0UL))
#define bM4_TMR63_BCONR_BSESPB                          *((volatile unsigned int*)(0x42318BE4UL))
#define bM4_TMR63_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42318BF0UL))
#define bM4_TMR63_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42318BF4UL))
#define bM4_TMR63_DCONR_DTCEN                           *((volatile unsigned int*)(0x42318C00UL))
#define bM4_TMR63_DCONR_DTBENU                          *((volatile unsigned int*)(0x42318C10UL))
#define bM4_TMR63_DCONR_DTBEND                          *((volatile unsigned int*)(0x42318C14UL))
#define bM4_TMR63_DCONR_SEPA                            *((volatile unsigned int*)(0x42318C20UL))
#define bM4_TMR63_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42318D00UL))
#define bM4_TMR63_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42318D04UL))
#define bM4_TMR63_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42318D08UL))
#define bM4_TMR63_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42318D10UL))
#define bM4_TMR63_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42318D14UL))
#define bM4_TMR63_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42318D18UL))
#define bM4_TMR63_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42318D40UL))
#define bM4_TMR63_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42318D44UL))
#define bM4_TMR63_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42318D48UL))
#define bM4_TMR63_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42318D50UL))
#define bM4_TMR63_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42318D54UL))
#define bM4_TMR63_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42318D58UL))
#define bM4_TMR63_FCONR_NOFIENTC                        *((volatile unsigned int*)(0x42318D60UL))
#define bM4_TMR63_FCONR_NOFICKTC0                       *((volatile unsigned int*)(0x42318D64UL))
#define bM4_TMR63_FCONR_NOFICKTC1                       *((volatile unsigned int*)(0x42318D68UL))
#define bM4_TMR63_FCONR_NOFIENTD                        *((volatile unsigned int*)(0x42318D70UL))
#define bM4_TMR63_FCONR_NOFICKTD0                       *((volatile unsigned int*)(0x42318D74UL))
#define bM4_TMR63_FCONR_NOFICKTD1                       *((volatile unsigned int*)(0x42318D78UL))
#define bM4_TMR63_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42318DA0UL))
#define bM4_TMR63_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42318DA4UL))
#define bM4_TMR63_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42318DC0UL))
#define bM4_TMR63_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42318DC4UL))
#define bM4_TMR63_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42318DC8UL))
#define bM4_TMR63_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42318DCCUL))
#define bM4_TMR63_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42318DD0UL))
#define bM4_TMR63_VPERR_RESV                            *((volatile unsigned int*)(0x42318DE0UL))
#define bM4_TMR63_STFLR_CMAF                            *((volatile unsigned int*)(0x42318E00UL))
#define bM4_TMR63_STFLR_CMBF                            *((volatile unsigned int*)(0x42318E04UL))
#define bM4_TMR63_STFLR_CMCF                            *((volatile unsigned int*)(0x42318E08UL))
#define bM4_TMR63_STFLR_CMDF                            *((volatile unsigned int*)(0x42318E0CUL))
#define bM4_TMR63_STFLR_CMEF                            *((volatile unsigned int*)(0x42318E10UL))
#define bM4_TMR63_STFLR_CMFF                            *((volatile unsigned int*)(0x42318E14UL))
#define bM4_TMR63_STFLR_OVFF                            *((volatile unsigned int*)(0x42318E18UL))
#define bM4_TMR63_STFLR_UDFF                            *((volatile unsigned int*)(0x42318E1CUL))
#define bM4_TMR63_STFLR_DTEF                            *((volatile unsigned int*)(0x42318E20UL))
#define bM4_TMR63_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42318E24UL))
#define bM4_TMR63_STFLR_CMSADF                          *((volatile unsigned int*)(0x42318E28UL))
#define bM4_TMR63_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42318E2CUL))
#define bM4_TMR63_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42318E30UL))
#define bM4_TMR63_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42318E54UL))
#define bM4_TMR63_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42318E58UL))
#define bM4_TMR63_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42318E5CUL))
#define bM4_TMR63_STFLR_DIRF                            *((volatile unsigned int*)(0x42318E7CUL))
#define bM4_TMR63_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42318E80UL))
#define bM4_TMR63_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42318E84UL))
#define bM4_TMR63_HSTAR_HSTA2                           *((volatile unsigned int*)(0x42318E88UL))
#define bM4_TMR63_HSTAR_HSTA3                           *((volatile unsigned int*)(0x42318E8CUL))
#define bM4_TMR63_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42318E90UL))
#define bM4_TMR63_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42318E94UL))
#define bM4_TMR63_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42318E98UL))
#define bM4_TMR63_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42318E9CUL))
#define bM4_TMR63_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42318EA0UL))
#define bM4_TMR63_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42318EA4UL))
#define bM4_TMR63_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42318EA8UL))
#define bM4_TMR63_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42318EACUL))
#define bM4_TMR63_HSTAR_HSTA12                          *((volatile unsigned int*)(0x42318EB0UL))
#define bM4_TMR63_HSTAR_HSTA13                          *((volatile unsigned int*)(0x42318EB4UL))
#define bM4_TMR63_HSTAR_HSTA14                          *((volatile unsigned int*)(0x42318EB8UL))
#define bM4_TMR63_HSTAR_HSTA15                          *((volatile unsigned int*)(0x42318EBCUL))
#define bM4_TMR63_HSTAR_STARTS                          *((volatile unsigned int*)(0x42318EFCUL))
#define bM4_TMR63_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42318F00UL))
#define bM4_TMR63_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42318F04UL))
#define bM4_TMR63_HSTPR_HSTP2                           *((volatile unsigned int*)(0x42318F08UL))
#define bM4_TMR63_HSTPR_HSTP3                           *((volatile unsigned int*)(0x42318F0CUL))
#define bM4_TMR63_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42318F10UL))
#define bM4_TMR63_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42318F14UL))
#define bM4_TMR63_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42318F18UL))
#define bM4_TMR63_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42318F1CUL))
#define bM4_TMR63_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42318F20UL))
#define bM4_TMR63_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42318F24UL))
#define bM4_TMR63_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42318F28UL))
#define bM4_TMR63_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42318F2CUL))
#define bM4_TMR63_HSTPR_HSTP12                          *((volatile unsigned int*)(0x42318F30UL))
#define bM4_TMR63_HSTPR_HSTP13                          *((volatile unsigned int*)(0x42318F34UL))
#define bM4_TMR63_HSTPR_HSTP14                          *((volatile unsigned int*)(0x42318F38UL))
#define bM4_TMR63_HSTPR_HSTP15                          *((volatile unsigned int*)(0x42318F3CUL))
#define bM4_TMR63_HSTPR_STOPS                           *((volatile unsigned int*)(0x42318F7CUL))
#define bM4_TMR63_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42318F80UL))
#define bM4_TMR63_HCLRR_HCLE1                           *((volatile unsigned int*)(0x42318F84UL))
#define bM4_TMR63_HCLRR_HCLE2                           *((volatile unsigned int*)(0x42318F88UL))
#define bM4_TMR63_HCLRR_HCLE3                           *((volatile unsigned int*)(0x42318F8CUL))
#define bM4_TMR63_HCLRR_HCLE4                           *((volatile unsigned int*)(0x42318F90UL))
#define bM4_TMR63_HCLRR_HCLE5                           *((volatile unsigned int*)(0x42318F94UL))
#define bM4_TMR63_HCLRR_HCLE6                           *((volatile unsigned int*)(0x42318F98UL))
#define bM4_TMR63_HCLRR_HCLE7                           *((volatile unsigned int*)(0x42318F9CUL))
#define bM4_TMR63_HCLRR_HCLE8                           *((volatile unsigned int*)(0x42318FA0UL))
#define bM4_TMR63_HCLRR_HCLE9                           *((volatile unsigned int*)(0x42318FA4UL))
#define bM4_TMR63_HCLRR_HCLE10                          *((volatile unsigned int*)(0x42318FA8UL))
#define bM4_TMR63_HCLRR_HCLE11                          *((volatile unsigned int*)(0x42318FACUL))
#define bM4_TMR63_HCLRR_HCLE12                          *((volatile unsigned int*)(0x42318FB0UL))
#define bM4_TMR63_HCLRR_HCLE13                          *((volatile unsigned int*)(0x42318FB4UL))
#define bM4_TMR63_HCLRR_HCLE14                          *((volatile unsigned int*)(0x42318FB8UL))
#define bM4_TMR63_HCLRR_HCLE15                          *((volatile unsigned int*)(0x42318FBCUL))
#define bM4_TMR63_HCLRR_CLEARS                          *((volatile unsigned int*)(0x42318FFCUL))
#define bM4_TMR63_HCPAR_HCPA0                           *((volatile unsigned int*)(0x42319000UL))
#define bM4_TMR63_HCPAR_HCPA1                           *((volatile unsigned int*)(0x42319004UL))
#define bM4_TMR63_HCPAR_HCPA2                           *((volatile unsigned int*)(0x42319008UL))
#define bM4_TMR63_HCPAR_HCPA3                           *((volatile unsigned int*)(0x4231900CUL))
#define bM4_TMR63_HCPAR_HCPA4                           *((volatile unsigned int*)(0x42319010UL))
#define bM4_TMR63_HCPAR_HCPA5                           *((volatile unsigned int*)(0x42319014UL))
#define bM4_TMR63_HCPAR_HCPA6                           *((volatile unsigned int*)(0x42319018UL))
#define bM4_TMR63_HCPAR_HCPA7                           *((volatile unsigned int*)(0x4231901CUL))
#define bM4_TMR63_HCPAR_HCPA8                           *((volatile unsigned int*)(0x42319020UL))
#define bM4_TMR63_HCPAR_HCPA9                           *((volatile unsigned int*)(0x42319024UL))
#define bM4_TMR63_HCPAR_HCPA10                          *((volatile unsigned int*)(0x42319028UL))
