RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR63_HCPAR_HCPA11                          *((volatile unsigned int*)(0x4231902CUL))
#define bM4_TMR63_HCPAR_HCPA12                          *((volatile unsigned int*)(0x42319030UL))
#define bM4_TMR63_HCPAR_HCPA13                          *((volatile unsigned int*)(0x42319034UL))
#define bM4_TMR63_HCPAR_HCPA14                          *((volatile unsigned int*)(0x42319038UL))
#define bM4_TMR63_HCPAR_HCPA15                          *((volatile unsigned int*)(0x4231903CUL))
#define bM4_TMR63_HCPBR_HCPB0                           *((volatile unsigned int*)(0x42319080UL))
#define bM4_TMR63_HCPBR_HCPB1                           *((volatile unsigned int*)(0x42319084UL))
#define bM4_TMR63_HCPBR_HCPB2                           *((volatile unsigned int*)(0x42319088UL))
#define bM4_TMR63_HCPBR_HCPB3                           *((volatile unsigned int*)(0x4231908CUL))
#define bM4_TMR63_HCPBR_HCPB4                           *((volatile unsigned int*)(0x42319090UL))
#define bM4_TMR63_HCPBR_HCPB5                           *((volatile unsigned int*)(0x42319094UL))
#define bM4_TMR63_HCPBR_HCPB6                           *((volatile unsigned int*)(0x42319098UL))
#define bM4_TMR63_HCPBR_HCPB7                           *((volatile unsigned int*)(0x4231909CUL))
#define bM4_TMR63_HCPBR_HCPB8                           *((volatile unsigned int*)(0x423190A0UL))
#define bM4_TMR63_HCPBR_HCPB9                           *((volatile unsigned int*)(0x423190A4UL))
#define bM4_TMR63_HCPBR_HCPB10                          *((volatile unsigned int*)(0x423190A8UL))
#define bM4_TMR63_HCPBR_HCPB11                          *((volatile unsigned int*)(0x423190ACUL))
#define bM4_TMR63_HCPBR_HCPB12                          *((volatile unsigned int*)(0x423190B0UL))
#define bM4_TMR63_HCPBR_HCPB13                          *((volatile unsigned int*)(0x423190B4UL))
#define bM4_TMR63_HCPBR_HCPB14                          *((volatile unsigned int*)(0x423190B8UL))
#define bM4_TMR63_HCPBR_HCPB15                          *((volatile unsigned int*)(0x423190BCUL))
#define bM4_TMR63_HCUPR_HCUP0                           *((volatile unsigned int*)(0x42319100UL))
#define bM4_TMR63_HCUPR_HCUP1                           *((volatile unsigned int*)(0x42319104UL))
#define bM4_TMR63_HCUPR_HCUP2                           *((volatile unsigned int*)(0x42319108UL))
#define bM4_TMR63_HCUPR_HCUP3                           *((volatile unsigned int*)(0x4231910CUL))
#define bM4_TMR63_HCUPR_HCUP4                           *((volatile unsigned int*)(0x42319110UL))
#define bM4_TMR63_HCUPR_HCUP5                           *((volatile unsigned int*)(0x42319114UL))
#define bM4_TMR63_HCUPR_HCUP6                           *((volatile unsigned int*)(0x42319118UL))
#define bM4_TMR63_HCUPR_HCUP7                           *((volatile unsigned int*)(0x4231911CUL))
#define bM4_TMR63_HCUPR_HCUP8                           *((volatile unsigned int*)(0x42319120UL))
#define bM4_TMR63_HCUPR_HCUP9                           *((volatile unsigned int*)(0x42319124UL))
#define bM4_TMR63_HCUPR_HCUP10                          *((volatile unsigned int*)(0x42319128UL))
#define bM4_TMR63_HCUPR_HCUP11                          *((volatile unsigned int*)(0x4231912CUL))
#define bM4_TMR63_HCUPR_HCUP12                          *((volatile unsigned int*)(0x42319130UL))
#define bM4_TMR63_HCUPR_HCUP13                          *((volatile unsigned int*)(0x42319134UL))
#define bM4_TMR63_HCUPR_HCUP14                          *((volatile unsigned int*)(0x42319138UL))
#define bM4_TMR63_HCUPR_HCUP15                          *((volatile unsigned int*)(0x4231913CUL))
#define bM4_TMR63_HCUPR_HCUP16                          *((volatile unsigned int*)(0x42319140UL))
#define bM4_TMR63_HCUPR_HCUP17                          *((volatile unsigned int*)(0x42319144UL))
#define bM4_TMR63_HCUPR_HCUP18                          *((volatile unsigned int*)(0x42319148UL))
#define bM4_TMR63_HCUPR_HCUP19                          *((volatile unsigned int*)(0x4231914CUL))
#define bM4_TMR63_HCUPR_RESV                            *((volatile unsigned int*)(0x42319160UL))
#define bM4_TMR63_HCDOR_HCDO0                           *((volatile unsigned int*)(0x42319180UL))
#define bM4_TMR63_HCDOR_HCDO1                           *((volatile unsigned int*)(0x42319184UL))
#define bM4_TMR63_HCDOR_HCDO2                           *((volatile unsigned int*)(0x42319188UL))
#define bM4_TMR63_HCDOR_HCDO3                           *((volatile unsigned int*)(0x4231918CUL))
#define bM4_TMR63_HCDOR_HCDO4                           *((volatile unsigned int*)(0x42319190UL))
#define bM4_TMR63_HCDOR_HCDO5                           *((volatile unsigned int*)(0x42319194UL))
#define bM4_TMR63_HCDOR_HCDO6                           *((volatile unsigned int*)(0x42319198UL))
#define bM4_TMR63_HCDOR_HCDO7                           *((volatile unsigned int*)(0x4231919CUL))
#define bM4_TMR63_HCDOR_HCDO8                           *((volatile unsigned int*)(0x423191A0UL))
#define bM4_TMR63_HCDOR_HCDO9                           *((volatile unsigned int*)(0x423191A4UL))
#define bM4_TMR63_HCDOR_HCDO10                          *((volatile unsigned int*)(0x423191A8UL))
#define bM4_TMR63_HCDOR_HCDO11                          *((volatile unsigned int*)(0x423191ACUL))
#define bM4_TMR63_HCDOR_HCDO12                          *((volatile unsigned int*)(0x423191B0UL))
#define bM4_TMR63_HCDOR_HCDO13                          *((volatile unsigned int*)(0x423191B4UL))
#define bM4_TMR63_HCDOR_HCDO14                          *((volatile unsigned int*)(0x423191B8UL))
#define bM4_TMR63_HCDOR_HCDO15                          *((volatile unsigned int*)(0x423191BCUL))
#define bM4_TMR63_HCDOR_HCDO16                          *((volatile unsigned int*)(0x423191C0UL))
#define bM4_TMR63_HCDOR_HCDO17                          *((volatile unsigned int*)(0x423191C4UL))
#define bM4_TMR63_HCDOR_HCDO18                          *((volatile unsigned int*)(0x423191C8UL))
#define bM4_TMR63_HCDOR_HCDO19                          *((volatile unsigned int*)(0x423191CCUL))
#define bM4_TMR63_HCDOR_RESV                            *((volatile unsigned int*)(0x423191E0UL))
#define bM4_TMR63_SSTAR_SSTA0                           *((volatile unsigned int*)(0x4231FE80UL))
#define bM4_TMR63_SSTAR_SSTA1                           *((volatile unsigned int*)(0x4231FE84UL))
#define bM4_TMR63_SSTAR_SSTA2                           *((volatile unsigned int*)(0x4231FE88UL))
#define bM4_TMR63_SSTAR_SSTA3                           *((volatile unsigned int*)(0x4231FE8CUL))
#define bM4_TMR63_SSTAR_SSTA4                           *((volatile unsigned int*)(0x4231FE90UL))
#define bM4_TMR63_SSTAR_SSTA5                           *((volatile unsigned int*)(0x4231FE94UL))
#define bM4_TMR63_SSTAR_SSTA6                           *((volatile unsigned int*)(0x4231FE98UL))
#define bM4_TMR63_SSTAR_SSTA7                           *((volatile unsigned int*)(0x4231FE9CUL))
#define bM4_TMR63_SSTAR_SSTA8                           *((volatile unsigned int*)(0x4231FEA0UL))
#define bM4_TMR63_SSTAR_SSTA9                           *((volatile unsigned int*)(0x4231FEA4UL))
#define bM4_TMR63_SSTAR_RESV                            *((volatile unsigned int*)(0x4231FEE0UL))
#define bM4_TMR63_SSTPR_SSTP0                           *((volatile unsigned int*)(0x4231FF00UL))
#define bM4_TMR63_SSTPR_SSTP1                           *((volatile unsigned int*)(0x4231FF04UL))
#define bM4_TMR63_SSTPR_SSTP2                           *((volatile unsigned int*)(0x4231FF08UL))
#define bM4_TMR63_SSTPR_SSTP3                           *((volatile unsigned int*)(0x4231FF0CUL))
#define bM4_TMR63_SSTPR_SSTP4                           *((volatile unsigned int*)(0x4231FF10UL))
#define bM4_TMR63_SSTPR_SSTP5                           *((volatile unsigned int*)(0x4231FF14UL))
#define bM4_TMR63_SSTPR_SSTP6                           *((volatile unsigned int*)(0x4231FF18UL))
#define bM4_TMR63_SSTPR_SSTP7                           *((volatile unsigned int*)(0x4231FF1CUL))
#define bM4_TMR63_SSTPR_SSTP8                           *((volatile unsigned int*)(0x4231FF20UL))
#define bM4_TMR63_SSTPR_SSTP9                           *((volatile unsigned int*)(0x4231FF24UL))
#define bM4_TMR63_SSTPR_RESV                            *((volatile unsigned int*)(0x4231FF60UL))
#define bM4_TMR63_SCLRR_SCLE0                           *((volatile unsigned int*)(0x4231FF80UL))
#define bM4_TMR63_SCLRR_SCLE1                           *((volatile unsigned int*)(0x4231FF84UL))
#define bM4_TMR63_SCLRR_SCLE2                           *((volatile unsigned int*)(0x4231FF88UL))
#define bM4_TMR63_SCLRR_SCLE3                           *((volatile unsigned int*)(0x4231FF8CUL))
#define bM4_TMR63_SCLRR_SCLE4                           *((volatile unsigned int*)(0x4231FF90UL))
#define bM4_TMR63_SCLRR_SCLE5                           *((volatile unsigned int*)(0x4231FF94UL))
#define bM4_TMR63_SCLRR_SCLE6                           *((volatile unsigned int*)(0x4231FF98UL))
#define bM4_TMR63_SCLRR_SCLE7                           *((volatile unsigned int*)(0x4231FF9CUL))
#define bM4_TMR63_SCLRR_SCLE8                           *((volatile unsigned int*)(0x4231FFA0UL))
#define bM4_TMR63_SCLRR_SCLE9                           *((volatile unsigned int*)(0x4231FFA4UL))
#define bM4_TMR63_SCLRR_RESV                            *((volatile unsigned int*)(0x4231FFE0UL))
#define bM4_TMR64_GCONR_START                           *((volatile unsigned int*)(0x42320A00UL))
#define bM4_TMR64_GCONR_MODE0                           *((volatile unsigned int*)(0x42320A04UL))
#define bM4_TMR64_GCONR_MODE1                           *((volatile unsigned int*)(0x42320A08UL))
#define bM4_TMR64_GCONR_MODE2                           *((volatile unsigned int*)(0x42320A0CUL))
#define bM4_TMR64_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42320A10UL))
#define bM4_TMR64_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42320A14UL))
#define bM4_TMR64_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42320A18UL))
#define bM4_TMR64_GCONR_DIR                             *((volatile unsigned int*)(0x42320A20UL))
#define bM4_TMR64_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42320A40UL))
#define bM4_TMR64_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42320A44UL))
#define bM4_TMR64_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42320A48UL))
#define bM4_TMR64_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42320A4CUL))
#define bM4_TMR64_GCONR_RESV                            *((volatile unsigned int*)(0x42320A60UL))
#define bM4_TMR64_ICONR_INTENA                          *((volatile unsigned int*)(0x42320A80UL))
#define bM4_TMR64_ICONR_INTENB                          *((volatile unsigned int*)(0x42320A84UL))
#define bM4_TMR64_ICONR_INTENC                          *((volatile unsigned int*)(0x42320A88UL))
#define bM4_TMR64_ICONR_INTEND                          *((volatile unsigned int*)(0x42320A8CUL))
#define bM4_TMR64_ICONR_INTENE                          *((volatile unsigned int*)(0x42320A90UL))
#define bM4_TMR64_ICONR_INTENF                          *((volatile unsigned int*)(0x42320A94UL))
#define bM4_TMR64_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42320A98UL))
#define bM4_TMR64_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42320A9CUL))
#define bM4_TMR64_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42320AA0UL))
#define bM4_TMR64_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42320AC0UL))
#define bM4_TMR64_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42320AC4UL))
#define bM4_TMR64_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42320AC8UL))
#define bM4_TMR64_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42320ACCUL))
#define bM4_TMR64_ICONR_RESV                            *((volatile unsigned int*)(0x42320AE0UL))
#define bM4_TMR64_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42320B00UL))
#define bM4_TMR64_PCONR_STACA                           *((volatile unsigned int*)(0x42320B04UL))
#define bM4_TMR64_PCONR_STPCA                           *((volatile unsigned int*)(0x42320B08UL))
#define bM4_TMR64_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42320B0CUL))
#define bM4_TMR64_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42320B10UL))
#define bM4_TMR64_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42320B14UL))
#define bM4_TMR64_PCONR_PERCA0                          *((volatile unsigned int*)(0x42320B18UL))
#define bM4_TMR64_PCONR_PERCA1                          *((volatile unsigned int*)(0x42320B1CUL))
#define bM4_TMR64_PCONR_OUTENA                          *((volatile unsigned int*)(0x42320B20UL))
#define bM4_TMR64_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42320B24UL))
#define bM4_TMR64_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42320B28UL))
#define bM4_TMR64_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42320B2CUL))
#define bM4_TMR64_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42320B30UL))
#define bM4_TMR64_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42320B40UL))
#define bM4_TMR64_PCONR_STACB                           *((volatile unsigned int*)(0x42320B44UL))
#define bM4_TMR64_PCONR_STPCB                           *((volatile unsigned int*)(0x42320B48UL))
#define bM4_TMR64_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42320B4CUL))
#define bM4_TMR64_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42320B50UL))
#define bM4_TMR64_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42320B54UL))
#define bM4_TMR64_PCONR_PERCB0                          *((volatile unsigned int*)(0x42320B58UL))
#define bM4_TMR64_PCONR_PERCB1                          *((volatile unsigned int*)(0x42320B5CUL))
#define bM4_TMR64_PCONR_OUTENB                          *((volatile unsigned int*)(0x42320B60UL))
#define bM4_TMR64_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42320B64UL))
#define bM4_TMR64_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42320B68UL))
#define bM4_TMR64_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42320B6CUL))
#define bM4_TMR64_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42320B70UL))
#define bM4_TMR64_BCONR_BENA                            *((volatile unsigned int*)(0x42320B80UL))
#define bM4_TMR64_BCONR_BSEA                            *((volatile unsigned int*)(0x42320B84UL))
#define bM4_TMR64_BCONR_BENB                            *((volatile unsigned int*)(0x42320B88UL))
#define bM4_TMR64_BCONR_BSEB                            *((volatile unsigned int*)(0x42320B8CUL))
#define bM4_TMR64_BCONR_BENP                            *((volatile unsigned int*)(0x42320BA0UL))
#define bM4_TMR64_BCONR_BSEP                            *((volatile unsigned int*)(0x42320BA4UL))
#define bM4_TMR64_BCONR_BENSPA                          *((volatile unsigned int*)(0x42320BC0UL))
#define bM4_TMR64_BCONR_BSESPA                          *((volatile unsigned int*)(0x42320BC4UL))
#define bM4_TMR64_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42320BD0UL))
#define bM4_TMR64_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42320BD4UL))
#define bM4_TMR64_BCONR_BENSPB                          *((volatile unsigned int*)(0x42320BE0UL))
#define bM4_TMR64_BCONR_BSESPB                          *((volatile unsigned int*)(0x42320BE4UL))
#define bM4_TMR64_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42320BF0UL))
#define bM4_TMR64_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42320BF4UL))
#define bM4_TMR64_DCONR_DTCEN                           *((volatile unsigned int*)(0x42320C00UL))
#define bM4_TMR64_DCONR_DTBENU                          *((volatile unsigned int*)(0x42320C10UL))
#define bM4_TMR64_DCONR_DTBEND                          *((volatile unsigned int*)(0x42320C14UL))
#define bM4_TMR64_DCONR_SEPA                            *((volatile unsigned int*)(0x42320C20UL))
#define bM4_TMR64_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42320D00UL))
#define bM4_TMR64_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42320D04UL))
#define bM4_TMR64_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42320D08UL))
#define bM4_TMR64_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42320D10UL))
#define bM4_TMR64_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42320D14UL))
#define bM4_TMR64_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42320D18UL))
#define bM4_TMR64_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42320D40UL))
#define bM4_TMR64_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42320D44UL))
#define bM4_TMR64_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42320D48UL))
#define bM4_TMR64_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42320D50UL))
#define bM4_TMR64_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42320D54UL))
#define bM4_TMR64_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42320D58UL))
#define bM4_TMR64_FCONR_NOFIENTC                        *((volatile unsigned int*)(0x42320D60UL))
#define bM4_TMR64_FCONR_NOFICKTC0                       *((volatile unsigned int*)(0x42320D64UL))
#define bM4_TMR64_FCONR_NOFICKTC1                       *((volatile unsigned int*)(0x42320D68UL))
#define bM4_TMR64_FCONR_NOFIENTD                        *((volatile unsigned int*)(0x42320D70UL))
#define bM4_TMR64_FCONR_NOFICKTD0                       *((volatile unsigned int*)(0x42320D74UL))
#define bM4_TMR64_FCONR_NOFICKTD1                       *((volatile unsigned int*)(0x42320D78UL))
#define bM4_TMR64_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42320DA0UL))
#define bM4_TMR64_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42320DA4UL))
#define bM4_TMR64_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42320DC0UL))
#define bM4_TMR64_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42320DC4UL))
#define bM4_TMR64_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42320DC8UL))
#define bM4_TMR64_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42320DCCUL))
#define bM4_TMR64_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42320DD0UL))
#define bM4_TMR64_VPERR_RESV                            *((volatile unsigned int*)(0x42320DE0UL))
#define bM4_TMR64_STFLR_CMAF                            *((volatile unsigned int*)(0x42320E00UL))
#define bM4_TMR64_STFLR_CMBF                            *((volatile unsigned int*)(0x42320E04UL))
#define bM4_TMR64_STFLR_CMCF                            *((volatile unsigned int*)(0x42320E08UL))
#define bM4_TMR64_STFLR_CMDF                            *((volatile unsigned int*)(0x42320E0CUL))
#define bM4_TMR64_STFLR_CMEF                            *((volatile unsigned int*)(0x42320E10UL))
#define bM4_TMR64_STFLR_CMFF                            *((volatile unsigned int*)(0x42320E14UL))
#define bM4_TMR64_STFLR_OVFF                            *((volatile unsigned int*)(0x42320E18UL))
#define bM4_TMR64_STFLR_UDFF                            *((volatile unsigned int*)(0x42320E1CUL))
#define bM4_TMR64_STFLR_DTEF                            *((volatile unsigned int*)(0x42320E20UL))
#define bM4_TMR64_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42320E24UL))
#define bM4_TMR64_STFLR_CMSADF                          *((volatile unsigned int*)(0x42320E28UL))
#define bM4_TMR64_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42320E2CUL))
#define bM4_TMR64_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42320E30UL))
#define bM4_TMR64_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42320E54UL))
#define bM4_TMR64_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42320E58UL))
#define bM4_TMR64_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42320E5CUL))
#define bM4_TMR64_STFLR_DIRF                            *((volatile unsigned int*)(0x42320E7CUL))
#define bM4_TMR64_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42320E80UL))
#define bM4_TMR64_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42320E84UL))
#define bM4_TMR64_HSTAR_HSTA2                           *((volatile unsigned int*)(0x42320E88UL))
#define bM4_TMR64_HSTAR_HSTA3                           *((volatile unsigned int*)(0x42320E8CUL))
#define bM4_TMR64_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42320E90UL))
#define bM4_TMR64_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42320E94UL))
#define bM4_TMR64_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42320E98UL))
#define bM4_TMR64_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42320E9CUL))
#define bM4_TMR64_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42320EA0UL))
#define bM4_TMR64_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42320EA4UL))
#define bM4_TMR64_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42320EA8UL))
#define bM4_TMR64_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42320EACUL))
#define bM4_TMR64_HSTAR_HSTA12                          *((volatile unsigned int*)(0x42320EB0UL))
#define bM4_TMR64_HSTAR_HSTA13                          *((volatile unsigned int*)(0x42320EB4UL))
#define bM4_TMR64_HSTAR_HSTA14                          *((volatile unsigned int*)(0x42320EB8UL))
#define bM4_TMR64_HSTAR_HSTA15                          *((volatile unsigned int*)(0x42320EBCUL))
#define bM4_TMR64_HSTAR_STARTS                          *((volatile unsigned int*)(0x42320EFCUL))
#define bM4_TMR64_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42320F00UL))
#define bM4_TMR64_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42320F04UL))
#define bM4_TMR64_HSTPR_HSTP2                           *((volatile unsigned int*)(0x42320F08UL))
#define bM4_TMR64_HSTPR_HSTP3                           *((volatile unsigned int*)(0x42320F0CUL))
#define bM4_TMR64_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42320F10UL))
#define bM4_TMR64_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42320F14UL))
#define bM4_TMR64_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42320F18UL))
#define bM4_TMR64_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42320F1CUL))
#define bM4_TMR64_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42320F20UL))
#define bM4_TMR64_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42320F24UL))
#define bM4_TMR64_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42320F28UL))
#define bM4_TMR64_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42320F2CUL))
#define bM4_TMR64_HSTPR_HSTP12                          *((volatile unsigned int*)(0x42320F30UL))
#define bM4_TMR64_HSTPR_HSTP13                          *((volatile unsigned int*)(0x42320F34UL))
#define bM4_TMR64_HSTPR_HSTP14                          *((volatile unsigned int*)(0x42320F38UL))
#define bM4_TMR64_HSTPR_HSTP15                          *((volatile unsigned int*)(0x42320F3CUL))
#define bM4_TMR64_HSTPR_STOPS                           *((volatile unsigned int*)(0x42320F7CUL))
