RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR64_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42320F80UL))
#define bM4_TMR64_HCLRR_HCLE1                           *((volatile unsigned int*)(0x42320F84UL))
#define bM4_TMR64_HCLRR_HCLE2                           *((volatile unsigned int*)(0x42320F88UL))
#define bM4_TMR64_HCLRR_HCLE3                           *((volatile unsigned int*)(0x42320F8CUL))
#define bM4_TMR64_HCLRR_HCLE4                           *((volatile unsigned int*)(0x42320F90UL))
#define bM4_TMR64_HCLRR_HCLE5                           *((volatile unsigned int*)(0x42320F94UL))
#define bM4_TMR64_HCLRR_HCLE6                           *((volatile unsigned int*)(0x42320F98UL))
#define bM4_TMR64_HCLRR_HCLE7                           *((volatile unsigned int*)(0x42320F9CUL))
#define bM4_TMR64_HCLRR_HCLE8                           *((volatile unsigned int*)(0x42320FA0UL))
#define bM4_TMR64_HCLRR_HCLE9                           *((volatile unsigned int*)(0x42320FA4UL))
#define bM4_TMR64_HCLRR_HCLE10                          *((volatile unsigned int*)(0x42320FA8UL))
#define bM4_TMR64_HCLRR_HCLE11                          *((volatile unsigned int*)(0x42320FACUL))
#define bM4_TMR64_HCLRR_HCLE12                          *((volatile unsigned int*)(0x42320FB0UL))
#define bM4_TMR64_HCLRR_HCLE13                          *((volatile unsigned int*)(0x42320FB4UL))
#define bM4_TMR64_HCLRR_HCLE14                          *((volatile unsigned int*)(0x42320FB8UL))
#define bM4_TMR64_HCLRR_HCLE15                          *((volatile unsigned int*)(0x42320FBCUL))
#define bM4_TMR64_HCLRR_CLEARS                          *((volatile unsigned int*)(0x42320FFCUL))
#define bM4_TMR64_HCPAR_HCPA0                           *((volatile unsigned int*)(0x42321000UL))
#define bM4_TMR64_HCPAR_HCPA1                           *((volatile unsigned int*)(0x42321004UL))
#define bM4_TMR64_HCPAR_HCPA2                           *((volatile unsigned int*)(0x42321008UL))
#define bM4_TMR64_HCPAR_HCPA3                           *((volatile unsigned int*)(0x4232100CUL))
#define bM4_TMR64_HCPAR_HCPA4                           *((volatile unsigned int*)(0x42321010UL))
#define bM4_TMR64_HCPAR_HCPA5                           *((volatile unsigned int*)(0x42321014UL))
#define bM4_TMR64_HCPAR_HCPA6                           *((volatile unsigned int*)(0x42321018UL))
#define bM4_TMR64_HCPAR_HCPA7                           *((volatile unsigned int*)(0x4232101CUL))
#define bM4_TMR64_HCPAR_HCPA8                           *((volatile unsigned int*)(0x42321020UL))
#define bM4_TMR64_HCPAR_HCPA9                           *((volatile unsigned int*)(0x42321024UL))
#define bM4_TMR64_HCPAR_HCPA10                          *((volatile unsigned int*)(0x42321028UL))
#define bM4_TMR64_HCPAR_HCPA11                          *((volatile unsigned int*)(0x4232102CUL))
#define bM4_TMR64_HCPAR_HCPA12                          *((volatile unsigned int*)(0x42321030UL))
#define bM4_TMR64_HCPAR_HCPA13                          *((volatile unsigned int*)(0x42321034UL))
#define bM4_TMR64_HCPAR_HCPA14                          *((volatile unsigned int*)(0x42321038UL))
#define bM4_TMR64_HCPAR_HCPA15                          *((volatile unsigned int*)(0x4232103CUL))
#define bM4_TMR64_HCPBR_HCPB0                           *((volatile unsigned int*)(0x42321080UL))
#define bM4_TMR64_HCPBR_HCPB1                           *((volatile unsigned int*)(0x42321084UL))
#define bM4_TMR64_HCPBR_HCPB2                           *((volatile unsigned int*)(0x42321088UL))
#define bM4_TMR64_HCPBR_HCPB3                           *((volatile unsigned int*)(0x4232108CUL))
#define bM4_TMR64_HCPBR_HCPB4                           *((volatile unsigned int*)(0x42321090UL))
#define bM4_TMR64_HCPBR_HCPB5                           *((volatile unsigned int*)(0x42321094UL))
#define bM4_TMR64_HCPBR_HCPB6                           *((volatile unsigned int*)(0x42321098UL))
#define bM4_TMR64_HCPBR_HCPB7                           *((volatile unsigned int*)(0x4232109CUL))
#define bM4_TMR64_HCPBR_HCPB8                           *((volatile unsigned int*)(0x423210A0UL))
#define bM4_TMR64_HCPBR_HCPB9                           *((volatile unsigned int*)(0x423210A4UL))
#define bM4_TMR64_HCPBR_HCPB10                          *((volatile unsigned int*)(0x423210A8UL))
#define bM4_TMR64_HCPBR_HCPB11                          *((volatile unsigned int*)(0x423210ACUL))
#define bM4_TMR64_HCPBR_HCPB12                          *((volatile unsigned int*)(0x423210B0UL))
#define bM4_TMR64_HCPBR_HCPB13                          *((volatile unsigned int*)(0x423210B4UL))
#define bM4_TMR64_HCPBR_HCPB14                          *((volatile unsigned int*)(0x423210B8UL))
#define bM4_TMR64_HCPBR_HCPB15                          *((volatile unsigned int*)(0x423210BCUL))
#define bM4_TMR64_HCUPR_HCUP0                           *((volatile unsigned int*)(0x42321100UL))
#define bM4_TMR64_HCUPR_HCUP1                           *((volatile unsigned int*)(0x42321104UL))
#define bM4_TMR64_HCUPR_HCUP2                           *((volatile unsigned int*)(0x42321108UL))
#define bM4_TMR64_HCUPR_HCUP3                           *((volatile unsigned int*)(0x4232110CUL))
#define bM4_TMR64_HCUPR_HCUP4                           *((volatile unsigned int*)(0x42321110UL))
#define bM4_TMR64_HCUPR_HCUP5                           *((volatile unsigned int*)(0x42321114UL))
#define bM4_TMR64_HCUPR_HCUP6                           *((volatile unsigned int*)(0x42321118UL))
#define bM4_TMR64_HCUPR_HCUP7                           *((volatile unsigned int*)(0x4232111CUL))
#define bM4_TMR64_HCUPR_HCUP8                           *((volatile unsigned int*)(0x42321120UL))
#define bM4_TMR64_HCUPR_HCUP9                           *((volatile unsigned int*)(0x42321124UL))
#define bM4_TMR64_HCUPR_HCUP10                          *((volatile unsigned int*)(0x42321128UL))
#define bM4_TMR64_HCUPR_HCUP11                          *((volatile unsigned int*)(0x4232112CUL))
#define bM4_TMR64_HCUPR_HCUP12                          *((volatile unsigned int*)(0x42321130UL))
#define bM4_TMR64_HCUPR_HCUP13                          *((volatile unsigned int*)(0x42321134UL))
#define bM4_TMR64_HCUPR_HCUP14                          *((volatile unsigned int*)(0x42321138UL))
#define bM4_TMR64_HCUPR_HCUP15                          *((volatile unsigned int*)(0x4232113CUL))
#define bM4_TMR64_HCUPR_HCUP16                          *((volatile unsigned int*)(0x42321140UL))
#define bM4_TMR64_HCUPR_HCUP17                          *((volatile unsigned int*)(0x42321144UL))
#define bM4_TMR64_HCUPR_HCUP18                          *((volatile unsigned int*)(0x42321148UL))
#define bM4_TMR64_HCUPR_HCUP19                          *((volatile unsigned int*)(0x4232114CUL))
#define bM4_TMR64_HCUPR_RESV                            *((volatile unsigned int*)(0x42321160UL))
#define bM4_TMR64_HCDOR_HCDO0                           *((volatile unsigned int*)(0x42321180UL))
#define bM4_TMR64_HCDOR_HCDO1                           *((volatile unsigned int*)(0x42321184UL))
#define bM4_TMR64_HCDOR_HCDO2                           *((volatile unsigned int*)(0x42321188UL))
#define bM4_TMR64_HCDOR_HCDO3                           *((volatile unsigned int*)(0x4232118CUL))
#define bM4_TMR64_HCDOR_HCDO4                           *((volatile unsigned int*)(0x42321190UL))
#define bM4_TMR64_HCDOR_HCDO5                           *((volatile unsigned int*)(0x42321194UL))
#define bM4_TMR64_HCDOR_HCDO6                           *((volatile unsigned int*)(0x42321198UL))
#define bM4_TMR64_HCDOR_HCDO7                           *((volatile unsigned int*)(0x4232119CUL))
#define bM4_TMR64_HCDOR_HCDO8                           *((volatile unsigned int*)(0x423211A0UL))
#define bM4_TMR64_HCDOR_HCDO9                           *((volatile unsigned int*)(0x423211A4UL))
#define bM4_TMR64_HCDOR_HCDO10                          *((volatile unsigned int*)(0x423211A8UL))
#define bM4_TMR64_HCDOR_HCDO11                          *((volatile unsigned int*)(0x423211ACUL))
#define bM4_TMR64_HCDOR_HCDO12                          *((volatile unsigned int*)(0x423211B0UL))
#define bM4_TMR64_HCDOR_HCDO13                          *((volatile unsigned int*)(0x423211B4UL))
#define bM4_TMR64_HCDOR_HCDO14                          *((volatile unsigned int*)(0x423211B8UL))
#define bM4_TMR64_HCDOR_HCDO15                          *((volatile unsigned int*)(0x423211BCUL))
#define bM4_TMR64_HCDOR_HCDO16                          *((volatile unsigned int*)(0x423211C0UL))
#define bM4_TMR64_HCDOR_HCDO17                          *((volatile unsigned int*)(0x423211C4UL))
#define bM4_TMR64_HCDOR_HCDO18                          *((volatile unsigned int*)(0x423211C8UL))
#define bM4_TMR64_HCDOR_HCDO19                          *((volatile unsigned int*)(0x423211CCUL))
#define bM4_TMR64_HCDOR_RESV                            *((volatile unsigned int*)(0x423211E0UL))
#define bM4_TMR64_SSTAR_SSTA0                           *((volatile unsigned int*)(0x42327E80UL))
#define bM4_TMR64_SSTAR_SSTA1                           *((volatile unsigned int*)(0x42327E84UL))
#define bM4_TMR64_SSTAR_SSTA2                           *((volatile unsigned int*)(0x42327E88UL))
#define bM4_TMR64_SSTAR_SSTA3                           *((volatile unsigned int*)(0x42327E8CUL))
#define bM4_TMR64_SSTAR_SSTA4                           *((volatile unsigned int*)(0x42327E90UL))
#define bM4_TMR64_SSTAR_SSTA5                           *((volatile unsigned int*)(0x42327E94UL))
#define bM4_TMR64_SSTAR_SSTA6                           *((volatile unsigned int*)(0x42327E98UL))
#define bM4_TMR64_SSTAR_SSTA7                           *((volatile unsigned int*)(0x42327E9CUL))
#define bM4_TMR64_SSTAR_SSTA8                           *((volatile unsigned int*)(0x42327EA0UL))
#define bM4_TMR64_SSTAR_SSTA9                           *((volatile unsigned int*)(0x42327EA4UL))
#define bM4_TMR64_SSTAR_RESV                            *((volatile unsigned int*)(0x42327EE0UL))
#define bM4_TMR64_SSTPR_SSTP0                           *((volatile unsigned int*)(0x42327F00UL))
#define bM4_TMR64_SSTPR_SSTP1                           *((volatile unsigned int*)(0x42327F04UL))
#define bM4_TMR64_SSTPR_SSTP2                           *((volatile unsigned int*)(0x42327F08UL))
#define bM4_TMR64_SSTPR_SSTP3                           *((volatile unsigned int*)(0x42327F0CUL))
#define bM4_TMR64_SSTPR_SSTP4                           *((volatile unsigned int*)(0x42327F10UL))
#define bM4_TMR64_SSTPR_SSTP5                           *((volatile unsigned int*)(0x42327F14UL))
#define bM4_TMR64_SSTPR_SSTP6                           *((volatile unsigned int*)(0x42327F18UL))
#define bM4_TMR64_SSTPR_SSTP7                           *((volatile unsigned int*)(0x42327F1CUL))
#define bM4_TMR64_SSTPR_SSTP8                           *((volatile unsigned int*)(0x42327F20UL))
#define bM4_TMR64_SSTPR_SSTP9                           *((volatile unsigned int*)(0x42327F24UL))
#define bM4_TMR64_SSTPR_RESV                            *((volatile unsigned int*)(0x42327F60UL))
#define bM4_TMR64_SCLRR_SCLE0                           *((volatile unsigned int*)(0x42327F80UL))
#define bM4_TMR64_SCLRR_SCLE1                           *((volatile unsigned int*)(0x42327F84UL))
#define bM4_TMR64_SCLRR_SCLE2                           *((volatile unsigned int*)(0x42327F88UL))
#define bM4_TMR64_SCLRR_SCLE3                           *((volatile unsigned int*)(0x42327F8CUL))
#define bM4_TMR64_SCLRR_SCLE4                           *((volatile unsigned int*)(0x42327F90UL))
#define bM4_TMR64_SCLRR_SCLE5                           *((volatile unsigned int*)(0x42327F94UL))
#define bM4_TMR64_SCLRR_SCLE6                           *((volatile unsigned int*)(0x42327F98UL))
#define bM4_TMR64_SCLRR_SCLE7                           *((volatile unsigned int*)(0x42327F9CUL))
#define bM4_TMR64_SCLRR_SCLE8                           *((volatile unsigned int*)(0x42327FA0UL))
#define bM4_TMR64_SCLRR_SCLE9                           *((volatile unsigned int*)(0x42327FA4UL))
#define bM4_TMR64_SCLRR_RESV                            *((volatile unsigned int*)(0x42327FE0UL))
#define bM4_TMR65_GCONR_START                           *((volatile unsigned int*)(0x42328A00UL))
#define bM4_TMR65_GCONR_MODE0                           *((volatile unsigned int*)(0x42328A04UL))
#define bM4_TMR65_GCONR_MODE1                           *((volatile unsigned int*)(0x42328A08UL))
#define bM4_TMR65_GCONR_MODE2                           *((volatile unsigned int*)(0x42328A0CUL))
#define bM4_TMR65_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42328A10UL))
#define bM4_TMR65_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42328A14UL))
#define bM4_TMR65_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42328A18UL))
#define bM4_TMR65_GCONR_DIR                             *((volatile unsigned int*)(0x42328A20UL))
#define bM4_TMR65_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42328A40UL))
#define bM4_TMR65_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42328A44UL))
#define bM4_TMR65_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42328A48UL))
#define bM4_TMR65_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42328A4CUL))
#define bM4_TMR65_GCONR_RESV                            *((volatile unsigned int*)(0x42328A60UL))
#define bM4_TMR65_ICONR_INTENA                          *((volatile unsigned int*)(0x42328A80UL))
#define bM4_TMR65_ICONR_INTENB                          *((volatile unsigned int*)(0x42328A84UL))
#define bM4_TMR65_ICONR_INTENC                          *((volatile unsigned int*)(0x42328A88UL))
#define bM4_TMR65_ICONR_INTEND                          *((volatile unsigned int*)(0x42328A8CUL))
#define bM4_TMR65_ICONR_INTENE                          *((volatile unsigned int*)(0x42328A90UL))
#define bM4_TMR65_ICONR_INTENF                          *((volatile unsigned int*)(0x42328A94UL))
#define bM4_TMR65_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42328A98UL))
#define bM4_TMR65_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42328A9CUL))
#define bM4_TMR65_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42328AA0UL))
#define bM4_TMR65_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42328AC0UL))
#define bM4_TMR65_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42328AC4UL))
#define bM4_TMR65_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42328AC8UL))
#define bM4_TMR65_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42328ACCUL))
#define bM4_TMR65_ICONR_RESV                            *((volatile unsigned int*)(0x42328AE0UL))
#define bM4_TMR65_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42328B00UL))
#define bM4_TMR65_PCONR_STACA                           *((volatile unsigned int*)(0x42328B04UL))
#define bM4_TMR65_PCONR_STPCA                           *((volatile unsigned int*)(0x42328B08UL))
#define bM4_TMR65_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42328B0CUL))
#define bM4_TMR65_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42328B10UL))
#define bM4_TMR65_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42328B14UL))
#define bM4_TMR65_PCONR_PERCA0                          *((volatile unsigned int*)(0x42328B18UL))
#define bM4_TMR65_PCONR_PERCA1                          *((volatile unsigned int*)(0x42328B1CUL))
#define bM4_TMR65_PCONR_OUTENA                          *((volatile unsigned int*)(0x42328B20UL))
#define bM4_TMR65_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42328B24UL))
#define bM4_TMR65_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42328B28UL))
#define bM4_TMR65_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42328B2CUL))
#define bM4_TMR65_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42328B30UL))
#define bM4_TMR65_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42328B40UL))
#define bM4_TMR65_PCONR_STACB                           *((volatile unsigned int*)(0x42328B44UL))
#define bM4_TMR65_PCONR_STPCB                           *((volatile unsigned int*)(0x42328B48UL))
#define bM4_TMR65_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42328B4CUL))
#define bM4_TMR65_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42328B50UL))
#define bM4_TMR65_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42328B54UL))
#define bM4_TMR65_PCONR_PERCB0                          *((volatile unsigned int*)(0x42328B58UL))
#define bM4_TMR65_PCONR_PERCB1                          *((volatile unsigned int*)(0x42328B5CUL))
#define bM4_TMR65_PCONR_OUTENB                          *((volatile unsigned int*)(0x42328B60UL))
#define bM4_TMR65_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42328B64UL))
#define bM4_TMR65_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42328B68UL))
#define bM4_TMR65_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42328B6CUL))
#define bM4_TMR65_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42328B70UL))
#define bM4_TMR65_BCONR_BENA                            *((volatile unsigned int*)(0x42328B80UL))
#define bM4_TMR65_BCONR_BSEA                            *((volatile unsigned int*)(0x42328B84UL))
#define bM4_TMR65_BCONR_BENB                            *((volatile unsigned int*)(0x42328B88UL))
#define bM4_TMR65_BCONR_BSEB                            *((volatile unsigned int*)(0x42328B8CUL))
#define bM4_TMR65_BCONR_BENP                            *((volatile unsigned int*)(0x42328BA0UL))
#define bM4_TMR65_BCONR_BSEP                            *((volatile unsigned int*)(0x42328BA4UL))
#define bM4_TMR65_BCONR_BENSPA                          *((volatile unsigned int*)(0x42328BC0UL))
#define bM4_TMR65_BCONR_BSESPA                          *((volatile unsigned int*)(0x42328BC4UL))
#define bM4_TMR65_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42328BD0UL))
#define bM4_TMR65_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42328BD4UL))
#define bM4_TMR65_BCONR_BENSPB                          *((volatile unsigned int*)(0x42328BE0UL))
#define bM4_TMR65_BCONR_BSESPB                          *((volatile unsigned int*)(0x42328BE4UL))
#define bM4_TMR65_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42328BF0UL))
#define bM4_TMR65_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42328BF4UL))
#define bM4_TMR65_DCONR_DTCEN                           *((volatile unsigned int*)(0x42328C00UL))
#define bM4_TMR65_DCONR_DTBENU                          *((volatile unsigned int*)(0x42328C10UL))
#define bM4_TMR65_DCONR_DTBEND                          *((volatile unsigned int*)(0x42328C14UL))
#define bM4_TMR65_DCONR_SEPA                            *((volatile unsigned int*)(0x42328C20UL))
#define bM4_TMR65_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42328D00UL))
#define bM4_TMR65_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42328D04UL))
#define bM4_TMR65_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42328D08UL))
#define bM4_TMR65_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42328D10UL))
#define bM4_TMR65_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42328D14UL))
#define bM4_TMR65_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42328D18UL))
#define bM4_TMR65_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42328D40UL))
#define bM4_TMR65_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42328D44UL))
#define bM4_TMR65_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42328D48UL))
#define bM4_TMR65_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42328D50UL))
#define bM4_TMR65_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42328D54UL))
#define bM4_TMR65_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42328D58UL))
#define bM4_TMR65_FCONR_NOFIENTC                        *((volatile unsigned int*)(0x42328D60UL))
#define bM4_TMR65_FCONR_NOFICKTC0                       *((volatile unsigned int*)(0x42328D64UL))
#define bM4_TMR65_FCONR_NOFICKTC1                       *((volatile unsigned int*)(0x42328D68UL))
#define bM4_TMR65_FCONR_NOFIENTD                        *((volatile unsigned int*)(0x42328D70UL))
#define bM4_TMR65_FCONR_NOFICKTD0                       *((volatile unsigned int*)(0x42328D74UL))
#define bM4_TMR65_FCONR_NOFICKTD1                       *((volatile unsigned int*)(0x42328D78UL))
#define bM4_TMR65_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42328DA0UL))
#define bM4_TMR65_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42328DA4UL))
#define bM4_TMR65_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42328DC0UL))
#define bM4_TMR65_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42328DC4UL))
#define bM4_TMR65_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42328DC8UL))
#define bM4_TMR65_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42328DCCUL))
#define bM4_TMR65_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42328DD0UL))
#define bM4_TMR65_VPERR_RESV                            *((volatile unsigned int*)(0x42328DE0UL))
#define bM4_TMR65_STFLR_CMAF                            *((volatile unsigned int*)(0x42328E00UL))
#define bM4_TMR65_STFLR_CMBF                            *((volatile unsigned int*)(0x42328E04UL))
#define bM4_TMR65_STFLR_CMCF                            *((volatile unsigned int*)(0x42328E08UL))
#define bM4_TMR65_STFLR_CMDF                            *((volatile unsigned int*)(0x42328E0CUL))
#define bM4_TMR65_STFLR_CMEF                            *((volatile unsigned int*)(0x42328E10UL))
#define bM4_TMR65_STFLR_CMFF                            *((volatile unsigned int*)(0x42328E14UL))
#define bM4_TMR65_STFLR_OVFF                            *((volatile unsigned int*)(0x42328E18UL))
#define bM4_TMR65_STFLR_UDFF                            *((volatile unsigned int*)(0x42328E1CUL))
#define bM4_TMR65_STFLR_DTEF                            *((volatile unsigned int*)(0x42328E20UL))
#define bM4_TMR65_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42328E24UL))
#define bM4_TMR65_STFLR_CMSADF                          *((volatile unsigned int*)(0x42328E28UL))
#define bM4_TMR65_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42328E2CUL))
#define bM4_TMR65_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42328E30UL))
#define bM4_TMR65_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42328E54UL))
#define bM4_TMR65_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42328E58UL))
#define bM4_TMR65_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42328E5CUL))
#define bM4_TMR65_STFLR_DIRF                            *((volatile unsigned int*)(0x42328E7CUL))
#define bM4_TMR65_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42328E80UL))
#define bM4_TMR65_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42328E84UL))
#define bM4_TMR65_HSTAR_HSTA2                           *((volatile unsigned int*)(0x42328E88UL))
#define bM4_TMR65_HSTAR_HSTA3                           *((volatile unsigned int*)(0x42328E8CUL))
#define bM4_TMR65_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42328E90UL))
#define bM4_TMR65_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42328E94UL))
