RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR65_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42328E98UL))
#define bM4_TMR65_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42328E9CUL))
#define bM4_TMR65_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42328EA0UL))
#define bM4_TMR65_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42328EA4UL))
#define bM4_TMR65_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42328EA8UL))
#define bM4_TMR65_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42328EACUL))
#define bM4_TMR65_HSTAR_HSTA12                          *((volatile unsigned int*)(0x42328EB0UL))
#define bM4_TMR65_HSTAR_HSTA13                          *((volatile unsigned int*)(0x42328EB4UL))
#define bM4_TMR65_HSTAR_HSTA14                          *((volatile unsigned int*)(0x42328EB8UL))
#define bM4_TMR65_HSTAR_HSTA15                          *((volatile unsigned int*)(0x42328EBCUL))
#define bM4_TMR65_HSTAR_STARTS                          *((volatile unsigned int*)(0x42328EFCUL))
#define bM4_TMR65_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42328F00UL))
#define bM4_TMR65_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42328F04UL))
#define bM4_TMR65_HSTPR_HSTP2                           *((volatile unsigned int*)(0x42328F08UL))
#define bM4_TMR65_HSTPR_HSTP3                           *((volatile unsigned int*)(0x42328F0CUL))
#define bM4_TMR65_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42328F10UL))
#define bM4_TMR65_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42328F14UL))
#define bM4_TMR65_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42328F18UL))
#define bM4_TMR65_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42328F1CUL))
#define bM4_TMR65_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42328F20UL))
#define bM4_TMR65_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42328F24UL))
#define bM4_TMR65_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42328F28UL))
#define bM4_TMR65_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42328F2CUL))
#define bM4_TMR65_HSTPR_HSTP12                          *((volatile unsigned int*)(0x42328F30UL))
#define bM4_TMR65_HSTPR_HSTP13                          *((volatile unsigned int*)(0x42328F34UL))
#define bM4_TMR65_HSTPR_HSTP14                          *((volatile unsigned int*)(0x42328F38UL))
#define bM4_TMR65_HSTPR_HSTP15                          *((volatile unsigned int*)(0x42328F3CUL))
#define bM4_TMR65_HSTPR_STOPS                           *((volatile unsigned int*)(0x42328F7CUL))
#define bM4_TMR65_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42328F80UL))
#define bM4_TMR65_HCLRR_HCLE1                           *((volatile unsigned int*)(0x42328F84UL))
#define bM4_TMR65_HCLRR_HCLE2                           *((volatile unsigned int*)(0x42328F88UL))
#define bM4_TMR65_HCLRR_HCLE3                           *((volatile unsigned int*)(0x42328F8CUL))
#define bM4_TMR65_HCLRR_HCLE4                           *((volatile unsigned int*)(0x42328F90UL))
#define bM4_TMR65_HCLRR_HCLE5                           *((volatile unsigned int*)(0x42328F94UL))
#define bM4_TMR65_HCLRR_HCLE6                           *((volatile unsigned int*)(0x42328F98UL))
#define bM4_TMR65_HCLRR_HCLE7                           *((volatile unsigned int*)(0x42328F9CUL))
#define bM4_TMR65_HCLRR_HCLE8                           *((volatile unsigned int*)(0x42328FA0UL))
#define bM4_TMR65_HCLRR_HCLE9                           *((volatile unsigned int*)(0x42328FA4UL))
#define bM4_TMR65_HCLRR_HCLE10                          *((volatile unsigned int*)(0x42328FA8UL))
#define bM4_TMR65_HCLRR_HCLE11                          *((volatile unsigned int*)(0x42328FACUL))
#define bM4_TMR65_HCLRR_HCLE12                          *((volatile unsigned int*)(0x42328FB0UL))
#define bM4_TMR65_HCLRR_HCLE13                          *((volatile unsigned int*)(0x42328FB4UL))
#define bM4_TMR65_HCLRR_HCLE14                          *((volatile unsigned int*)(0x42328FB8UL))
#define bM4_TMR65_HCLRR_HCLE15                          *((volatile unsigned int*)(0x42328FBCUL))
#define bM4_TMR65_HCLRR_CLEARS                          *((volatile unsigned int*)(0x42328FFCUL))
#define bM4_TMR65_HCPAR_HCPA0                           *((volatile unsigned int*)(0x42329000UL))
#define bM4_TMR65_HCPAR_HCPA1                           *((volatile unsigned int*)(0x42329004UL))
#define bM4_TMR65_HCPAR_HCPA2                           *((volatile unsigned int*)(0x42329008UL))
#define bM4_TMR65_HCPAR_HCPA3                           *((volatile unsigned int*)(0x4232900CUL))
#define bM4_TMR65_HCPAR_HCPA4                           *((volatile unsigned int*)(0x42329010UL))
#define bM4_TMR65_HCPAR_HCPA5                           *((volatile unsigned int*)(0x42329014UL))
#define bM4_TMR65_HCPAR_HCPA6                           *((volatile unsigned int*)(0x42329018UL))
#define bM4_TMR65_HCPAR_HCPA7                           *((volatile unsigned int*)(0x4232901CUL))
#define bM4_TMR65_HCPAR_HCPA8                           *((volatile unsigned int*)(0x42329020UL))
#define bM4_TMR65_HCPAR_HCPA9                           *((volatile unsigned int*)(0x42329024UL))
#define bM4_TMR65_HCPAR_HCPA10                          *((volatile unsigned int*)(0x42329028UL))
#define bM4_TMR65_HCPAR_HCPA11                          *((volatile unsigned int*)(0x4232902CUL))
#define bM4_TMR65_HCPAR_HCPA12                          *((volatile unsigned int*)(0x42329030UL))
#define bM4_TMR65_HCPAR_HCPA13                          *((volatile unsigned int*)(0x42329034UL))
#define bM4_TMR65_HCPAR_HCPA14                          *((volatile unsigned int*)(0x42329038UL))
#define bM4_TMR65_HCPAR_HCPA15                          *((volatile unsigned int*)(0x4232903CUL))
#define bM4_TMR65_HCPBR_HCPB0                           *((volatile unsigned int*)(0x42329080UL))
#define bM4_TMR65_HCPBR_HCPB1                           *((volatile unsigned int*)(0x42329084UL))
#define bM4_TMR65_HCPBR_HCPB2                           *((volatile unsigned int*)(0x42329088UL))
#define bM4_TMR65_HCPBR_HCPB3                           *((volatile unsigned int*)(0x4232908CUL))
#define bM4_TMR65_HCPBR_HCPB4                           *((volatile unsigned int*)(0x42329090UL))
#define bM4_TMR65_HCPBR_HCPB5                           *((volatile unsigned int*)(0x42329094UL))
#define bM4_TMR65_HCPBR_HCPB6                           *((volatile unsigned int*)(0x42329098UL))
#define bM4_TMR65_HCPBR_HCPB7                           *((volatile unsigned int*)(0x4232909CUL))
#define bM4_TMR65_HCPBR_HCPB8                           *((volatile unsigned int*)(0x423290A0UL))
#define bM4_TMR65_HCPBR_HCPB9                           *((volatile unsigned int*)(0x423290A4UL))
#define bM4_TMR65_HCPBR_HCPB10                          *((volatile unsigned int*)(0x423290A8UL))
#define bM4_TMR65_HCPBR_HCPB11                          *((volatile unsigned int*)(0x423290ACUL))
#define bM4_TMR65_HCPBR_HCPB12                          *((volatile unsigned int*)(0x423290B0UL))
#define bM4_TMR65_HCPBR_HCPB13                          *((volatile unsigned int*)(0x423290B4UL))
#define bM4_TMR65_HCPBR_HCPB14                          *((volatile unsigned int*)(0x423290B8UL))
#define bM4_TMR65_HCPBR_HCPB15                          *((volatile unsigned int*)(0x423290BCUL))
#define bM4_TMR65_HCUPR_HCUP0                           *((volatile unsigned int*)(0x42329100UL))
#define bM4_TMR65_HCUPR_HCUP1                           *((volatile unsigned int*)(0x42329104UL))
#define bM4_TMR65_HCUPR_HCUP2                           *((volatile unsigned int*)(0x42329108UL))
#define bM4_TMR65_HCUPR_HCUP3                           *((volatile unsigned int*)(0x4232910CUL))
#define bM4_TMR65_HCUPR_HCUP4                           *((volatile unsigned int*)(0x42329110UL))
#define bM4_TMR65_HCUPR_HCUP5                           *((volatile unsigned int*)(0x42329114UL))
#define bM4_TMR65_HCUPR_HCUP6                           *((volatile unsigned int*)(0x42329118UL))
#define bM4_TMR65_HCUPR_HCUP7                           *((volatile unsigned int*)(0x4232911CUL))
#define bM4_TMR65_HCUPR_HCUP8                           *((volatile unsigned int*)(0x42329120UL))
#define bM4_TMR65_HCUPR_HCUP9                           *((volatile unsigned int*)(0x42329124UL))
#define bM4_TMR65_HCUPR_HCUP10                          *((volatile unsigned int*)(0x42329128UL))
#define bM4_TMR65_HCUPR_HCUP11                          *((volatile unsigned int*)(0x4232912CUL))
#define bM4_TMR65_HCUPR_HCUP12                          *((volatile unsigned int*)(0x42329130UL))
#define bM4_TMR65_HCUPR_HCUP13                          *((volatile unsigned int*)(0x42329134UL))
#define bM4_TMR65_HCUPR_HCUP14                          *((volatile unsigned int*)(0x42329138UL))
#define bM4_TMR65_HCUPR_HCUP15                          *((volatile unsigned int*)(0x4232913CUL))
#define bM4_TMR65_HCUPR_HCUP16                          *((volatile unsigned int*)(0x42329140UL))
#define bM4_TMR65_HCUPR_HCUP17                          *((volatile unsigned int*)(0x42329144UL))
#define bM4_TMR65_HCUPR_HCUP18                          *((volatile unsigned int*)(0x42329148UL))
#define bM4_TMR65_HCUPR_HCUP19                          *((volatile unsigned int*)(0x4232914CUL))
#define bM4_TMR65_HCUPR_RESV                            *((volatile unsigned int*)(0x42329160UL))
#define bM4_TMR65_HCDOR_HCDO0                           *((volatile unsigned int*)(0x42329180UL))
#define bM4_TMR65_HCDOR_HCDO1                           *((volatile unsigned int*)(0x42329184UL))
#define bM4_TMR65_HCDOR_HCDO2                           *((volatile unsigned int*)(0x42329188UL))
#define bM4_TMR65_HCDOR_HCDO3                           *((volatile unsigned int*)(0x4232918CUL))
#define bM4_TMR65_HCDOR_HCDO4                           *((volatile unsigned int*)(0x42329190UL))
#define bM4_TMR65_HCDOR_HCDO5                           *((volatile unsigned int*)(0x42329194UL))
#define bM4_TMR65_HCDOR_HCDO6                           *((volatile unsigned int*)(0x42329198UL))
#define bM4_TMR65_HCDOR_HCDO7                           *((volatile unsigned int*)(0x4232919CUL))
#define bM4_TMR65_HCDOR_HCDO8                           *((volatile unsigned int*)(0x423291A0UL))
#define bM4_TMR65_HCDOR_HCDO9                           *((volatile unsigned int*)(0x423291A4UL))
#define bM4_TMR65_HCDOR_HCDO10                          *((volatile unsigned int*)(0x423291A8UL))
#define bM4_TMR65_HCDOR_HCDO11                          *((volatile unsigned int*)(0x423291ACUL))
#define bM4_TMR65_HCDOR_HCDO12                          *((volatile unsigned int*)(0x423291B0UL))
#define bM4_TMR65_HCDOR_HCDO13                          *((volatile unsigned int*)(0x423291B4UL))
#define bM4_TMR65_HCDOR_HCDO14                          *((volatile unsigned int*)(0x423291B8UL))
#define bM4_TMR65_HCDOR_HCDO15                          *((volatile unsigned int*)(0x423291BCUL))
#define bM4_TMR65_HCDOR_HCDO16                          *((volatile unsigned int*)(0x423291C0UL))
#define bM4_TMR65_HCDOR_HCDO17                          *((volatile unsigned int*)(0x423291C4UL))
#define bM4_TMR65_HCDOR_HCDO18                          *((volatile unsigned int*)(0x423291C8UL))
#define bM4_TMR65_HCDOR_HCDO19                          *((volatile unsigned int*)(0x423291CCUL))
#define bM4_TMR65_HCDOR_RESV                            *((volatile unsigned int*)(0x423291E0UL))
#define bM4_TMR65_SSTAR_SSTA0                           *((volatile unsigned int*)(0x4232FE80UL))
#define bM4_TMR65_SSTAR_SSTA1                           *((volatile unsigned int*)(0x4232FE84UL))
#define bM4_TMR65_SSTAR_SSTA2                           *((volatile unsigned int*)(0x4232FE88UL))
#define bM4_TMR65_SSTAR_SSTA3                           *((volatile unsigned int*)(0x4232FE8CUL))
#define bM4_TMR65_SSTAR_SSTA4                           *((volatile unsigned int*)(0x4232FE90UL))
#define bM4_TMR65_SSTAR_SSTA5                           *((volatile unsigned int*)(0x4232FE94UL))
#define bM4_TMR65_SSTAR_SSTA6                           *((volatile unsigned int*)(0x4232FE98UL))
#define bM4_TMR65_SSTAR_SSTA7                           *((volatile unsigned int*)(0x4232FE9CUL))
#define bM4_TMR65_SSTAR_SSTA8                           *((volatile unsigned int*)(0x4232FEA0UL))
#define bM4_TMR65_SSTAR_SSTA9                           *((volatile unsigned int*)(0x4232FEA4UL))
#define bM4_TMR65_SSTAR_RESV                            *((volatile unsigned int*)(0x4232FEE0UL))
#define bM4_TMR65_SSTPR_SSTP0                           *((volatile unsigned int*)(0x4232FF00UL))
#define bM4_TMR65_SSTPR_SSTP1                           *((volatile unsigned int*)(0x4232FF04UL))
#define bM4_TMR65_SSTPR_SSTP2                           *((volatile unsigned int*)(0x4232FF08UL))
#define bM4_TMR65_SSTPR_SSTP3                           *((volatile unsigned int*)(0x4232FF0CUL))
#define bM4_TMR65_SSTPR_SSTP4                           *((volatile unsigned int*)(0x4232FF10UL))
#define bM4_TMR65_SSTPR_SSTP5                           *((volatile unsigned int*)(0x4232FF14UL))
#define bM4_TMR65_SSTPR_SSTP6                           *((volatile unsigned int*)(0x4232FF18UL))
#define bM4_TMR65_SSTPR_SSTP7                           *((volatile unsigned int*)(0x4232FF1CUL))
#define bM4_TMR65_SSTPR_SSTP8                           *((volatile unsigned int*)(0x4232FF20UL))
#define bM4_TMR65_SSTPR_SSTP9                           *((volatile unsigned int*)(0x4232FF24UL))
#define bM4_TMR65_SSTPR_RESV                            *((volatile unsigned int*)(0x4232FF60UL))
#define bM4_TMR65_SCLRR_SCLE0                           *((volatile unsigned int*)(0x4232FF80UL))
#define bM4_TMR65_SCLRR_SCLE1                           *((volatile unsigned int*)(0x4232FF84UL))
#define bM4_TMR65_SCLRR_SCLE2                           *((volatile unsigned int*)(0x4232FF88UL))
#define bM4_TMR65_SCLRR_SCLE3                           *((volatile unsigned int*)(0x4232FF8CUL))
#define bM4_TMR65_SCLRR_SCLE4                           *((volatile unsigned int*)(0x4232FF90UL))
#define bM4_TMR65_SCLRR_SCLE5                           *((volatile unsigned int*)(0x4232FF94UL))
#define bM4_TMR65_SCLRR_SCLE6                           *((volatile unsigned int*)(0x4232FF98UL))
#define bM4_TMR65_SCLRR_SCLE7                           *((volatile unsigned int*)(0x4232FF9CUL))
#define bM4_TMR65_SCLRR_SCLE8                           *((volatile unsigned int*)(0x4232FFA0UL))
#define bM4_TMR65_SCLRR_SCLE9                           *((volatile unsigned int*)(0x4232FFA4UL))
#define bM4_TMR65_SCLRR_RESV                            *((volatile unsigned int*)(0x4232FFE0UL))
#define bM4_TMR66_GCONR_START                           *((volatile unsigned int*)(0x42330A00UL))
#define bM4_TMR66_GCONR_MODE0                           *((volatile unsigned int*)(0x42330A04UL))
#define bM4_TMR66_GCONR_MODE1                           *((volatile unsigned int*)(0x42330A08UL))
#define bM4_TMR66_GCONR_MODE2                           *((volatile unsigned int*)(0x42330A0CUL))
#define bM4_TMR66_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42330A10UL))
#define bM4_TMR66_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42330A14UL))
#define bM4_TMR66_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42330A18UL))
#define bM4_TMR66_GCONR_DIR                             *((volatile unsigned int*)(0x42330A20UL))
#define bM4_TMR66_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42330A40UL))
#define bM4_TMR66_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42330A44UL))
#define bM4_TMR66_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42330A48UL))
#define bM4_TMR66_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42330A4CUL))
#define bM4_TMR66_GCONR_RESV                            *((volatile unsigned int*)(0x42330A60UL))
#define bM4_TMR66_ICONR_INTENA                          *((volatile unsigned int*)(0x42330A80UL))
#define bM4_TMR66_ICONR_INTENB                          *((volatile unsigned int*)(0x42330A84UL))
#define bM4_TMR66_ICONR_INTENC                          *((volatile unsigned int*)(0x42330A88UL))
#define bM4_TMR66_ICONR_INTEND                          *((volatile unsigned int*)(0x42330A8CUL))
#define bM4_TMR66_ICONR_INTENE                          *((volatile unsigned int*)(0x42330A90UL))
#define bM4_TMR66_ICONR_INTENF                          *((volatile unsigned int*)(0x42330A94UL))
#define bM4_TMR66_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42330A98UL))
#define bM4_TMR66_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42330A9CUL))
#define bM4_TMR66_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42330AA0UL))
#define bM4_TMR66_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42330AC0UL))
#define bM4_TMR66_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42330AC4UL))
#define bM4_TMR66_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42330AC8UL))
#define bM4_TMR66_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42330ACCUL))
#define bM4_TMR66_ICONR_RESV                            *((volatile unsigned int*)(0x42330AE0UL))
#define bM4_TMR66_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42330B00UL))
#define bM4_TMR66_PCONR_STACA                           *((volatile unsigned int*)(0x42330B04UL))
#define bM4_TMR66_PCONR_STPCA                           *((volatile unsigned int*)(0x42330B08UL))
#define bM4_TMR66_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42330B0CUL))
#define bM4_TMR66_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42330B10UL))
#define bM4_TMR66_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42330B14UL))
#define bM4_TMR66_PCONR_PERCA0                          *((volatile unsigned int*)(0x42330B18UL))
#define bM4_TMR66_PCONR_PERCA1                          *((volatile unsigned int*)(0x42330B1CUL))
#define bM4_TMR66_PCONR_OUTENA                          *((volatile unsigned int*)(0x42330B20UL))
#define bM4_TMR66_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42330B24UL))
#define bM4_TMR66_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42330B28UL))
#define bM4_TMR66_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42330B2CUL))
#define bM4_TMR66_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42330B30UL))
#define bM4_TMR66_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42330B40UL))
#define bM4_TMR66_PCONR_STACB                           *((volatile unsigned int*)(0x42330B44UL))
#define bM4_TMR66_PCONR_STPCB                           *((volatile unsigned int*)(0x42330B48UL))
#define bM4_TMR66_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42330B4CUL))
#define bM4_TMR66_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42330B50UL))
#define bM4_TMR66_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42330B54UL))
#define bM4_TMR66_PCONR_PERCB0                          *((volatile unsigned int*)(0x42330B58UL))
#define bM4_TMR66_PCONR_PERCB1                          *((volatile unsigned int*)(0x42330B5CUL))
#define bM4_TMR66_PCONR_OUTENB                          *((volatile unsigned int*)(0x42330B60UL))
#define bM4_TMR66_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42330B64UL))
#define bM4_TMR66_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42330B68UL))
#define bM4_TMR66_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42330B6CUL))
#define bM4_TMR66_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42330B70UL))
#define bM4_TMR66_BCONR_BENA                            *((volatile unsigned int*)(0x42330B80UL))
#define bM4_TMR66_BCONR_BSEA                            *((volatile unsigned int*)(0x42330B84UL))
#define bM4_TMR66_BCONR_BENB                            *((volatile unsigned int*)(0x42330B88UL))
#define bM4_TMR66_BCONR_BSEB                            *((volatile unsigned int*)(0x42330B8CUL))
#define bM4_TMR66_BCONR_BENP                            *((volatile unsigned int*)(0x42330BA0UL))
#define bM4_TMR66_BCONR_BSEP                            *((volatile unsigned int*)(0x42330BA4UL))
#define bM4_TMR66_BCONR_BENSPA                          *((volatile unsigned int*)(0x42330BC0UL))
#define bM4_TMR66_BCONR_BSESPA                          *((volatile unsigned int*)(0x42330BC4UL))
#define bM4_TMR66_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42330BD0UL))
#define bM4_TMR66_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42330BD4UL))
#define bM4_TMR66_BCONR_BENSPB                          *((volatile unsigned int*)(0x42330BE0UL))
#define bM4_TMR66_BCONR_BSESPB                          *((volatile unsigned int*)(0x42330BE4UL))
#define bM4_TMR66_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42330BF0UL))
#define bM4_TMR66_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42330BF4UL))
#define bM4_TMR66_DCONR_DTCEN                           *((volatile unsigned int*)(0x42330C00UL))
#define bM4_TMR66_DCONR_DTBENU                          *((volatile unsigned int*)(0x42330C10UL))
#define bM4_TMR66_DCONR_DTBEND                          *((volatile unsigned int*)(0x42330C14UL))
#define bM4_TMR66_DCONR_SEPA                            *((volatile unsigned int*)(0x42330C20UL))
#define bM4_TMR66_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42330D00UL))
#define bM4_TMR66_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42330D04UL))
#define bM4_TMR66_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42330D08UL))
#define bM4_TMR66_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42330D10UL))
#define bM4_TMR66_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42330D14UL))
#define bM4_TMR66_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42330D18UL))
#define bM4_TMR66_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42330D40UL))
#define bM4_TMR66_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42330D44UL))
#define bM4_TMR66_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42330D48UL))
#define bM4_TMR66_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42330D50UL))
#define bM4_TMR66_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42330D54UL))
#define bM4_TMR66_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42330D58UL))
#define bM4_TMR66_FCONR_NOFIENTC                        *((volatile unsigned int*)(0x42330D60UL))
#define bM4_TMR66_FCONR_NOFICKTC0                       *((volatile unsigned int*)(0x42330D64UL))
#define bM4_TMR66_FCONR_NOFICKTC1                       *((volatile unsigned int*)(0x42330D68UL))
#define bM4_TMR66_FCONR_NOFIENTD                        *((volatile unsigned int*)(0x42330D70UL))
#define bM4_TMR66_FCONR_NOFICKTD0                       *((volatile unsigned int*)(0x42330D74UL))
#define bM4_TMR66_FCONR_NOFICKTD1                       *((volatile unsigned int*)(0x42330D78UL))
#define bM4_TMR66_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42330DA0UL))
#define bM4_TMR66_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42330DA4UL))
#define bM4_TMR66_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42330DC0UL))
