RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR66_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42330DC4UL))
#define bM4_TMR66_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42330DC8UL))
#define bM4_TMR66_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42330DCCUL))
#define bM4_TMR66_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42330DD0UL))
#define bM4_TMR66_VPERR_RESV                            *((volatile unsigned int*)(0x42330DE0UL))
#define bM4_TMR66_STFLR_CMAF                            *((volatile unsigned int*)(0x42330E00UL))
#define bM4_TMR66_STFLR_CMBF                            *((volatile unsigned int*)(0x42330E04UL))
#define bM4_TMR66_STFLR_CMCF                            *((volatile unsigned int*)(0x42330E08UL))
#define bM4_TMR66_STFLR_CMDF                            *((volatile unsigned int*)(0x42330E0CUL))
#define bM4_TMR66_STFLR_CMEF                            *((volatile unsigned int*)(0x42330E10UL))
#define bM4_TMR66_STFLR_CMFF                            *((volatile unsigned int*)(0x42330E14UL))
#define bM4_TMR66_STFLR_OVFF                            *((volatile unsigned int*)(0x42330E18UL))
#define bM4_TMR66_STFLR_UDFF                            *((volatile unsigned int*)(0x42330E1CUL))
#define bM4_TMR66_STFLR_DTEF                            *((volatile unsigned int*)(0x42330E20UL))
#define bM4_TMR66_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42330E24UL))
#define bM4_TMR66_STFLR_CMSADF                          *((volatile unsigned int*)(0x42330E28UL))
#define bM4_TMR66_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42330E2CUL))
#define bM4_TMR66_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42330E30UL))
#define bM4_TMR66_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42330E54UL))
#define bM4_TMR66_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42330E58UL))
#define bM4_TMR66_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42330E5CUL))
#define bM4_TMR66_STFLR_DIRF                            *((volatile unsigned int*)(0x42330E7CUL))
#define bM4_TMR66_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42330E80UL))
#define bM4_TMR66_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42330E84UL))
#define bM4_TMR66_HSTAR_HSTA2                           *((volatile unsigned int*)(0x42330E88UL))
#define bM4_TMR66_HSTAR_HSTA3                           *((volatile unsigned int*)(0x42330E8CUL))
#define bM4_TMR66_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42330E90UL))
#define bM4_TMR66_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42330E94UL))
#define bM4_TMR66_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42330E98UL))
#define bM4_TMR66_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42330E9CUL))
#define bM4_TMR66_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42330EA0UL))
#define bM4_TMR66_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42330EA4UL))
#define bM4_TMR66_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42330EA8UL))
#define bM4_TMR66_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42330EACUL))
#define bM4_TMR66_HSTAR_HSTA12                          *((volatile unsigned int*)(0x42330EB0UL))
#define bM4_TMR66_HSTAR_HSTA13                          *((volatile unsigned int*)(0x42330EB4UL))
#define bM4_TMR66_HSTAR_HSTA14                          *((volatile unsigned int*)(0x42330EB8UL))
#define bM4_TMR66_HSTAR_HSTA15                          *((volatile unsigned int*)(0x42330EBCUL))
#define bM4_TMR66_HSTAR_STARTS                          *((volatile unsigned int*)(0x42330EFCUL))
#define bM4_TMR66_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42330F00UL))
#define bM4_TMR66_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42330F04UL))
#define bM4_TMR66_HSTPR_HSTP2                           *((volatile unsigned int*)(0x42330F08UL))
#define bM4_TMR66_HSTPR_HSTP3                           *((volatile unsigned int*)(0x42330F0CUL))
#define bM4_TMR66_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42330F10UL))
#define bM4_TMR66_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42330F14UL))
#define bM4_TMR66_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42330F18UL))
#define bM4_TMR66_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42330F1CUL))
#define bM4_TMR66_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42330F20UL))
#define bM4_TMR66_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42330F24UL))
#define bM4_TMR66_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42330F28UL))
#define bM4_TMR66_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42330F2CUL))
#define bM4_TMR66_HSTPR_HSTP12                          *((volatile unsigned int*)(0x42330F30UL))
#define bM4_TMR66_HSTPR_HSTP13                          *((volatile unsigned int*)(0x42330F34UL))
#define bM4_TMR66_HSTPR_HSTP14                          *((volatile unsigned int*)(0x42330F38UL))
#define bM4_TMR66_HSTPR_HSTP15                          *((volatile unsigned int*)(0x42330F3CUL))
#define bM4_TMR66_HSTPR_STOPS                           *((volatile unsigned int*)(0x42330F7CUL))
#define bM4_TMR66_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42330F80UL))
#define bM4_TMR66_HCLRR_HCLE1                           *((volatile unsigned int*)(0x42330F84UL))
#define bM4_TMR66_HCLRR_HCLE2                           *((volatile unsigned int*)(0x42330F88UL))
#define bM4_TMR66_HCLRR_HCLE3                           *((volatile unsigned int*)(0x42330F8CUL))
#define bM4_TMR66_HCLRR_HCLE4                           *((volatile unsigned int*)(0x42330F90UL))
#define bM4_TMR66_HCLRR_HCLE5                           *((volatile unsigned int*)(0x42330F94UL))
#define bM4_TMR66_HCLRR_HCLE6                           *((volatile unsigned int*)(0x42330F98UL))
#define bM4_TMR66_HCLRR_HCLE7                           *((volatile unsigned int*)(0x42330F9CUL))
#define bM4_TMR66_HCLRR_HCLE8                           *((volatile unsigned int*)(0x42330FA0UL))
#define bM4_TMR66_HCLRR_HCLE9                           *((volatile unsigned int*)(0x42330FA4UL))
#define bM4_TMR66_HCLRR_HCLE10                          *((volatile unsigned int*)(0x42330FA8UL))
#define bM4_TMR66_HCLRR_HCLE11                          *((volatile unsigned int*)(0x42330FACUL))
#define bM4_TMR66_HCLRR_HCLE12                          *((volatile unsigned int*)(0x42330FB0UL))
#define bM4_TMR66_HCLRR_HCLE13                          *((volatile unsigned int*)(0x42330FB4UL))
#define bM4_TMR66_HCLRR_HCLE14                          *((volatile unsigned int*)(0x42330FB8UL))
#define bM4_TMR66_HCLRR_HCLE15                          *((volatile unsigned int*)(0x42330FBCUL))
#define bM4_TMR66_HCLRR_CLEARS                          *((volatile unsigned int*)(0x42330FFCUL))
#define bM4_TMR66_HCPAR_HCPA0                           *((volatile unsigned int*)(0x42331000UL))
#define bM4_TMR66_HCPAR_HCPA1                           *((volatile unsigned int*)(0x42331004UL))
#define bM4_TMR66_HCPAR_HCPA2                           *((volatile unsigned int*)(0x42331008UL))
#define bM4_TMR66_HCPAR_HCPA3                           *((volatile unsigned int*)(0x4233100CUL))
#define bM4_TMR66_HCPAR_HCPA4                           *((volatile unsigned int*)(0x42331010UL))
#define bM4_TMR66_HCPAR_HCPA5                           *((volatile unsigned int*)(0x42331014UL))
#define bM4_TMR66_HCPAR_HCPA6                           *((volatile unsigned int*)(0x42331018UL))
#define bM4_TMR66_HCPAR_HCPA7                           *((volatile unsigned int*)(0x4233101CUL))
#define bM4_TMR66_HCPAR_HCPA8                           *((volatile unsigned int*)(0x42331020UL))
#define bM4_TMR66_HCPAR_HCPA9                           *((volatile unsigned int*)(0x42331024UL))
#define bM4_TMR66_HCPAR_HCPA10                          *((volatile unsigned int*)(0x42331028UL))
#define bM4_TMR66_HCPAR_HCPA11                          *((volatile unsigned int*)(0x4233102CUL))
#define bM4_TMR66_HCPAR_HCPA12                          *((volatile unsigned int*)(0x42331030UL))
#define bM4_TMR66_HCPAR_HCPA13                          *((volatile unsigned int*)(0x42331034UL))
#define bM4_TMR66_HCPAR_HCPA14                          *((volatile unsigned int*)(0x42331038UL))
#define bM4_TMR66_HCPAR_HCPA15                          *((volatile unsigned int*)(0x4233103CUL))
#define bM4_TMR66_HCPBR_HCPB0                           *((volatile unsigned int*)(0x42331080UL))
#define bM4_TMR66_HCPBR_HCPB1                           *((volatile unsigned int*)(0x42331084UL))
#define bM4_TMR66_HCPBR_HCPB2                           *((volatile unsigned int*)(0x42331088UL))
#define bM4_TMR66_HCPBR_HCPB3                           *((volatile unsigned int*)(0x4233108CUL))
#define bM4_TMR66_HCPBR_HCPB4                           *((volatile unsigned int*)(0x42331090UL))
#define bM4_TMR66_HCPBR_HCPB5                           *((volatile unsigned int*)(0x42331094UL))
#define bM4_TMR66_HCPBR_HCPB6                           *((volatile unsigned int*)(0x42331098UL))
#define bM4_TMR66_HCPBR_HCPB7                           *((volatile unsigned int*)(0x4233109CUL))
#define bM4_TMR66_HCPBR_HCPB8                           *((volatile unsigned int*)(0x423310A0UL))
#define bM4_TMR66_HCPBR_HCPB9                           *((volatile unsigned int*)(0x423310A4UL))
#define bM4_TMR66_HCPBR_HCPB10                          *((volatile unsigned int*)(0x423310A8UL))
#define bM4_TMR66_HCPBR_HCPB11                          *((volatile unsigned int*)(0x423310ACUL))
#define bM4_TMR66_HCPBR_HCPB12                          *((volatile unsigned int*)(0x423310B0UL))
#define bM4_TMR66_HCPBR_HCPB13                          *((volatile unsigned int*)(0x423310B4UL))
#define bM4_TMR66_HCPBR_HCPB14                          *((volatile unsigned int*)(0x423310B8UL))
#define bM4_TMR66_HCPBR_HCPB15                          *((volatile unsigned int*)(0x423310BCUL))
#define bM4_TMR66_HCUPR_HCUP0                           *((volatile unsigned int*)(0x42331100UL))
#define bM4_TMR66_HCUPR_HCUP1                           *((volatile unsigned int*)(0x42331104UL))
#define bM4_TMR66_HCUPR_HCUP2                           *((volatile unsigned int*)(0x42331108UL))
#define bM4_TMR66_HCUPR_HCUP3                           *((volatile unsigned int*)(0x4233110CUL))
#define bM4_TMR66_HCUPR_HCUP4                           *((volatile unsigned int*)(0x42331110UL))
#define bM4_TMR66_HCUPR_HCUP5                           *((volatile unsigned int*)(0x42331114UL))
#define bM4_TMR66_HCUPR_HCUP6                           *((volatile unsigned int*)(0x42331118UL))
#define bM4_TMR66_HCUPR_HCUP7                           *((volatile unsigned int*)(0x4233111CUL))
#define bM4_TMR66_HCUPR_HCUP8                           *((volatile unsigned int*)(0x42331120UL))
#define bM4_TMR66_HCUPR_HCUP9                           *((volatile unsigned int*)(0x42331124UL))
#define bM4_TMR66_HCUPR_HCUP10                          *((volatile unsigned int*)(0x42331128UL))
#define bM4_TMR66_HCUPR_HCUP11                          *((volatile unsigned int*)(0x4233112CUL))
#define bM4_TMR66_HCUPR_HCUP12                          *((volatile unsigned int*)(0x42331130UL))
#define bM4_TMR66_HCUPR_HCUP13                          *((volatile unsigned int*)(0x42331134UL))
#define bM4_TMR66_HCUPR_HCUP14                          *((volatile unsigned int*)(0x42331138UL))
#define bM4_TMR66_HCUPR_HCUP15                          *((volatile unsigned int*)(0x4233113CUL))
#define bM4_TMR66_HCUPR_HCUP16                          *((volatile unsigned int*)(0x42331140UL))
#define bM4_TMR66_HCUPR_HCUP17                          *((volatile unsigned int*)(0x42331144UL))
#define bM4_TMR66_HCUPR_HCUP18                          *((volatile unsigned int*)(0x42331148UL))
#define bM4_TMR66_HCUPR_HCUP19                          *((volatile unsigned int*)(0x4233114CUL))
#define bM4_TMR66_HCUPR_RESV                            *((volatile unsigned int*)(0x42331160UL))
#define bM4_TMR66_HCDOR_HCDO0                           *((volatile unsigned int*)(0x42331180UL))
#define bM4_TMR66_HCDOR_HCDO1                           *((volatile unsigned int*)(0x42331184UL))
#define bM4_TMR66_HCDOR_HCDO2                           *((volatile unsigned int*)(0x42331188UL))
#define bM4_TMR66_HCDOR_HCDO3                           *((volatile unsigned int*)(0x4233118CUL))
#define bM4_TMR66_HCDOR_HCDO4                           *((volatile unsigned int*)(0x42331190UL))
#define bM4_TMR66_HCDOR_HCDO5                           *((volatile unsigned int*)(0x42331194UL))
#define bM4_TMR66_HCDOR_HCDO6                           *((volatile unsigned int*)(0x42331198UL))
#define bM4_TMR66_HCDOR_HCDO7                           *((volatile unsigned int*)(0x4233119CUL))
#define bM4_TMR66_HCDOR_HCDO8                           *((volatile unsigned int*)(0x423311A0UL))
#define bM4_TMR66_HCDOR_HCDO9                           *((volatile unsigned int*)(0x423311A4UL))
#define bM4_TMR66_HCDOR_HCDO10                          *((volatile unsigned int*)(0x423311A8UL))
#define bM4_TMR66_HCDOR_HCDO11                          *((volatile unsigned int*)(0x423311ACUL))
#define bM4_TMR66_HCDOR_HCDO12                          *((volatile unsigned int*)(0x423311B0UL))
#define bM4_TMR66_HCDOR_HCDO13                          *((volatile unsigned int*)(0x423311B4UL))
#define bM4_TMR66_HCDOR_HCDO14                          *((volatile unsigned int*)(0x423311B8UL))
#define bM4_TMR66_HCDOR_HCDO15                          *((volatile unsigned int*)(0x423311BCUL))
#define bM4_TMR66_HCDOR_HCDO16                          *((volatile unsigned int*)(0x423311C0UL))
#define bM4_TMR66_HCDOR_HCDO17                          *((volatile unsigned int*)(0x423311C4UL))
#define bM4_TMR66_HCDOR_HCDO18                          *((volatile unsigned int*)(0x423311C8UL))
#define bM4_TMR66_HCDOR_HCDO19                          *((volatile unsigned int*)(0x423311CCUL))
#define bM4_TMR66_HCDOR_RESV                            *((volatile unsigned int*)(0x423311E0UL))
#define bM4_TMR66_SSTAR_SSTA0                           *((volatile unsigned int*)(0x42337E80UL))
#define bM4_TMR66_SSTAR_SSTA1                           *((volatile unsigned int*)(0x42337E84UL))
#define bM4_TMR66_SSTAR_SSTA2                           *((volatile unsigned int*)(0x42337E88UL))
#define bM4_TMR66_SSTAR_SSTA3                           *((volatile unsigned int*)(0x42337E8CUL))
#define bM4_TMR66_SSTAR_SSTA4                           *((volatile unsigned int*)(0x42337E90UL))
#define bM4_TMR66_SSTAR_SSTA5                           *((volatile unsigned int*)(0x42337E94UL))
#define bM4_TMR66_SSTAR_SSTA6                           *((volatile unsigned int*)(0x42337E98UL))
#define bM4_TMR66_SSTAR_SSTA7                           *((volatile unsigned int*)(0x42337E9CUL))
#define bM4_TMR66_SSTAR_SSTA8                           *((volatile unsigned int*)(0x42337EA0UL))
#define bM4_TMR66_SSTAR_SSTA9                           *((volatile unsigned int*)(0x42337EA4UL))
#define bM4_TMR66_SSTAR_RESV                            *((volatile unsigned int*)(0x42337EE0UL))
#define bM4_TMR66_SSTPR_SSTP0                           *((volatile unsigned int*)(0x42337F00UL))
#define bM4_TMR66_SSTPR_SSTP1                           *((volatile unsigned int*)(0x42337F04UL))
#define bM4_TMR66_SSTPR_SSTP2                           *((volatile unsigned int*)(0x42337F08UL))
#define bM4_TMR66_SSTPR_SSTP3                           *((volatile unsigned int*)(0x42337F0CUL))
#define bM4_TMR66_SSTPR_SSTP4                           *((volatile unsigned int*)(0x42337F10UL))
#define bM4_TMR66_SSTPR_SSTP5                           *((volatile unsigned int*)(0x42337F14UL))
#define bM4_TMR66_SSTPR_SSTP6                           *((volatile unsigned int*)(0x42337F18UL))
#define bM4_TMR66_SSTPR_SSTP7                           *((volatile unsigned int*)(0x42337F1CUL))
#define bM4_TMR66_SSTPR_SSTP8                           *((volatile unsigned int*)(0x42337F20UL))
#define bM4_TMR66_SSTPR_SSTP9                           *((volatile unsigned int*)(0x42337F24UL))
#define bM4_TMR66_SSTPR_RESV                            *((volatile unsigned int*)(0x42337F60UL))
#define bM4_TMR66_SCLRR_SCLE0                           *((volatile unsigned int*)(0x42337F80UL))
#define bM4_TMR66_SCLRR_SCLE1                           *((volatile unsigned int*)(0x42337F84UL))
#define bM4_TMR66_SCLRR_SCLE2                           *((volatile unsigned int*)(0x42337F88UL))
#define bM4_TMR66_SCLRR_SCLE3                           *((volatile unsigned int*)(0x42337F8CUL))
#define bM4_TMR66_SCLRR_SCLE4                           *((volatile unsigned int*)(0x42337F90UL))
#define bM4_TMR66_SCLRR_SCLE5                           *((volatile unsigned int*)(0x42337F94UL))
#define bM4_TMR66_SCLRR_SCLE6                           *((volatile unsigned int*)(0x42337F98UL))
#define bM4_TMR66_SCLRR_SCLE7                           *((volatile unsigned int*)(0x42337F9CUL))
#define bM4_TMR66_SCLRR_SCLE8                           *((volatile unsigned int*)(0x42337FA0UL))
#define bM4_TMR66_SCLRR_SCLE9                           *((volatile unsigned int*)(0x42337FA4UL))
#define bM4_TMR66_SCLRR_RESV                            *((volatile unsigned int*)(0x42337FE0UL))
#define bM4_TMR67_GCONR_START                           *((volatile unsigned int*)(0x42338A00UL))
#define bM4_TMR67_GCONR_MODE0                           *((volatile unsigned int*)(0x42338A04UL))
#define bM4_TMR67_GCONR_MODE1                           *((volatile unsigned int*)(0x42338A08UL))
#define bM4_TMR67_GCONR_MODE2                           *((volatile unsigned int*)(0x42338A0CUL))
#define bM4_TMR67_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42338A10UL))
#define bM4_TMR67_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42338A14UL))
#define bM4_TMR67_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42338A18UL))
#define bM4_TMR67_GCONR_DIR                             *((volatile unsigned int*)(0x42338A20UL))
#define bM4_TMR67_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42338A40UL))
#define bM4_TMR67_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42338A44UL))
#define bM4_TMR67_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42338A48UL))
#define bM4_TMR67_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42338A4CUL))
#define bM4_TMR67_GCONR_RESV                            *((volatile unsigned int*)(0x42338A60UL))
#define bM4_TMR67_ICONR_INTENA                          *((volatile unsigned int*)(0x42338A80UL))
#define bM4_TMR67_ICONR_INTENB                          *((volatile unsigned int*)(0x42338A84UL))
#define bM4_TMR67_ICONR_INTENC                          *((volatile unsigned int*)(0x42338A88UL))
#define bM4_TMR67_ICONR_INTEND                          *((volatile unsigned int*)(0x42338A8CUL))
#define bM4_TMR67_ICONR_INTENE                          *((volatile unsigned int*)(0x42338A90UL))
#define bM4_TMR67_ICONR_INTENF                          *((volatile unsigned int*)(0x42338A94UL))
#define bM4_TMR67_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42338A98UL))
#define bM4_TMR67_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42338A9CUL))
#define bM4_TMR67_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42338AA0UL))
#define bM4_TMR67_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42338AC0UL))
#define bM4_TMR67_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42338AC4UL))
#define bM4_TMR67_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42338AC8UL))
#define bM4_TMR67_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42338ACCUL))
#define bM4_TMR67_ICONR_RESV                            *((volatile unsigned int*)(0x42338AE0UL))
#define bM4_TMR67_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42338B00UL))
#define bM4_TMR67_PCONR_STACA                           *((volatile unsigned int*)(0x42338B04UL))
#define bM4_TMR67_PCONR_STPCA                           *((volatile unsigned int*)(0x42338B08UL))
#define bM4_TMR67_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42338B0CUL))
#define bM4_TMR67_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42338B10UL))
#define bM4_TMR67_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42338B14UL))
#define bM4_TMR67_PCONR_PERCA0                          *((volatile unsigned int*)(0x42338B18UL))
#define bM4_TMR67_PCONR_PERCA1                          *((volatile unsigned int*)(0x42338B1CUL))
#define bM4_TMR67_PCONR_OUTENA                          *((volatile unsigned int*)(0x42338B20UL))
#define bM4_TMR67_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42338B24UL))
#define bM4_TMR67_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42338B28UL))
#define bM4_TMR67_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42338B2CUL))
#define bM4_TMR67_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42338B30UL))
#define bM4_TMR67_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42338B40UL))
#define bM4_TMR67_PCONR_STACB                           *((volatile unsigned int*)(0x42338B44UL))
#define bM4_TMR67_PCONR_STPCB                           *((volatile unsigned int*)(0x42338B48UL))
#define bM4_TMR67_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42338B4CUL))
#define bM4_TMR67_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42338B50UL))
#define bM4_TMR67_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42338B54UL))
#define bM4_TMR67_PCONR_PERCB0                          *((volatile unsigned int*)(0x42338B58UL))
#define bM4_TMR67_PCONR_PERCB1                          *((volatile unsigned int*)(0x42338B5CUL))
#define bM4_TMR67_PCONR_OUTENB                          *((volatile unsigned int*)(0x42338B60UL))
#define bM4_TMR67_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42338B64UL))
#define bM4_TMR67_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42338B68UL))
#define bM4_TMR67_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42338B6CUL))
#define bM4_TMR67_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42338B70UL))
#define bM4_TMR67_BCONR_BENA                            *((volatile unsigned int*)(0x42338B80UL))
#define bM4_TMR67_BCONR_BSEA                            *((volatile unsigned int*)(0x42338B84UL))
#define bM4_TMR67_BCONR_BENB                            *((volatile unsigned int*)(0x42338B88UL))
#define bM4_TMR67_BCONR_BSEB                            *((volatile unsigned int*)(0x42338B8CUL))
#define bM4_TMR67_BCONR_BENP                            *((volatile unsigned int*)(0x42338BA0UL))
#define bM4_TMR67_BCONR_BSEP                            *((volatile unsigned int*)(0x42338BA4UL))
#define bM4_TMR67_BCONR_BENSPA                          *((volatile unsigned int*)(0x42338BC0UL))
#define bM4_TMR67_BCONR_BSESPA                          *((volatile unsigned int*)(0x42338BC4UL))
#define bM4_TMR67_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42338BD0UL))
#define bM4_TMR67_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42338BD4UL))
#define bM4_TMR67_BCONR_BENSPB                          *((volatile unsigned int*)(0x42338BE0UL))
