RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR67_BCONR_BSESPB                          *((volatile unsigned int*)(0x42338BE4UL))
#define bM4_TMR67_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42338BF0UL))
#define bM4_TMR67_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42338BF4UL))
#define bM4_TMR67_DCONR_DTCEN                           *((volatile unsigned int*)(0x42338C00UL))
#define bM4_TMR67_DCONR_DTBENU                          *((volatile unsigned int*)(0x42338C10UL))
#define bM4_TMR67_DCONR_DTBEND                          *((volatile unsigned int*)(0x42338C14UL))
#define bM4_TMR67_DCONR_SEPA                            *((volatile unsigned int*)(0x42338C20UL))
#define bM4_TMR67_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42338D00UL))
#define bM4_TMR67_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42338D04UL))
#define bM4_TMR67_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42338D08UL))
#define bM4_TMR67_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42338D10UL))
#define bM4_TMR67_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42338D14UL))
#define bM4_TMR67_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42338D18UL))
#define bM4_TMR67_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42338D40UL))
#define bM4_TMR67_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42338D44UL))
#define bM4_TMR67_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42338D48UL))
#define bM4_TMR67_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42338D50UL))
#define bM4_TMR67_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42338D54UL))
#define bM4_TMR67_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42338D58UL))
#define bM4_TMR67_FCONR_NOFIENTC                        *((volatile unsigned int*)(0x42338D60UL))
#define bM4_TMR67_FCONR_NOFICKTC0                       *((volatile unsigned int*)(0x42338D64UL))
#define bM4_TMR67_FCONR_NOFICKTC1                       *((volatile unsigned int*)(0x42338D68UL))
#define bM4_TMR67_FCONR_NOFIENTD                        *((volatile unsigned int*)(0x42338D70UL))
#define bM4_TMR67_FCONR_NOFICKTD0                       *((volatile unsigned int*)(0x42338D74UL))
#define bM4_TMR67_FCONR_NOFICKTD1                       *((volatile unsigned int*)(0x42338D78UL))
#define bM4_TMR67_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42338DA0UL))
#define bM4_TMR67_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42338DA4UL))
#define bM4_TMR67_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42338DC0UL))
#define bM4_TMR67_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42338DC4UL))
#define bM4_TMR67_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42338DC8UL))
#define bM4_TMR67_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42338DCCUL))
#define bM4_TMR67_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42338DD0UL))
#define bM4_TMR67_VPERR_RESV                            *((volatile unsigned int*)(0x42338DE0UL))
#define bM4_TMR67_STFLR_CMAF                            *((volatile unsigned int*)(0x42338E00UL))
#define bM4_TMR67_STFLR_CMBF                            *((volatile unsigned int*)(0x42338E04UL))
#define bM4_TMR67_STFLR_CMCF                            *((volatile unsigned int*)(0x42338E08UL))
#define bM4_TMR67_STFLR_CMDF                            *((volatile unsigned int*)(0x42338E0CUL))
#define bM4_TMR67_STFLR_CMEF                            *((volatile unsigned int*)(0x42338E10UL))
#define bM4_TMR67_STFLR_CMFF                            *((volatile unsigned int*)(0x42338E14UL))
#define bM4_TMR67_STFLR_OVFF                            *((volatile unsigned int*)(0x42338E18UL))
#define bM4_TMR67_STFLR_UDFF                            *((volatile unsigned int*)(0x42338E1CUL))
#define bM4_TMR67_STFLR_DTEF                            *((volatile unsigned int*)(0x42338E20UL))
#define bM4_TMR67_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42338E24UL))
#define bM4_TMR67_STFLR_CMSADF                          *((volatile unsigned int*)(0x42338E28UL))
#define bM4_TMR67_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42338E2CUL))
#define bM4_TMR67_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42338E30UL))
#define bM4_TMR67_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42338E54UL))
#define bM4_TMR67_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42338E58UL))
#define bM4_TMR67_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42338E5CUL))
#define bM4_TMR67_STFLR_DIRF                            *((volatile unsigned int*)(0x42338E7CUL))
#define bM4_TMR67_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42338E80UL))
#define bM4_TMR67_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42338E84UL))
#define bM4_TMR67_HSTAR_HSTA2                           *((volatile unsigned int*)(0x42338E88UL))
#define bM4_TMR67_HSTAR_HSTA3                           *((volatile unsigned int*)(0x42338E8CUL))
#define bM4_TMR67_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42338E90UL))
#define bM4_TMR67_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42338E94UL))
#define bM4_TMR67_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42338E98UL))
#define bM4_TMR67_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42338E9CUL))
#define bM4_TMR67_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42338EA0UL))
#define bM4_TMR67_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42338EA4UL))
#define bM4_TMR67_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42338EA8UL))
#define bM4_TMR67_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42338EACUL))
#define bM4_TMR67_HSTAR_HSTA12                          *((volatile unsigned int*)(0x42338EB0UL))
#define bM4_TMR67_HSTAR_HSTA13                          *((volatile unsigned int*)(0x42338EB4UL))
#define bM4_TMR67_HSTAR_HSTA14                          *((volatile unsigned int*)(0x42338EB8UL))
#define bM4_TMR67_HSTAR_HSTA15                          *((volatile unsigned int*)(0x42338EBCUL))
#define bM4_TMR67_HSTAR_STARTS                          *((volatile unsigned int*)(0x42338EFCUL))
#define bM4_TMR67_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42338F00UL))
#define bM4_TMR67_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42338F04UL))
#define bM4_TMR67_HSTPR_HSTP2                           *((volatile unsigned int*)(0x42338F08UL))
#define bM4_TMR67_HSTPR_HSTP3                           *((volatile unsigned int*)(0x42338F0CUL))
#define bM4_TMR67_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42338F10UL))
#define bM4_TMR67_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42338F14UL))
#define bM4_TMR67_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42338F18UL))
#define bM4_TMR67_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42338F1CUL))
#define bM4_TMR67_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42338F20UL))
#define bM4_TMR67_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42338F24UL))
#define bM4_TMR67_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42338F28UL))
#define bM4_TMR67_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42338F2CUL))
#define bM4_TMR67_HSTPR_HSTP12                          *((volatile unsigned int*)(0x42338F30UL))
#define bM4_TMR67_HSTPR_HSTP13                          *((volatile unsigned int*)(0x42338F34UL))
#define bM4_TMR67_HSTPR_HSTP14                          *((volatile unsigned int*)(0x42338F38UL))
#define bM4_TMR67_HSTPR_HSTP15                          *((volatile unsigned int*)(0x42338F3CUL))
#define bM4_TMR67_HSTPR_STOPS                           *((volatile unsigned int*)(0x42338F7CUL))
#define bM4_TMR67_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42338F80UL))
#define bM4_TMR67_HCLRR_HCLE1                           *((volatile unsigned int*)(0x42338F84UL))
#define bM4_TMR67_HCLRR_HCLE2                           *((volatile unsigned int*)(0x42338F88UL))
#define bM4_TMR67_HCLRR_HCLE3                           *((volatile unsigned int*)(0x42338F8CUL))
#define bM4_TMR67_HCLRR_HCLE4                           *((volatile unsigned int*)(0x42338F90UL))
#define bM4_TMR67_HCLRR_HCLE5                           *((volatile unsigned int*)(0x42338F94UL))
#define bM4_TMR67_HCLRR_HCLE6                           *((volatile unsigned int*)(0x42338F98UL))
#define bM4_TMR67_HCLRR_HCLE7                           *((volatile unsigned int*)(0x42338F9CUL))
#define bM4_TMR67_HCLRR_HCLE8                           *((volatile unsigned int*)(0x42338FA0UL))
#define bM4_TMR67_HCLRR_HCLE9                           *((volatile unsigned int*)(0x42338FA4UL))
#define bM4_TMR67_HCLRR_HCLE10                          *((volatile unsigned int*)(0x42338FA8UL))
#define bM4_TMR67_HCLRR_HCLE11                          *((volatile unsigned int*)(0x42338FACUL))
#define bM4_TMR67_HCLRR_HCLE12                          *((volatile unsigned int*)(0x42338FB0UL))
#define bM4_TMR67_HCLRR_HCLE13                          *((volatile unsigned int*)(0x42338FB4UL))
#define bM4_TMR67_HCLRR_HCLE14                          *((volatile unsigned int*)(0x42338FB8UL))
#define bM4_TMR67_HCLRR_HCLE15                          *((volatile unsigned int*)(0x42338FBCUL))
#define bM4_TMR67_HCLRR_CLEARS                          *((volatile unsigned int*)(0x42338FFCUL))
#define bM4_TMR67_HCPAR_HCPA0                           *((volatile unsigned int*)(0x42339000UL))
#define bM4_TMR67_HCPAR_HCPA1                           *((volatile unsigned int*)(0x42339004UL))
#define bM4_TMR67_HCPAR_HCPA2                           *((volatile unsigned int*)(0x42339008UL))
#define bM4_TMR67_HCPAR_HCPA3                           *((volatile unsigned int*)(0x4233900CUL))
#define bM4_TMR67_HCPAR_HCPA4                           *((volatile unsigned int*)(0x42339010UL))
#define bM4_TMR67_HCPAR_HCPA5                           *((volatile unsigned int*)(0x42339014UL))
#define bM4_TMR67_HCPAR_HCPA6                           *((volatile unsigned int*)(0x42339018UL))
#define bM4_TMR67_HCPAR_HCPA7                           *((volatile unsigned int*)(0x4233901CUL))
#define bM4_TMR67_HCPAR_HCPA8                           *((volatile unsigned int*)(0x42339020UL))
#define bM4_TMR67_HCPAR_HCPA9                           *((volatile unsigned int*)(0x42339024UL))
#define bM4_TMR67_HCPAR_HCPA10                          *((volatile unsigned int*)(0x42339028UL))
#define bM4_TMR67_HCPAR_HCPA11                          *((volatile unsigned int*)(0x4233902CUL))
#define bM4_TMR67_HCPAR_HCPA12                          *((volatile unsigned int*)(0x42339030UL))
#define bM4_TMR67_HCPAR_HCPA13                          *((volatile unsigned int*)(0x42339034UL))
#define bM4_TMR67_HCPAR_HCPA14                          *((volatile unsigned int*)(0x42339038UL))
#define bM4_TMR67_HCPAR_HCPA15                          *((volatile unsigned int*)(0x4233903CUL))
#define bM4_TMR67_HCPBR_HCPB0                           *((volatile unsigned int*)(0x42339080UL))
#define bM4_TMR67_HCPBR_HCPB1                           *((volatile unsigned int*)(0x42339084UL))
#define bM4_TMR67_HCPBR_HCPB2                           *((volatile unsigned int*)(0x42339088UL))
#define bM4_TMR67_HCPBR_HCPB3                           *((volatile unsigned int*)(0x4233908CUL))
#define bM4_TMR67_HCPBR_HCPB4                           *((volatile unsigned int*)(0x42339090UL))
#define bM4_TMR67_HCPBR_HCPB5                           *((volatile unsigned int*)(0x42339094UL))
#define bM4_TMR67_HCPBR_HCPB6                           *((volatile unsigned int*)(0x42339098UL))
#define bM4_TMR67_HCPBR_HCPB7                           *((volatile unsigned int*)(0x4233909CUL))
#define bM4_TMR67_HCPBR_HCPB8                           *((volatile unsigned int*)(0x423390A0UL))
#define bM4_TMR67_HCPBR_HCPB9                           *((volatile unsigned int*)(0x423390A4UL))
#define bM4_TMR67_HCPBR_HCPB10                          *((volatile unsigned int*)(0x423390A8UL))
#define bM4_TMR67_HCPBR_HCPB11                          *((volatile unsigned int*)(0x423390ACUL))
#define bM4_TMR67_HCPBR_HCPB12                          *((volatile unsigned int*)(0x423390B0UL))
#define bM4_TMR67_HCPBR_HCPB13                          *((volatile unsigned int*)(0x423390B4UL))
#define bM4_TMR67_HCPBR_HCPB14                          *((volatile unsigned int*)(0x423390B8UL))
#define bM4_TMR67_HCPBR_HCPB15                          *((volatile unsigned int*)(0x423390BCUL))
#define bM4_TMR67_HCUPR_HCUP0                           *((volatile unsigned int*)(0x42339100UL))
#define bM4_TMR67_HCUPR_HCUP1                           *((volatile unsigned int*)(0x42339104UL))
#define bM4_TMR67_HCUPR_HCUP2                           *((volatile unsigned int*)(0x42339108UL))
#define bM4_TMR67_HCUPR_HCUP3                           *((volatile unsigned int*)(0x4233910CUL))
#define bM4_TMR67_HCUPR_HCUP4                           *((volatile unsigned int*)(0x42339110UL))
#define bM4_TMR67_HCUPR_HCUP5                           *((volatile unsigned int*)(0x42339114UL))
#define bM4_TMR67_HCUPR_HCUP6                           *((volatile unsigned int*)(0x42339118UL))
#define bM4_TMR67_HCUPR_HCUP7                           *((volatile unsigned int*)(0x4233911CUL))
#define bM4_TMR67_HCUPR_HCUP8                           *((volatile unsigned int*)(0x42339120UL))
#define bM4_TMR67_HCUPR_HCUP9                           *((volatile unsigned int*)(0x42339124UL))
#define bM4_TMR67_HCUPR_HCUP10                          *((volatile unsigned int*)(0x42339128UL))
#define bM4_TMR67_HCUPR_HCUP11                          *((volatile unsigned int*)(0x4233912CUL))
#define bM4_TMR67_HCUPR_HCUP12                          *((volatile unsigned int*)(0x42339130UL))
#define bM4_TMR67_HCUPR_HCUP13                          *((volatile unsigned int*)(0x42339134UL))
#define bM4_TMR67_HCUPR_HCUP14                          *((volatile unsigned int*)(0x42339138UL))
#define bM4_TMR67_HCUPR_HCUP15                          *((volatile unsigned int*)(0x4233913CUL))
#define bM4_TMR67_HCUPR_HCUP16                          *((volatile unsigned int*)(0x42339140UL))
#define bM4_TMR67_HCUPR_HCUP17                          *((volatile unsigned int*)(0x42339144UL))
#define bM4_TMR67_HCUPR_HCUP18                          *((volatile unsigned int*)(0x42339148UL))
#define bM4_TMR67_HCUPR_HCUP19                          *((volatile unsigned int*)(0x4233914CUL))
#define bM4_TMR67_HCUPR_RESV                            *((volatile unsigned int*)(0x42339160UL))
#define bM4_TMR67_HCDOR_HCDO0                           *((volatile unsigned int*)(0x42339180UL))
#define bM4_TMR67_HCDOR_HCDO1                           *((volatile unsigned int*)(0x42339184UL))
#define bM4_TMR67_HCDOR_HCDO2                           *((volatile unsigned int*)(0x42339188UL))
#define bM4_TMR67_HCDOR_HCDO3                           *((volatile unsigned int*)(0x4233918CUL))
#define bM4_TMR67_HCDOR_HCDO4                           *((volatile unsigned int*)(0x42339190UL))
#define bM4_TMR67_HCDOR_HCDO5                           *((volatile unsigned int*)(0x42339194UL))
#define bM4_TMR67_HCDOR_HCDO6                           *((volatile unsigned int*)(0x42339198UL))
#define bM4_TMR67_HCDOR_HCDO7                           *((volatile unsigned int*)(0x4233919CUL))
#define bM4_TMR67_HCDOR_HCDO8                           *((volatile unsigned int*)(0x423391A0UL))
#define bM4_TMR67_HCDOR_HCDO9                           *((volatile unsigned int*)(0x423391A4UL))
#define bM4_TMR67_HCDOR_HCDO10                          *((volatile unsigned int*)(0x423391A8UL))
#define bM4_TMR67_HCDOR_HCDO11                          *((volatile unsigned int*)(0x423391ACUL))
#define bM4_TMR67_HCDOR_HCDO12                          *((volatile unsigned int*)(0x423391B0UL))
#define bM4_TMR67_HCDOR_HCDO13                          *((volatile unsigned int*)(0x423391B4UL))
#define bM4_TMR67_HCDOR_HCDO14                          *((volatile unsigned int*)(0x423391B8UL))
#define bM4_TMR67_HCDOR_HCDO15                          *((volatile unsigned int*)(0x423391BCUL))
#define bM4_TMR67_HCDOR_HCDO16                          *((volatile unsigned int*)(0x423391C0UL))
#define bM4_TMR67_HCDOR_HCDO17                          *((volatile unsigned int*)(0x423391C4UL))
#define bM4_TMR67_HCDOR_HCDO18                          *((volatile unsigned int*)(0x423391C8UL))
#define bM4_TMR67_HCDOR_HCDO19                          *((volatile unsigned int*)(0x423391CCUL))
#define bM4_TMR67_HCDOR_RESV                            *((volatile unsigned int*)(0x423391E0UL))
#define bM4_TMR67_SSTAR_SSTA0                           *((volatile unsigned int*)(0x4233FE80UL))
#define bM4_TMR67_SSTAR_SSTA1                           *((volatile unsigned int*)(0x4233FE84UL))
#define bM4_TMR67_SSTAR_SSTA2                           *((volatile unsigned int*)(0x4233FE88UL))
#define bM4_TMR67_SSTAR_SSTA3                           *((volatile unsigned int*)(0x4233FE8CUL))
#define bM4_TMR67_SSTAR_SSTA4                           *((volatile unsigned int*)(0x4233FE90UL))
#define bM4_TMR67_SSTAR_SSTA5                           *((volatile unsigned int*)(0x4233FE94UL))
#define bM4_TMR67_SSTAR_SSTA6                           *((volatile unsigned int*)(0x4233FE98UL))
#define bM4_TMR67_SSTAR_SSTA7                           *((volatile unsigned int*)(0x4233FE9CUL))
#define bM4_TMR67_SSTAR_SSTA8                           *((volatile unsigned int*)(0x4233FEA0UL))
#define bM4_TMR67_SSTAR_SSTA9                           *((volatile unsigned int*)(0x4233FEA4UL))
#define bM4_TMR67_SSTAR_RESV                            *((volatile unsigned int*)(0x4233FEE0UL))
#define bM4_TMR67_SSTPR_SSTP0                           *((volatile unsigned int*)(0x4233FF00UL))
#define bM4_TMR67_SSTPR_SSTP1                           *((volatile unsigned int*)(0x4233FF04UL))
#define bM4_TMR67_SSTPR_SSTP2                           *((volatile unsigned int*)(0x4233FF08UL))
#define bM4_TMR67_SSTPR_SSTP3                           *((volatile unsigned int*)(0x4233FF0CUL))
#define bM4_TMR67_SSTPR_SSTP4                           *((volatile unsigned int*)(0x4233FF10UL))
#define bM4_TMR67_SSTPR_SSTP5                           *((volatile unsigned int*)(0x4233FF14UL))
#define bM4_TMR67_SSTPR_SSTP6                           *((volatile unsigned int*)(0x4233FF18UL))
#define bM4_TMR67_SSTPR_SSTP7                           *((volatile unsigned int*)(0x4233FF1CUL))
#define bM4_TMR67_SSTPR_SSTP8                           *((volatile unsigned int*)(0x4233FF20UL))
#define bM4_TMR67_SSTPR_SSTP9                           *((volatile unsigned int*)(0x4233FF24UL))
#define bM4_TMR67_SSTPR_RESV                            *((volatile unsigned int*)(0x4233FF60UL))
#define bM4_TMR67_SCLRR_SCLE0                           *((volatile unsigned int*)(0x4233FF80UL))
#define bM4_TMR67_SCLRR_SCLE1                           *((volatile unsigned int*)(0x4233FF84UL))
#define bM4_TMR67_SCLRR_SCLE2                           *((volatile unsigned int*)(0x4233FF88UL))
#define bM4_TMR67_SCLRR_SCLE3                           *((volatile unsigned int*)(0x4233FF8CUL))
#define bM4_TMR67_SCLRR_SCLE4                           *((volatile unsigned int*)(0x4233FF90UL))
#define bM4_TMR67_SCLRR_SCLE5                           *((volatile unsigned int*)(0x4233FF94UL))
#define bM4_TMR67_SCLRR_SCLE6                           *((volatile unsigned int*)(0x4233FF98UL))
#define bM4_TMR67_SCLRR_SCLE7                           *((volatile unsigned int*)(0x4233FF9CUL))
#define bM4_TMR67_SCLRR_SCLE8                           *((volatile unsigned int*)(0x4233FFA0UL))
#define bM4_TMR67_SCLRR_SCLE9                           *((volatile unsigned int*)(0x4233FFA4UL))
#define bM4_TMR67_SCLRR_RESV                            *((volatile unsigned int*)(0x4233FFE0UL))
#define bM4_TMR68_GCONR_START                           *((volatile unsigned int*)(0x42340A00UL))
#define bM4_TMR68_GCONR_MODE0                           *((volatile unsigned int*)(0x42340A04UL))
#define bM4_TMR68_GCONR_MODE1                           *((volatile unsigned int*)(0x42340A08UL))
#define bM4_TMR68_GCONR_MODE2                           *((volatile unsigned int*)(0x42340A0CUL))
#define bM4_TMR68_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42340A10UL))
#define bM4_TMR68_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42340A14UL))
#define bM4_TMR68_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42340A18UL))
#define bM4_TMR68_GCONR_DIR                             *((volatile unsigned int*)(0x42340A20UL))
#define bM4_TMR68_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42340A40UL))
#define bM4_TMR68_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42340A44UL))
#define bM4_TMR68_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42340A48UL))
#define bM4_TMR68_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42340A4CUL))
#define bM4_TMR68_GCONR_RESV                            *((volatile unsigned int*)(0x42340A60UL))
#define bM4_TMR68_ICONR_INTENA                          *((volatile unsigned int*)(0x42340A80UL))
#define bM4_TMR68_ICONR_INTENB                          *((volatile unsigned int*)(0x42340A84UL))
#define bM4_TMR68_ICONR_INTENC                          *((volatile unsigned int*)(0x42340A88UL))
#define bM4_TMR68_ICONR_INTEND                          *((volatile unsigned int*)(0x42340A8CUL))
#define bM4_TMR68_ICONR_INTENE                          *((volatile unsigned int*)(0x42340A90UL))
#define bM4_TMR68_ICONR_INTENF                          *((volatile unsigned int*)(0x42340A94UL))
#define bM4_TMR68_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42340A98UL))
#define bM4_TMR68_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42340A9CUL))
#define bM4_TMR68_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42340AA0UL))
#define bM4_TMR68_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42340AC0UL))
#define bM4_TMR68_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42340AC4UL))
#define bM4_TMR68_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42340AC8UL))
#define bM4_TMR68_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42340ACCUL))
#define bM4_TMR68_ICONR_RESV                            *((volatile unsigned int*)(0x42340AE0UL))
#define bM4_TMR68_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42340B00UL))
#define bM4_TMR68_PCONR_STACA                           *((volatile unsigned int*)(0x42340B04UL))
#define bM4_TMR68_PCONR_STPCA                           *((volatile unsigned int*)(0x42340B08UL))
#define bM4_TMR68_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42340B0CUL))
#define bM4_TMR68_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42340B10UL))
#define bM4_TMR68_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42340B14UL))
#define bM4_TMR68_PCONR_PERCA0                          *((volatile unsigned int*)(0x42340B18UL))
#define bM4_TMR68_PCONR_PERCA1                          *((volatile unsigned int*)(0x42340B1CUL))
#define bM4_TMR68_PCONR_OUTENA                          *((volatile unsigned int*)(0x42340B20UL))
