RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR68_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42340B24UL))
#define bM4_TMR68_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42340B28UL))
#define bM4_TMR68_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42340B2CUL))
#define bM4_TMR68_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42340B30UL))
#define bM4_TMR68_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42340B40UL))
#define bM4_TMR68_PCONR_STACB                           *((volatile unsigned int*)(0x42340B44UL))
#define bM4_TMR68_PCONR_STPCB                           *((volatile unsigned int*)(0x42340B48UL))
#define bM4_TMR68_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42340B4CUL))
#define bM4_TMR68_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42340B50UL))
#define bM4_TMR68_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42340B54UL))
#define bM4_TMR68_PCONR_PERCB0                          *((volatile unsigned int*)(0x42340B58UL))
#define bM4_TMR68_PCONR_PERCB1                          *((volatile unsigned int*)(0x42340B5CUL))
#define bM4_TMR68_PCONR_OUTENB                          *((volatile unsigned int*)(0x42340B60UL))
#define bM4_TMR68_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42340B64UL))
#define bM4_TMR68_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42340B68UL))
#define bM4_TMR68_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42340B6CUL))
#define bM4_TMR68_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42340B70UL))
#define bM4_TMR68_BCONR_BENA                            *((volatile unsigned int*)(0x42340B80UL))
#define bM4_TMR68_BCONR_BSEA                            *((volatile unsigned int*)(0x42340B84UL))
#define bM4_TMR68_BCONR_BENB                            *((volatile unsigned int*)(0x42340B88UL))
#define bM4_TMR68_BCONR_BSEB                            *((volatile unsigned int*)(0x42340B8CUL))
#define bM4_TMR68_BCONR_BENP                            *((volatile unsigned int*)(0x42340BA0UL))
#define bM4_TMR68_BCONR_BSEP                            *((volatile unsigned int*)(0x42340BA4UL))
#define bM4_TMR68_BCONR_BENSPA                          *((volatile unsigned int*)(0x42340BC0UL))
#define bM4_TMR68_BCONR_BSESPA                          *((volatile unsigned int*)(0x42340BC4UL))
#define bM4_TMR68_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42340BD0UL))
#define bM4_TMR68_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42340BD4UL))
#define bM4_TMR68_BCONR_BENSPB                          *((volatile unsigned int*)(0x42340BE0UL))
#define bM4_TMR68_BCONR_BSESPB                          *((volatile unsigned int*)(0x42340BE4UL))
#define bM4_TMR68_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42340BF0UL))
#define bM4_TMR68_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42340BF4UL))
#define bM4_TMR68_DCONR_DTCEN                           *((volatile unsigned int*)(0x42340C00UL))
#define bM4_TMR68_DCONR_DTBENU                          *((volatile unsigned int*)(0x42340C10UL))
#define bM4_TMR68_DCONR_DTBEND                          *((volatile unsigned int*)(0x42340C14UL))
#define bM4_TMR68_DCONR_SEPA                            *((volatile unsigned int*)(0x42340C20UL))
#define bM4_TMR68_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42340D00UL))
#define bM4_TMR68_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42340D04UL))
#define bM4_TMR68_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42340D08UL))
#define bM4_TMR68_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42340D10UL))
#define bM4_TMR68_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42340D14UL))
#define bM4_TMR68_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42340D18UL))
#define bM4_TMR68_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42340D40UL))
#define bM4_TMR68_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42340D44UL))
#define bM4_TMR68_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42340D48UL))
#define bM4_TMR68_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42340D50UL))
#define bM4_TMR68_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42340D54UL))
#define bM4_TMR68_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42340D58UL))
#define bM4_TMR68_FCONR_NOFIENTC                        *((volatile unsigned int*)(0x42340D60UL))
#define bM4_TMR68_FCONR_NOFICKTC0                       *((volatile unsigned int*)(0x42340D64UL))
#define bM4_TMR68_FCONR_NOFICKTC1                       *((volatile unsigned int*)(0x42340D68UL))
#define bM4_TMR68_FCONR_NOFIENTD                        *((volatile unsigned int*)(0x42340D70UL))
#define bM4_TMR68_FCONR_NOFICKTD0                       *((volatile unsigned int*)(0x42340D74UL))
#define bM4_TMR68_FCONR_NOFICKTD1                       *((volatile unsigned int*)(0x42340D78UL))
#define bM4_TMR68_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42340DA0UL))
#define bM4_TMR68_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42340DA4UL))
#define bM4_TMR68_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42340DC0UL))
#define bM4_TMR68_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42340DC4UL))
#define bM4_TMR68_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42340DC8UL))
#define bM4_TMR68_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42340DCCUL))
#define bM4_TMR68_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42340DD0UL))
#define bM4_TMR68_VPERR_RESV                            *((volatile unsigned int*)(0x42340DE0UL))
#define bM4_TMR68_STFLR_CMAF                            *((volatile unsigned int*)(0x42340E00UL))
#define bM4_TMR68_STFLR_CMBF                            *((volatile unsigned int*)(0x42340E04UL))
#define bM4_TMR68_STFLR_CMCF                            *((volatile unsigned int*)(0x42340E08UL))
#define bM4_TMR68_STFLR_CMDF                            *((volatile unsigned int*)(0x42340E0CUL))
#define bM4_TMR68_STFLR_CMEF                            *((volatile unsigned int*)(0x42340E10UL))
#define bM4_TMR68_STFLR_CMFF                            *((volatile unsigned int*)(0x42340E14UL))
#define bM4_TMR68_STFLR_OVFF                            *((volatile unsigned int*)(0x42340E18UL))
#define bM4_TMR68_STFLR_UDFF                            *((volatile unsigned int*)(0x42340E1CUL))
#define bM4_TMR68_STFLR_DTEF                            *((volatile unsigned int*)(0x42340E20UL))
#define bM4_TMR68_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42340E24UL))
#define bM4_TMR68_STFLR_CMSADF                          *((volatile unsigned int*)(0x42340E28UL))
#define bM4_TMR68_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42340E2CUL))
#define bM4_TMR68_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42340E30UL))
#define bM4_TMR68_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42340E54UL))
#define bM4_TMR68_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42340E58UL))
#define bM4_TMR68_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42340E5CUL))
#define bM4_TMR68_STFLR_DIRF                            *((volatile unsigned int*)(0x42340E7CUL))
#define bM4_TMR68_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42340E80UL))
#define bM4_TMR68_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42340E84UL))
#define bM4_TMR68_HSTAR_HSTA2                           *((volatile unsigned int*)(0x42340E88UL))
#define bM4_TMR68_HSTAR_HSTA3                           *((volatile unsigned int*)(0x42340E8CUL))
#define bM4_TMR68_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42340E90UL))
#define bM4_TMR68_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42340E94UL))
#define bM4_TMR68_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42340E98UL))
#define bM4_TMR68_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42340E9CUL))
#define bM4_TMR68_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42340EA0UL))
#define bM4_TMR68_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42340EA4UL))
#define bM4_TMR68_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42340EA8UL))
#define bM4_TMR68_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42340EACUL))
#define bM4_TMR68_HSTAR_HSTA12                          *((volatile unsigned int*)(0x42340EB0UL))
#define bM4_TMR68_HSTAR_HSTA13                          *((volatile unsigned int*)(0x42340EB4UL))
#define bM4_TMR68_HSTAR_HSTA14                          *((volatile unsigned int*)(0x42340EB8UL))
#define bM4_TMR68_HSTAR_HSTA15                          *((volatile unsigned int*)(0x42340EBCUL))
#define bM4_TMR68_HSTAR_STARTS                          *((volatile unsigned int*)(0x42340EFCUL))
#define bM4_TMR68_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42340F00UL))
#define bM4_TMR68_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42340F04UL))
#define bM4_TMR68_HSTPR_HSTP2                           *((volatile unsigned int*)(0x42340F08UL))
#define bM4_TMR68_HSTPR_HSTP3                           *((volatile unsigned int*)(0x42340F0CUL))
#define bM4_TMR68_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42340F10UL))
#define bM4_TMR68_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42340F14UL))
#define bM4_TMR68_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42340F18UL))
#define bM4_TMR68_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42340F1CUL))
#define bM4_TMR68_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42340F20UL))
#define bM4_TMR68_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42340F24UL))
#define bM4_TMR68_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42340F28UL))
#define bM4_TMR68_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42340F2CUL))
#define bM4_TMR68_HSTPR_HSTP12                          *((volatile unsigned int*)(0x42340F30UL))
#define bM4_TMR68_HSTPR_HSTP13                          *((volatile unsigned int*)(0x42340F34UL))
#define bM4_TMR68_HSTPR_HSTP14                          *((volatile unsigned int*)(0x42340F38UL))
#define bM4_TMR68_HSTPR_HSTP15                          *((volatile unsigned int*)(0x42340F3CUL))
#define bM4_TMR68_HSTPR_STOPS                           *((volatile unsigned int*)(0x42340F7CUL))
#define bM4_TMR68_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42340F80UL))
#define bM4_TMR68_HCLRR_HCLE1                           *((volatile unsigned int*)(0x42340F84UL))
#define bM4_TMR68_HCLRR_HCLE2                           *((volatile unsigned int*)(0x42340F88UL))
#define bM4_TMR68_HCLRR_HCLE3                           *((volatile unsigned int*)(0x42340F8CUL))
#define bM4_TMR68_HCLRR_HCLE4                           *((volatile unsigned int*)(0x42340F90UL))
#define bM4_TMR68_HCLRR_HCLE5                           *((volatile unsigned int*)(0x42340F94UL))
#define bM4_TMR68_HCLRR_HCLE6                           *((volatile unsigned int*)(0x42340F98UL))
#define bM4_TMR68_HCLRR_HCLE7                           *((volatile unsigned int*)(0x42340F9CUL))
#define bM4_TMR68_HCLRR_HCLE8                           *((volatile unsigned int*)(0x42340FA0UL))
#define bM4_TMR68_HCLRR_HCLE9                           *((volatile unsigned int*)(0x42340FA4UL))
#define bM4_TMR68_HCLRR_HCLE10                          *((volatile unsigned int*)(0x42340FA8UL))
#define bM4_TMR68_HCLRR_HCLE11                          *((volatile unsigned int*)(0x42340FACUL))
#define bM4_TMR68_HCLRR_HCLE12                          *((volatile unsigned int*)(0x42340FB0UL))
#define bM4_TMR68_HCLRR_HCLE13                          *((volatile unsigned int*)(0x42340FB4UL))
#define bM4_TMR68_HCLRR_HCLE14                          *((volatile unsigned int*)(0x42340FB8UL))
#define bM4_TMR68_HCLRR_HCLE15                          *((volatile unsigned int*)(0x42340FBCUL))
#define bM4_TMR68_HCLRR_CLEARS                          *((volatile unsigned int*)(0x42340FFCUL))
#define bM4_TMR68_HCPAR_HCPA0                           *((volatile unsigned int*)(0x42341000UL))
#define bM4_TMR68_HCPAR_HCPA1                           *((volatile unsigned int*)(0x42341004UL))
#define bM4_TMR68_HCPAR_HCPA2                           *((volatile unsigned int*)(0x42341008UL))
#define bM4_TMR68_HCPAR_HCPA3                           *((volatile unsigned int*)(0x4234100CUL))
#define bM4_TMR68_HCPAR_HCPA4                           *((volatile unsigned int*)(0x42341010UL))
#define bM4_TMR68_HCPAR_HCPA5                           *((volatile unsigned int*)(0x42341014UL))
#define bM4_TMR68_HCPAR_HCPA6                           *((volatile unsigned int*)(0x42341018UL))
#define bM4_TMR68_HCPAR_HCPA7                           *((volatile unsigned int*)(0x4234101CUL))
#define bM4_TMR68_HCPAR_HCPA8                           *((volatile unsigned int*)(0x42341020UL))
#define bM4_TMR68_HCPAR_HCPA9                           *((volatile unsigned int*)(0x42341024UL))
#define bM4_TMR68_HCPAR_HCPA10                          *((volatile unsigned int*)(0x42341028UL))
#define bM4_TMR68_HCPAR_HCPA11                          *((volatile unsigned int*)(0x4234102CUL))
#define bM4_TMR68_HCPAR_HCPA12                          *((volatile unsigned int*)(0x42341030UL))
#define bM4_TMR68_HCPAR_HCPA13                          *((volatile unsigned int*)(0x42341034UL))
#define bM4_TMR68_HCPAR_HCPA14                          *((volatile unsigned int*)(0x42341038UL))
#define bM4_TMR68_HCPAR_HCPA15                          *((volatile unsigned int*)(0x4234103CUL))
#define bM4_TMR68_HCPBR_HCPB0                           *((volatile unsigned int*)(0x42341080UL))
#define bM4_TMR68_HCPBR_HCPB1                           *((volatile unsigned int*)(0x42341084UL))
#define bM4_TMR68_HCPBR_HCPB2                           *((volatile unsigned int*)(0x42341088UL))
#define bM4_TMR68_HCPBR_HCPB3                           *((volatile unsigned int*)(0x4234108CUL))
#define bM4_TMR68_HCPBR_HCPB4                           *((volatile unsigned int*)(0x42341090UL))
#define bM4_TMR68_HCPBR_HCPB5                           *((volatile unsigned int*)(0x42341094UL))
#define bM4_TMR68_HCPBR_HCPB6                           *((volatile unsigned int*)(0x42341098UL))
#define bM4_TMR68_HCPBR_HCPB7                           *((volatile unsigned int*)(0x4234109CUL))
#define bM4_TMR68_HCPBR_HCPB8                           *((volatile unsigned int*)(0x423410A0UL))
#define bM4_TMR68_HCPBR_HCPB9                           *((volatile unsigned int*)(0x423410A4UL))
#define bM4_TMR68_HCPBR_HCPB10                          *((volatile unsigned int*)(0x423410A8UL))
#define bM4_TMR68_HCPBR_HCPB11                          *((volatile unsigned int*)(0x423410ACUL))
#define bM4_TMR68_HCPBR_HCPB12                          *((volatile unsigned int*)(0x423410B0UL))
#define bM4_TMR68_HCPBR_HCPB13                          *((volatile unsigned int*)(0x423410B4UL))
#define bM4_TMR68_HCPBR_HCPB14                          *((volatile unsigned int*)(0x423410B8UL))
#define bM4_TMR68_HCPBR_HCPB15                          *((volatile unsigned int*)(0x423410BCUL))
#define bM4_TMR68_HCUPR_HCUP0                           *((volatile unsigned int*)(0x42341100UL))
#define bM4_TMR68_HCUPR_HCUP1                           *((volatile unsigned int*)(0x42341104UL))
#define bM4_TMR68_HCUPR_HCUP2                           *((volatile unsigned int*)(0x42341108UL))
#define bM4_TMR68_HCUPR_HCUP3                           *((volatile unsigned int*)(0x4234110CUL))
#define bM4_TMR68_HCUPR_HCUP4                           *((volatile unsigned int*)(0x42341110UL))
#define bM4_TMR68_HCUPR_HCUP5                           *((volatile unsigned int*)(0x42341114UL))
#define bM4_TMR68_HCUPR_HCUP6                           *((volatile unsigned int*)(0x42341118UL))
#define bM4_TMR68_HCUPR_HCUP7                           *((volatile unsigned int*)(0x4234111CUL))
#define bM4_TMR68_HCUPR_HCUP8                           *((volatile unsigned int*)(0x42341120UL))
#define bM4_TMR68_HCUPR_HCUP9                           *((volatile unsigned int*)(0x42341124UL))
#define bM4_TMR68_HCUPR_HCUP10                          *((volatile unsigned int*)(0x42341128UL))
#define bM4_TMR68_HCUPR_HCUP11                          *((volatile unsigned int*)(0x4234112CUL))
#define bM4_TMR68_HCUPR_HCUP12                          *((volatile unsigned int*)(0x42341130UL))
#define bM4_TMR68_HCUPR_HCUP13                          *((volatile unsigned int*)(0x42341134UL))
#define bM4_TMR68_HCUPR_HCUP14                          *((volatile unsigned int*)(0x42341138UL))
#define bM4_TMR68_HCUPR_HCUP15                          *((volatile unsigned int*)(0x4234113CUL))
#define bM4_TMR68_HCUPR_HCUP16                          *((volatile unsigned int*)(0x42341140UL))
#define bM4_TMR68_HCUPR_HCUP17                          *((volatile unsigned int*)(0x42341144UL))
#define bM4_TMR68_HCUPR_HCUP18                          *((volatile unsigned int*)(0x42341148UL))
#define bM4_TMR68_HCUPR_HCUP19                          *((volatile unsigned int*)(0x4234114CUL))
#define bM4_TMR68_HCUPR_RESV                            *((volatile unsigned int*)(0x42341160UL))
#define bM4_TMR68_HCDOR_HCDO0                           *((volatile unsigned int*)(0x42341180UL))
#define bM4_TMR68_HCDOR_HCDO1                           *((volatile unsigned int*)(0x42341184UL))
#define bM4_TMR68_HCDOR_HCDO2                           *((volatile unsigned int*)(0x42341188UL))
#define bM4_TMR68_HCDOR_HCDO3                           *((volatile unsigned int*)(0x4234118CUL))
#define bM4_TMR68_HCDOR_HCDO4                           *((volatile unsigned int*)(0x42341190UL))
#define bM4_TMR68_HCDOR_HCDO5                           *((volatile unsigned int*)(0x42341194UL))
#define bM4_TMR68_HCDOR_HCDO6                           *((volatile unsigned int*)(0x42341198UL))
#define bM4_TMR68_HCDOR_HCDO7                           *((volatile unsigned int*)(0x4234119CUL))
#define bM4_TMR68_HCDOR_HCDO8                           *((volatile unsigned int*)(0x423411A0UL))
#define bM4_TMR68_HCDOR_HCDO9                           *((volatile unsigned int*)(0x423411A4UL))
#define bM4_TMR68_HCDOR_HCDO10                          *((volatile unsigned int*)(0x423411A8UL))
#define bM4_TMR68_HCDOR_HCDO11                          *((volatile unsigned int*)(0x423411ACUL))
#define bM4_TMR68_HCDOR_HCDO12                          *((volatile unsigned int*)(0x423411B0UL))
#define bM4_TMR68_HCDOR_HCDO13                          *((volatile unsigned int*)(0x423411B4UL))
#define bM4_TMR68_HCDOR_HCDO14                          *((volatile unsigned int*)(0x423411B8UL))
#define bM4_TMR68_HCDOR_HCDO15                          *((volatile unsigned int*)(0x423411BCUL))
#define bM4_TMR68_HCDOR_HCDO16                          *((volatile unsigned int*)(0x423411C0UL))
#define bM4_TMR68_HCDOR_HCDO17                          *((volatile unsigned int*)(0x423411C4UL))
#define bM4_TMR68_HCDOR_HCDO18                          *((volatile unsigned int*)(0x423411C8UL))
#define bM4_TMR68_HCDOR_HCDO19                          *((volatile unsigned int*)(0x423411CCUL))
#define bM4_TMR68_HCDOR_RESV                            *((volatile unsigned int*)(0x423411E0UL))
#define bM4_TMR68_SSTAR_SSTA0                           *((volatile unsigned int*)(0x42347E80UL))
#define bM4_TMR68_SSTAR_SSTA1                           *((volatile unsigned int*)(0x42347E84UL))
#define bM4_TMR68_SSTAR_SSTA2                           *((volatile unsigned int*)(0x42347E88UL))
#define bM4_TMR68_SSTAR_SSTA3                           *((volatile unsigned int*)(0x42347E8CUL))
#define bM4_TMR68_SSTAR_SSTA4                           *((volatile unsigned int*)(0x42347E90UL))
#define bM4_TMR68_SSTAR_SSTA5                           *((volatile unsigned int*)(0x42347E94UL))
#define bM4_TMR68_SSTAR_SSTA6                           *((volatile unsigned int*)(0x42347E98UL))
#define bM4_TMR68_SSTAR_SSTA7                           *((volatile unsigned int*)(0x42347E9CUL))
#define bM4_TMR68_SSTAR_SSTA8                           *((volatile unsigned int*)(0x42347EA0UL))
#define bM4_TMR68_SSTAR_SSTA9                           *((volatile unsigned int*)(0x42347EA4UL))
#define bM4_TMR68_SSTAR_RESV                            *((volatile unsigned int*)(0x42347EE0UL))
#define bM4_TMR68_SSTPR_SSTP0                           *((volatile unsigned int*)(0x42347F00UL))
#define bM4_TMR68_SSTPR_SSTP1                           *((volatile unsigned int*)(0x42347F04UL))
#define bM4_TMR68_SSTPR_SSTP2                           *((volatile unsigned int*)(0x42347F08UL))
#define bM4_TMR68_SSTPR_SSTP3                           *((volatile unsigned int*)(0x42347F0CUL))
#define bM4_TMR68_SSTPR_SSTP4                           *((volatile unsigned int*)(0x42347F10UL))
#define bM4_TMR68_SSTPR_SSTP5                           *((volatile unsigned int*)(0x42347F14UL))
#define bM4_TMR68_SSTPR_SSTP6                           *((volatile unsigned int*)(0x42347F18UL))
#define bM4_TMR68_SSTPR_SSTP7                           *((volatile unsigned int*)(0x42347F1CUL))
#define bM4_TMR68_SSTPR_SSTP8                           *((volatile unsigned int*)(0x42347F20UL))
#define bM4_TMR68_SSTPR_SSTP9                           *((volatile unsigned int*)(0x42347F24UL))
#define bM4_TMR68_SSTPR_RESV                            *((volatile unsigned int*)(0x42347F60UL))
#define bM4_TMR68_SCLRR_SCLE0                           *((volatile unsigned int*)(0x42347F80UL))
#define bM4_TMR68_SCLRR_SCLE1                           *((volatile unsigned int*)(0x42347F84UL))
#define bM4_TMR68_SCLRR_SCLE2                           *((volatile unsigned int*)(0x42347F88UL))
#define bM4_TMR68_SCLRR_SCLE3                           *((volatile unsigned int*)(0x42347F8CUL))
#define bM4_TMR68_SCLRR_SCLE4                           *((volatile unsigned int*)(0x42347F90UL))
#define bM4_TMR68_SCLRR_SCLE5                           *((volatile unsigned int*)(0x42347F94UL))
#define bM4_TMR68_SCLRR_SCLE6                           *((volatile unsigned int*)(0x42347F98UL))
#define bM4_TMR68_SCLRR_SCLE7                           *((volatile unsigned int*)(0x42347F9CUL))
#define bM4_TMR68_SCLRR_SCLE8                           *((volatile unsigned int*)(0x42347FA0UL))
#define bM4_TMR68_SCLRR_SCLE9                           *((volatile unsigned int*)(0x42347FA4UL))
#define bM4_TMR68_SCLRR_RESV                            *((volatile unsigned int*)(0x42347FE0UL))
#define bM4_TMR69_GCONR_START                           *((volatile unsigned int*)(0x42348A00UL))
#define bM4_TMR69_GCONR_MODE0                           *((volatile unsigned int*)(0x42348A04UL))
#define bM4_TMR69_GCONR_MODE1                           *((volatile unsigned int*)(0x42348A08UL))
#define bM4_TMR69_GCONR_MODE2                           *((volatile unsigned int*)(0x42348A0CUL))
#define bM4_TMR69_GCONR_CKDIV0                          *((volatile unsigned int*)(0x42348A10UL))
#define bM4_TMR69_GCONR_CKDIV1                          *((volatile unsigned int*)(0x42348A14UL))
#define bM4_TMR69_GCONR_CKDIV2                          *((volatile unsigned int*)(0x42348A18UL))
#define bM4_TMR69_GCONR_DIR                             *((volatile unsigned int*)(0x42348A20UL))
