RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR69_GCONR_ZMSKREV                         *((volatile unsigned int*)(0x42348A40UL))
#define bM4_TMR69_GCONR_ZMSKPOS                         *((volatile unsigned int*)(0x42348A44UL))
#define bM4_TMR69_GCONR_ZMSKVAL0                        *((volatile unsigned int*)(0x42348A48UL))
#define bM4_TMR69_GCONR_ZMSKVAL1                        *((volatile unsigned int*)(0x42348A4CUL))
#define bM4_TMR69_GCONR_RESV                            *((volatile unsigned int*)(0x42348A60UL))
#define bM4_TMR69_ICONR_INTENA                          *((volatile unsigned int*)(0x42348A80UL))
#define bM4_TMR69_ICONR_INTENB                          *((volatile unsigned int*)(0x42348A84UL))
#define bM4_TMR69_ICONR_INTENC                          *((volatile unsigned int*)(0x42348A88UL))
#define bM4_TMR69_ICONR_INTEND                          *((volatile unsigned int*)(0x42348A8CUL))
#define bM4_TMR69_ICONR_INTENE                          *((volatile unsigned int*)(0x42348A90UL))
#define bM4_TMR69_ICONR_INTENF                          *((volatile unsigned int*)(0x42348A94UL))
#define bM4_TMR69_ICONR_INTENOVF                        *((volatile unsigned int*)(0x42348A98UL))
#define bM4_TMR69_ICONR_INTENUDF                        *((volatile unsigned int*)(0x42348A9CUL))
#define bM4_TMR69_ICONR_INTENDTE                        *((volatile unsigned int*)(0x42348AA0UL))
#define bM4_TMR69_ICONR_INTENSAU                        *((volatile unsigned int*)(0x42348AC0UL))
#define bM4_TMR69_ICONR_INTENSAD                        *((volatile unsigned int*)(0x42348AC4UL))
#define bM4_TMR69_ICONR_INTENSBU                        *((volatile unsigned int*)(0x42348AC8UL))
#define bM4_TMR69_ICONR_INTENSBD                        *((volatile unsigned int*)(0x42348ACCUL))
#define bM4_TMR69_ICONR_RESV                            *((volatile unsigned int*)(0x42348AE0UL))
#define bM4_TMR69_PCONR_CAPMDA                          *((volatile unsigned int*)(0x42348B00UL))
#define bM4_TMR69_PCONR_STACA                           *((volatile unsigned int*)(0x42348B04UL))
#define bM4_TMR69_PCONR_STPCA                           *((volatile unsigned int*)(0x42348B08UL))
#define bM4_TMR69_PCONR_STASTPSA                        *((volatile unsigned int*)(0x42348B0CUL))
#define bM4_TMR69_PCONR_CMPCA0                          *((volatile unsigned int*)(0x42348B10UL))
#define bM4_TMR69_PCONR_CMPCA1                          *((volatile unsigned int*)(0x42348B14UL))
#define bM4_TMR69_PCONR_PERCA0                          *((volatile unsigned int*)(0x42348B18UL))
#define bM4_TMR69_PCONR_PERCA1                          *((volatile unsigned int*)(0x42348B1CUL))
#define bM4_TMR69_PCONR_OUTENA                          *((volatile unsigned int*)(0x42348B20UL))
#define bM4_TMR69_PCONR_EMBSELA0                        *((volatile unsigned int*)(0x42348B24UL))
#define bM4_TMR69_PCONR_EMBSELA1                        *((volatile unsigned int*)(0x42348B28UL))
#define bM4_TMR69_PCONR_EMBVALA0                        *((volatile unsigned int*)(0x42348B2CUL))
#define bM4_TMR69_PCONR_EMBVALA1                        *((volatile unsigned int*)(0x42348B30UL))
#define bM4_TMR69_PCONR_CAPMDB                          *((volatile unsigned int*)(0x42348B40UL))
#define bM4_TMR69_PCONR_STACB                           *((volatile unsigned int*)(0x42348B44UL))
#define bM4_TMR69_PCONR_STPCB                           *((volatile unsigned int*)(0x42348B48UL))
#define bM4_TMR69_PCONR_STASTPSB                        *((volatile unsigned int*)(0x42348B4CUL))
#define bM4_TMR69_PCONR_CMPCB0                          *((volatile unsigned int*)(0x42348B50UL))
#define bM4_TMR69_PCONR_CMPCB1                          *((volatile unsigned int*)(0x42348B54UL))
#define bM4_TMR69_PCONR_PERCB0                          *((volatile unsigned int*)(0x42348B58UL))
#define bM4_TMR69_PCONR_PERCB1                          *((volatile unsigned int*)(0x42348B5CUL))
#define bM4_TMR69_PCONR_OUTENB                          *((volatile unsigned int*)(0x42348B60UL))
#define bM4_TMR69_PCONR_EMBSELB0                        *((volatile unsigned int*)(0x42348B64UL))
#define bM4_TMR69_PCONR_EMBSELB1                        *((volatile unsigned int*)(0x42348B68UL))
#define bM4_TMR69_PCONR_EMBVALB0                        *((volatile unsigned int*)(0x42348B6CUL))
#define bM4_TMR69_PCONR_EMBVALB1                        *((volatile unsigned int*)(0x42348B70UL))
#define bM4_TMR69_BCONR_BENA                            *((volatile unsigned int*)(0x42348B80UL))
#define bM4_TMR69_BCONR_BSEA                            *((volatile unsigned int*)(0x42348B84UL))
#define bM4_TMR69_BCONR_BENB                            *((volatile unsigned int*)(0x42348B88UL))
#define bM4_TMR69_BCONR_BSEB                            *((volatile unsigned int*)(0x42348B8CUL))
#define bM4_TMR69_BCONR_BENP                            *((volatile unsigned int*)(0x42348BA0UL))
#define bM4_TMR69_BCONR_BSEP                            *((volatile unsigned int*)(0x42348BA4UL))
#define bM4_TMR69_BCONR_BENSPA                          *((volatile unsigned int*)(0x42348BC0UL))
#define bM4_TMR69_BCONR_BSESPA                          *((volatile unsigned int*)(0x42348BC4UL))
#define bM4_TMR69_BCONR_BTRSPA0                         *((volatile unsigned int*)(0x42348BD0UL))
#define bM4_TMR69_BCONR_BTRSPA1                         *((volatile unsigned int*)(0x42348BD4UL))
#define bM4_TMR69_BCONR_BENSPB                          *((volatile unsigned int*)(0x42348BE0UL))
#define bM4_TMR69_BCONR_BSESPB                          *((volatile unsigned int*)(0x42348BE4UL))
#define bM4_TMR69_BCONR_BTRSPB0                         *((volatile unsigned int*)(0x42348BF0UL))
#define bM4_TMR69_BCONR_BTRSPB1                         *((volatile unsigned int*)(0x42348BF4UL))
#define bM4_TMR69_DCONR_DTCEN                           *((volatile unsigned int*)(0x42348C00UL))
#define bM4_TMR69_DCONR_DTBENU                          *((volatile unsigned int*)(0x42348C10UL))
#define bM4_TMR69_DCONR_DTBEND                          *((volatile unsigned int*)(0x42348C14UL))
#define bM4_TMR69_DCONR_SEPA                            *((volatile unsigned int*)(0x42348C20UL))
#define bM4_TMR69_FCONR_NOFIENGA                        *((volatile unsigned int*)(0x42348D00UL))
#define bM4_TMR69_FCONR_NOFICKGA0                       *((volatile unsigned int*)(0x42348D04UL))
#define bM4_TMR69_FCONR_NOFICKGA1                       *((volatile unsigned int*)(0x42348D08UL))
#define bM4_TMR69_FCONR_NOFIENGB                        *((volatile unsigned int*)(0x42348D10UL))
#define bM4_TMR69_FCONR_NOFICKGB0                       *((volatile unsigned int*)(0x42348D14UL))
#define bM4_TMR69_FCONR_NOFICKGB1                       *((volatile unsigned int*)(0x42348D18UL))
#define bM4_TMR69_FCONR_NOFIENTA                        *((volatile unsigned int*)(0x42348D40UL))
#define bM4_TMR69_FCONR_NOFICKTA0                       *((volatile unsigned int*)(0x42348D44UL))
#define bM4_TMR69_FCONR_NOFICKTA1                       *((volatile unsigned int*)(0x42348D48UL))
#define bM4_TMR69_FCONR_NOFIENTB                        *((volatile unsigned int*)(0x42348D50UL))
#define bM4_TMR69_FCONR_NOFICKTB0                       *((volatile unsigned int*)(0x42348D54UL))
#define bM4_TMR69_FCONR_NOFICKTB1                       *((volatile unsigned int*)(0x42348D58UL))
#define bM4_TMR69_FCONR_NOFIENTC                        *((volatile unsigned int*)(0x42348D60UL))
#define bM4_TMR69_FCONR_NOFICKTC0                       *((volatile unsigned int*)(0x42348D64UL))
#define bM4_TMR69_FCONR_NOFICKTC1                       *((volatile unsigned int*)(0x42348D68UL))
#define bM4_TMR69_FCONR_NOFIENTD                        *((volatile unsigned int*)(0x42348D70UL))
#define bM4_TMR69_FCONR_NOFICKTD0                       *((volatile unsigned int*)(0x42348D74UL))
#define bM4_TMR69_FCONR_NOFICKTD1                       *((volatile unsigned int*)(0x42348D78UL))
#define bM4_TMR69_VPERR_SPPERIA                         *((volatile unsigned int*)(0x42348DA0UL))
#define bM4_TMR69_VPERR_SPPERIB                         *((volatile unsigned int*)(0x42348DA4UL))
#define bM4_TMR69_VPERR_PCNTE0                          *((volatile unsigned int*)(0x42348DC0UL))
#define bM4_TMR69_VPERR_PCNTE1                          *((volatile unsigned int*)(0x42348DC4UL))
#define bM4_TMR69_VPERR_PCNTS0                          *((volatile unsigned int*)(0x42348DC8UL))
#define bM4_TMR69_VPERR_PCNTS1                          *((volatile unsigned int*)(0x42348DCCUL))
#define bM4_TMR69_VPERR_PCNTS2                          *((volatile unsigned int*)(0x42348DD0UL))
#define bM4_TMR69_VPERR_RESV                            *((volatile unsigned int*)(0x42348DE0UL))
#define bM4_TMR69_STFLR_CMAF                            *((volatile unsigned int*)(0x42348E00UL))
#define bM4_TMR69_STFLR_CMBF                            *((volatile unsigned int*)(0x42348E04UL))
#define bM4_TMR69_STFLR_CMCF                            *((volatile unsigned int*)(0x42348E08UL))
#define bM4_TMR69_STFLR_CMDF                            *((volatile unsigned int*)(0x42348E0CUL))
#define bM4_TMR69_STFLR_CMEF                            *((volatile unsigned int*)(0x42348E10UL))
#define bM4_TMR69_STFLR_CMFF                            *((volatile unsigned int*)(0x42348E14UL))
#define bM4_TMR69_STFLR_OVFF                            *((volatile unsigned int*)(0x42348E18UL))
#define bM4_TMR69_STFLR_UDFF                            *((volatile unsigned int*)(0x42348E1CUL))
#define bM4_TMR69_STFLR_DTEF                            *((volatile unsigned int*)(0x42348E20UL))
#define bM4_TMR69_STFLR_CMSAUF                          *((volatile unsigned int*)(0x42348E24UL))
#define bM4_TMR69_STFLR_CMSADF                          *((volatile unsigned int*)(0x42348E28UL))
#define bM4_TMR69_STFLR_CMSBUF                          *((volatile unsigned int*)(0x42348E2CUL))
#define bM4_TMR69_STFLR_CMSBDF                          *((volatile unsigned int*)(0x42348E30UL))
#define bM4_TMR69_STFLR_VPERNUM0                        *((volatile unsigned int*)(0x42348E54UL))
#define bM4_TMR69_STFLR_VPERNUM1                        *((volatile unsigned int*)(0x42348E58UL))
#define bM4_TMR69_STFLR_VPERNUM2                        *((volatile unsigned int*)(0x42348E5CUL))
#define bM4_TMR69_STFLR_DIRF                            *((volatile unsigned int*)(0x42348E7CUL))
#define bM4_TMR69_HSTAR_HSTA0                           *((volatile unsigned int*)(0x42348E80UL))
#define bM4_TMR69_HSTAR_HSTA1                           *((volatile unsigned int*)(0x42348E84UL))
#define bM4_TMR69_HSTAR_HSTA2                           *((volatile unsigned int*)(0x42348E88UL))
#define bM4_TMR69_HSTAR_HSTA3                           *((volatile unsigned int*)(0x42348E8CUL))
#define bM4_TMR69_HSTAR_HSTA4                           *((volatile unsigned int*)(0x42348E90UL))
#define bM4_TMR69_HSTAR_HSTA5                           *((volatile unsigned int*)(0x42348E94UL))
#define bM4_TMR69_HSTAR_HSTA6                           *((volatile unsigned int*)(0x42348E98UL))
#define bM4_TMR69_HSTAR_HSTA7                           *((volatile unsigned int*)(0x42348E9CUL))
#define bM4_TMR69_HSTAR_HSTA8                           *((volatile unsigned int*)(0x42348EA0UL))
#define bM4_TMR69_HSTAR_HSTA9                           *((volatile unsigned int*)(0x42348EA4UL))
#define bM4_TMR69_HSTAR_HSTA10                          *((volatile unsigned int*)(0x42348EA8UL))
#define bM4_TMR69_HSTAR_HSTA11                          *((volatile unsigned int*)(0x42348EACUL))
#define bM4_TMR69_HSTAR_HSTA12                          *((volatile unsigned int*)(0x42348EB0UL))
#define bM4_TMR69_HSTAR_HSTA13                          *((volatile unsigned int*)(0x42348EB4UL))
#define bM4_TMR69_HSTAR_HSTA14                          *((volatile unsigned int*)(0x42348EB8UL))
#define bM4_TMR69_HSTAR_HSTA15                          *((volatile unsigned int*)(0x42348EBCUL))
#define bM4_TMR69_HSTAR_STARTS                          *((volatile unsigned int*)(0x42348EFCUL))
#define bM4_TMR69_HSTPR_HSTP0                           *((volatile unsigned int*)(0x42348F00UL))
#define bM4_TMR69_HSTPR_HSTP1                           *((volatile unsigned int*)(0x42348F04UL))
#define bM4_TMR69_HSTPR_HSTP2                           *((volatile unsigned int*)(0x42348F08UL))
#define bM4_TMR69_HSTPR_HSTP3                           *((volatile unsigned int*)(0x42348F0CUL))
#define bM4_TMR69_HSTPR_HSTP4                           *((volatile unsigned int*)(0x42348F10UL))
#define bM4_TMR69_HSTPR_HSTP5                           *((volatile unsigned int*)(0x42348F14UL))
#define bM4_TMR69_HSTPR_HSTP6                           *((volatile unsigned int*)(0x42348F18UL))
#define bM4_TMR69_HSTPR_HSTP7                           *((volatile unsigned int*)(0x42348F1CUL))
#define bM4_TMR69_HSTPR_HSTP8                           *((volatile unsigned int*)(0x42348F20UL))
#define bM4_TMR69_HSTPR_HSTP9                           *((volatile unsigned int*)(0x42348F24UL))
#define bM4_TMR69_HSTPR_HSTP10                          *((volatile unsigned int*)(0x42348F28UL))
#define bM4_TMR69_HSTPR_HSTP11                          *((volatile unsigned int*)(0x42348F2CUL))
#define bM4_TMR69_HSTPR_HSTP12                          *((volatile unsigned int*)(0x42348F30UL))
#define bM4_TMR69_HSTPR_HSTP13                          *((volatile unsigned int*)(0x42348F34UL))
#define bM4_TMR69_HSTPR_HSTP14                          *((volatile unsigned int*)(0x42348F38UL))
#define bM4_TMR69_HSTPR_HSTP15                          *((volatile unsigned int*)(0x42348F3CUL))
#define bM4_TMR69_HSTPR_STOPS                           *((volatile unsigned int*)(0x42348F7CUL))
#define bM4_TMR69_HCLRR_HCLE0                           *((volatile unsigned int*)(0x42348F80UL))
#define bM4_TMR69_HCLRR_HCLE1                           *((volatile unsigned int*)(0x42348F84UL))
#define bM4_TMR69_HCLRR_HCLE2                           *((volatile unsigned int*)(0x42348F88UL))
#define bM4_TMR69_HCLRR_HCLE3                           *((volatile unsigned int*)(0x42348F8CUL))
#define bM4_TMR69_HCLRR_HCLE4                           *((volatile unsigned int*)(0x42348F90UL))
#define bM4_TMR69_HCLRR_HCLE5                           *((volatile unsigned int*)(0x42348F94UL))
#define bM4_TMR69_HCLRR_HCLE6                           *((volatile unsigned int*)(0x42348F98UL))
#define bM4_TMR69_HCLRR_HCLE7                           *((volatile unsigned int*)(0x42348F9CUL))
#define bM4_TMR69_HCLRR_HCLE8                           *((volatile unsigned int*)(0x42348FA0UL))
#define bM4_TMR69_HCLRR_HCLE9                           *((volatile unsigned int*)(0x42348FA4UL))
#define bM4_TMR69_HCLRR_HCLE10                          *((volatile unsigned int*)(0x42348FA8UL))
#define bM4_TMR69_HCLRR_HCLE11                          *((volatile unsigned int*)(0x42348FACUL))
#define bM4_TMR69_HCLRR_HCLE12                          *((volatile unsigned int*)(0x42348FB0UL))
#define bM4_TMR69_HCLRR_HCLE13                          *((volatile unsigned int*)(0x42348FB4UL))
#define bM4_TMR69_HCLRR_HCLE14                          *((volatile unsigned int*)(0x42348FB8UL))
#define bM4_TMR69_HCLRR_HCLE15                          *((volatile unsigned int*)(0x42348FBCUL))
#define bM4_TMR69_HCLRR_CLEARS                          *((volatile unsigned int*)(0x42348FFCUL))
#define bM4_TMR69_HCPAR_HCPA0                           *((volatile unsigned int*)(0x42349000UL))
#define bM4_TMR69_HCPAR_HCPA1                           *((volatile unsigned int*)(0x42349004UL))
#define bM4_TMR69_HCPAR_HCPA2                           *((volatile unsigned int*)(0x42349008UL))
#define bM4_TMR69_HCPAR_HCPA3                           *((volatile unsigned int*)(0x4234900CUL))
#define bM4_TMR69_HCPAR_HCPA4                           *((volatile unsigned int*)(0x42349010UL))
#define bM4_TMR69_HCPAR_HCPA5                           *((volatile unsigned int*)(0x42349014UL))
#define bM4_TMR69_HCPAR_HCPA6                           *((volatile unsigned int*)(0x42349018UL))
#define bM4_TMR69_HCPAR_HCPA7                           *((volatile unsigned int*)(0x4234901CUL))
#define bM4_TMR69_HCPAR_HCPA8                           *((volatile unsigned int*)(0x42349020UL))
#define bM4_TMR69_HCPAR_HCPA9                           *((volatile unsigned int*)(0x42349024UL))
#define bM4_TMR69_HCPAR_HCPA10                          *((volatile unsigned int*)(0x42349028UL))
#define bM4_TMR69_HCPAR_HCPA11                          *((volatile unsigned int*)(0x4234902CUL))
#define bM4_TMR69_HCPAR_HCPA12                          *((volatile unsigned int*)(0x42349030UL))
#define bM4_TMR69_HCPAR_HCPA13                          *((volatile unsigned int*)(0x42349034UL))
#define bM4_TMR69_HCPAR_HCPA14                          *((volatile unsigned int*)(0x42349038UL))
#define bM4_TMR69_HCPAR_HCPA15                          *((volatile unsigned int*)(0x4234903CUL))
#define bM4_TMR69_HCPBR_HCPB0                           *((volatile unsigned int*)(0x42349080UL))
#define bM4_TMR69_HCPBR_HCPB1                           *((volatile unsigned int*)(0x42349084UL))
#define bM4_TMR69_HCPBR_HCPB2                           *((volatile unsigned int*)(0x42349088UL))
#define bM4_TMR69_HCPBR_HCPB3                           *((volatile unsigned int*)(0x4234908CUL))
#define bM4_TMR69_HCPBR_HCPB4                           *((volatile unsigned int*)(0x42349090UL))
#define bM4_TMR69_HCPBR_HCPB5                           *((volatile unsigned int*)(0x42349094UL))
#define bM4_TMR69_HCPBR_HCPB6                           *((volatile unsigned int*)(0x42349098UL))
#define bM4_TMR69_HCPBR_HCPB7                           *((volatile unsigned int*)(0x4234909CUL))
#define bM4_TMR69_HCPBR_HCPB8                           *((volatile unsigned int*)(0x423490A0UL))
#define bM4_TMR69_HCPBR_HCPB9                           *((volatile unsigned int*)(0x423490A4UL))
#define bM4_TMR69_HCPBR_HCPB10                          *((volatile unsigned int*)(0x423490A8UL))
#define bM4_TMR69_HCPBR_HCPB11                          *((volatile unsigned int*)(0x423490ACUL))
#define bM4_TMR69_HCPBR_HCPB12                          *((volatile unsigned int*)(0x423490B0UL))
#define bM4_TMR69_HCPBR_HCPB13                          *((volatile unsigned int*)(0x423490B4UL))
#define bM4_TMR69_HCPBR_HCPB14                          *((volatile unsigned int*)(0x423490B8UL))
#define bM4_TMR69_HCPBR_HCPB15                          *((volatile unsigned int*)(0x423490BCUL))
#define bM4_TMR69_HCUPR_HCUP0                           *((volatile unsigned int*)(0x42349100UL))
#define bM4_TMR69_HCUPR_HCUP1                           *((volatile unsigned int*)(0x42349104UL))
#define bM4_TMR69_HCUPR_HCUP2                           *((volatile unsigned int*)(0x42349108UL))
#define bM4_TMR69_HCUPR_HCUP3                           *((volatile unsigned int*)(0x4234910CUL))
#define bM4_TMR69_HCUPR_HCUP4                           *((volatile unsigned int*)(0x42349110UL))
#define bM4_TMR69_HCUPR_HCUP5                           *((volatile unsigned int*)(0x42349114UL))
#define bM4_TMR69_HCUPR_HCUP6                           *((volatile unsigned int*)(0x42349118UL))
#define bM4_TMR69_HCUPR_HCUP7                           *((volatile unsigned int*)(0x4234911CUL))
#define bM4_TMR69_HCUPR_HCUP8                           *((volatile unsigned int*)(0x42349120UL))
#define bM4_TMR69_HCUPR_HCUP9                           *((volatile unsigned int*)(0x42349124UL))
#define bM4_TMR69_HCUPR_HCUP10                          *((volatile unsigned int*)(0x42349128UL))
#define bM4_TMR69_HCUPR_HCUP11                          *((volatile unsigned int*)(0x4234912CUL))
#define bM4_TMR69_HCUPR_HCUP12                          *((volatile unsigned int*)(0x42349130UL))
#define bM4_TMR69_HCUPR_HCUP13                          *((volatile unsigned int*)(0x42349134UL))
#define bM4_TMR69_HCUPR_HCUP14                          *((volatile unsigned int*)(0x42349138UL))
#define bM4_TMR69_HCUPR_HCUP15                          *((volatile unsigned int*)(0x4234913CUL))
#define bM4_TMR69_HCUPR_HCUP16                          *((volatile unsigned int*)(0x42349140UL))
#define bM4_TMR69_HCUPR_HCUP17                          *((volatile unsigned int*)(0x42349144UL))
#define bM4_TMR69_HCUPR_HCUP18                          *((volatile unsigned int*)(0x42349148UL))
#define bM4_TMR69_HCUPR_HCUP19                          *((volatile unsigned int*)(0x4234914CUL))
#define bM4_TMR69_HCUPR_RESV                            *((volatile unsigned int*)(0x42349160UL))
#define bM4_TMR69_HCDOR_HCDO0                           *((volatile unsigned int*)(0x42349180UL))
#define bM4_TMR69_HCDOR_HCDO1                           *((volatile unsigned int*)(0x42349184UL))
#define bM4_TMR69_HCDOR_HCDO2                           *((volatile unsigned int*)(0x42349188UL))
#define bM4_TMR69_HCDOR_HCDO3                           *((volatile unsigned int*)(0x4234918CUL))
#define bM4_TMR69_HCDOR_HCDO4                           *((volatile unsigned int*)(0x42349190UL))
#define bM4_TMR69_HCDOR_HCDO5                           *((volatile unsigned int*)(0x42349194UL))
#define bM4_TMR69_HCDOR_HCDO6                           *((volatile unsigned int*)(0x42349198UL))
#define bM4_TMR69_HCDOR_HCDO7                           *((volatile unsigned int*)(0x4234919CUL))
#define bM4_TMR69_HCDOR_HCDO8                           *((volatile unsigned int*)(0x423491A0UL))
#define bM4_TMR69_HCDOR_HCDO9                           *((volatile unsigned int*)(0x423491A4UL))
#define bM4_TMR69_HCDOR_HCDO10                          *((volatile unsigned int*)(0x423491A8UL))
#define bM4_TMR69_HCDOR_HCDO11                          *((volatile unsigned int*)(0x423491ACUL))
#define bM4_TMR69_HCDOR_HCDO12                          *((volatile unsigned int*)(0x423491B0UL))
#define bM4_TMR69_HCDOR_HCDO13                          *((volatile unsigned int*)(0x423491B4UL))
#define bM4_TMR69_HCDOR_HCDO14                          *((volatile unsigned int*)(0x423491B8UL))
#define bM4_TMR69_HCDOR_HCDO15                          *((volatile unsigned int*)(0x423491BCUL))
#define bM4_TMR69_HCDOR_HCDO16                          *((volatile unsigned int*)(0x423491C0UL))
#define bM4_TMR69_HCDOR_HCDO17                          *((volatile unsigned int*)(0x423491C4UL))
#define bM4_TMR69_HCDOR_HCDO18                          *((volatile unsigned int*)(0x423491C8UL))
#define bM4_TMR69_HCDOR_HCDO19                          *((volatile unsigned int*)(0x423491CCUL))
#define bM4_TMR69_HCDOR_RESV                            *((volatile unsigned int*)(0x423491E0UL))
#define bM4_TMR69_SSTAR_SSTA0                           *((volatile unsigned int*)(0x4234FE80UL))
#define bM4_TMR69_SSTAR_SSTA1                           *((volatile unsigned int*)(0x4234FE84UL))
#define bM4_TMR69_SSTAR_SSTA2                           *((volatile unsigned int*)(0x4234FE88UL))
#define bM4_TMR69_SSTAR_SSTA3                           *((volatile unsigned int*)(0x4234FE8CUL))
#define bM4_TMR69_SSTAR_SSTA4                           *((volatile unsigned int*)(0x4234FE90UL))
#define bM4_TMR69_SSTAR_SSTA5                           *((volatile unsigned int*)(0x4234FE94UL))
#define bM4_TMR69_SSTAR_SSTA6                           *((volatile unsigned int*)(0x4234FE98UL))
#define bM4_TMR69_SSTAR_SSTA7                           *((volatile unsigned int*)(0x4234FE9CUL))
#define bM4_TMR69_SSTAR_SSTA8                           *((volatile unsigned int*)(0x4234FEA0UL))
#define bM4_TMR69_SSTAR_SSTA9                           *((volatile unsigned int*)(0x4234FEA4UL))
#define bM4_TMR69_SSTAR_RESV                            *((volatile unsigned int*)(0x4234FEE0UL))
#define bM4_TMR69_SSTPR_SSTP0                           *((volatile unsigned int*)(0x4234FF00UL))
#define bM4_TMR69_SSTPR_SSTP1                           *((volatile unsigned int*)(0x4234FF04UL))
