RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_TMR69_SSTPR_SSTP2                           *((volatile unsigned int*)(0x4234FF08UL))
#define bM4_TMR69_SSTPR_SSTP3                           *((volatile unsigned int*)(0x4234FF0CUL))
#define bM4_TMR69_SSTPR_SSTP4                           *((volatile unsigned int*)(0x4234FF10UL))
#define bM4_TMR69_SSTPR_SSTP5                           *((volatile unsigned int*)(0x4234FF14UL))
#define bM4_TMR69_SSTPR_SSTP6                           *((volatile unsigned int*)(0x4234FF18UL))
#define bM4_TMR69_SSTPR_SSTP7                           *((volatile unsigned int*)(0x4234FF1CUL))
#define bM4_TMR69_SSTPR_SSTP8                           *((volatile unsigned int*)(0x4234FF20UL))
#define bM4_TMR69_SSTPR_SSTP9                           *((volatile unsigned int*)(0x4234FF24UL))
#define bM4_TMR69_SSTPR_RESV                            *((volatile unsigned int*)(0x4234FF60UL))
#define bM4_TMR69_SCLRR_SCLE0                           *((volatile unsigned int*)(0x4234FF80UL))
#define bM4_TMR69_SCLRR_SCLE1                           *((volatile unsigned int*)(0x4234FF84UL))
#define bM4_TMR69_SCLRR_SCLE2                           *((volatile unsigned int*)(0x4234FF88UL))
#define bM4_TMR69_SCLRR_SCLE3                           *((volatile unsigned int*)(0x4234FF8CUL))
#define bM4_TMR69_SCLRR_SCLE4                           *((volatile unsigned int*)(0x4234FF90UL))
#define bM4_TMR69_SCLRR_SCLE5                           *((volatile unsigned int*)(0x4234FF94UL))
#define bM4_TMR69_SCLRR_SCLE6                           *((volatile unsigned int*)(0x4234FF98UL))
#define bM4_TMR69_SCLRR_SCLE7                           *((volatile unsigned int*)(0x4234FF9CUL))
#define bM4_TMR69_SCLRR_SCLE8                           *((volatile unsigned int*)(0x4234FFA0UL))
#define bM4_TMR69_SCLRR_SCLE9                           *((volatile unsigned int*)(0x4234FFA4UL))
#define bM4_TMR69_SCLRR_RESV                            *((volatile unsigned int*)(0x4234FFE0UL))
#define bM4_TRNG_CR_EN                                  *((volatile unsigned int*)(0x42110000UL))
#define bM4_TRNG_CR_RUN                                 *((volatile unsigned int*)(0x42110004UL))
#define bM4_TRNG_FR_LENGTH0                             *((volatile unsigned int*)(0x42110080UL))
#define bM4_TRNG_FR_LENGTH1                             *((volatile unsigned int*)(0x42110084UL))
#define bM4_TRNG_FR_LENGTH2                             *((volatile unsigned int*)(0x42110088UL))
#define bM4_TRNG_FR_LENGTH3                             *((volatile unsigned int*)(0x4211008CUL))
#define bM4_TRNG_FR_XOR0                                *((volatile unsigned int*)(0x42110090UL))
#define bM4_TRNG_FR_XOR1                                *((volatile unsigned int*)(0x42110094UL))
#define bM4_TRNG_FR_XOR2                                *((volatile unsigned int*)(0x42110098UL))
#define bM4_TRNG_SR_STABLE                              *((volatile unsigned int*)(0x4211011CUL))
#define bM4_TRNG_IR_END                                 *((volatile unsigned int*)(0x42110500UL))
#define bM4_USART0_MR_CKS0                              *((volatile unsigned int*)(0x423E8000UL))
#define bM4_USART0_MR_CKS1                              *((volatile unsigned int*)(0x423E8004UL))
#define bM4_USART0_MR_MP                                *((volatile unsigned int*)(0x423E8008UL))
#define bM4_USART0_MR_STP                               *((volatile unsigned int*)(0x423E800CUL))
#define bM4_USART0_MR_P                                 *((volatile unsigned int*)(0x423E8010UL))
#define bM4_USART0_MR_PE                                *((volatile unsigned int*)(0x423E8014UL))
#define bM4_USART0_MR_ML                                *((volatile unsigned int*)(0x423E8018UL))
#define bM4_USART0_MR_MS                                *((volatile unsigned int*)(0x423E801CUL))
#define bM4_USART0_MR_CL0                               *((volatile unsigned int*)(0x423E8020UL))
#define bM4_USART0_MR_CL1                               *((volatile unsigned int*)(0x423E8024UL))
#define bM4_USART0_MR_CTSE                              *((volatile unsigned int*)(0x423E8028UL))
#define bM4_USART0_MR_NFE                               *((volatile unsigned int*)(0x423E8054UL))
#define bM4_USART0_MR_SBS                               *((volatile unsigned int*)(0x423E805CUL))
#define bM4_USART0_MR_SME                               *((volatile unsigned int*)(0x423E8060UL))
#define bM4_USART0_MR_T                                 *((volatile unsigned int*)(0x423E8064UL))
#define bM4_USART0_MR_INV                               *((volatile unsigned int*)(0x423E8068UL))
#define bM4_USART0_MR_GM                                *((volatile unsigned int*)(0x423E8070UL))
#define bM4_USART0_MR_CN0                               *((volatile unsigned int*)(0x423E8074UL))
#define bM4_USART0_MR_CN1                               *((volatile unsigned int*)(0x423E8078UL))
#define bM4_USART0_MR_CN2                               *((volatile unsigned int*)(0x423E807CUL))
#define bM4_USART0_CR_CKC0                              *((volatile unsigned int*)(0x423E8080UL))
#define bM4_USART0_CR_CKC1                              *((volatile unsigned int*)(0x423E8084UL))
#define bM4_USART0_CR_TCIE                              *((volatile unsigned int*)(0x423E8088UL))
#define bM4_USART0_CR_SLME                              *((volatile unsigned int*)(0x423E808CUL))
#define bM4_USART0_CR_RE                                *((volatile unsigned int*)(0x423E8090UL))
#define bM4_USART0_CR_TE                                *((volatile unsigned int*)(0x423E8094UL))
#define bM4_USART0_CR_RIE                               *((volatile unsigned int*)(0x423E8098UL))
#define bM4_USART0_CR_TIE                               *((volatile unsigned int*)(0x423E809CUL))
#define bM4_USART0_SR_MPB                               *((volatile unsigned int*)(0x423E8100UL))
#define bM4_USART0_SR_TCF                               *((volatile unsigned int*)(0x423E8104UL))
#define bM4_USART0_SR_PEF                               *((volatile unsigned int*)(0x423E8108UL))
#define bM4_USART0_SR_FEF                               *((volatile unsigned int*)(0x423E810CUL))
#define bM4_USART0_SR_OREF                              *((volatile unsigned int*)(0x423E8110UL))
#define bM4_USART0_CLR_CPEF                             *((volatile unsigned int*)(0x423E8188UL))
#define bM4_USART0_CLR_CFEF                             *((volatile unsigned int*)(0x423E818CUL))
#define bM4_USART0_CLR_COREF                            *((volatile unsigned int*)(0x423E8190UL))
#define bM4_USART0_TDR_TDR0                             *((volatile unsigned int*)(0x423E8280UL))
#define bM4_USART0_TDR_TDR1                             *((volatile unsigned int*)(0x423E8284UL))
#define bM4_USART0_TDR_TDR2                             *((volatile unsigned int*)(0x423E8288UL))
#define bM4_USART0_TDR_TDR3                             *((volatile unsigned int*)(0x423E828CUL))
#define bM4_USART0_TDR_TDR4                             *((volatile unsigned int*)(0x423E8290UL))
#define bM4_USART0_TDR_TDR5                             *((volatile unsigned int*)(0x423E8294UL))
#define bM4_USART0_TDR_TDR6                             *((volatile unsigned int*)(0x423E8298UL))
#define bM4_USART0_TDR_TDR7                             *((volatile unsigned int*)(0x423E829CUL))
#define bM4_USART0_TDR_TDR8                             *((volatile unsigned int*)(0x423E82A0UL))
#define bM4_USART0_TDR_MPID                             *((volatile unsigned int*)(0x423E82A4UL))
#define bM4_USART0_RDR_RDR0                             *((volatile unsigned int*)(0x423E8300UL))
#define bM4_USART0_RDR_RDR1                             *((volatile unsigned int*)(0x423E8304UL))
#define bM4_USART0_RDR_RDR2                             *((volatile unsigned int*)(0x423E8308UL))
#define bM4_USART0_RDR_RDR3                             *((volatile unsigned int*)(0x423E830CUL))
#define bM4_USART0_RDR_RDR4                             *((volatile unsigned int*)(0x423E8310UL))
#define bM4_USART0_RDR_RDR5                             *((volatile unsigned int*)(0x423E8314UL))
#define bM4_USART0_RDR_RDR6                             *((volatile unsigned int*)(0x423E8318UL))
#define bM4_USART0_RDR_RDR7                             *((volatile unsigned int*)(0x423E831CUL))
#define bM4_USART0_RDR_RDR8                             *((volatile unsigned int*)(0x423E8320UL))
#define bM4_USART1_MR_CKS0                              *((volatile unsigned int*)(0x423F0000UL))
#define bM4_USART1_MR_CKS1                              *((volatile unsigned int*)(0x423F0004UL))
#define bM4_USART1_MR_MP                                *((volatile unsigned int*)(0x423F0008UL))
#define bM4_USART1_MR_STP                               *((volatile unsigned int*)(0x423F000CUL))
#define bM4_USART1_MR_P                                 *((volatile unsigned int*)(0x423F0010UL))
#define bM4_USART1_MR_PE                                *((volatile unsigned int*)(0x423F0014UL))
#define bM4_USART1_MR_ML                                *((volatile unsigned int*)(0x423F0018UL))
#define bM4_USART1_MR_MS                                *((volatile unsigned int*)(0x423F001CUL))
#define bM4_USART1_MR_CL0                               *((volatile unsigned int*)(0x423F0020UL))
#define bM4_USART1_MR_CL1                               *((volatile unsigned int*)(0x423F0024UL))
#define bM4_USART1_MR_CTSE                              *((volatile unsigned int*)(0x423F0028UL))
#define bM4_USART1_MR_NFE                               *((volatile unsigned int*)(0x423F0054UL))
#define bM4_USART1_MR_SBS                               *((volatile unsigned int*)(0x423F005CUL))
#define bM4_USART1_MR_SME                               *((volatile unsigned int*)(0x423F0060UL))
#define bM4_USART1_MR_T                                 *((volatile unsigned int*)(0x423F0064UL))
#define bM4_USART1_MR_INV                               *((volatile unsigned int*)(0x423F0068UL))
#define bM4_USART1_MR_GM                                *((volatile unsigned int*)(0x423F0070UL))
#define bM4_USART1_MR_CN0                               *((volatile unsigned int*)(0x423F0074UL))
#define bM4_USART1_MR_CN1                               *((volatile unsigned int*)(0x423F0078UL))
#define bM4_USART1_MR_CN2                               *((volatile unsigned int*)(0x423F007CUL))
#define bM4_USART1_CR_CKC0                              *((volatile unsigned int*)(0x423F0080UL))
#define bM4_USART1_CR_CKC1                              *((volatile unsigned int*)(0x423F0084UL))
#define bM4_USART1_CR_TCIE                              *((volatile unsigned int*)(0x423F0088UL))
#define bM4_USART1_CR_SLME                              *((volatile unsigned int*)(0x423F008CUL))
#define bM4_USART1_CR_RE                                *((volatile unsigned int*)(0x423F0090UL))
#define bM4_USART1_CR_TE                                *((volatile unsigned int*)(0x423F0094UL))
#define bM4_USART1_CR_RIE                               *((volatile unsigned int*)(0x423F0098UL))
#define bM4_USART1_CR_TIE                               *((volatile unsigned int*)(0x423F009CUL))
#define bM4_USART1_SR_MPB                               *((volatile unsigned int*)(0x423F0100UL))
#define bM4_USART1_SR_TCF                               *((volatile unsigned int*)(0x423F0104UL))
#define bM4_USART1_SR_PEF                               *((volatile unsigned int*)(0x423F0108UL))
#define bM4_USART1_SR_FEF                               *((volatile unsigned int*)(0x423F010CUL))
#define bM4_USART1_SR_OREF                              *((volatile unsigned int*)(0x423F0110UL))
#define bM4_USART1_CLR_CPEF                             *((volatile unsigned int*)(0x423F0188UL))
#define bM4_USART1_CLR_CFEF                             *((volatile unsigned int*)(0x423F018CUL))
#define bM4_USART1_CLR_COREF                            *((volatile unsigned int*)(0x423F0190UL))
#define bM4_USART1_TDR_TDR0                             *((volatile unsigned int*)(0x423F0280UL))
#define bM4_USART1_TDR_TDR1                             *((volatile unsigned int*)(0x423F0284UL))
#define bM4_USART1_TDR_TDR2                             *((volatile unsigned int*)(0x423F0288UL))
#define bM4_USART1_TDR_TDR3                             *((volatile unsigned int*)(0x423F028CUL))
#define bM4_USART1_TDR_TDR4                             *((volatile unsigned int*)(0x423F0290UL))
#define bM4_USART1_TDR_TDR5                             *((volatile unsigned int*)(0x423F0294UL))
#define bM4_USART1_TDR_TDR6                             *((volatile unsigned int*)(0x423F0298UL))
#define bM4_USART1_TDR_TDR7                             *((volatile unsigned int*)(0x423F029CUL))
#define bM4_USART1_TDR_TDR8                             *((volatile unsigned int*)(0x423F02A0UL))
#define bM4_USART1_TDR_MPID                             *((volatile unsigned int*)(0x423F02A4UL))
#define bM4_USART1_RDR_RDR0                             *((volatile unsigned int*)(0x423F0300UL))
#define bM4_USART1_RDR_RDR1                             *((volatile unsigned int*)(0x423F0304UL))
#define bM4_USART1_RDR_RDR2                             *((volatile unsigned int*)(0x423F0308UL))
#define bM4_USART1_RDR_RDR3                             *((volatile unsigned int*)(0x423F030CUL))
#define bM4_USART1_RDR_RDR4                             *((volatile unsigned int*)(0x423F0310UL))
#define bM4_USART1_RDR_RDR5                             *((volatile unsigned int*)(0x423F0314UL))
#define bM4_USART1_RDR_RDR6                             *((volatile unsigned int*)(0x423F0318UL))
#define bM4_USART1_RDR_RDR7                             *((volatile unsigned int*)(0x423F031CUL))
#define bM4_USART1_RDR_RDR8                             *((volatile unsigned int*)(0x423F0320UL))
#define bM4_USART2_MR_CKS0                              *((volatile unsigned int*)(0x423F8000UL))
#define bM4_USART2_MR_CKS1                              *((volatile unsigned int*)(0x423F8004UL))
#define bM4_USART2_MR_MP                                *((volatile unsigned int*)(0x423F8008UL))
#define bM4_USART2_MR_STP                               *((volatile unsigned int*)(0x423F800CUL))
#define bM4_USART2_MR_P                                 *((volatile unsigned int*)(0x423F8010UL))
#define bM4_USART2_MR_PE                                *((volatile unsigned int*)(0x423F8014UL))
#define bM4_USART2_MR_ML                                *((volatile unsigned int*)(0x423F8018UL))
#define bM4_USART2_MR_MS                                *((volatile unsigned int*)(0x423F801CUL))
#define bM4_USART2_MR_CL0                               *((volatile unsigned int*)(0x423F8020UL))
#define bM4_USART2_MR_CL1                               *((volatile unsigned int*)(0x423F8024UL))
#define bM4_USART2_MR_CTSE                              *((volatile unsigned int*)(0x423F8028UL))
#define bM4_USART2_MR_NFE                               *((volatile unsigned int*)(0x423F8054UL))
#define bM4_USART2_MR_SBS                               *((volatile unsigned int*)(0x423F805CUL))
#define bM4_USART2_MR_SME                               *((volatile unsigned int*)(0x423F8060UL))
#define bM4_USART2_MR_T                                 *((volatile unsigned int*)(0x423F8064UL))
#define bM4_USART2_MR_INV                               *((volatile unsigned int*)(0x423F8068UL))
#define bM4_USART2_MR_GM                                *((volatile unsigned int*)(0x423F8070UL))
#define bM4_USART2_MR_CN0                               *((volatile unsigned int*)(0x423F8074UL))
#define bM4_USART2_MR_CN1                               *((volatile unsigned int*)(0x423F8078UL))
#define bM4_USART2_MR_CN2                               *((volatile unsigned int*)(0x423F807CUL))
#define bM4_USART2_CR_CKC0                              *((volatile unsigned int*)(0x423F8080UL))
#define bM4_USART2_CR_CKC1                              *((volatile unsigned int*)(0x423F8084UL))
#define bM4_USART2_CR_TCIE                              *((volatile unsigned int*)(0x423F8088UL))
#define bM4_USART2_CR_SLME                              *((volatile unsigned int*)(0x423F808CUL))
#define bM4_USART2_CR_RE                                *((volatile unsigned int*)(0x423F8090UL))
#define bM4_USART2_CR_TE                                *((volatile unsigned int*)(0x423F8094UL))
#define bM4_USART2_CR_RIE                               *((volatile unsigned int*)(0x423F8098UL))
#define bM4_USART2_CR_TIE                               *((volatile unsigned int*)(0x423F809CUL))
#define bM4_USART2_SR_MPB                               *((volatile unsigned int*)(0x423F8100UL))
#define bM4_USART2_SR_TCF                               *((volatile unsigned int*)(0x423F8104UL))
#define bM4_USART2_SR_PEF                               *((volatile unsigned int*)(0x423F8108UL))
#define bM4_USART2_SR_FEF                               *((volatile unsigned int*)(0x423F810CUL))
#define bM4_USART2_SR_OREF                              *((volatile unsigned int*)(0x423F8110UL))
#define bM4_USART2_CLR_CPEF                             *((volatile unsigned int*)(0x423F8188UL))
#define bM4_USART2_CLR_CFEF                             *((volatile unsigned int*)(0x423F818CUL))
#define bM4_USART2_CLR_COREF                            *((volatile unsigned int*)(0x423F8190UL))
#define bM4_USART2_TDR_TDR0                             *((volatile unsigned int*)(0x423F8280UL))
#define bM4_USART2_TDR_TDR1                             *((volatile unsigned int*)(0x423F8284UL))
#define bM4_USART2_TDR_TDR2                             *((volatile unsigned int*)(0x423F8288UL))
#define bM4_USART2_TDR_TDR3                             *((volatile unsigned int*)(0x423F828CUL))
#define bM4_USART2_TDR_TDR4                             *((volatile unsigned int*)(0x423F8290UL))
#define bM4_USART2_TDR_TDR5                             *((volatile unsigned int*)(0x423F8294UL))
#define bM4_USART2_TDR_TDR6                             *((volatile unsigned int*)(0x423F8298UL))
#define bM4_USART2_TDR_TDR7                             *((volatile unsigned int*)(0x423F829CUL))
#define bM4_USART2_TDR_TDR8                             *((volatile unsigned int*)(0x423F82A0UL))
#define bM4_USART2_TDR_MPID                             *((volatile unsigned int*)(0x423F82A4UL))
#define bM4_USART2_RDR_RDR0                             *((volatile unsigned int*)(0x423F8300UL))
#define bM4_USART2_RDR_RDR1                             *((volatile unsigned int*)(0x423F8304UL))
#define bM4_USART2_RDR_RDR2                             *((volatile unsigned int*)(0x423F8308UL))
#define bM4_USART2_RDR_RDR3                             *((volatile unsigned int*)(0x423F830CUL))
#define bM4_USART2_RDR_RDR4                             *((volatile unsigned int*)(0x423F8310UL))
#define bM4_USART2_RDR_RDR5                             *((volatile unsigned int*)(0x423F8314UL))
#define bM4_USART2_RDR_RDR6                             *((volatile unsigned int*)(0x423F8318UL))
#define bM4_USART2_RDR_RDR7                             *((volatile unsigned int*)(0x423F831CUL))
#define bM4_USART2_RDR_RDR8                             *((volatile unsigned int*)(0x423F8320UL))
#define bM4_USART3_MR_CKS0                              *((volatile unsigned int*)(0x42400000UL))
#define bM4_USART3_MR_CKS1                              *((volatile unsigned int*)(0x42400004UL))
#define bM4_USART3_MR_MP                                *((volatile unsigned int*)(0x42400008UL))
#define bM4_USART3_MR_STP                               *((volatile unsigned int*)(0x4240000CUL))
#define bM4_USART3_MR_P                                 *((volatile unsigned int*)(0x42400010UL))
#define bM4_USART3_MR_PE                                *((volatile unsigned int*)(0x42400014UL))
#define bM4_USART3_MR_ML                                *((volatile unsigned int*)(0x42400018UL))
#define bM4_USART3_MR_MS                                *((volatile unsigned int*)(0x4240001CUL))
#define bM4_USART3_MR_CL0                               *((volatile unsigned int*)(0x42400020UL))
#define bM4_USART3_MR_CL1                               *((volatile unsigned int*)(0x42400024UL))
#define bM4_USART3_MR_CTSE                              *((volatile unsigned int*)(0x42400028UL))
#define bM4_USART3_MR_NFE                               *((volatile unsigned int*)(0x42400054UL))
#define bM4_USART3_MR_SBS                               *((volatile unsigned int*)(0x4240005CUL))
#define bM4_USART3_MR_SME                               *((volatile unsigned int*)(0x42400060UL))
#define bM4_USART3_MR_T                                 *((volatile unsigned int*)(0x42400064UL))
#define bM4_USART3_MR_INV                               *((volatile unsigned int*)(0x42400068UL))
#define bM4_USART3_MR_GM                                *((volatile unsigned int*)(0x42400070UL))
#define bM4_USART3_MR_CN0                               *((volatile unsigned int*)(0x42400074UL))
#define bM4_USART3_MR_CN1                               *((volatile unsigned int*)(0x42400078UL))
#define bM4_USART3_MR_CN2                               *((volatile unsigned int*)(0x4240007CUL))
#define bM4_USART3_CR_CKC0                              *((volatile unsigned int*)(0x42400080UL))
#define bM4_USART3_CR_CKC1                              *((volatile unsigned int*)(0x42400084UL))
#define bM4_USART3_CR_TCIE                              *((volatile unsigned int*)(0x42400088UL))
#define bM4_USART3_CR_SLME                              *((volatile unsigned int*)(0x4240008CUL))
#define bM4_USART3_CR_RE                                *((volatile unsigned int*)(0x42400090UL))
#define bM4_USART3_CR_TE                                *((volatile unsigned int*)(0x42400094UL))
#define bM4_USART3_CR_RIE                               *((volatile unsigned int*)(0x42400098UL))
#define bM4_USART3_CR_TIE                               *((volatile unsigned int*)(0x4240009CUL))
#define bM4_USART3_SR_MPB                               *((volatile unsigned int*)(0x42400100UL))
#define bM4_USART3_SR_TCF                               *((volatile unsigned int*)(0x42400104UL))
#define bM4_USART3_SR_PEF                               *((volatile unsigned int*)(0x42400108UL))
#define bM4_USART3_SR_FEF                               *((volatile unsigned int*)(0x4240010CUL))
#define bM4_USART3_SR_OREF                              *((volatile unsigned int*)(0x42400110UL))
#define bM4_USART3_CLR_CPEF                             *((volatile unsigned int*)(0x42400188UL))
#define bM4_USART3_CLR_CFEF                             *((volatile unsigned int*)(0x4240018CUL))
#define bM4_USART3_CLR_COREF                            *((volatile unsigned int*)(0x42400190UL))
#define bM4_USART3_TDR_TDR0                             *((volatile unsigned int*)(0x42400280UL))
#define bM4_USART3_TDR_TDR1                             *((volatile unsigned int*)(0x42400284UL))
#define bM4_USART3_TDR_TDR2                             *((volatile unsigned int*)(0x42400288UL))
#define bM4_USART3_TDR_TDR3                             *((volatile unsigned int*)(0x4240028CUL))
#define bM4_USART3_TDR_TDR4                             *((volatile unsigned int*)(0x42400290UL))
#define bM4_USART3_TDR_TDR5                             *((volatile unsigned int*)(0x42400294UL))
#define bM4_USART3_TDR_TDR6                             *((volatile unsigned int*)(0x42400298UL))
#define bM4_USART3_TDR_TDR7                             *((volatile unsigned int*)(0x4240029CUL))
#define bM4_USART3_TDR_TDR8                             *((volatile unsigned int*)(0x424002A0UL))
#define bM4_USART3_TDR_MPID                             *((volatile unsigned int*)(0x424002A4UL))
#define bM4_USART3_RDR_RDR0                             *((volatile unsigned int*)(0x42400300UL))
#define bM4_USART3_RDR_RDR1                             *((volatile unsigned int*)(0x42400304UL))
