RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USART3_RDR_RDR2                             *((volatile unsigned int*)(0x42400308UL))
#define bM4_USART3_RDR_RDR3                             *((volatile unsigned int*)(0x4240030CUL))
#define bM4_USART3_RDR_RDR4                             *((volatile unsigned int*)(0x42400310UL))
#define bM4_USART3_RDR_RDR5                             *((volatile unsigned int*)(0x42400314UL))
#define bM4_USART3_RDR_RDR6                             *((volatile unsigned int*)(0x42400318UL))
#define bM4_USART3_RDR_RDR7                             *((volatile unsigned int*)(0x4240031CUL))
#define bM4_USART3_RDR_RDR8                             *((volatile unsigned int*)(0x42400320UL))
#define bM4_USART4_MR_CKS0                              *((volatile unsigned int*)(0x42408000UL))
#define bM4_USART4_MR_CKS1                              *((volatile unsigned int*)(0x42408004UL))
#define bM4_USART4_MR_MP                                *((volatile unsigned int*)(0x42408008UL))
#define bM4_USART4_MR_STP                               *((volatile unsigned int*)(0x4240800CUL))
#define bM4_USART4_MR_P                                 *((volatile unsigned int*)(0x42408010UL))
#define bM4_USART4_MR_PE                                *((volatile unsigned int*)(0x42408014UL))
#define bM4_USART4_MR_ML                                *((volatile unsigned int*)(0x42408018UL))
#define bM4_USART4_MR_MS                                *((volatile unsigned int*)(0x4240801CUL))
#define bM4_USART4_MR_CL0                               *((volatile unsigned int*)(0x42408020UL))
#define bM4_USART4_MR_CL1                               *((volatile unsigned int*)(0x42408024UL))
#define bM4_USART4_MR_CTSE                              *((volatile unsigned int*)(0x42408028UL))
#define bM4_USART4_MR_NFE                               *((volatile unsigned int*)(0x42408054UL))
#define bM4_USART4_MR_SBS                               *((volatile unsigned int*)(0x4240805CUL))
#define bM4_USART4_MR_SME                               *((volatile unsigned int*)(0x42408060UL))
#define bM4_USART4_MR_T                                 *((volatile unsigned int*)(0x42408064UL))
#define bM4_USART4_MR_INV                               *((volatile unsigned int*)(0x42408068UL))
#define bM4_USART4_MR_GM                                *((volatile unsigned int*)(0x42408070UL))
#define bM4_USART4_MR_CN0                               *((volatile unsigned int*)(0x42408074UL))
#define bM4_USART4_MR_CN1                               *((volatile unsigned int*)(0x42408078UL))
#define bM4_USART4_MR_CN2                               *((volatile unsigned int*)(0x4240807CUL))
#define bM4_USART4_CR_CKC0                              *((volatile unsigned int*)(0x42408080UL))
#define bM4_USART4_CR_CKC1                              *((volatile unsigned int*)(0x42408084UL))
#define bM4_USART4_CR_TCIE                              *((volatile unsigned int*)(0x42408088UL))
#define bM4_USART4_CR_SLME                              *((volatile unsigned int*)(0x4240808CUL))
#define bM4_USART4_CR_RE                                *((volatile unsigned int*)(0x42408090UL))
#define bM4_USART4_CR_TE                                *((volatile unsigned int*)(0x42408094UL))
#define bM4_USART4_CR_RIE                               *((volatile unsigned int*)(0x42408098UL))
#define bM4_USART4_CR_TIE                               *((volatile unsigned int*)(0x4240809CUL))
#define bM4_USART4_SR_MPB                               *((volatile unsigned int*)(0x42408100UL))
#define bM4_USART4_SR_TCF                               *((volatile unsigned int*)(0x42408104UL))
#define bM4_USART4_SR_PEF                               *((volatile unsigned int*)(0x42408108UL))
#define bM4_USART4_SR_FEF                               *((volatile unsigned int*)(0x4240810CUL))
#define bM4_USART4_SR_OREF                              *((volatile unsigned int*)(0x42408110UL))
#define bM4_USART4_CLR_CPEF                             *((volatile unsigned int*)(0x42408188UL))
#define bM4_USART4_CLR_CFEF                             *((volatile unsigned int*)(0x4240818CUL))
#define bM4_USART4_CLR_COREF                            *((volatile unsigned int*)(0x42408190UL))
#define bM4_USART4_TDR_TDR0                             *((volatile unsigned int*)(0x42408280UL))
#define bM4_USART4_TDR_TDR1                             *((volatile unsigned int*)(0x42408284UL))
#define bM4_USART4_TDR_TDR2                             *((volatile unsigned int*)(0x42408288UL))
#define bM4_USART4_TDR_TDR3                             *((volatile unsigned int*)(0x4240828CUL))
#define bM4_USART4_TDR_TDR4                             *((volatile unsigned int*)(0x42408290UL))
#define bM4_USART4_TDR_TDR5                             *((volatile unsigned int*)(0x42408294UL))
#define bM4_USART4_TDR_TDR6                             *((volatile unsigned int*)(0x42408298UL))
#define bM4_USART4_TDR_TDR7                             *((volatile unsigned int*)(0x4240829CUL))
#define bM4_USART4_TDR_TDR8                             *((volatile unsigned int*)(0x424082A0UL))
#define bM4_USART4_TDR_MPID                             *((volatile unsigned int*)(0x424082A4UL))
#define bM4_USART4_RDR_RDR0                             *((volatile unsigned int*)(0x42408300UL))
#define bM4_USART4_RDR_RDR1                             *((volatile unsigned int*)(0x42408304UL))
#define bM4_USART4_RDR_RDR2                             *((volatile unsigned int*)(0x42408308UL))
#define bM4_USART4_RDR_RDR3                             *((volatile unsigned int*)(0x4240830CUL))
#define bM4_USART4_RDR_RDR4                             *((volatile unsigned int*)(0x42408310UL))
#define bM4_USART4_RDR_RDR5                             *((volatile unsigned int*)(0x42408314UL))
#define bM4_USART4_RDR_RDR6                             *((volatile unsigned int*)(0x42408318UL))
#define bM4_USART4_RDR_RDR7                             *((volatile unsigned int*)(0x4240831CUL))
#define bM4_USART4_RDR_RDR8                             *((volatile unsigned int*)(0x42408320UL))
#define bM4_USART5_MR_CKS0                              *((volatile unsigned int*)(0x42410000UL))
#define bM4_USART5_MR_CKS1                              *((volatile unsigned int*)(0x42410004UL))
#define bM4_USART5_MR_MP                                *((volatile unsigned int*)(0x42410008UL))
#define bM4_USART5_MR_STP                               *((volatile unsigned int*)(0x4241000CUL))
#define bM4_USART5_MR_P                                 *((volatile unsigned int*)(0x42410010UL))
#define bM4_USART5_MR_PE                                *((volatile unsigned int*)(0x42410014UL))
#define bM4_USART5_MR_ML                                *((volatile unsigned int*)(0x42410018UL))
#define bM4_USART5_MR_MS                                *((volatile unsigned int*)(0x4241001CUL))
#define bM4_USART5_MR_CL0                               *((volatile unsigned int*)(0x42410020UL))
#define bM4_USART5_MR_CL1                               *((volatile unsigned int*)(0x42410024UL))
#define bM4_USART5_MR_CTSE                              *((volatile unsigned int*)(0x42410028UL))
#define bM4_USART5_MR_NFE                               *((volatile unsigned int*)(0x42410054UL))
#define bM4_USART5_MR_SBS                               *((volatile unsigned int*)(0x4241005CUL))
#define bM4_USART5_MR_SME                               *((volatile unsigned int*)(0x42410060UL))
#define bM4_USART5_MR_T                                 *((volatile unsigned int*)(0x42410064UL))
#define bM4_USART5_MR_INV                               *((volatile unsigned int*)(0x42410068UL))
#define bM4_USART5_MR_GM                                *((volatile unsigned int*)(0x42410070UL))
#define bM4_USART5_MR_CN0                               *((volatile unsigned int*)(0x42410074UL))
#define bM4_USART5_MR_CN1                               *((volatile unsigned int*)(0x42410078UL))
#define bM4_USART5_MR_CN2                               *((volatile unsigned int*)(0x4241007CUL))
#define bM4_USART5_CR_CKC0                              *((volatile unsigned int*)(0x42410080UL))
#define bM4_USART5_CR_CKC1                              *((volatile unsigned int*)(0x42410084UL))
#define bM4_USART5_CR_TCIE                              *((volatile unsigned int*)(0x42410088UL))
#define bM4_USART5_CR_SLME                              *((volatile unsigned int*)(0x4241008CUL))
#define bM4_USART5_CR_RE                                *((volatile unsigned int*)(0x42410090UL))
#define bM4_USART5_CR_TE                                *((volatile unsigned int*)(0x42410094UL))
#define bM4_USART5_CR_RIE                               *((volatile unsigned int*)(0x42410098UL))
#define bM4_USART5_CR_TIE                               *((volatile unsigned int*)(0x4241009CUL))
#define bM4_USART5_SR_MPB                               *((volatile unsigned int*)(0x42410100UL))
#define bM4_USART5_SR_TCF                               *((volatile unsigned int*)(0x42410104UL))
#define bM4_USART5_SR_PEF                               *((volatile unsigned int*)(0x42410108UL))
#define bM4_USART5_SR_FEF                               *((volatile unsigned int*)(0x4241010CUL))
#define bM4_USART5_SR_OREF                              *((volatile unsigned int*)(0x42410110UL))
#define bM4_USART5_CLR_CPEF                             *((volatile unsigned int*)(0x42410188UL))
#define bM4_USART5_CLR_CFEF                             *((volatile unsigned int*)(0x4241018CUL))
#define bM4_USART5_CLR_COREF                            *((volatile unsigned int*)(0x42410190UL))
#define bM4_USART5_TDR_TDR0                             *((volatile unsigned int*)(0x42410280UL))
#define bM4_USART5_TDR_TDR1                             *((volatile unsigned int*)(0x42410284UL))
#define bM4_USART5_TDR_TDR2                             *((volatile unsigned int*)(0x42410288UL))
#define bM4_USART5_TDR_TDR3                             *((volatile unsigned int*)(0x4241028CUL))
#define bM4_USART5_TDR_TDR4                             *((volatile unsigned int*)(0x42410290UL))
#define bM4_USART5_TDR_TDR5                             *((volatile unsigned int*)(0x42410294UL))
#define bM4_USART5_TDR_TDR6                             *((volatile unsigned int*)(0x42410298UL))
#define bM4_USART5_TDR_TDR7                             *((volatile unsigned int*)(0x4241029CUL))
#define bM4_USART5_TDR_TDR8                             *((volatile unsigned int*)(0x424102A0UL))
#define bM4_USART5_TDR_MPID                             *((volatile unsigned int*)(0x424102A4UL))
#define bM4_USART5_RDR_RDR0                             *((volatile unsigned int*)(0x42410300UL))
#define bM4_USART5_RDR_RDR1                             *((volatile unsigned int*)(0x42410304UL))
#define bM4_USART5_RDR_RDR2                             *((volatile unsigned int*)(0x42410308UL))
#define bM4_USART5_RDR_RDR3                             *((volatile unsigned int*)(0x4241030CUL))
#define bM4_USART5_RDR_RDR4                             *((volatile unsigned int*)(0x42410310UL))
#define bM4_USART5_RDR_RDR5                             *((volatile unsigned int*)(0x42410314UL))
#define bM4_USART5_RDR_RDR6                             *((volatile unsigned int*)(0x42410318UL))
#define bM4_USART5_RDR_RDR7                             *((volatile unsigned int*)(0x4241031CUL))
#define bM4_USART5_RDR_RDR8                             *((volatile unsigned int*)(0x42410320UL))
#define bM4_USART6_MR_CKS0                              *((volatile unsigned int*)(0x42418000UL))
#define bM4_USART6_MR_CKS1                              *((volatile unsigned int*)(0x42418004UL))
#define bM4_USART6_MR_MP                                *((volatile unsigned int*)(0x42418008UL))
#define bM4_USART6_MR_STP                               *((volatile unsigned int*)(0x4241800CUL))
#define bM4_USART6_MR_P                                 *((volatile unsigned int*)(0x42418010UL))
#define bM4_USART6_MR_PE                                *((volatile unsigned int*)(0x42418014UL))
#define bM4_USART6_MR_ML                                *((volatile unsigned int*)(0x42418018UL))
#define bM4_USART6_MR_MS                                *((volatile unsigned int*)(0x4241801CUL))
#define bM4_USART6_MR_CL0                               *((volatile unsigned int*)(0x42418020UL))
#define bM4_USART6_MR_CL1                               *((volatile unsigned int*)(0x42418024UL))
#define bM4_USART6_MR_CTSE                              *((volatile unsigned int*)(0x42418028UL))
#define bM4_USART6_MR_NFE                               *((volatile unsigned int*)(0x42418054UL))
#define bM4_USART6_MR_SBS                               *((volatile unsigned int*)(0x4241805CUL))
#define bM4_USART6_MR_SME                               *((volatile unsigned int*)(0x42418060UL))
#define bM4_USART6_MR_T                                 *((volatile unsigned int*)(0x42418064UL))
#define bM4_USART6_MR_INV                               *((volatile unsigned int*)(0x42418068UL))
#define bM4_USART6_MR_GM                                *((volatile unsigned int*)(0x42418070UL))
#define bM4_USART6_MR_CN0                               *((volatile unsigned int*)(0x42418074UL))
#define bM4_USART6_MR_CN1                               *((volatile unsigned int*)(0x42418078UL))
#define bM4_USART6_MR_CN2                               *((volatile unsigned int*)(0x4241807CUL))
#define bM4_USART6_CR_CKC0                              *((volatile unsigned int*)(0x42418080UL))
#define bM4_USART6_CR_CKC1                              *((volatile unsigned int*)(0x42418084UL))
#define bM4_USART6_CR_TCIE                              *((volatile unsigned int*)(0x42418088UL))
#define bM4_USART6_CR_SLME                              *((volatile unsigned int*)(0x4241808CUL))
#define bM4_USART6_CR_RE                                *((volatile unsigned int*)(0x42418090UL))
#define bM4_USART6_CR_TE                                *((volatile unsigned int*)(0x42418094UL))
#define bM4_USART6_CR_RIE                               *((volatile unsigned int*)(0x42418098UL))
#define bM4_USART6_CR_TIE                               *((volatile unsigned int*)(0x4241809CUL))
#define bM4_USART6_SR_MPB                               *((volatile unsigned int*)(0x42418100UL))
#define bM4_USART6_SR_TCF                               *((volatile unsigned int*)(0x42418104UL))
#define bM4_USART6_SR_PEF                               *((volatile unsigned int*)(0x42418108UL))
#define bM4_USART6_SR_FEF                               *((volatile unsigned int*)(0x4241810CUL))
#define bM4_USART6_SR_OREF                              *((volatile unsigned int*)(0x42418110UL))
#define bM4_USART6_CLR_CPEF                             *((volatile unsigned int*)(0x42418188UL))
#define bM4_USART6_CLR_CFEF                             *((volatile unsigned int*)(0x4241818CUL))
#define bM4_USART6_CLR_COREF                            *((volatile unsigned int*)(0x42418190UL))
#define bM4_USART6_TDR_TDR0                             *((volatile unsigned int*)(0x42418280UL))
#define bM4_USART6_TDR_TDR1                             *((volatile unsigned int*)(0x42418284UL))
#define bM4_USART6_TDR_TDR2                             *((volatile unsigned int*)(0x42418288UL))
#define bM4_USART6_TDR_TDR3                             *((volatile unsigned int*)(0x4241828CUL))
#define bM4_USART6_TDR_TDR4                             *((volatile unsigned int*)(0x42418290UL))
#define bM4_USART6_TDR_TDR5                             *((volatile unsigned int*)(0x42418294UL))
#define bM4_USART6_TDR_TDR6                             *((volatile unsigned int*)(0x42418298UL))
#define bM4_USART6_TDR_TDR7                             *((volatile unsigned int*)(0x4241829CUL))
#define bM4_USART6_TDR_TDR8                             *((volatile unsigned int*)(0x424182A0UL))
#define bM4_USART6_TDR_MPID                             *((volatile unsigned int*)(0x424182A4UL))
#define bM4_USART6_RDR_RDR0                             *((volatile unsigned int*)(0x42418300UL))
#define bM4_USART6_RDR_RDR1                             *((volatile unsigned int*)(0x42418304UL))
#define bM4_USART6_RDR_RDR2                             *((volatile unsigned int*)(0x42418308UL))
#define bM4_USART6_RDR_RDR3                             *((volatile unsigned int*)(0x4241830CUL))
#define bM4_USART6_RDR_RDR4                             *((volatile unsigned int*)(0x42418310UL))
#define bM4_USART6_RDR_RDR5                             *((volatile unsigned int*)(0x42418314UL))
#define bM4_USART6_RDR_RDR6                             *((volatile unsigned int*)(0x42418318UL))
#define bM4_USART6_RDR_RDR7                             *((volatile unsigned int*)(0x4241831CUL))
#define bM4_USART6_RDR_RDR8                             *((volatile unsigned int*)(0x42418320UL))
#define bM4_USF_GOTGCTL_SESREQSCS                       *((volatile unsigned int*)(0x43800000UL))
#define bM4_USF_GOTGCTL_SESREQ                          *((volatile unsigned int*)(0x43800004UL))
#define bM4_USF_GOTGCTL_VBVALIDOVEN                     *((volatile unsigned int*)(0x43800008UL))
#define bM4_USF_GOTGCTL_VBVALIDOVVAL                    *((volatile unsigned int*)(0x4380000CUL))
#define bM4_USF_GOTGCTL_AVALIDOVEN                      *((volatile unsigned int*)(0x43800010UL))
#define bM4_USF_GOTGCTL_AVALIDOVVAL                     *((volatile unsigned int*)(0x43800014UL))
#define bM4_USF_GOTGCTL_BVALIDOVEN                      *((volatile unsigned int*)(0x43800018UL))
#define bM4_USF_GOTGCTL_BVALIDOVVAL                     *((volatile unsigned int*)(0x4380001CUL))
#define bM4_USF_GOTGCTL_HSTNEGSCS                       *((volatile unsigned int*)(0x43800020UL))
#define bM4_USF_GOTGCTL_HNPREQ                          *((volatile unsigned int*)(0x43800024UL))
#define bM4_USF_GOTGCTL_HSTSETHNPEN                     *((volatile unsigned int*)(0x43800028UL))
#define bM4_USF_GOTGCTL_DEVHNPEN                        *((volatile unsigned int*)(0x4380002CUL))
#define bM4_USF_GOTGCTL_EHEN                            *((volatile unsigned int*)(0x43800030UL))
#define bM4_USF_GOTGCTL_DBNCEFLTRBYPASS                 *((volatile unsigned int*)(0x4380003CUL))
#define bM4_USF_GOTGCTL_CONIDSTS                        *((volatile unsigned int*)(0x43800040UL))
#define bM4_USF_GOTGCTL_DBNCTIME                        *((volatile unsigned int*)(0x43800044UL))
#define bM4_USF_GOTGCTL_ASESVLD                         *((volatile unsigned int*)(0x43800048UL))
#define bM4_USF_GOTGCTL_BSESVLD                         *((volatile unsigned int*)(0x4380004CUL))
#define bM4_USF_GOTGCTL_OTGVER                          *((volatile unsigned int*)(0x43800050UL))
#define bM4_USF_GOTGCTL_CURMOD                          *((volatile unsigned int*)(0x43800054UL))
#define bM4_USF_GOTGCTL_RESV                            *((volatile unsigned int*)(0x43800060UL))
#define bM4_USF_GOTGINT_SESENDDET                       *((volatile unsigned int*)(0x43800088UL))
#define bM4_USF_GOTGINT_SESREQSUCSTSCHNG                *((volatile unsigned int*)(0x438000A0UL))
#define bM4_USF_GOTGINT_HSTNEGSUCSTSCHNG                *((volatile unsigned int*)(0x438000A4UL))
#define bM4_USF_GOTGINT_HSTNEGDET                       *((volatile unsigned int*)(0x438000C4UL))
#define bM4_USF_GOTGINT_ADEVTOUTCHG                     *((volatile unsigned int*)(0x438000C8UL))
#define bM4_USF_GOTGINT_DBNCEDONE                       *((volatile unsigned int*)(0x438000CCUL))
#define bM4_USF_GOTGINT_RESV                            *((volatile unsigned int*)(0x438000E0UL))
#define bM4_USF_GAHBCFG_GLBLINTRMSK                     *((volatile unsigned int*)(0x43800100UL))
#define bM4_USF_GAHBCFG_HBSTLEN0                        *((volatile unsigned int*)(0x43800104UL))
#define bM4_USF_GAHBCFG_HBSTLEN1                        *((volatile unsigned int*)(0x43800108UL))
#define bM4_USF_GAHBCFG_HBSTLEN2                        *((volatile unsigned int*)(0x4380010CUL))
#define bM4_USF_GAHBCFG_HBSTLEN3                        *((volatile unsigned int*)(0x43800110UL))
#define bM4_USF_GAHBCFG_DMAEN                           *((volatile unsigned int*)(0x43800114UL))
#define bM4_USF_GAHBCFG_NPTXFEMPLVL                     *((volatile unsigned int*)(0x4380011CUL))
#define bM4_USF_GAHBCFG_PTXFEMPLVL                      *((volatile unsigned int*)(0x43800120UL))
#define bM4_USF_GAHBCFG_REMMEMSUPP                      *((volatile unsigned int*)(0x43800154UL))
#define bM4_USF_GAHBCFG_NOTIALLDMAWRIT                  *((volatile unsigned int*)(0x43800158UL))
#define bM4_USF_GAHBCFG_AHBSINGLE                       *((volatile unsigned int*)(0x4380015CUL))
#define bM4_USF_GAHBCFG_RESV                            *((volatile unsigned int*)(0x43800160UL))
#define bM4_USF_GUSBCFG_TOUTCAL0                        *((volatile unsigned int*)(0x43800180UL))
#define bM4_USF_GUSBCFG_TOUTCAL1                        *((volatile unsigned int*)(0x43800184UL))
#define bM4_USF_GUSBCFG_TOUTCAL2                        *((volatile unsigned int*)(0x43800188UL))
#define bM4_USF_GUSBCFG_PHYIF                           *((volatile unsigned int*)(0x4380018CUL))
#define bM4_USF_GUSBCFG_ULPI_UTMI_SEL                   *((volatile unsigned int*)(0x43800190UL))
#define bM4_USF_GUSBCFG_FSINTF                          *((volatile unsigned int*)(0x43800194UL))
#define bM4_USF_GUSBCFG_PHYSEL                          *((volatile unsigned int*)(0x43800198UL))
#define bM4_USF_GUSBCFG_DDRSEL                          *((volatile unsigned int*)(0x4380019CUL))
#define bM4_USF_GUSBCFG_SRPCAP                          *((volatile unsigned int*)(0x438001A0UL))
#define bM4_USF_GUSBCFG_HNPCAP                          *((volatile unsigned int*)(0x438001A4UL))
#define bM4_USF_GUSBCFG_USBTRDTIM0                      *((volatile unsigned int*)(0x438001A8UL))
#define bM4_USF_GUSBCFG_USBTRDTIM1                      *((volatile unsigned int*)(0x438001ACUL))
#define bM4_USF_GUSBCFG_USBTRDTIM2                      *((volatile unsigned int*)(0x438001B0UL))
#define bM4_USF_GUSBCFG_USBTRDTIM3                      *((volatile unsigned int*)(0x438001B4UL))
#define bM4_USF_GUSBCFG_ULPIFSLS                        *((volatile unsigned int*)(0x438001C4UL))
#define bM4_USF_GUSBCFG_ULPIAUTORES                     *((volatile unsigned int*)(0x438001C8UL))
#define bM4_USF_GUSBCFG_ULPICLKSUSM                     *((volatile unsigned int*)(0x438001CCUL))
#define bM4_USF_GUSBCFG_ULPIEXTVBUSDRV                  *((volatile unsigned int*)(0x438001D0UL))
#define bM4_USF_GUSBCFG_ULPIEXTVBUSINDICATOR            *((volatile unsigned int*)(0x438001D4UL))
#define bM4_USF_GUSBCFG_TERMSELDLPULSE                  *((volatile unsigned int*)(0x438001D8UL))
#define bM4_USF_GUSBCFG_COMPLEMENT                      *((volatile unsigned int*)(0x438001DCUL))
#define bM4_USF_GUSBCFG_INDICATOR                       *((volatile unsigned int*)(0x438001E0UL))
#define bM4_USF_GUSBCFG_ULPI                            *((volatile unsigned int*)(0x438001E4UL))
#define bM4_USF_GUSBCFG_IC_USBCAP                       *((volatile unsigned int*)(0x438001E8UL))
#define bM4_USF_GUSBCFG_TXENDDELAY                      *((volatile unsigned int*)(0x438001F0UL))
#define bM4_USF_GUSBCFG_FORCEHSTMODE                    *((volatile unsigned int*)(0x438001F4UL))
#define bM4_USF_GUSBCFG_FORCEDEVMODE                    *((volatile unsigned int*)(0x438001F8UL))
#define bM4_USF_GUSBCFG_CORRUPTTXPKT                    *((volatile unsigned int*)(0x438001FCUL))
#define bM4_USF_GRSTCTL_CSFTRST                         *((volatile unsigned int*)(0x43800200UL))
#define bM4_USF_GRSTCTL_PIUFSSFTRST                     *((volatile unsigned int*)(0x43800204UL))
#define bM4_USF_GRSTCTL_FRMCNTRRST                      *((volatile unsigned int*)(0x43800208UL))
#define bM4_USF_GRSTCTL_RXFFLSH                         *((volatile unsigned int*)(0x43800210UL))
