RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_GRSTCTL_TXFFLSH                         *((volatile unsigned int*)(0x43800214UL))
#define bM4_USF_GRSTCTL_TXFNUM0                         *((volatile unsigned int*)(0x43800218UL))
#define bM4_USF_GRSTCTL_TXFNUM1                         *((volatile unsigned int*)(0x4380021CUL))
#define bM4_USF_GRSTCTL_TXFNUM2                         *((volatile unsigned int*)(0x43800220UL))
#define bM4_USF_GRSTCTL_TXFNUM3                         *((volatile unsigned int*)(0x43800224UL))
#define bM4_USF_GRSTCTL_TXFNUM4                         *((volatile unsigned int*)(0x43800228UL))
#define bM4_USF_GRSTCTL_DMAREQ                          *((volatile unsigned int*)(0x43800278UL))
#define bM4_USF_GRSTCTL_AHBIDLE                         *((volatile unsigned int*)(0x4380027CUL))
#define bM4_USF_GINTSTS_CURMOD                          *((volatile unsigned int*)(0x43800280UL))
#define bM4_USF_GINTSTS_MODEMIS                         *((volatile unsigned int*)(0x43800284UL))
#define bM4_USF_GINTSTS_OTGINT                          *((volatile unsigned int*)(0x43800288UL))
#define bM4_USF_GINTSTS_SOF                             *((volatile unsigned int*)(0x4380028CUL))
#define bM4_USF_GINTSTS_RXFLVL                          *((volatile unsigned int*)(0x43800290UL))
#define bM4_USF_GINTSTS_NPTXFEMP                        *((volatile unsigned int*)(0x43800294UL))
#define bM4_USF_GINTSTS_GINNAKEFF                       *((volatile unsigned int*)(0x43800298UL))
#define bM4_USF_GINTSTS_GOUTNAKEFF                      *((volatile unsigned int*)(0x4380029CUL))
#define bM4_USF_GINTSTS_ERLYSUSP                        *((volatile unsigned int*)(0x438002A8UL))
#define bM4_USF_GINTSTS_USBSUSP                         *((volatile unsigned int*)(0x438002ACUL))
#define bM4_USF_GINTSTS_USBRST                          *((volatile unsigned int*)(0x438002B0UL))
#define bM4_USF_GINTSTS_ENUMDONE                        *((volatile unsigned int*)(0x438002B4UL))
#define bM4_USF_GINTSTS_ISOOUTDROP                      *((volatile unsigned int*)(0x438002B8UL))
#define bM4_USF_GINTSTS_EOPF                            *((volatile unsigned int*)(0x438002BCUL))
#define bM4_USF_GINTSTS_EPMIS                           *((volatile unsigned int*)(0x438002C4UL))
#define bM4_USF_GINTSTS_IEPINT                          *((volatile unsigned int*)(0x438002C8UL))
#define bM4_USF_GINTSTS_OEPINT                          *((volatile unsigned int*)(0x438002CCUL))
#define bM4_USF_GINTSTS_INCOMPISOIN                     *((volatile unsigned int*)(0x438002D0UL))
#define bM4_USF_GINTSTS_INCOMPLP                        *((volatile unsigned int*)(0x438002D4UL))
#define bM4_USF_GINTSTS_FETSUSP                         *((volatile unsigned int*)(0x438002D8UL))
#define bM4_USF_GINTSTS_RESETDET                        *((volatile unsigned int*)(0x438002DCUL))
#define bM4_USF_GINTSTS_PRTINT                          *((volatile unsigned int*)(0x438002E0UL))
#define bM4_USF_GINTSTS_HCHINT                          *((volatile unsigned int*)(0x438002E4UL))
#define bM4_USF_GINTSTS_PTXFEMP                         *((volatile unsigned int*)(0x438002E8UL))
#define bM4_USF_GINTSTS_CONIDSTSCHNG                    *((volatile unsigned int*)(0x438002F0UL))
#define bM4_USF_GINTSTS_DISCONNINT                      *((volatile unsigned int*)(0x438002F4UL))
#define bM4_USF_GINTSTS_SESSREQINT                      *((volatile unsigned int*)(0x438002F8UL))
#define bM4_USF_GINTSTS_WKUPINT                         *((volatile unsigned int*)(0x438002FCUL))
#define bM4_USF_GINTMSK_MODEMISMSK                      *((volatile unsigned int*)(0x43800304UL))
#define bM4_USF_GINTMSK_OTGINTMSK                       *((volatile unsigned int*)(0x43800308UL))
#define bM4_USF_GINTMSK_SOFMSK                          *((volatile unsigned int*)(0x4380030CUL))
#define bM4_USF_GINTMSK_RXFLVLMSK                       *((volatile unsigned int*)(0x43800310UL))
#define bM4_USF_GINTMSK_NPTXFEMPMSK                     *((volatile unsigned int*)(0x43800314UL))
#define bM4_USF_GINTMSK_GINNAKEFFMSK                    *((volatile unsigned int*)(0x43800318UL))
#define bM4_USF_GINTMSK_GOUTNAKEFFMSK                   *((volatile unsigned int*)(0x4380031CUL))
#define bM4_USF_GINTMSK_ERLYSUSPMSK                     *((volatile unsigned int*)(0x43800328UL))
#define bM4_USF_GINTMSK_USBSUSPMSK                      *((volatile unsigned int*)(0x4380032CUL))
#define bM4_USF_GINTMSK_USBRSTMSK                       *((volatile unsigned int*)(0x43800330UL))
#define bM4_USF_GINTMSK_ENUMDONEMSK                     *((volatile unsigned int*)(0x43800334UL))
#define bM4_USF_GINTMSK_ISOOUTDROPMSK                   *((volatile unsigned int*)(0x43800338UL))
#define bM4_USF_GINTMSK_EOPFMSK                         *((volatile unsigned int*)(0x4380033CUL))
#define bM4_USF_GINTMSK_EPMISMSK                        *((volatile unsigned int*)(0x43800344UL))
#define bM4_USF_GINTMSK_IEPINTMSK                       *((volatile unsigned int*)(0x43800348UL))
#define bM4_USF_GINTMSK_OEPINTMSK                       *((volatile unsigned int*)(0x4380034CUL))
#define bM4_USF_GINTMSK_INCOMPISOINMSK                  *((volatile unsigned int*)(0x43800350UL))
#define bM4_USF_GINTMSK_INCOMPLPMSK                     *((volatile unsigned int*)(0x43800354UL))
#define bM4_USF_GINTMSK_FETSUSPMSK                      *((volatile unsigned int*)(0x43800358UL))
#define bM4_USF_GINTMSK_RESETDETMSK                     *((volatile unsigned int*)(0x4380035CUL))
#define bM4_USF_GINTMSK_PRTINTMSK                       *((volatile unsigned int*)(0x43800360UL))
#define bM4_USF_GINTMSK_HCHINTMSK                       *((volatile unsigned int*)(0x43800364UL))
#define bM4_USF_GINTMSK_PTXFEMPMSK                      *((volatile unsigned int*)(0x43800368UL))
#define bM4_USF_GINTMSK_CONIDSTSCHNGMSK                 *((volatile unsigned int*)(0x43800370UL))
#define bM4_USF_GINTMSK_DISCONNINTMSK                   *((volatile unsigned int*)(0x43800374UL))
#define bM4_USF_GINTMSK_SESSREQINTMSK                   *((volatile unsigned int*)(0x43800378UL))
#define bM4_USF_GINTMSK_WKUPINTMSK                      *((volatile unsigned int*)(0x4380037CUL))
#define bM4_USF_GRXSTSR_CHNUM0                          *((volatile unsigned int*)(0x43800380UL))
#define bM4_USF_GRXSTSR_CHNUM1                          *((volatile unsigned int*)(0x43800384UL))
#define bM4_USF_GRXSTSR_CHNUM2                          *((volatile unsigned int*)(0x43800388UL))
#define bM4_USF_GRXSTSR_CHNUM3                          *((volatile unsigned int*)(0x4380038CUL))
#define bM4_USF_GRXSTSR_BCNT0                           *((volatile unsigned int*)(0x43800390UL))
#define bM4_USF_GRXSTSR_BCNT1                           *((volatile unsigned int*)(0x43800394UL))
#define bM4_USF_GRXSTSR_BCNT2                           *((volatile unsigned int*)(0x43800398UL))
#define bM4_USF_GRXSTSR_BCNT3                           *((volatile unsigned int*)(0x4380039CUL))
#define bM4_USF_GRXSTSR_BCNT4                           *((volatile unsigned int*)(0x438003A0UL))
#define bM4_USF_GRXSTSR_BCNT5                           *((volatile unsigned int*)(0x438003A4UL))
#define bM4_USF_GRXSTSR_BCNT6                           *((volatile unsigned int*)(0x438003A8UL))
#define bM4_USF_GRXSTSR_BCNT7                           *((volatile unsigned int*)(0x438003ACUL))
#define bM4_USF_GRXSTSR_BCNT8                           *((volatile unsigned int*)(0x438003B0UL))
#define bM4_USF_GRXSTSR_BCNT9                           *((volatile unsigned int*)(0x438003B4UL))
#define bM4_USF_GRXSTSR_BCNT10                          *((volatile unsigned int*)(0x438003B8UL))
#define bM4_USF_GRXSTSR_DPID0                           *((volatile unsigned int*)(0x438003BCUL))
#define bM4_USF_GRXSTSR_DPID1                           *((volatile unsigned int*)(0x438003C0UL))
#define bM4_USF_GRXSTSR_PKTSTS0                         *((volatile unsigned int*)(0x438003C4UL))
#define bM4_USF_GRXSTSR_PKTSTS1                         *((volatile unsigned int*)(0x438003C8UL))
#define bM4_USF_GRXSTSR_PKTSTS2                         *((volatile unsigned int*)(0x438003CCUL))
#define bM4_USF_GRXSTSR_PKTSTS3                         *((volatile unsigned int*)(0x438003D0UL))
#define bM4_USF_GRXSTSR_RESV                            *((volatile unsigned int*)(0x438003E0UL))
#define bM4_USF_GRXSTSP_CHNUM0                          *((volatile unsigned int*)(0x43800400UL))
#define bM4_USF_GRXSTSP_CHNUM1                          *((volatile unsigned int*)(0x43800404UL))
#define bM4_USF_GRXSTSP_CHNUM2                          *((volatile unsigned int*)(0x43800408UL))
#define bM4_USF_GRXSTSP_CHNUM3                          *((volatile unsigned int*)(0x4380040CUL))
#define bM4_USF_GRXSTSP_BCNT0                           *((volatile unsigned int*)(0x43800410UL))
#define bM4_USF_GRXSTSP_BCNT1                           *((volatile unsigned int*)(0x43800414UL))
#define bM4_USF_GRXSTSP_BCNT2                           *((volatile unsigned int*)(0x43800418UL))
#define bM4_USF_GRXSTSP_BCNT3                           *((volatile unsigned int*)(0x4380041CUL))
#define bM4_USF_GRXSTSP_BCNT4                           *((volatile unsigned int*)(0x43800420UL))
#define bM4_USF_GRXSTSP_BCNT5                           *((volatile unsigned int*)(0x43800424UL))
#define bM4_USF_GRXSTSP_BCNT6                           *((volatile unsigned int*)(0x43800428UL))
#define bM4_USF_GRXSTSP_BCNT7                           *((volatile unsigned int*)(0x4380042CUL))
#define bM4_USF_GRXSTSP_BCNT8                           *((volatile unsigned int*)(0x43800430UL))
#define bM4_USF_GRXSTSP_BCNT9                           *((volatile unsigned int*)(0x43800434UL))
#define bM4_USF_GRXSTSP_BCNT10                          *((volatile unsigned int*)(0x43800438UL))
#define bM4_USF_GRXSTSP_DPID0                           *((volatile unsigned int*)(0x4380043CUL))
#define bM4_USF_GRXSTSP_DPID1                           *((volatile unsigned int*)(0x43800440UL))
#define bM4_USF_GRXSTSP_PKTSTS0                         *((volatile unsigned int*)(0x43800444UL))
#define bM4_USF_GRXSTSP_PKTSTS1                         *((volatile unsigned int*)(0x43800448UL))
#define bM4_USF_GRXSTSP_PKTSTS2                         *((volatile unsigned int*)(0x4380044CUL))
#define bM4_USF_GRXSTSP_PKTSTS3                         *((volatile unsigned int*)(0x43800450UL))
#define bM4_USF_GRXSTSP_RESV                            *((volatile unsigned int*)(0x43800460UL))
#define bM4_USF_GRXFSIZ_RXFDEP0                         *((volatile unsigned int*)(0x43800480UL))
#define bM4_USF_GRXFSIZ_RXFDEP1                         *((volatile unsigned int*)(0x43800484UL))
#define bM4_USF_GRXFSIZ_RXFDEP2                         *((volatile unsigned int*)(0x43800488UL))
#define bM4_USF_GRXFSIZ_RXFDEP3                         *((volatile unsigned int*)(0x4380048CUL))
#define bM4_USF_GRXFSIZ_RXFDEP4                         *((volatile unsigned int*)(0x43800490UL))
#define bM4_USF_GRXFSIZ_RXFDEP5                         *((volatile unsigned int*)(0x43800494UL))
#define bM4_USF_GRXFSIZ_RXFDEP6                         *((volatile unsigned int*)(0x43800498UL))
#define bM4_USF_GRXFSIZ_RXFDEP7                         *((volatile unsigned int*)(0x4380049CUL))
#define bM4_USF_GRXFSIZ_RXFDEP8                         *((volatile unsigned int*)(0x438004A0UL))
#define bM4_USF_GRXFSIZ_RXFDEP9                         *((volatile unsigned int*)(0x438004A4UL))
#define bM4_USF_GRXFSIZ_RXFDEP10                        *((volatile unsigned int*)(0x438004A8UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR0                  *((volatile unsigned int*)(0x43800500UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR1                  *((volatile unsigned int*)(0x43800504UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR2                  *((volatile unsigned int*)(0x43800508UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR3                  *((volatile unsigned int*)(0x4380050CUL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR4                  *((volatile unsigned int*)(0x43800510UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR5                  *((volatile unsigned int*)(0x43800514UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR6                  *((volatile unsigned int*)(0x43800518UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR7                  *((volatile unsigned int*)(0x4380051CUL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR8                  *((volatile unsigned int*)(0x43800520UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR9                  *((volatile unsigned int*)(0x43800524UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR10                 *((volatile unsigned int*)(0x43800528UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR11                 *((volatile unsigned int*)(0x4380052CUL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR12                 *((volatile unsigned int*)(0x43800530UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR13                 *((volatile unsigned int*)(0x43800534UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR14                 *((volatile unsigned int*)(0x43800538UL))
#define bM4_USF_GNPTXFSIZ_NPTXFSTADDR15                 *((volatile unsigned int*)(0x4380053CUL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP0                     *((volatile unsigned int*)(0x43800540UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP1                     *((volatile unsigned int*)(0x43800544UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP2                     *((volatile unsigned int*)(0x43800548UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP3                     *((volatile unsigned int*)(0x4380054CUL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP4                     *((volatile unsigned int*)(0x43800550UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP5                     *((volatile unsigned int*)(0x43800554UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP6                     *((volatile unsigned int*)(0x43800558UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP7                     *((volatile unsigned int*)(0x4380055CUL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP8                     *((volatile unsigned int*)(0x43800560UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP9                     *((volatile unsigned int*)(0x43800564UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP10                    *((volatile unsigned int*)(0x43800568UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP11                    *((volatile unsigned int*)(0x4380056CUL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP12                    *((volatile unsigned int*)(0x43800570UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP13                    *((volatile unsigned int*)(0x43800574UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP14                    *((volatile unsigned int*)(0x43800578UL))
#define bM4_USF_GNPTXFSIZ_NPTXFDEP15                    *((volatile unsigned int*)(0x4380057CUL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL0                 *((volatile unsigned int*)(0x43800580UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL1                 *((volatile unsigned int*)(0x43800584UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL2                 *((volatile unsigned int*)(0x43800588UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL3                 *((volatile unsigned int*)(0x4380058CUL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL4                 *((volatile unsigned int*)(0x43800590UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL5                 *((volatile unsigned int*)(0x43800594UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL6                 *((volatile unsigned int*)(0x43800598UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL7                 *((volatile unsigned int*)(0x4380059CUL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL8                 *((volatile unsigned int*)(0x438005A0UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL9                 *((volatile unsigned int*)(0x438005A4UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL10                *((volatile unsigned int*)(0x438005A8UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL11                *((volatile unsigned int*)(0x438005ACUL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL12                *((volatile unsigned int*)(0x438005B0UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL13                *((volatile unsigned int*)(0x438005B4UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL14                *((volatile unsigned int*)(0x438005B8UL))
#define bM4_USF_GNPTXSTS_NPTXFSPCAVAIL15                *((volatile unsigned int*)(0x438005BCUL))
#define bM4_USF_GNPTXSTS_NPTXQSPCAVAIL0                 *((volatile unsigned int*)(0x438005C0UL))
#define bM4_USF_GNPTXSTS_NPTXQSPCAVAIL1                 *((volatile unsigned int*)(0x438005C4UL))
#define bM4_USF_GNPTXSTS_NPTXQSPCAVAIL2                 *((volatile unsigned int*)(0x438005C8UL))
#define bM4_USF_GNPTXSTS_NPTXQSPCAVAIL3                 *((volatile unsigned int*)(0x438005CCUL))
#define bM4_USF_GNPTXSTS_NPTXQSPCAVAIL4                 *((volatile unsigned int*)(0x438005D0UL))
#define bM4_USF_GNPTXSTS_NPTXQSPCAVAIL5                 *((volatile unsigned int*)(0x438005D4UL))
#define bM4_USF_GNPTXSTS_NPTXQSPCAVAIL6                 *((volatile unsigned int*)(0x438005D8UL))
#define bM4_USF_GNPTXSTS_NPTXQSPCAVAIL7                 *((volatile unsigned int*)(0x438005DCUL))
#define bM4_USF_GNPTXSTS_NPTXQTOP0                      *((volatile unsigned int*)(0x438005E0UL))
#define bM4_USF_GNPTXSTS_NPTXQTOP1                      *((volatile unsigned int*)(0x438005E4UL))
#define bM4_USF_GNPTXSTS_NPTXQTOP2                      *((volatile unsigned int*)(0x438005E8UL))
#define bM4_USF_GNPTXSTS_NPTXQTOP3                      *((volatile unsigned int*)(0x438005ECUL))
#define bM4_USF_GNPTXSTS_NPTXQTOP4                      *((volatile unsigned int*)(0x438005F0UL))
#define bM4_USF_GNPTXSTS_NPTXQTOP5                      *((volatile unsigned int*)(0x438005F4UL))
#define bM4_USF_GNPTXSTS_NPTXQTOP6                      *((volatile unsigned int*)(0x438005F8UL))
#define bM4_USF_GPVNDCTL_REGDATA0                       *((volatile unsigned int*)(0x43800680UL))
#define bM4_USF_GPVNDCTL_REGDATA1                       *((volatile unsigned int*)(0x43800684UL))
#define bM4_USF_GPVNDCTL_REGDATA2                       *((volatile unsigned int*)(0x43800688UL))
#define bM4_USF_GPVNDCTL_REGDATA3                       *((volatile unsigned int*)(0x4380068CUL))
#define bM4_USF_GPVNDCTL_REGDATA4                       *((volatile unsigned int*)(0x43800690UL))
#define bM4_USF_GPVNDCTL_REGDATA5                       *((volatile unsigned int*)(0x43800694UL))
#define bM4_USF_GPVNDCTL_REGDATA6                       *((volatile unsigned int*)(0x43800698UL))
#define bM4_USF_GPVNDCTL_REGDATA7                       *((volatile unsigned int*)(0x4380069CUL))
#define bM4_USF_GPVNDCTL_VCTRL0                         *((volatile unsigned int*)(0x438006A0UL))
#define bM4_USF_GPVNDCTL_VCTRL1                         *((volatile unsigned int*)(0x438006A4UL))
#define bM4_USF_GPVNDCTL_VCTRL2                         *((volatile unsigned int*)(0x438006A8UL))
#define bM4_USF_GPVNDCTL_VCTRL3                         *((volatile unsigned int*)(0x438006ACUL))
#define bM4_USF_GPVNDCTL_VCTRL4                         *((volatile unsigned int*)(0x438006B0UL))
#define bM4_USF_GPVNDCTL_VCTRL5                         *((volatile unsigned int*)(0x438006B4UL))
#define bM4_USF_GPVNDCTL_VCTRL6                         *((volatile unsigned int*)(0x438006B8UL))
#define bM4_USF_GPVNDCTL_VCTRL7                         *((volatile unsigned int*)(0x438006BCUL))
#define bM4_USF_GPVNDCTL_REGADDR0                       *((volatile unsigned int*)(0x438006C0UL))
#define bM4_USF_GPVNDCTL_REGADDR1                       *((volatile unsigned int*)(0x438006C4UL))
#define bM4_USF_GPVNDCTL_REGADDR2                       *((volatile unsigned int*)(0x438006C8UL))
#define bM4_USF_GPVNDCTL_REGADDR3                       *((volatile unsigned int*)(0x438006CCUL))
#define bM4_USF_GPVNDCTL_REGADDR4                       *((volatile unsigned int*)(0x438006D0UL))
#define bM4_USF_GPVNDCTL_REGADDR5                       *((volatile unsigned int*)(0x438006D4UL))
#define bM4_USF_GPVNDCTL_REGWR                          *((volatile unsigned int*)(0x438006D8UL))
#define bM4_USF_GPVNDCTL_NEWREGREQ                      *((volatile unsigned int*)(0x438006E4UL))
#define bM4_USF_GPVNDCTL_VSTSBSY                        *((volatile unsigned int*)(0x438006E8UL))
#define bM4_USF_GPVNDCTL_VSTSDONE                       *((volatile unsigned int*)(0x438006ECUL))
#define bM4_USF_GGPIO_GPI0                              *((volatile unsigned int*)(0x43800700UL))
#define bM4_USF_GGPIO_GPI1                              *((volatile unsigned int*)(0x43800704UL))
#define bM4_USF_GGPIO_GPI2                              *((volatile unsigned int*)(0x43800708UL))
#define bM4_USF_GGPIO_GPI3                              *((volatile unsigned int*)(0x4380070CUL))
#define bM4_USF_GGPIO_GPI4                              *((volatile unsigned int*)(0x43800710UL))
#define bM4_USF_GGPIO_GPI5                              *((volatile unsigned int*)(0x43800714UL))
#define bM4_USF_GGPIO_GPI6                              *((volatile unsigned int*)(0x43800718UL))
#define bM4_USF_GGPIO_GPI7                              *((volatile unsigned int*)(0x4380071CUL))
#define bM4_USF_GGPIO_GPI8                              *((volatile unsigned int*)(0x43800720UL))
#define bM4_USF_GGPIO_GPI9                              *((volatile unsigned int*)(0x43800724UL))
#define bM4_USF_GGPIO_GPI10                             *((volatile unsigned int*)(0x43800728UL))
#define bM4_USF_GGPIO_GPI11                             *((volatile unsigned int*)(0x4380072CUL))
#define bM4_USF_GGPIO_GPI12                             *((volatile unsigned int*)(0x43800730UL))
#define bM4_USF_GGPIO_GPI13                             *((volatile unsigned int*)(0x43800734UL))
#define bM4_USF_GGPIO_GPI14                             *((volatile unsigned int*)(0x43800738UL))
#define bM4_USF_GGPIO_GPI15                             *((volatile unsigned int*)(0x4380073CUL))
#define bM4_USF_GGPIO_GPO0                              *((volatile unsigned int*)(0x43800740UL))
#define bM4_USF_GGPIO_GPO1                              *((volatile unsigned int*)(0x43800744UL))
#define bM4_USF_GGPIO_GPO2                              *((volatile unsigned int*)(0x43800748UL))
#define bM4_USF_GGPIO_GPO3                              *((volatile unsigned int*)(0x4380074CUL))
#define bM4_USF_GGPIO_GPO4                              *((volatile unsigned int*)(0x43800750UL))
#define bM4_USF_GGPIO_GPO5                              *((volatile unsigned int*)(0x43800754UL))
#define bM4_USF_GGPIO_GPO6                              *((volatile unsigned int*)(0x43800758UL))
#define bM4_USF_GGPIO_GPO7                              *((volatile unsigned int*)(0x4380075CUL))
#define bM4_USF_GGPIO_GPO8                              *((volatile unsigned int*)(0x43800760UL))
#define bM4_USF_GGPIO_GPO9                              *((volatile unsigned int*)(0x43800764UL))
#define bM4_USF_GGPIO_GPO10                             *((volatile unsigned int*)(0x43800768UL))
#define bM4_USF_GGPIO_GPO11                             *((volatile unsigned int*)(0x4380076CUL))
#define bM4_USF_GGPIO_GPO12                             *((volatile unsigned int*)(0x43800770UL))
#define bM4_USF_GGPIO_GPO13                             *((volatile unsigned int*)(0x43800774UL))
#define bM4_USF_GGPIO_GPO14                             *((volatile unsigned int*)(0x43800778UL))
#define bM4_USF_GGPIO_GPO15                             *((volatile unsigned int*)(0x4380077CUL))
#define bM4_USF_GHWCFG2_OTGMODE0                        *((volatile unsigned int*)(0x43800900UL))
#define bM4_USF_GHWCFG2_OTGMODE1                        *((volatile unsigned int*)(0x43800904UL))
#define bM4_USF_GHWCFG2_OTGMODE2                        *((volatile unsigned int*)(0x43800908UL))
#define bM4_USF_GHWCFG2_OTGARCH0                        *((volatile unsigned int*)(0x4380090CUL))
#define bM4_USF_GHWCFG2_OTGARCH1                        *((volatile unsigned int*)(0x43800910UL))
