RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_GHWCFG2_SINGPNT                         *((volatile unsigned int*)(0x43800914UL))
#define bM4_USF_GHWCFG2_HSPHYTYPE0                      *((volatile unsigned int*)(0x43800918UL))
#define bM4_USF_GHWCFG2_HSPHYTYPE1                      *((volatile unsigned int*)(0x4380091CUL))
#define bM4_USF_GHWCFG2_FSPHYTYPE0                      *((volatile unsigned int*)(0x43800920UL))
#define bM4_USF_GHWCFG2_FSPHYTYPE1                      *((volatile unsigned int*)(0x43800924UL))
#define bM4_USF_GHWCFG2_NUMDEVEPS0                      *((volatile unsigned int*)(0x43800928UL))
#define bM4_USF_GHWCFG2_NUMDEVEPS1                      *((volatile unsigned int*)(0x4380092CUL))
#define bM4_USF_GHWCFG2_NUMDEVEPS2                      *((volatile unsigned int*)(0x43800930UL))
#define bM4_USF_GHWCFG2_NUMDEVEPS3                      *((volatile unsigned int*)(0x43800934UL))
#define bM4_USF_GHWCFG2_NUMHSTCHNL0                     *((volatile unsigned int*)(0x43800938UL))
#define bM4_USF_GHWCFG2_NUMHSTCHNL1                     *((volatile unsigned int*)(0x4380093CUL))
#define bM4_USF_GHWCFG2_NUMHSTCHNL2                     *((volatile unsigned int*)(0x43800940UL))
#define bM4_USF_GHWCFG2_NUMHSTCHNL3                     *((volatile unsigned int*)(0x43800944UL))
#define bM4_USF_GHWCFG2_PERIOSUPPORT                    *((volatile unsigned int*)(0x43800948UL))
#define bM4_USF_GHWCFG2_DYNFIFOSIZING                   *((volatile unsigned int*)(0x4380094CUL))
#define bM4_USF_GHWCFG2_MULTIPROCINTRPT                 *((volatile unsigned int*)(0x43800950UL))
#define bM4_USF_GHWCFG2_NPTXQDEPTH0                     *((volatile unsigned int*)(0x43800958UL))
#define bM4_USF_GHWCFG2_NPTXQDEPTH1                     *((volatile unsigned int*)(0x4380095CUL))
#define bM4_USF_GHWCFG2_PTXQDEPTH0                      *((volatile unsigned int*)(0x43800960UL))
#define bM4_USF_GHWCFG2_PTXQDEPTH1                      *((volatile unsigned int*)(0x43800964UL))
#define bM4_USF_GHWCFG2_TKNQDEPTH0                      *((volatile unsigned int*)(0x43800968UL))
#define bM4_USF_GHWCFG2_TKNQDEPTH1                      *((volatile unsigned int*)(0x4380096CUL))
#define bM4_USF_GHWCFG2_TKNQDEPTH2                      *((volatile unsigned int*)(0x43800970UL))
#define bM4_USF_GHWCFG2_TKNQDEPTH3                      *((volatile unsigned int*)(0x43800974UL))
#define bM4_USF_GHWCFG2_TKNQDEPTH4                      *((volatile unsigned int*)(0x43800978UL))
#define bM4_USF_GHWCFG3_XFERSIZEWIDTH0                  *((volatile unsigned int*)(0x43800980UL))
#define bM4_USF_GHWCFG3_XFERSIZEWIDTH1                  *((volatile unsigned int*)(0x43800984UL))
#define bM4_USF_GHWCFG3_XFERSIZEWIDTH2                  *((volatile unsigned int*)(0x43800988UL))
#define bM4_USF_GHWCFG3_XFERSIZEWIDTH3                  *((volatile unsigned int*)(0x4380098CUL))
#define bM4_USF_GHWCFG3_PKTSIZEWIDTH0                   *((volatile unsigned int*)(0x43800990UL))
#define bM4_USF_GHWCFG3_PKTSIZEWIDTH1                   *((volatile unsigned int*)(0x43800994UL))
#define bM4_USF_GHWCFG3_PKTSIZEWIDTH2                   *((volatile unsigned int*)(0x43800998UL))
#define bM4_USF_GHWCFG3_OTGEN                           *((volatile unsigned int*)(0x4380099CUL))
#define bM4_USF_GHWCFG3_I2CINTSEL                       *((volatile unsigned int*)(0x438009A0UL))
#define bM4_USF_GHWCFG3_VNDCTLSUPT                      *((volatile unsigned int*)(0x438009A4UL))
#define bM4_USF_GHWCFG3_OPTFEATURE                      *((volatile unsigned int*)(0x438009A8UL))
#define bM4_USF_GHWCFG3_RSTTYPE                         *((volatile unsigned int*)(0x438009ACUL))
#define bM4_USF_GHWCFG3_ADPSUPPORT                      *((volatile unsigned int*)(0x438009B0UL))
#define bM4_USF_GHWCFG3_HSICMODE                        *((volatile unsigned int*)(0x438009B4UL))
#define bM4_USF_GHWCFG3_BCSUPPORT                       *((volatile unsigned int*)(0x438009B8UL))
#define bM4_USF_GHWCFG3_LPMMODE                         *((volatile unsigned int*)(0x438009BCUL))
#define bM4_USF_GHWCFG3_DFIFODEPTH0                     *((volatile unsigned int*)(0x438009C0UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH1                     *((volatile unsigned int*)(0x438009C4UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH2                     *((volatile unsigned int*)(0x438009C8UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH3                     *((volatile unsigned int*)(0x438009CCUL))
#define bM4_USF_GHWCFG3_DFIFODEPTH4                     *((volatile unsigned int*)(0x438009D0UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH5                     *((volatile unsigned int*)(0x438009D4UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH6                     *((volatile unsigned int*)(0x438009D8UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH7                     *((volatile unsigned int*)(0x438009DCUL))
#define bM4_USF_GHWCFG3_DFIFODEPTH8                     *((volatile unsigned int*)(0x438009E0UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH9                     *((volatile unsigned int*)(0x438009E4UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH10                    *((volatile unsigned int*)(0x438009E8UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH11                    *((volatile unsigned int*)(0x438009ECUL))
#define bM4_USF_GHWCFG3_DFIFODEPTH12                    *((volatile unsigned int*)(0x438009F0UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH13                    *((volatile unsigned int*)(0x438009F4UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH14                    *((volatile unsigned int*)(0x438009F8UL))
#define bM4_USF_GHWCFG3_DFIFODEPTH15                    *((volatile unsigned int*)(0x438009FCUL))
#define bM4_USF_GHWCFG4_NUMDEVPERIOEPS0                 *((volatile unsigned int*)(0x43800A00UL))
#define bM4_USF_GHWCFG4_NUMDEVPERIOEPS1                 *((volatile unsigned int*)(0x43800A04UL))
#define bM4_USF_GHWCFG4_NUMDEVPERIOEPS2                 *((volatile unsigned int*)(0x43800A08UL))
#define bM4_USF_GHWCFG4_NUMDEVPERIOEPS3                 *((volatile unsigned int*)(0x43800A0CUL))
#define bM4_USF_GHWCFG4_PARTIALPWRDN                    *((volatile unsigned int*)(0x43800A10UL))
#define bM4_USF_GHWCFG4_AHBFREQ                         *((volatile unsigned int*)(0x43800A14UL))
#define bM4_USF_GHWCFG4_HIBERNATION                     *((volatile unsigned int*)(0x43800A18UL))
#define bM4_USF_GHWCFG4_EXTENDEDHIBERNATION             *((volatile unsigned int*)(0x43800A1CUL))
#define bM4_USF_GHWCFG4_PHYDATAWIDTH0                   *((volatile unsigned int*)(0x43800A38UL))
#define bM4_USF_GHWCFG4_PHYDATAWIDTH1                   *((volatile unsigned int*)(0x43800A3CUL))
#define bM4_USF_GHWCFG4_NUMCTLEPS0                      *((volatile unsigned int*)(0x43800A40UL))
#define bM4_USF_GHWCFG4_NUMCTLEPS1                      *((volatile unsigned int*)(0x43800A44UL))
#define bM4_USF_GHWCFG4_NUMCTLEPS2                      *((volatile unsigned int*)(0x43800A48UL))
#define bM4_USF_GHWCFG4_NUMCTLEPS3                      *((volatile unsigned int*)(0x43800A4CUL))
#define bM4_USF_GHWCFG4_IDDGFLTR                        *((volatile unsigned int*)(0x43800A50UL))
#define bM4_USF_GHWCFG4_VBUSVALIDFLTR                   *((volatile unsigned int*)(0x43800A54UL))
#define bM4_USF_GHWCFG4_AVALIDFLTR                      *((volatile unsigned int*)(0x43800A58UL))
#define bM4_USF_GHWCFG4_BVALIDFLTR                      *((volatile unsigned int*)(0x43800A5CUL))
#define bM4_USF_GHWCFG4_SESSENDFLTR                     *((volatile unsigned int*)(0x43800A60UL))
#define bM4_USF_GHWCFG4_DEDFIFOMODE                     *((volatile unsigned int*)(0x43800A64UL))
#define bM4_USF_GHWCFG4_INEPS0                          *((volatile unsigned int*)(0x43800A68UL))
#define bM4_USF_GHWCFG4_INEPS1                          *((volatile unsigned int*)(0x43800A6CUL))
#define bM4_USF_GHWCFG4_INEPS2                          *((volatile unsigned int*)(0x43800A70UL))
#define bM4_USF_GHWCFG4_INEPS3                          *((volatile unsigned int*)(0x43800A74UL))
#define bM4_USF_GHWCFG4_DESCDMAENABLED                  *((volatile unsigned int*)(0x43800A78UL))
#define bM4_USF_GHWCFG4_DESCDMA                         *((volatile unsigned int*)(0x43800A7CUL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG0                    *((volatile unsigned int*)(0x43800B80UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG1                    *((volatile unsigned int*)(0x43800B84UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG2                    *((volatile unsigned int*)(0x43800B88UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG3                    *((volatile unsigned int*)(0x43800B8CUL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG4                    *((volatile unsigned int*)(0x43800B90UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG5                    *((volatile unsigned int*)(0x43800B94UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG6                    *((volatile unsigned int*)(0x43800B98UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG7                    *((volatile unsigned int*)(0x43800B9CUL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG8                    *((volatile unsigned int*)(0x43800BA0UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG9                    *((volatile unsigned int*)(0x43800BA4UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG10                   *((volatile unsigned int*)(0x43800BA8UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG11                   *((volatile unsigned int*)(0x43800BACUL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG12                   *((volatile unsigned int*)(0x43800BB0UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG13                   *((volatile unsigned int*)(0x43800BB4UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG14                   *((volatile unsigned int*)(0x43800BB8UL))
#define bM4_USF_GDFIFOCFG_GDFIFOCFG15                   *((volatile unsigned int*)(0x43800BBCUL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR0               *((volatile unsigned int*)(0x43800BC0UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR1               *((volatile unsigned int*)(0x43800BC4UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR2               *((volatile unsigned int*)(0x43800BC8UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR3               *((volatile unsigned int*)(0x43800BCCUL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR4               *((volatile unsigned int*)(0x43800BD0UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR5               *((volatile unsigned int*)(0x43800BD4UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR6               *((volatile unsigned int*)(0x43800BD8UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR7               *((volatile unsigned int*)(0x43800BDCUL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR8               *((volatile unsigned int*)(0x43800BE0UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR9               *((volatile unsigned int*)(0x43800BE4UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR10              *((volatile unsigned int*)(0x43800BE8UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR11              *((volatile unsigned int*)(0x43800BECUL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR12              *((volatile unsigned int*)(0x43800BF0UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR13              *((volatile unsigned int*)(0x43800BF4UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR14              *((volatile unsigned int*)(0x43800BF8UL))
#define bM4_USF_GDFIFOCFG_EPINFOBASEADDR15              *((volatile unsigned int*)(0x43800BFCUL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR0                    *((volatile unsigned int*)(0x43802000UL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR1                    *((volatile unsigned int*)(0x43802004UL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR2                    *((volatile unsigned int*)(0x43802008UL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR3                    *((volatile unsigned int*)(0x4380200CUL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR4                    *((volatile unsigned int*)(0x43802010UL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR5                    *((volatile unsigned int*)(0x43802014UL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR6                    *((volatile unsigned int*)(0x43802018UL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR7                    *((volatile unsigned int*)(0x4380201CUL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR8                    *((volatile unsigned int*)(0x43802020UL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR9                    *((volatile unsigned int*)(0x43802024UL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR10                   *((volatile unsigned int*)(0x43802028UL))
#define bM4_USF_HPTXFSIZ_PTXFSTADDR11                   *((volatile unsigned int*)(0x4380202CUL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE0                      *((volatile unsigned int*)(0x43802040UL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE1                      *((volatile unsigned int*)(0x43802044UL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE2                      *((volatile unsigned int*)(0x43802048UL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE3                      *((volatile unsigned int*)(0x4380204CUL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE4                      *((volatile unsigned int*)(0x43802050UL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE5                      *((volatile unsigned int*)(0x43802054UL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE6                      *((volatile unsigned int*)(0x43802058UL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE7                      *((volatile unsigned int*)(0x4380205CUL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE8                      *((volatile unsigned int*)(0x43802060UL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE9                      *((volatile unsigned int*)(0x43802064UL))
#define bM4_USF_HPTXFSIZ_PTXFSIZE10                     *((volatile unsigned int*)(0x43802068UL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43802080UL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43802084UL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43802088UL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4380208CUL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43802090UL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43802094UL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43802098UL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4380209CUL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x438020A0UL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x438020A4UL))
#define bM4_USF_DIEPTXF1_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x438020A8UL))
#define bM4_USF_DIEPTXF1_INEPNTXFDEP0                   *((volatile unsigned int*)(0x438020C0UL))
#define bM4_USF_DIEPTXF1_INEPNTXFDEP1                   *((volatile unsigned int*)(0x438020C4UL))
#define bM4_USF_DIEPTXF1_INEPNTXFDEP2                   *((volatile unsigned int*)(0x438020C8UL))
#define bM4_USF_DIEPTXF1_INEPNTXFDEP3                   *((volatile unsigned int*)(0x438020CCUL))
#define bM4_USF_DIEPTXF1_INEPNTXFDEP4                   *((volatile unsigned int*)(0x438020D0UL))
#define bM4_USF_DIEPTXF1_INEPNTXFDEP5                   *((volatile unsigned int*)(0x438020D4UL))
#define bM4_USF_DIEPTXF1_INEPNTXFDEP6                   *((volatile unsigned int*)(0x438020D8UL))
#define bM4_USF_DIEPTXF1_INEPNTXFDEP7                   *((volatile unsigned int*)(0x438020DCUL))
#define bM4_USF_DIEPTXF1_INEPNTXFDEP8                   *((volatile unsigned int*)(0x438020E0UL))
#define bM4_USF_DIEPTXF1_INEPNTXFDEP9                   *((volatile unsigned int*)(0x438020E4UL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43802100UL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43802104UL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43802108UL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4380210CUL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43802110UL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43802114UL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43802118UL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4380211CUL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x43802120UL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x43802124UL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x43802128UL))
#define bM4_USF_DIEPTXF2_INEPNTXFSTADDR11               *((volatile unsigned int*)(0x4380212CUL))
#define bM4_USF_DIEPTXF2_INEPNTXFDEP0                   *((volatile unsigned int*)(0x43802140UL))
#define bM4_USF_DIEPTXF2_INEPNTXFDEP1                   *((volatile unsigned int*)(0x43802144UL))
#define bM4_USF_DIEPTXF2_INEPNTXFDEP2                   *((volatile unsigned int*)(0x43802148UL))
#define bM4_USF_DIEPTXF2_INEPNTXFDEP3                   *((volatile unsigned int*)(0x4380214CUL))
#define bM4_USF_DIEPTXF2_INEPNTXFDEP4                   *((volatile unsigned int*)(0x43802150UL))
#define bM4_USF_DIEPTXF2_INEPNTXFDEP5                   *((volatile unsigned int*)(0x43802154UL))
#define bM4_USF_DIEPTXF2_INEPNTXFDEP6                   *((volatile unsigned int*)(0x43802158UL))
#define bM4_USF_DIEPTXF2_INEPNTXFDEP7                   *((volatile unsigned int*)(0x4380215CUL))
#define bM4_USF_DIEPTXF2_INEPNTXFDEP8                   *((volatile unsigned int*)(0x43802160UL))
#define bM4_USF_DIEPTXF2_INEPNTXFDEP9                   *((volatile unsigned int*)(0x43802164UL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43802180UL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43802184UL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43802188UL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4380218CUL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43802190UL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43802194UL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43802198UL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4380219CUL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x438021A0UL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x438021A4UL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x438021A8UL))
#define bM4_USF_DIEPTXF3_INEPNTXFSTADDR11               *((volatile unsigned int*)(0x438021ACUL))
#define bM4_USF_DIEPTXF3_INEPNTXFDEP0                   *((volatile unsigned int*)(0x438021C0UL))
#define bM4_USF_DIEPTXF3_INEPNTXFDEP1                   *((volatile unsigned int*)(0x438021C4UL))
#define bM4_USF_DIEPTXF3_INEPNTXFDEP2                   *((volatile unsigned int*)(0x438021C8UL))
#define bM4_USF_DIEPTXF3_INEPNTXFDEP3                   *((volatile unsigned int*)(0x438021CCUL))
#define bM4_USF_DIEPTXF3_INEPNTXFDEP4                   *((volatile unsigned int*)(0x438021D0UL))
#define bM4_USF_DIEPTXF3_INEPNTXFDEP5                   *((volatile unsigned int*)(0x438021D4UL))
#define bM4_USF_DIEPTXF3_INEPNTXFDEP6                   *((volatile unsigned int*)(0x438021D8UL))
#define bM4_USF_DIEPTXF3_INEPNTXFDEP7                   *((volatile unsigned int*)(0x438021DCUL))
#define bM4_USF_DIEPTXF3_INEPNTXFDEP8                   *((volatile unsigned int*)(0x438021E0UL))
#define bM4_USF_DIEPTXF3_INEPNTXFDEP9                   *((volatile unsigned int*)(0x438021E4UL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43802200UL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43802204UL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43802208UL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4380220CUL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43802210UL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43802214UL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43802218UL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4380221CUL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x43802220UL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x43802224UL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x43802228UL))
#define bM4_USF_DIEPTXF4_INEPNTXFSTADDR11               *((volatile unsigned int*)(0x4380222CUL))
#define bM4_USF_DIEPTXF4_INEPNTXFDEP0                   *((volatile unsigned int*)(0x43802240UL))
#define bM4_USF_DIEPTXF4_INEPNTXFDEP1                   *((volatile unsigned int*)(0x43802244UL))
#define bM4_USF_DIEPTXF4_INEPNTXFDEP2                   *((volatile unsigned int*)(0x43802248UL))
#define bM4_USF_DIEPTXF4_INEPNTXFDEP3                   *((volatile unsigned int*)(0x4380224CUL))
#define bM4_USF_DIEPTXF4_INEPNTXFDEP4                   *((volatile unsigned int*)(0x43802250UL))
#define bM4_USF_DIEPTXF4_INEPNTXFDEP5                   *((volatile unsigned int*)(0x43802254UL))
#define bM4_USF_DIEPTXF4_INEPNTXFDEP6                   *((volatile unsigned int*)(0x43802258UL))
#define bM4_USF_DIEPTXF4_INEPNTXFDEP7                   *((volatile unsigned int*)(0x4380225CUL))
#define bM4_USF_DIEPTXF4_INEPNTXFDEP8                   *((volatile unsigned int*)(0x43802260UL))
#define bM4_USF_DIEPTXF4_INEPNTXFDEP9                   *((volatile unsigned int*)(0x43802264UL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43802280UL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43802284UL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43802288UL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4380228CUL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43802290UL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43802294UL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43802298UL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4380229CUL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x438022A0UL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x438022A4UL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x438022A8UL))
#define bM4_USF_DIEPTXF5_INEPNTXFSTADDR11               *((volatile unsigned int*)(0x438022ACUL))
#define bM4_USF_DIEPTXF5_INEPNTXFDEP0                   *((volatile unsigned int*)(0x438022C0UL))
#define bM4_USF_DIEPTXF5_INEPNTXFDEP1                   *((volatile unsigned int*)(0x438022C4UL))
#define bM4_USF_DIEPTXF5_INEPNTXFDEP2                   *((volatile unsigned int*)(0x438022C8UL))
#define bM4_USF_DIEPTXF5_INEPNTXFDEP3                   *((volatile unsigned int*)(0x438022CCUL))
#define bM4_USF_DIEPTXF5_INEPNTXFDEP4                   *((volatile unsigned int*)(0x438022D0UL))
#define bM4_USF_DIEPTXF5_INEPNTXFDEP5                   *((volatile unsigned int*)(0x438022D4UL))
#define bM4_USF_DIEPTXF5_INEPNTXFDEP6                   *((volatile unsigned int*)(0x438022D8UL))
