RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_DIEPTXF5_INEPNTXFDEP7                   *((volatile unsigned int*)(0x438022DCUL))
#define bM4_USF_DIEPTXF5_INEPNTXFDEP8                   *((volatile unsigned int*)(0x438022E0UL))
#define bM4_USF_DIEPTXF5_INEPNTXFDEP9                   *((volatile unsigned int*)(0x438022E4UL))
#define bM4_USF_HCFG_FSLSPCLKSEL0                       *((volatile unsigned int*)(0x43808000UL))
#define bM4_USF_HCFG_FSLSPCLKSEL1                       *((volatile unsigned int*)(0x43808004UL))
#define bM4_USF_HCFG_FSLSSUPP                           *((volatile unsigned int*)(0x43808008UL))
#define bM4_USF_HCFG_ENA32KHZS                          *((volatile unsigned int*)(0x4380801CUL))
#define bM4_USF_HCFG_RESVALID0                          *((volatile unsigned int*)(0x43808020UL))
#define bM4_USF_HCFG_RESVALID1                          *((volatile unsigned int*)(0x43808024UL))
#define bM4_USF_HCFG_RESVALID2                          *((volatile unsigned int*)(0x43808028UL))
#define bM4_USF_HCFG_RESVALID3                          *((volatile unsigned int*)(0x4380802CUL))
#define bM4_USF_HCFG_RESVALID4                          *((volatile unsigned int*)(0x43808030UL))
#define bM4_USF_HCFG_RESVALID5                          *((volatile unsigned int*)(0x43808034UL))
#define bM4_USF_HCFG_RESVALID6                          *((volatile unsigned int*)(0x43808038UL))
#define bM4_USF_HCFG_RESVALID7                          *((volatile unsigned int*)(0x4380803CUL))
#define bM4_USF_HCFG_MODECHTIMEN                        *((volatile unsigned int*)(0x4380807CUL))
#define bM4_USF_HFIR_FRINT0                             *((volatile unsigned int*)(0x43808080UL))
#define bM4_USF_HFIR_FRINT1                             *((volatile unsigned int*)(0x43808084UL))
#define bM4_USF_HFIR_FRINT2                             *((volatile unsigned int*)(0x43808088UL))
#define bM4_USF_HFIR_FRINT3                             *((volatile unsigned int*)(0x4380808CUL))
#define bM4_USF_HFIR_FRINT4                             *((volatile unsigned int*)(0x43808090UL))
#define bM4_USF_HFIR_FRINT5                             *((volatile unsigned int*)(0x43808094UL))
#define bM4_USF_HFIR_FRINT6                             *((volatile unsigned int*)(0x43808098UL))
#define bM4_USF_HFIR_FRINT7                             *((volatile unsigned int*)(0x4380809CUL))
#define bM4_USF_HFIR_FRINT8                             *((volatile unsigned int*)(0x438080A0UL))
#define bM4_USF_HFIR_FRINT9                             *((volatile unsigned int*)(0x438080A4UL))
#define bM4_USF_HFIR_FRINT10                            *((volatile unsigned int*)(0x438080A8UL))
#define bM4_USF_HFIR_FRINT11                            *((volatile unsigned int*)(0x438080ACUL))
#define bM4_USF_HFIR_FRINT12                            *((volatile unsigned int*)(0x438080B0UL))
#define bM4_USF_HFIR_FRINT13                            *((volatile unsigned int*)(0x438080B4UL))
#define bM4_USF_HFIR_FRINT14                            *((volatile unsigned int*)(0x438080B8UL))
#define bM4_USF_HFIR_FRINT15                            *((volatile unsigned int*)(0x438080BCUL))
#define bM4_USF_HFIR_HFIRRLDCTRL                        *((volatile unsigned int*)(0x438080C0UL))
#define bM4_USF_HFIR_RESV                               *((volatile unsigned int*)(0x438080E0UL))
#define bM4_USF_HFNUM_FRNUM0                            *((volatile unsigned int*)(0x43808100UL))
#define bM4_USF_HFNUM_FRNUM1                            *((volatile unsigned int*)(0x43808104UL))
#define bM4_USF_HFNUM_FRNUM2                            *((volatile unsigned int*)(0x43808108UL))
#define bM4_USF_HFNUM_FRNUM3                            *((volatile unsigned int*)(0x4380810CUL))
#define bM4_USF_HFNUM_FRNUM4                            *((volatile unsigned int*)(0x43808110UL))
#define bM4_USF_HFNUM_FRNUM5                            *((volatile unsigned int*)(0x43808114UL))
#define bM4_USF_HFNUM_FRNUM6                            *((volatile unsigned int*)(0x43808118UL))
#define bM4_USF_HFNUM_FRNUM7                            *((volatile unsigned int*)(0x4380811CUL))
#define bM4_USF_HFNUM_FRNUM8                            *((volatile unsigned int*)(0x43808120UL))
#define bM4_USF_HFNUM_FRNUM9                            *((volatile unsigned int*)(0x43808124UL))
#define bM4_USF_HFNUM_FRNUM10                           *((volatile unsigned int*)(0x43808128UL))
#define bM4_USF_HFNUM_FRNUM11                           *((volatile unsigned int*)(0x4380812CUL))
#define bM4_USF_HFNUM_FRNUM12                           *((volatile unsigned int*)(0x43808130UL))
#define bM4_USF_HFNUM_FRNUM13                           *((volatile unsigned int*)(0x43808134UL))
#define bM4_USF_HFNUM_FRNUM14                           *((volatile unsigned int*)(0x43808138UL))
#define bM4_USF_HFNUM_FRNUM15                           *((volatile unsigned int*)(0x4380813CUL))
#define bM4_USF_HFNUM_FRREM0                            *((volatile unsigned int*)(0x43808140UL))
#define bM4_USF_HFNUM_FRREM1                            *((volatile unsigned int*)(0x43808144UL))
#define bM4_USF_HFNUM_FRREM2                            *((volatile unsigned int*)(0x43808148UL))
#define bM4_USF_HFNUM_FRREM3                            *((volatile unsigned int*)(0x4380814CUL))
#define bM4_USF_HFNUM_FRREM4                            *((volatile unsigned int*)(0x43808150UL))
#define bM4_USF_HFNUM_FRREM5                            *((volatile unsigned int*)(0x43808154UL))
#define bM4_USF_HFNUM_FRREM6                            *((volatile unsigned int*)(0x43808158UL))
#define bM4_USF_HFNUM_FRREM7                            *((volatile unsigned int*)(0x4380815CUL))
#define bM4_USF_HFNUM_FRREM8                            *((volatile unsigned int*)(0x43808160UL))
#define bM4_USF_HFNUM_FRREM9                            *((volatile unsigned int*)(0x43808164UL))
#define bM4_USF_HFNUM_FRREM10                           *((volatile unsigned int*)(0x43808168UL))
#define bM4_USF_HFNUM_FRREM11                           *((volatile unsigned int*)(0x4380816CUL))
#define bM4_USF_HFNUM_FRREM12                           *((volatile unsigned int*)(0x43808170UL))
#define bM4_USF_HFNUM_FRREM13                           *((volatile unsigned int*)(0x43808174UL))
#define bM4_USF_HFNUM_FRREM14                           *((volatile unsigned int*)(0x43808178UL))
#define bM4_USF_HFNUM_FRREM15                           *((volatile unsigned int*)(0x4380817CUL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL0                   *((volatile unsigned int*)(0x43808200UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL1                   *((volatile unsigned int*)(0x43808204UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL2                   *((volatile unsigned int*)(0x43808208UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL3                   *((volatile unsigned int*)(0x4380820CUL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL4                   *((volatile unsigned int*)(0x43808210UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL5                   *((volatile unsigned int*)(0x43808214UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL6                   *((volatile unsigned int*)(0x43808218UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL7                   *((volatile unsigned int*)(0x4380821CUL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL8                   *((volatile unsigned int*)(0x43808220UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL9                   *((volatile unsigned int*)(0x43808224UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL10                  *((volatile unsigned int*)(0x43808228UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL11                  *((volatile unsigned int*)(0x4380822CUL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL12                  *((volatile unsigned int*)(0x43808230UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL13                  *((volatile unsigned int*)(0x43808234UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL14                  *((volatile unsigned int*)(0x43808238UL))
#define bM4_USF_HPTXSTS_PTXFSPCAVAIL15                  *((volatile unsigned int*)(0x4380823CUL))
#define bM4_USF_HPTXSTS_PTXQSPCAVAIL0                   *((volatile unsigned int*)(0x43808240UL))
#define bM4_USF_HPTXSTS_PTXQSPCAVAIL1                   *((volatile unsigned int*)(0x43808244UL))
#define bM4_USF_HPTXSTS_PTXQSPCAVAIL2                   *((volatile unsigned int*)(0x43808248UL))
#define bM4_USF_HPTXSTS_PTXQSPCAVAIL3                   *((volatile unsigned int*)(0x4380824CUL))
#define bM4_USF_HPTXSTS_PTXQSPCAVAIL4                   *((volatile unsigned int*)(0x43808250UL))
#define bM4_USF_HPTXSTS_PTXQSPCAVAIL5                   *((volatile unsigned int*)(0x43808254UL))
#define bM4_USF_HPTXSTS_PTXQSPCAVAIL6                   *((volatile unsigned int*)(0x43808258UL))
#define bM4_USF_HPTXSTS_PTXQSPCAVAIL7                   *((volatile unsigned int*)(0x4380825CUL))
#define bM4_USF_HPTXSTS_PTXQTOP0                        *((volatile unsigned int*)(0x43808260UL))
#define bM4_USF_HPTXSTS_PTXQTOP1                        *((volatile unsigned int*)(0x43808264UL))
#define bM4_USF_HPTXSTS_PTXQTOP2                        *((volatile unsigned int*)(0x43808268UL))
#define bM4_USF_HPTXSTS_PTXQTOP3                        *((volatile unsigned int*)(0x4380826CUL))
#define bM4_USF_HPTXSTS_PTXQTOP4                        *((volatile unsigned int*)(0x43808270UL))
#define bM4_USF_HPTXSTS_PTXQTOP5                        *((volatile unsigned int*)(0x43808274UL))
#define bM4_USF_HPTXSTS_PTXQTOP6                        *((volatile unsigned int*)(0x43808278UL))
#define bM4_USF_HPTXSTS_PTXQTOP7                        *((volatile unsigned int*)(0x4380827CUL))
#define bM4_USF_HPRT_PRTCONNSTS                         *((volatile unsigned int*)(0x43808800UL))
#define bM4_USF_HPRT_PRTCONNDET                         *((volatile unsigned int*)(0x43808804UL))
#define bM4_USF_HPRT_PRTENA                             *((volatile unsigned int*)(0x43808808UL))
#define bM4_USF_HPRT_PRTENCHNG                          *((volatile unsigned int*)(0x4380880CUL))
#define bM4_USF_HPRT_PRTOVRCURRACT                      *((volatile unsigned int*)(0x43808810UL))
#define bM4_USF_HPRT_PRTOVRCURRCHNG                     *((volatile unsigned int*)(0x43808814UL))
#define bM4_USF_HPRT_PRTRES                             *((volatile unsigned int*)(0x43808818UL))
#define bM4_USF_HPRT_PRTSUSP                            *((volatile unsigned int*)(0x4380881CUL))
#define bM4_USF_HPRT_PRTRST                             *((volatile unsigned int*)(0x43808820UL))
#define bM4_USF_HPRT_PRTLNSTS0                          *((volatile unsigned int*)(0x43808828UL))
#define bM4_USF_HPRT_PRTLNSTS1                          *((volatile unsigned int*)(0x4380882CUL))
#define bM4_USF_HPRT_PRTPWR                             *((volatile unsigned int*)(0x43808830UL))
#define bM4_USF_HPRT_PRTTSTCTL0                         *((volatile unsigned int*)(0x43808834UL))
#define bM4_USF_HPRT_PRTTSTCTL1                         *((volatile unsigned int*)(0x43808838UL))
#define bM4_USF_HPRT_PRTTSTCTL2                         *((volatile unsigned int*)(0x4380883CUL))
#define bM4_USF_HPRT_PRTTSTCTL3                         *((volatile unsigned int*)(0x43808840UL))
#define bM4_USF_HPRT_PRTSPD0                            *((volatile unsigned int*)(0x43808844UL))
#define bM4_USF_HPRT_PRTSPD1                            *((volatile unsigned int*)(0x43808848UL))
#define bM4_USF_HPRT_RESV                               *((volatile unsigned int*)(0x43808860UL))
#define bM4_USF_HCCHAR0_MPS0                            *((volatile unsigned int*)(0x4380A000UL))
#define bM4_USF_HCCHAR0_MPS1                            *((volatile unsigned int*)(0x4380A004UL))
#define bM4_USF_HCCHAR0_MPS2                            *((volatile unsigned int*)(0x4380A008UL))
#define bM4_USF_HCCHAR0_MPS3                            *((volatile unsigned int*)(0x4380A00CUL))
#define bM4_USF_HCCHAR0_MPS4                            *((volatile unsigned int*)(0x4380A010UL))
#define bM4_USF_HCCHAR0_MPS5                            *((volatile unsigned int*)(0x4380A014UL))
#define bM4_USF_HCCHAR0_MPS6                            *((volatile unsigned int*)(0x4380A018UL))
#define bM4_USF_HCCHAR0_MPS7                            *((volatile unsigned int*)(0x4380A01CUL))
#define bM4_USF_HCCHAR0_MPS8                            *((volatile unsigned int*)(0x4380A020UL))
#define bM4_USF_HCCHAR0_MPS9                            *((volatile unsigned int*)(0x4380A024UL))
#define bM4_USF_HCCHAR0_MPS10                           *((volatile unsigned int*)(0x4380A028UL))
#define bM4_USF_HCCHAR0_EPNUM0                          *((volatile unsigned int*)(0x4380A02CUL))
#define bM4_USF_HCCHAR0_EPNUM1                          *((volatile unsigned int*)(0x4380A030UL))
#define bM4_USF_HCCHAR0_EPNUM2                          *((volatile unsigned int*)(0x4380A034UL))
#define bM4_USF_HCCHAR0_EPNUM3                          *((volatile unsigned int*)(0x4380A038UL))
#define bM4_USF_HCCHAR0_EPDIR                           *((volatile unsigned int*)(0x4380A03CUL))
#define bM4_USF_HCCHAR0_LSPDDEV                         *((volatile unsigned int*)(0x4380A044UL))
#define bM4_USF_HCCHAR0_EPTYPE0                         *((volatile unsigned int*)(0x4380A048UL))
#define bM4_USF_HCCHAR0_EPTYPE1                         *((volatile unsigned int*)(0x4380A04CUL))
#define bM4_USF_HCCHAR0_EC0                             *((volatile unsigned int*)(0x4380A050UL))
#define bM4_USF_HCCHAR0_EC1                             *((volatile unsigned int*)(0x4380A054UL))
#define bM4_USF_HCCHAR0_DEVADDR0                        *((volatile unsigned int*)(0x4380A058UL))
#define bM4_USF_HCCHAR0_DEVADDR1                        *((volatile unsigned int*)(0x4380A05CUL))
#define bM4_USF_HCCHAR0_DEVADDR2                        *((volatile unsigned int*)(0x4380A060UL))
#define bM4_USF_HCCHAR0_DEVADDR3                        *((volatile unsigned int*)(0x4380A064UL))
#define bM4_USF_HCCHAR0_DEVADDR4                        *((volatile unsigned int*)(0x4380A068UL))
#define bM4_USF_HCCHAR0_DEVADDR5                        *((volatile unsigned int*)(0x4380A06CUL))
#define bM4_USF_HCCHAR0_DEVADDR6                        *((volatile unsigned int*)(0x4380A070UL))
#define bM4_USF_HCCHAR0_ODDFRM                          *((volatile unsigned int*)(0x4380A074UL))
#define bM4_USF_HCCHAR0_CHDIS                           *((volatile unsigned int*)(0x4380A078UL))
#define bM4_USF_HCCHAR0_CHENA                           *((volatile unsigned int*)(0x4380A07CUL))
#define bM4_USF_HCSPLT0_PRTADDR0                        *((volatile unsigned int*)(0x4380A080UL))
#define bM4_USF_HCSPLT0_PRTADDR1                        *((volatile unsigned int*)(0x4380A084UL))
#define bM4_USF_HCSPLT0_PRTADDR2                        *((volatile unsigned int*)(0x4380A088UL))
#define bM4_USF_HCSPLT0_PRTADDR3                        *((volatile unsigned int*)(0x4380A08CUL))
#define bM4_USF_HCSPLT0_PRTADDR4                        *((volatile unsigned int*)(0x4380A090UL))
#define bM4_USF_HCSPLT0_PRTADDR5                        *((volatile unsigned int*)(0x4380A094UL))
#define bM4_USF_HCSPLT0_PRTADDR6                        *((volatile unsigned int*)(0x4380A098UL))
#define bM4_USF_HCSPLT0_HUBADDR0                        *((volatile unsigned int*)(0x4380A09CUL))
#define bM4_USF_HCSPLT0_HUBADDR1                        *((volatile unsigned int*)(0x4380A0A0UL))
#define bM4_USF_HCSPLT0_HUBADDR2                        *((volatile unsigned int*)(0x4380A0A4UL))
#define bM4_USF_HCSPLT0_HUBADDR3                        *((volatile unsigned int*)(0x4380A0A8UL))
#define bM4_USF_HCSPLT0_HUBADDR4                        *((volatile unsigned int*)(0x4380A0ACUL))
#define bM4_USF_HCSPLT0_HUBADDR5                        *((volatile unsigned int*)(0x4380A0B0UL))
#define bM4_USF_HCSPLT0_HUBADDR6                        *((volatile unsigned int*)(0x4380A0B4UL))
#define bM4_USF_HCSPLT0_XACTPOS0                        *((volatile unsigned int*)(0x4380A0B8UL))
#define bM4_USF_HCSPLT0_XACTPOS1                        *((volatile unsigned int*)(0x4380A0BCUL))
#define bM4_USF_HCSPLT0_COMPSPLT                        *((volatile unsigned int*)(0x4380A0C0UL))
#define bM4_USF_HCSPLT0_RESV                            *((volatile unsigned int*)(0x4380A0E0UL))
#define bM4_USF_HCSPLT0_SPLTENA                         *((volatile unsigned int*)(0x4380A0FCUL))
#define bM4_USF_HCINT0_XFERCOMPL                        *((volatile unsigned int*)(0x4380A100UL))
#define bM4_USF_HCINT0_CHHLTD                           *((volatile unsigned int*)(0x4380A104UL))
#define bM4_USF_HCINT0_AHBERR                           *((volatile unsigned int*)(0x4380A108UL))
#define bM4_USF_HCINT0_STALL                            *((volatile unsigned int*)(0x4380A10CUL))
#define bM4_USF_HCINT0_NAK                              *((volatile unsigned int*)(0x4380A110UL))
#define bM4_USF_HCINT0_ACK                              *((volatile unsigned int*)(0x4380A114UL))
#define bM4_USF_HCINT0_NYET                             *((volatile unsigned int*)(0x4380A118UL))
#define bM4_USF_HCINT0_XACTERR                          *((volatile unsigned int*)(0x4380A11CUL))
#define bM4_USF_HCINT0_BBLERR                           *((volatile unsigned int*)(0x4380A120UL))
#define bM4_USF_HCINT0_FRMOVRUN                         *((volatile unsigned int*)(0x4380A124UL))
#define bM4_USF_HCINT0_DATATGLERR                       *((volatile unsigned int*)(0x4380A128UL))
#define bM4_USF_HCINTMSK0_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4380A180UL))
#define bM4_USF_HCINTMSK0_CHHLTDMSK                     *((volatile unsigned int*)(0x4380A184UL))
#define bM4_USF_HCINTMSK0_AHBERRMSK                     *((volatile unsigned int*)(0x4380A188UL))
#define bM4_USF_HCINTMSK0_STALLMSK                      *((volatile unsigned int*)(0x4380A18CUL))
#define bM4_USF_HCINTMSK0_NAKMSK                        *((volatile unsigned int*)(0x4380A190UL))
#define bM4_USF_HCINTMSK0_ACKMSK                        *((volatile unsigned int*)(0x4380A194UL))
#define bM4_USF_HCINTMSK0_NYETMSK                       *((volatile unsigned int*)(0x4380A198UL))
#define bM4_USF_HCINTMSK0_XACTERRMSK                    *((volatile unsigned int*)(0x4380A19CUL))
#define bM4_USF_HCINTMSK0_BBLERRMSK                     *((volatile unsigned int*)(0x4380A1A0UL))
#define bM4_USF_HCINTMSK0_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4380A1A4UL))
#define bM4_USF_HCINTMSK0_DATATGLERRMSK                 *((volatile unsigned int*)(0x4380A1A8UL))
#define bM4_USF_HCTSIZ0_XFERSIZE0                       *((volatile unsigned int*)(0x4380A200UL))
#define bM4_USF_HCTSIZ0_XFERSIZE1                       *((volatile unsigned int*)(0x4380A204UL))
#define bM4_USF_HCTSIZ0_XFERSIZE2                       *((volatile unsigned int*)(0x4380A208UL))
#define bM4_USF_HCTSIZ0_XFERSIZE3                       *((volatile unsigned int*)(0x4380A20CUL))
#define bM4_USF_HCTSIZ0_XFERSIZE4                       *((volatile unsigned int*)(0x4380A210UL))
#define bM4_USF_HCTSIZ0_XFERSIZE5                       *((volatile unsigned int*)(0x4380A214UL))
#define bM4_USF_HCTSIZ0_XFERSIZE6                       *((volatile unsigned int*)(0x4380A218UL))
#define bM4_USF_HCTSIZ0_XFERSIZE7                       *((volatile unsigned int*)(0x4380A21CUL))
#define bM4_USF_HCTSIZ0_XFERSIZE8                       *((volatile unsigned int*)(0x4380A220UL))
#define bM4_USF_HCTSIZ0_XFERSIZE9                       *((volatile unsigned int*)(0x4380A224UL))
#define bM4_USF_HCTSIZ0_XFERSIZE10                      *((volatile unsigned int*)(0x4380A228UL))
#define bM4_USF_HCTSIZ0_XFERSIZE11                      *((volatile unsigned int*)(0x4380A22CUL))
#define bM4_USF_HCTSIZ0_XFERSIZE12                      *((volatile unsigned int*)(0x4380A230UL))
#define bM4_USF_HCTSIZ0_XFERSIZE13                      *((volatile unsigned int*)(0x4380A234UL))
#define bM4_USF_HCTSIZ0_XFERSIZE14                      *((volatile unsigned int*)(0x4380A238UL))
#define bM4_USF_HCTSIZ0_XFERSIZE15                      *((volatile unsigned int*)(0x4380A23CUL))
#define bM4_USF_HCTSIZ0_XFERSIZE16                      *((volatile unsigned int*)(0x4380A240UL))
#define bM4_USF_HCTSIZ0_XFERSIZE17                      *((volatile unsigned int*)(0x4380A244UL))
#define bM4_USF_HCTSIZ0_XFERSIZE18                      *((volatile unsigned int*)(0x4380A248UL))
#define bM4_USF_HCTSIZ0_PKTCNT0                         *((volatile unsigned int*)(0x4380A24CUL))
#define bM4_USF_HCTSIZ0_PKTCNT1                         *((volatile unsigned int*)(0x4380A250UL))
#define bM4_USF_HCTSIZ0_PKTCNT2                         *((volatile unsigned int*)(0x4380A254UL))
#define bM4_USF_HCTSIZ0_PKTCNT3                         *((volatile unsigned int*)(0x4380A258UL))
#define bM4_USF_HCTSIZ0_PKTCNT4                         *((volatile unsigned int*)(0x4380A25CUL))
#define bM4_USF_HCTSIZ0_PKTCNT5                         *((volatile unsigned int*)(0x4380A260UL))
#define bM4_USF_HCTSIZ0_PKTCNT6                         *((volatile unsigned int*)(0x4380A264UL))
#define bM4_USF_HCTSIZ0_PKTCNT7                         *((volatile unsigned int*)(0x4380A268UL))
#define bM4_USF_HCTSIZ0_PKTCNT8                         *((volatile unsigned int*)(0x4380A26CUL))
#define bM4_USF_HCTSIZ0_PKTCNT9                         *((volatile unsigned int*)(0x4380A270UL))
#define bM4_USF_HCTSIZ0_PID0                            *((volatile unsigned int*)(0x4380A274UL))
#define bM4_USF_HCTSIZ0_PID1                            *((volatile unsigned int*)(0x4380A278UL))
#define bM4_USF_HCTSIZ0_DOPNG                           *((volatile unsigned int*)(0x4380A27CUL))
#define bM4_USF_HCCHAR1_MPS0                            *((volatile unsigned int*)(0x4380A400UL))
#define bM4_USF_HCCHAR1_MPS1                            *((volatile unsigned int*)(0x4380A404UL))
#define bM4_USF_HCCHAR1_MPS2                            *((volatile unsigned int*)(0x4380A408UL))
#define bM4_USF_HCCHAR1_MPS3                            *((volatile unsigned int*)(0x4380A40CUL))
#define bM4_USF_HCCHAR1_MPS4                            *((volatile unsigned int*)(0x4380A410UL))
#define bM4_USF_HCCHAR1_MPS5                            *((volatile unsigned int*)(0x4380A414UL))
#define bM4_USF_HCCHAR1_MPS6                            *((volatile unsigned int*)(0x4380A418UL))
#define bM4_USF_HCCHAR1_MPS7                            *((volatile unsigned int*)(0x4380A41CUL))
#define bM4_USF_HCCHAR1_MPS8                            *((volatile unsigned int*)(0x4380A420UL))
#define bM4_USF_HCCHAR1_MPS9                            *((volatile unsigned int*)(0x4380A424UL))
#define bM4_USF_HCCHAR1_MPS10                           *((volatile unsigned int*)(0x4380A428UL))
#define bM4_USF_HCCHAR1_EPNUM0                          *((volatile unsigned int*)(0x4380A42CUL))
#define bM4_USF_HCCHAR1_EPNUM1                          *((volatile unsigned int*)(0x4380A430UL))
#define bM4_USF_HCCHAR1_EPNUM2                          *((volatile unsigned int*)(0x4380A434UL))
#define bM4_USF_HCCHAR1_EPNUM3                          *((volatile unsigned int*)(0x4380A438UL))
#define bM4_USF_HCCHAR1_EPDIR                           *((volatile unsigned int*)(0x4380A43CUL))
#define bM4_USF_HCCHAR1_LSPDDEV                         *((volatile unsigned int*)(0x4380A444UL))
#define bM4_USF_HCCHAR1_EPTYPE0                         *((volatile unsigned int*)(0x4380A448UL))
#define bM4_USF_HCCHAR1_EPTYPE1                         *((volatile unsigned int*)(0x4380A44CUL))
#define bM4_USF_HCCHAR1_EC0                             *((volatile unsigned int*)(0x4380A450UL))
#define bM4_USF_HCCHAR1_EC1                             *((volatile unsigned int*)(0x4380A454UL))
#define bM4_USF_HCCHAR1_DEVADDR0                        *((volatile unsigned int*)(0x4380A458UL))
#define bM4_USF_HCCHAR1_DEVADDR1                        *((volatile unsigned int*)(0x4380A45CUL))
