RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_HCCHAR1_DEVADDR2                        *((volatile unsigned int*)(0x4380A460UL))
#define bM4_USF_HCCHAR1_DEVADDR3                        *((volatile unsigned int*)(0x4380A464UL))
#define bM4_USF_HCCHAR1_DEVADDR4                        *((volatile unsigned int*)(0x4380A468UL))
#define bM4_USF_HCCHAR1_DEVADDR5                        *((volatile unsigned int*)(0x4380A46CUL))
#define bM4_USF_HCCHAR1_DEVADDR6                        *((volatile unsigned int*)(0x4380A470UL))
#define bM4_USF_HCCHAR1_ODDFRM                          *((volatile unsigned int*)(0x4380A474UL))
#define bM4_USF_HCCHAR1_CHDIS                           *((volatile unsigned int*)(0x4380A478UL))
#define bM4_USF_HCCHAR1_CHENA                           *((volatile unsigned int*)(0x4380A47CUL))
#define bM4_USF_HCSPLT1_PRTADDR0                        *((volatile unsigned int*)(0x4380A480UL))
#define bM4_USF_HCSPLT1_PRTADDR1                        *((volatile unsigned int*)(0x4380A484UL))
#define bM4_USF_HCSPLT1_PRTADDR2                        *((volatile unsigned int*)(0x4380A488UL))
#define bM4_USF_HCSPLT1_PRTADDR3                        *((volatile unsigned int*)(0x4380A48CUL))
#define bM4_USF_HCSPLT1_PRTADDR4                        *((volatile unsigned int*)(0x4380A490UL))
#define bM4_USF_HCSPLT1_PRTADDR5                        *((volatile unsigned int*)(0x4380A494UL))
#define bM4_USF_HCSPLT1_PRTADDR6                        *((volatile unsigned int*)(0x4380A498UL))
#define bM4_USF_HCSPLT1_HUBADDR0                        *((volatile unsigned int*)(0x4380A49CUL))
#define bM4_USF_HCSPLT1_HUBADDR1                        *((volatile unsigned int*)(0x4380A4A0UL))
#define bM4_USF_HCSPLT1_HUBADDR2                        *((volatile unsigned int*)(0x4380A4A4UL))
#define bM4_USF_HCSPLT1_HUBADDR3                        *((volatile unsigned int*)(0x4380A4A8UL))
#define bM4_USF_HCSPLT1_HUBADDR4                        *((volatile unsigned int*)(0x4380A4ACUL))
#define bM4_USF_HCSPLT1_HUBADDR5                        *((volatile unsigned int*)(0x4380A4B0UL))
#define bM4_USF_HCSPLT1_HUBADDR6                        *((volatile unsigned int*)(0x4380A4B4UL))
#define bM4_USF_HCSPLT1_XACTPOS0                        *((volatile unsigned int*)(0x4380A4B8UL))
#define bM4_USF_HCSPLT1_XACTPOS1                        *((volatile unsigned int*)(0x4380A4BCUL))
#define bM4_USF_HCSPLT1_COMPSPLT                        *((volatile unsigned int*)(0x4380A4C0UL))
#define bM4_USF_HCSPLT1_RESV                            *((volatile unsigned int*)(0x4380A4E0UL))
#define bM4_USF_HCSPLT1_SPLTENA                         *((volatile unsigned int*)(0x4380A4FCUL))
#define bM4_USF_HCINT1_XFERCOMPL                        *((volatile unsigned int*)(0x4380A500UL))
#define bM4_USF_HCINT1_CHHLTD                           *((volatile unsigned int*)(0x4380A504UL))
#define bM4_USF_HCINT1_AHBERR                           *((volatile unsigned int*)(0x4380A508UL))
#define bM4_USF_HCINT1_STALL                            *((volatile unsigned int*)(0x4380A50CUL))
#define bM4_USF_HCINT1_NAK                              *((volatile unsigned int*)(0x4380A510UL))
#define bM4_USF_HCINT1_ACK                              *((volatile unsigned int*)(0x4380A514UL))
#define bM4_USF_HCINT1_NYET                             *((volatile unsigned int*)(0x4380A518UL))
#define bM4_USF_HCINT1_XACTERR                          *((volatile unsigned int*)(0x4380A51CUL))
#define bM4_USF_HCINT1_BBLERR                           *((volatile unsigned int*)(0x4380A520UL))
#define bM4_USF_HCINT1_FRMOVRUN                         *((volatile unsigned int*)(0x4380A524UL))
#define bM4_USF_HCINT1_DATATGLERR                       *((volatile unsigned int*)(0x4380A528UL))
#define bM4_USF_HCINTMSK1_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4380A580UL))
#define bM4_USF_HCINTMSK1_CHHLTDMSK                     *((volatile unsigned int*)(0x4380A584UL))
#define bM4_USF_HCINTMSK1_AHBERRMSK                     *((volatile unsigned int*)(0x4380A588UL))
#define bM4_USF_HCINTMSK1_STALLMSK                      *((volatile unsigned int*)(0x4380A58CUL))
#define bM4_USF_HCINTMSK1_NAKMSK                        *((volatile unsigned int*)(0x4380A590UL))
#define bM4_USF_HCINTMSK1_ACKMSK                        *((volatile unsigned int*)(0x4380A594UL))
#define bM4_USF_HCINTMSK1_NYETMSK                       *((volatile unsigned int*)(0x4380A598UL))
#define bM4_USF_HCINTMSK1_XACTERRMSK                    *((volatile unsigned int*)(0x4380A59CUL))
#define bM4_USF_HCINTMSK1_BBLERRMSK                     *((volatile unsigned int*)(0x4380A5A0UL))
#define bM4_USF_HCINTMSK1_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4380A5A4UL))
#define bM4_USF_HCINTMSK1_DATATGLERRMSK                 *((volatile unsigned int*)(0x4380A5A8UL))
#define bM4_USF_HCTSIZ1_XFERSIZE0                       *((volatile unsigned int*)(0x4380A600UL))
#define bM4_USF_HCTSIZ1_XFERSIZE1                       *((volatile unsigned int*)(0x4380A604UL))
#define bM4_USF_HCTSIZ1_XFERSIZE2                       *((volatile unsigned int*)(0x4380A608UL))
#define bM4_USF_HCTSIZ1_XFERSIZE3                       *((volatile unsigned int*)(0x4380A60CUL))
#define bM4_USF_HCTSIZ1_XFERSIZE4                       *((volatile unsigned int*)(0x4380A610UL))
#define bM4_USF_HCTSIZ1_XFERSIZE5                       *((volatile unsigned int*)(0x4380A614UL))
#define bM4_USF_HCTSIZ1_XFERSIZE6                       *((volatile unsigned int*)(0x4380A618UL))
#define bM4_USF_HCTSIZ1_XFERSIZE7                       *((volatile unsigned int*)(0x4380A61CUL))
#define bM4_USF_HCTSIZ1_XFERSIZE8                       *((volatile unsigned int*)(0x4380A620UL))
#define bM4_USF_HCTSIZ1_XFERSIZE9                       *((volatile unsigned int*)(0x4380A624UL))
#define bM4_USF_HCTSIZ1_XFERSIZE10                      *((volatile unsigned int*)(0x4380A628UL))
#define bM4_USF_HCTSIZ1_XFERSIZE11                      *((volatile unsigned int*)(0x4380A62CUL))
#define bM4_USF_HCTSIZ1_XFERSIZE12                      *((volatile unsigned int*)(0x4380A630UL))
#define bM4_USF_HCTSIZ1_XFERSIZE13                      *((volatile unsigned int*)(0x4380A634UL))
#define bM4_USF_HCTSIZ1_XFERSIZE14                      *((volatile unsigned int*)(0x4380A638UL))
#define bM4_USF_HCTSIZ1_XFERSIZE15                      *((volatile unsigned int*)(0x4380A63CUL))
#define bM4_USF_HCTSIZ1_XFERSIZE16                      *((volatile unsigned int*)(0x4380A640UL))
#define bM4_USF_HCTSIZ1_XFERSIZE17                      *((volatile unsigned int*)(0x4380A644UL))
#define bM4_USF_HCTSIZ1_XFERSIZE18                      *((volatile unsigned int*)(0x4380A648UL))
#define bM4_USF_HCTSIZ1_PKTCNT0                         *((volatile unsigned int*)(0x4380A64CUL))
#define bM4_USF_HCTSIZ1_PKTCNT1                         *((volatile unsigned int*)(0x4380A650UL))
#define bM4_USF_HCTSIZ1_PKTCNT2                         *((volatile unsigned int*)(0x4380A654UL))
#define bM4_USF_HCTSIZ1_PKTCNT3                         *((volatile unsigned int*)(0x4380A658UL))
#define bM4_USF_HCTSIZ1_PKTCNT4                         *((volatile unsigned int*)(0x4380A65CUL))
#define bM4_USF_HCTSIZ1_PKTCNT5                         *((volatile unsigned int*)(0x4380A660UL))
#define bM4_USF_HCTSIZ1_PKTCNT6                         *((volatile unsigned int*)(0x4380A664UL))
#define bM4_USF_HCTSIZ1_PKTCNT7                         *((volatile unsigned int*)(0x4380A668UL))
#define bM4_USF_HCTSIZ1_PKTCNT8                         *((volatile unsigned int*)(0x4380A66CUL))
#define bM4_USF_HCTSIZ1_PKTCNT9                         *((volatile unsigned int*)(0x4380A670UL))
#define bM4_USF_HCTSIZ1_PID0                            *((volatile unsigned int*)(0x4380A674UL))
#define bM4_USF_HCTSIZ1_PID1                            *((volatile unsigned int*)(0x4380A678UL))
#define bM4_USF_HCTSIZ1_DOPNG                           *((volatile unsigned int*)(0x4380A67CUL))
#define bM4_USF_HCCHAR2_MPS0                            *((volatile unsigned int*)(0x4380A800UL))
#define bM4_USF_HCCHAR2_MPS1                            *((volatile unsigned int*)(0x4380A804UL))
#define bM4_USF_HCCHAR2_MPS2                            *((volatile unsigned int*)(0x4380A808UL))
#define bM4_USF_HCCHAR2_MPS3                            *((volatile unsigned int*)(0x4380A80CUL))
#define bM4_USF_HCCHAR2_MPS4                            *((volatile unsigned int*)(0x4380A810UL))
#define bM4_USF_HCCHAR2_MPS5                            *((volatile unsigned int*)(0x4380A814UL))
#define bM4_USF_HCCHAR2_MPS6                            *((volatile unsigned int*)(0x4380A818UL))
#define bM4_USF_HCCHAR2_MPS7                            *((volatile unsigned int*)(0x4380A81CUL))
#define bM4_USF_HCCHAR2_MPS8                            *((volatile unsigned int*)(0x4380A820UL))
#define bM4_USF_HCCHAR2_MPS9                            *((volatile unsigned int*)(0x4380A824UL))
#define bM4_USF_HCCHAR2_MPS10                           *((volatile unsigned int*)(0x4380A828UL))
#define bM4_USF_HCCHAR2_EPNUM0                          *((volatile unsigned int*)(0x4380A82CUL))
#define bM4_USF_HCCHAR2_EPNUM1                          *((volatile unsigned int*)(0x4380A830UL))
#define bM4_USF_HCCHAR2_EPNUM2                          *((volatile unsigned int*)(0x4380A834UL))
#define bM4_USF_HCCHAR2_EPNUM3                          *((volatile unsigned int*)(0x4380A838UL))
#define bM4_USF_HCCHAR2_EPDIR                           *((volatile unsigned int*)(0x4380A83CUL))
#define bM4_USF_HCCHAR2_LSPDDEV                         *((volatile unsigned int*)(0x4380A844UL))
#define bM4_USF_HCCHAR2_EPTYPE0                         *((volatile unsigned int*)(0x4380A848UL))
#define bM4_USF_HCCHAR2_EPTYPE1                         *((volatile unsigned int*)(0x4380A84CUL))
#define bM4_USF_HCCHAR2_EC0                             *((volatile unsigned int*)(0x4380A850UL))
#define bM4_USF_HCCHAR2_EC1                             *((volatile unsigned int*)(0x4380A854UL))
#define bM4_USF_HCCHAR2_DEVADDR0                        *((volatile unsigned int*)(0x4380A858UL))
#define bM4_USF_HCCHAR2_DEVADDR1                        *((volatile unsigned int*)(0x4380A85CUL))
#define bM4_USF_HCCHAR2_DEVADDR2                        *((volatile unsigned int*)(0x4380A860UL))
#define bM4_USF_HCCHAR2_DEVADDR3                        *((volatile unsigned int*)(0x4380A864UL))
#define bM4_USF_HCCHAR2_DEVADDR4                        *((volatile unsigned int*)(0x4380A868UL))
#define bM4_USF_HCCHAR2_DEVADDR5                        *((volatile unsigned int*)(0x4380A86CUL))
#define bM4_USF_HCCHAR2_DEVADDR6                        *((volatile unsigned int*)(0x4380A870UL))
#define bM4_USF_HCCHAR2_ODDFRM                          *((volatile unsigned int*)(0x4380A874UL))
#define bM4_USF_HCCHAR2_CHDIS                           *((volatile unsigned int*)(0x4380A878UL))
#define bM4_USF_HCCHAR2_CHENA                           *((volatile unsigned int*)(0x4380A87CUL))
#define bM4_USF_HCSPLT2_PRTADDR0                        *((volatile unsigned int*)(0x4380A880UL))
#define bM4_USF_HCSPLT2_PRTADDR1                        *((volatile unsigned int*)(0x4380A884UL))
#define bM4_USF_HCSPLT2_PRTADDR2                        *((volatile unsigned int*)(0x4380A888UL))
#define bM4_USF_HCSPLT2_PRTADDR3                        *((volatile unsigned int*)(0x4380A88CUL))
#define bM4_USF_HCSPLT2_PRTADDR4                        *((volatile unsigned int*)(0x4380A890UL))
#define bM4_USF_HCSPLT2_PRTADDR5                        *((volatile unsigned int*)(0x4380A894UL))
#define bM4_USF_HCSPLT2_PRTADDR6                        *((volatile unsigned int*)(0x4380A898UL))
#define bM4_USF_HCSPLT2_HUBADDR0                        *((volatile unsigned int*)(0x4380A89CUL))
#define bM4_USF_HCSPLT2_HUBADDR1                        *((volatile unsigned int*)(0x4380A8A0UL))
#define bM4_USF_HCSPLT2_HUBADDR2                        *((volatile unsigned int*)(0x4380A8A4UL))
#define bM4_USF_HCSPLT2_HUBADDR3                        *((volatile unsigned int*)(0x4380A8A8UL))
#define bM4_USF_HCSPLT2_HUBADDR4                        *((volatile unsigned int*)(0x4380A8ACUL))
#define bM4_USF_HCSPLT2_HUBADDR5                        *((volatile unsigned int*)(0x4380A8B0UL))
#define bM4_USF_HCSPLT2_HUBADDR6                        *((volatile unsigned int*)(0x4380A8B4UL))
#define bM4_USF_HCSPLT2_XACTPOS0                        *((volatile unsigned int*)(0x4380A8B8UL))
#define bM4_USF_HCSPLT2_XACTPOS1                        *((volatile unsigned int*)(0x4380A8BCUL))
#define bM4_USF_HCSPLT2_COMPSPLT                        *((volatile unsigned int*)(0x4380A8C0UL))
#define bM4_USF_HCSPLT2_RESV                            *((volatile unsigned int*)(0x4380A8E0UL))
#define bM4_USF_HCSPLT2_SPLTENA                         *((volatile unsigned int*)(0x4380A8FCUL))
#define bM4_USF_HCINT2_XFERCOMPL                        *((volatile unsigned int*)(0x4380A900UL))
#define bM4_USF_HCINT2_CHHLTD                           *((volatile unsigned int*)(0x4380A904UL))
#define bM4_USF_HCINT2_AHBERR                           *((volatile unsigned int*)(0x4380A908UL))
#define bM4_USF_HCINT2_STALL                            *((volatile unsigned int*)(0x4380A90CUL))
#define bM4_USF_HCINT2_NAK                              *((volatile unsigned int*)(0x4380A910UL))
#define bM4_USF_HCINT2_ACK                              *((volatile unsigned int*)(0x4380A914UL))
#define bM4_USF_HCINT2_NYET                             *((volatile unsigned int*)(0x4380A918UL))
#define bM4_USF_HCINT2_XACTERR                          *((volatile unsigned int*)(0x4380A91CUL))
#define bM4_USF_HCINT2_BBLERR                           *((volatile unsigned int*)(0x4380A920UL))
#define bM4_USF_HCINT2_FRMOVRUN                         *((volatile unsigned int*)(0x4380A924UL))
#define bM4_USF_HCINT2_DATATGLERR                       *((volatile unsigned int*)(0x4380A928UL))
#define bM4_USF_HCINTMSK2_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4380A980UL))
#define bM4_USF_HCINTMSK2_CHHLTDMSK                     *((volatile unsigned int*)(0x4380A984UL))
#define bM4_USF_HCINTMSK2_AHBERRMSK                     *((volatile unsigned int*)(0x4380A988UL))
#define bM4_USF_HCINTMSK2_STALLMSK                      *((volatile unsigned int*)(0x4380A98CUL))
#define bM4_USF_HCINTMSK2_NAKMSK                        *((volatile unsigned int*)(0x4380A990UL))
#define bM4_USF_HCINTMSK2_ACKMSK                        *((volatile unsigned int*)(0x4380A994UL))
#define bM4_USF_HCINTMSK2_NYETMSK                       *((volatile unsigned int*)(0x4380A998UL))
#define bM4_USF_HCINTMSK2_XACTERRMSK                    *((volatile unsigned int*)(0x4380A99CUL))
#define bM4_USF_HCINTMSK2_BBLERRMSK                     *((volatile unsigned int*)(0x4380A9A0UL))
#define bM4_USF_HCINTMSK2_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4380A9A4UL))
#define bM4_USF_HCINTMSK2_DATATGLERRMSK                 *((volatile unsigned int*)(0x4380A9A8UL))
#define bM4_USF_HCTSIZ2_XFERSIZE0                       *((volatile unsigned int*)(0x4380AA00UL))
#define bM4_USF_HCTSIZ2_XFERSIZE1                       *((volatile unsigned int*)(0x4380AA04UL))
#define bM4_USF_HCTSIZ2_XFERSIZE2                       *((volatile unsigned int*)(0x4380AA08UL))
#define bM4_USF_HCTSIZ2_XFERSIZE3                       *((volatile unsigned int*)(0x4380AA0CUL))
#define bM4_USF_HCTSIZ2_XFERSIZE4                       *((volatile unsigned int*)(0x4380AA10UL))
#define bM4_USF_HCTSIZ2_XFERSIZE5                       *((volatile unsigned int*)(0x4380AA14UL))
#define bM4_USF_HCTSIZ2_XFERSIZE6                       *((volatile unsigned int*)(0x4380AA18UL))
#define bM4_USF_HCTSIZ2_XFERSIZE7                       *((volatile unsigned int*)(0x4380AA1CUL))
#define bM4_USF_HCTSIZ2_XFERSIZE8                       *((volatile unsigned int*)(0x4380AA20UL))
#define bM4_USF_HCTSIZ2_XFERSIZE9                       *((volatile unsigned int*)(0x4380AA24UL))
#define bM4_USF_HCTSIZ2_XFERSIZE10                      *((volatile unsigned int*)(0x4380AA28UL))
#define bM4_USF_HCTSIZ2_XFERSIZE11                      *((volatile unsigned int*)(0x4380AA2CUL))
#define bM4_USF_HCTSIZ2_XFERSIZE12                      *((volatile unsigned int*)(0x4380AA30UL))
#define bM4_USF_HCTSIZ2_XFERSIZE13                      *((volatile unsigned int*)(0x4380AA34UL))
#define bM4_USF_HCTSIZ2_XFERSIZE14                      *((volatile unsigned int*)(0x4380AA38UL))
#define bM4_USF_HCTSIZ2_XFERSIZE15                      *((volatile unsigned int*)(0x4380AA3CUL))
#define bM4_USF_HCTSIZ2_XFERSIZE16                      *((volatile unsigned int*)(0x4380AA40UL))
#define bM4_USF_HCTSIZ2_XFERSIZE17                      *((volatile unsigned int*)(0x4380AA44UL))
#define bM4_USF_HCTSIZ2_XFERSIZE18                      *((volatile unsigned int*)(0x4380AA48UL))
#define bM4_USF_HCTSIZ2_PKTCNT0                         *((volatile unsigned int*)(0x4380AA4CUL))
#define bM4_USF_HCTSIZ2_PKTCNT1                         *((volatile unsigned int*)(0x4380AA50UL))
#define bM4_USF_HCTSIZ2_PKTCNT2                         *((volatile unsigned int*)(0x4380AA54UL))
#define bM4_USF_HCTSIZ2_PKTCNT3                         *((volatile unsigned int*)(0x4380AA58UL))
#define bM4_USF_HCTSIZ2_PKTCNT4                         *((volatile unsigned int*)(0x4380AA5CUL))
#define bM4_USF_HCTSIZ2_PKTCNT5                         *((volatile unsigned int*)(0x4380AA60UL))
#define bM4_USF_HCTSIZ2_PKTCNT6                         *((volatile unsigned int*)(0x4380AA64UL))
#define bM4_USF_HCTSIZ2_PKTCNT7                         *((volatile unsigned int*)(0x4380AA68UL))
#define bM4_USF_HCTSIZ2_PKTCNT8                         *((volatile unsigned int*)(0x4380AA6CUL))
#define bM4_USF_HCTSIZ2_PKTCNT9                         *((volatile unsigned int*)(0x4380AA70UL))
#define bM4_USF_HCTSIZ2_PID0                            *((volatile unsigned int*)(0x4380AA74UL))
#define bM4_USF_HCTSIZ2_PID1                            *((volatile unsigned int*)(0x4380AA78UL))
#define bM4_USF_HCTSIZ2_DOPNG                           *((volatile unsigned int*)(0x4380AA7CUL))
#define bM4_USF_HCCHAR3_MPS0                            *((volatile unsigned int*)(0x4380AC00UL))
#define bM4_USF_HCCHAR3_MPS1                            *((volatile unsigned int*)(0x4380AC04UL))
#define bM4_USF_HCCHAR3_MPS2                            *((volatile unsigned int*)(0x4380AC08UL))
#define bM4_USF_HCCHAR3_MPS3                            *((volatile unsigned int*)(0x4380AC0CUL))
#define bM4_USF_HCCHAR3_MPS4                            *((volatile unsigned int*)(0x4380AC10UL))
#define bM4_USF_HCCHAR3_MPS5                            *((volatile unsigned int*)(0x4380AC14UL))
#define bM4_USF_HCCHAR3_MPS6                            *((volatile unsigned int*)(0x4380AC18UL))
#define bM4_USF_HCCHAR3_MPS7                            *((volatile unsigned int*)(0x4380AC1CUL))
#define bM4_USF_HCCHAR3_MPS8                            *((volatile unsigned int*)(0x4380AC20UL))
#define bM4_USF_HCCHAR3_MPS9                            *((volatile unsigned int*)(0x4380AC24UL))
#define bM4_USF_HCCHAR3_MPS10                           *((volatile unsigned int*)(0x4380AC28UL))
#define bM4_USF_HCCHAR3_EPNUM0                          *((volatile unsigned int*)(0x4380AC2CUL))
#define bM4_USF_HCCHAR3_EPNUM1                          *((volatile unsigned int*)(0x4380AC30UL))
#define bM4_USF_HCCHAR3_EPNUM2                          *((volatile unsigned int*)(0x4380AC34UL))
#define bM4_USF_HCCHAR3_EPNUM3                          *((volatile unsigned int*)(0x4380AC38UL))
#define bM4_USF_HCCHAR3_EPDIR                           *((volatile unsigned int*)(0x4380AC3CUL))
#define bM4_USF_HCCHAR3_LSPDDEV                         *((volatile unsigned int*)(0x4380AC44UL))
#define bM4_USF_HCCHAR3_EPTYPE0                         *((volatile unsigned int*)(0x4380AC48UL))
#define bM4_USF_HCCHAR3_EPTYPE1                         *((volatile unsigned int*)(0x4380AC4CUL))
#define bM4_USF_HCCHAR3_EC0                             *((volatile unsigned int*)(0x4380AC50UL))
#define bM4_USF_HCCHAR3_EC1                             *((volatile unsigned int*)(0x4380AC54UL))
#define bM4_USF_HCCHAR3_DEVADDR0                        *((volatile unsigned int*)(0x4380AC58UL))
#define bM4_USF_HCCHAR3_DEVADDR1                        *((volatile unsigned int*)(0x4380AC5CUL))
#define bM4_USF_HCCHAR3_DEVADDR2                        *((volatile unsigned int*)(0x4380AC60UL))
#define bM4_USF_HCCHAR3_DEVADDR3                        *((volatile unsigned int*)(0x4380AC64UL))
#define bM4_USF_HCCHAR3_DEVADDR4                        *((volatile unsigned int*)(0x4380AC68UL))
#define bM4_USF_HCCHAR3_DEVADDR5                        *((volatile unsigned int*)(0x4380AC6CUL))
#define bM4_USF_HCCHAR3_DEVADDR6                        *((volatile unsigned int*)(0x4380AC70UL))
#define bM4_USF_HCCHAR3_ODDFRM                          *((volatile unsigned int*)(0x4380AC74UL))
#define bM4_USF_HCCHAR3_CHDIS                           *((volatile unsigned int*)(0x4380AC78UL))
#define bM4_USF_HCCHAR3_CHENA                           *((volatile unsigned int*)(0x4380AC7CUL))
#define bM4_USF_HCSPLT3_PRTADDR0                        *((volatile unsigned int*)(0x4380AC80UL))
#define bM4_USF_HCSPLT3_PRTADDR1                        *((volatile unsigned int*)(0x4380AC84UL))
#define bM4_USF_HCSPLT3_PRTADDR2                        *((volatile unsigned int*)(0x4380AC88UL))
#define bM4_USF_HCSPLT3_PRTADDR3                        *((volatile unsigned int*)(0x4380AC8CUL))
#define bM4_USF_HCSPLT3_PRTADDR4                        *((volatile unsigned int*)(0x4380AC90UL))
#define bM4_USF_HCSPLT3_PRTADDR5                        *((volatile unsigned int*)(0x4380AC94UL))
#define bM4_USF_HCSPLT3_PRTADDR6                        *((volatile unsigned int*)(0x4380AC98UL))
#define bM4_USF_HCSPLT3_HUBADDR0                        *((volatile unsigned int*)(0x4380AC9CUL))
#define bM4_USF_HCSPLT3_HUBADDR1                        *((volatile unsigned int*)(0x4380ACA0UL))
#define bM4_USF_HCSPLT3_HUBADDR2                        *((volatile unsigned int*)(0x4380ACA4UL))
#define bM4_USF_HCSPLT3_HUBADDR3                        *((volatile unsigned int*)(0x4380ACA8UL))
#define bM4_USF_HCSPLT3_HUBADDR4                        *((volatile unsigned int*)(0x4380ACACUL))
#define bM4_USF_HCSPLT3_HUBADDR5                        *((volatile unsigned int*)(0x4380ACB0UL))
#define bM4_USF_HCSPLT3_HUBADDR6                        *((volatile unsigned int*)(0x4380ACB4UL))
#define bM4_USF_HCSPLT3_XACTPOS0                        *((volatile unsigned int*)(0x4380ACB8UL))
#define bM4_USF_HCSPLT3_XACTPOS1                        *((volatile unsigned int*)(0x4380ACBCUL))
#define bM4_USF_HCSPLT3_COMPSPLT                        *((volatile unsigned int*)(0x4380ACC0UL))
#define bM4_USF_HCSPLT3_RESV                            *((volatile unsigned int*)(0x4380ACE0UL))
#define bM4_USF_HCSPLT3_SPLTENA                         *((volatile unsigned int*)(0x4380ACFCUL))
#define bM4_USF_HCINT3_XFERCOMPL                        *((volatile unsigned int*)(0x4380AD00UL))
#define bM4_USF_HCINT3_CHHLTD                           *((volatile unsigned int*)(0x4380AD04UL))
#define bM4_USF_HCINT3_AHBERR                           *((volatile unsigned int*)(0x4380AD08UL))
#define bM4_USF_HCINT3_STALL                            *((volatile unsigned int*)(0x4380AD0CUL))
#define bM4_USF_HCINT3_NAK                              *((volatile unsigned int*)(0x4380AD10UL))
#define bM4_USF_HCINT3_ACK                              *((volatile unsigned int*)(0x4380AD14UL))
#define bM4_USF_HCINT3_NYET                             *((volatile unsigned int*)(0x4380AD18UL))
#define bM4_USF_HCINT3_XACTERR                          *((volatile unsigned int*)(0x4380AD1CUL))
#define bM4_USF_HCINT3_BBLERR                           *((volatile unsigned int*)(0x4380AD20UL))
