RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_HCINT3_FRMOVRUN                         *((volatile unsigned int*)(0x4380AD24UL))
#define bM4_USF_HCINT3_DATATGLERR                       *((volatile unsigned int*)(0x4380AD28UL))
#define bM4_USF_HCINTMSK3_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4380AD80UL))
#define bM4_USF_HCINTMSK3_CHHLTDMSK                     *((volatile unsigned int*)(0x4380AD84UL))
#define bM4_USF_HCINTMSK3_AHBERRMSK                     *((volatile unsigned int*)(0x4380AD88UL))
#define bM4_USF_HCINTMSK3_STALLMSK                      *((volatile unsigned int*)(0x4380AD8CUL))
#define bM4_USF_HCINTMSK3_NAKMSK                        *((volatile unsigned int*)(0x4380AD90UL))
#define bM4_USF_HCINTMSK3_ACKMSK                        *((volatile unsigned int*)(0x4380AD94UL))
#define bM4_USF_HCINTMSK3_NYETMSK                       *((volatile unsigned int*)(0x4380AD98UL))
#define bM4_USF_HCINTMSK3_XACTERRMSK                    *((volatile unsigned int*)(0x4380AD9CUL))
#define bM4_USF_HCINTMSK3_BBLERRMSK                     *((volatile unsigned int*)(0x4380ADA0UL))
#define bM4_USF_HCINTMSK3_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4380ADA4UL))
#define bM4_USF_HCINTMSK3_DATATGLERRMSK                 *((volatile unsigned int*)(0x4380ADA8UL))
#define bM4_USF_HCTSIZ3_XFERSIZE0                       *((volatile unsigned int*)(0x4380AE00UL))
#define bM4_USF_HCTSIZ3_XFERSIZE1                       *((volatile unsigned int*)(0x4380AE04UL))
#define bM4_USF_HCTSIZ3_XFERSIZE2                       *((volatile unsigned int*)(0x4380AE08UL))
#define bM4_USF_HCTSIZ3_XFERSIZE3                       *((volatile unsigned int*)(0x4380AE0CUL))
#define bM4_USF_HCTSIZ3_XFERSIZE4                       *((volatile unsigned int*)(0x4380AE10UL))
#define bM4_USF_HCTSIZ3_XFERSIZE5                       *((volatile unsigned int*)(0x4380AE14UL))
#define bM4_USF_HCTSIZ3_XFERSIZE6                       *((volatile unsigned int*)(0x4380AE18UL))
#define bM4_USF_HCTSIZ3_XFERSIZE7                       *((volatile unsigned int*)(0x4380AE1CUL))
#define bM4_USF_HCTSIZ3_XFERSIZE8                       *((volatile unsigned int*)(0x4380AE20UL))
#define bM4_USF_HCTSIZ3_XFERSIZE9                       *((volatile unsigned int*)(0x4380AE24UL))
#define bM4_USF_HCTSIZ3_XFERSIZE10                      *((volatile unsigned int*)(0x4380AE28UL))
#define bM4_USF_HCTSIZ3_XFERSIZE11                      *((volatile unsigned int*)(0x4380AE2CUL))
#define bM4_USF_HCTSIZ3_XFERSIZE12                      *((volatile unsigned int*)(0x4380AE30UL))
#define bM4_USF_HCTSIZ3_XFERSIZE13                      *((volatile unsigned int*)(0x4380AE34UL))
#define bM4_USF_HCTSIZ3_XFERSIZE14                      *((volatile unsigned int*)(0x4380AE38UL))
#define bM4_USF_HCTSIZ3_XFERSIZE15                      *((volatile unsigned int*)(0x4380AE3CUL))
#define bM4_USF_HCTSIZ3_XFERSIZE16                      *((volatile unsigned int*)(0x4380AE40UL))
#define bM4_USF_HCTSIZ3_XFERSIZE17                      *((volatile unsigned int*)(0x4380AE44UL))
#define bM4_USF_HCTSIZ3_XFERSIZE18                      *((volatile unsigned int*)(0x4380AE48UL))
#define bM4_USF_HCTSIZ3_PKTCNT0                         *((volatile unsigned int*)(0x4380AE4CUL))
#define bM4_USF_HCTSIZ3_PKTCNT1                         *((volatile unsigned int*)(0x4380AE50UL))
#define bM4_USF_HCTSIZ3_PKTCNT2                         *((volatile unsigned int*)(0x4380AE54UL))
#define bM4_USF_HCTSIZ3_PKTCNT3                         *((volatile unsigned int*)(0x4380AE58UL))
#define bM4_USF_HCTSIZ3_PKTCNT4                         *((volatile unsigned int*)(0x4380AE5CUL))
#define bM4_USF_HCTSIZ3_PKTCNT5                         *((volatile unsigned int*)(0x4380AE60UL))
#define bM4_USF_HCTSIZ3_PKTCNT6                         *((volatile unsigned int*)(0x4380AE64UL))
#define bM4_USF_HCTSIZ3_PKTCNT7                         *((volatile unsigned int*)(0x4380AE68UL))
#define bM4_USF_HCTSIZ3_PKTCNT8                         *((volatile unsigned int*)(0x4380AE6CUL))
#define bM4_USF_HCTSIZ3_PKTCNT9                         *((volatile unsigned int*)(0x4380AE70UL))
#define bM4_USF_HCTSIZ3_PID0                            *((volatile unsigned int*)(0x4380AE74UL))
#define bM4_USF_HCTSIZ3_PID1                            *((volatile unsigned int*)(0x4380AE78UL))
#define bM4_USF_HCTSIZ3_DOPNG                           *((volatile unsigned int*)(0x4380AE7CUL))
#define bM4_USF_HCCHAR4_MPS0                            *((volatile unsigned int*)(0x4380B000UL))
#define bM4_USF_HCCHAR4_MPS1                            *((volatile unsigned int*)(0x4380B004UL))
#define bM4_USF_HCCHAR4_MPS2                            *((volatile unsigned int*)(0x4380B008UL))
#define bM4_USF_HCCHAR4_MPS3                            *((volatile unsigned int*)(0x4380B00CUL))
#define bM4_USF_HCCHAR4_MPS4                            *((volatile unsigned int*)(0x4380B010UL))
#define bM4_USF_HCCHAR4_MPS5                            *((volatile unsigned int*)(0x4380B014UL))
#define bM4_USF_HCCHAR4_MPS6                            *((volatile unsigned int*)(0x4380B018UL))
#define bM4_USF_HCCHAR4_MPS7                            *((volatile unsigned int*)(0x4380B01CUL))
#define bM4_USF_HCCHAR4_MPS8                            *((volatile unsigned int*)(0x4380B020UL))
#define bM4_USF_HCCHAR4_MPS9                            *((volatile unsigned int*)(0x4380B024UL))
#define bM4_USF_HCCHAR4_MPS10                           *((volatile unsigned int*)(0x4380B028UL))
#define bM4_USF_HCCHAR4_EPNUM0                          *((volatile unsigned int*)(0x4380B02CUL))
#define bM4_USF_HCCHAR4_EPNUM1                          *((volatile unsigned int*)(0x4380B030UL))
#define bM4_USF_HCCHAR4_EPNUM2                          *((volatile unsigned int*)(0x4380B034UL))
#define bM4_USF_HCCHAR4_EPNUM3                          *((volatile unsigned int*)(0x4380B038UL))
#define bM4_USF_HCCHAR4_EPDIR                           *((volatile unsigned int*)(0x4380B03CUL))
#define bM4_USF_HCCHAR4_LSPDDEV                         *((volatile unsigned int*)(0x4380B044UL))
#define bM4_USF_HCCHAR4_EPTYPE0                         *((volatile unsigned int*)(0x4380B048UL))
#define bM4_USF_HCCHAR4_EPTYPE1                         *((volatile unsigned int*)(0x4380B04CUL))
#define bM4_USF_HCCHAR4_EC0                             *((volatile unsigned int*)(0x4380B050UL))
#define bM4_USF_HCCHAR4_EC1                             *((volatile unsigned int*)(0x4380B054UL))
#define bM4_USF_HCCHAR4_DEVADDR0                        *((volatile unsigned int*)(0x4380B058UL))
#define bM4_USF_HCCHAR4_DEVADDR1                        *((volatile unsigned int*)(0x4380B05CUL))
#define bM4_USF_HCCHAR4_DEVADDR2                        *((volatile unsigned int*)(0x4380B060UL))
#define bM4_USF_HCCHAR4_DEVADDR3                        *((volatile unsigned int*)(0x4380B064UL))
#define bM4_USF_HCCHAR4_DEVADDR4                        *((volatile unsigned int*)(0x4380B068UL))
#define bM4_USF_HCCHAR4_DEVADDR5                        *((volatile unsigned int*)(0x4380B06CUL))
#define bM4_USF_HCCHAR4_DEVADDR6                        *((volatile unsigned int*)(0x4380B070UL))
#define bM4_USF_HCCHAR4_ODDFRM                          *((volatile unsigned int*)(0x4380B074UL))
#define bM4_USF_HCCHAR4_CHDIS                           *((volatile unsigned int*)(0x4380B078UL))
#define bM4_USF_HCCHAR4_CHENA                           *((volatile unsigned int*)(0x4380B07CUL))
#define bM4_USF_HCSPLT4_PRTADDR0                        *((volatile unsigned int*)(0x4380B080UL))
#define bM4_USF_HCSPLT4_PRTADDR1                        *((volatile unsigned int*)(0x4380B084UL))
#define bM4_USF_HCSPLT4_PRTADDR2                        *((volatile unsigned int*)(0x4380B088UL))
#define bM4_USF_HCSPLT4_PRTADDR3                        *((volatile unsigned int*)(0x4380B08CUL))
#define bM4_USF_HCSPLT4_PRTADDR4                        *((volatile unsigned int*)(0x4380B090UL))
#define bM4_USF_HCSPLT4_PRTADDR5                        *((volatile unsigned int*)(0x4380B094UL))
#define bM4_USF_HCSPLT4_PRTADDR6                        *((volatile unsigned int*)(0x4380B098UL))
#define bM4_USF_HCSPLT4_HUBADDR0                        *((volatile unsigned int*)(0x4380B09CUL))
#define bM4_USF_HCSPLT4_HUBADDR1                        *((volatile unsigned int*)(0x4380B0A0UL))
#define bM4_USF_HCSPLT4_HUBADDR2                        *((volatile unsigned int*)(0x4380B0A4UL))
#define bM4_USF_HCSPLT4_HUBADDR3                        *((volatile unsigned int*)(0x4380B0A8UL))
#define bM4_USF_HCSPLT4_HUBADDR4                        *((volatile unsigned int*)(0x4380B0ACUL))
#define bM4_USF_HCSPLT4_HUBADDR5                        *((volatile unsigned int*)(0x4380B0B0UL))
#define bM4_USF_HCSPLT4_HUBADDR6                        *((volatile unsigned int*)(0x4380B0B4UL))
#define bM4_USF_HCSPLT4_XACTPOS0                        *((volatile unsigned int*)(0x4380B0B8UL))
#define bM4_USF_HCSPLT4_XACTPOS1                        *((volatile unsigned int*)(0x4380B0BCUL))
#define bM4_USF_HCSPLT4_COMPSPLT                        *((volatile unsigned int*)(0x4380B0C0UL))
#define bM4_USF_HCSPLT4_RESV                            *((volatile unsigned int*)(0x4380B0E0UL))
#define bM4_USF_HCSPLT4_SPLTENA                         *((volatile unsigned int*)(0x4380B0FCUL))
#define bM4_USF_HCINT4_XFERCOMPL                        *((volatile unsigned int*)(0x4380B100UL))
#define bM4_USF_HCINT4_CHHLTD                           *((volatile unsigned int*)(0x4380B104UL))
#define bM4_USF_HCINT4_AHBERR                           *((volatile unsigned int*)(0x4380B108UL))
#define bM4_USF_HCINT4_STALL                            *((volatile unsigned int*)(0x4380B10CUL))
#define bM4_USF_HCINT4_NAK                              *((volatile unsigned int*)(0x4380B110UL))
#define bM4_USF_HCINT4_ACK                              *((volatile unsigned int*)(0x4380B114UL))
#define bM4_USF_HCINT4_NYET                             *((volatile unsigned int*)(0x4380B118UL))
#define bM4_USF_HCINT4_XACTERR                          *((volatile unsigned int*)(0x4380B11CUL))
#define bM4_USF_HCINT4_BBLERR                           *((volatile unsigned int*)(0x4380B120UL))
#define bM4_USF_HCINT4_FRMOVRUN                         *((volatile unsigned int*)(0x4380B124UL))
#define bM4_USF_HCINT4_DATATGLERR                       *((volatile unsigned int*)(0x4380B128UL))
#define bM4_USF_HCINTMSK4_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4380B180UL))
#define bM4_USF_HCINTMSK4_CHHLTDMSK                     *((volatile unsigned int*)(0x4380B184UL))
#define bM4_USF_HCINTMSK4_AHBERRMSK                     *((volatile unsigned int*)(0x4380B188UL))
#define bM4_USF_HCINTMSK4_STALLMSK                      *((volatile unsigned int*)(0x4380B18CUL))
#define bM4_USF_HCINTMSK4_NAKMSK                        *((volatile unsigned int*)(0x4380B190UL))
#define bM4_USF_HCINTMSK4_ACKMSK                        *((volatile unsigned int*)(0x4380B194UL))
#define bM4_USF_HCINTMSK4_NYETMSK                       *((volatile unsigned int*)(0x4380B198UL))
#define bM4_USF_HCINTMSK4_XACTERRMSK                    *((volatile unsigned int*)(0x4380B19CUL))
#define bM4_USF_HCINTMSK4_BBLERRMSK                     *((volatile unsigned int*)(0x4380B1A0UL))
#define bM4_USF_HCINTMSK4_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4380B1A4UL))
#define bM4_USF_HCINTMSK4_DATATGLERRMSK                 *((volatile unsigned int*)(0x4380B1A8UL))
#define bM4_USF_HCTSIZ4_XFERSIZE0                       *((volatile unsigned int*)(0x4380B200UL))
#define bM4_USF_HCTSIZ4_XFERSIZE1                       *((volatile unsigned int*)(0x4380B204UL))
#define bM4_USF_HCTSIZ4_XFERSIZE2                       *((volatile unsigned int*)(0x4380B208UL))
#define bM4_USF_HCTSIZ4_XFERSIZE3                       *((volatile unsigned int*)(0x4380B20CUL))
#define bM4_USF_HCTSIZ4_XFERSIZE4                       *((volatile unsigned int*)(0x4380B210UL))
#define bM4_USF_HCTSIZ4_XFERSIZE5                       *((volatile unsigned int*)(0x4380B214UL))
#define bM4_USF_HCTSIZ4_XFERSIZE6                       *((volatile unsigned int*)(0x4380B218UL))
#define bM4_USF_HCTSIZ4_XFERSIZE7                       *((volatile unsigned int*)(0x4380B21CUL))
#define bM4_USF_HCTSIZ4_XFERSIZE8                       *((volatile unsigned int*)(0x4380B220UL))
#define bM4_USF_HCTSIZ4_XFERSIZE9                       *((volatile unsigned int*)(0x4380B224UL))
#define bM4_USF_HCTSIZ4_XFERSIZE10                      *((volatile unsigned int*)(0x4380B228UL))
#define bM4_USF_HCTSIZ4_XFERSIZE11                      *((volatile unsigned int*)(0x4380B22CUL))
#define bM4_USF_HCTSIZ4_XFERSIZE12                      *((volatile unsigned int*)(0x4380B230UL))
#define bM4_USF_HCTSIZ4_XFERSIZE13                      *((volatile unsigned int*)(0x4380B234UL))
#define bM4_USF_HCTSIZ4_XFERSIZE14                      *((volatile unsigned int*)(0x4380B238UL))
#define bM4_USF_HCTSIZ4_XFERSIZE15                      *((volatile unsigned int*)(0x4380B23CUL))
#define bM4_USF_HCTSIZ4_XFERSIZE16                      *((volatile unsigned int*)(0x4380B240UL))
#define bM4_USF_HCTSIZ4_XFERSIZE17                      *((volatile unsigned int*)(0x4380B244UL))
#define bM4_USF_HCTSIZ4_XFERSIZE18                      *((volatile unsigned int*)(0x4380B248UL))
#define bM4_USF_HCTSIZ4_PKTCNT0                         *((volatile unsigned int*)(0x4380B24CUL))
#define bM4_USF_HCTSIZ4_PKTCNT1                         *((volatile unsigned int*)(0x4380B250UL))
#define bM4_USF_HCTSIZ4_PKTCNT2                         *((volatile unsigned int*)(0x4380B254UL))
#define bM4_USF_HCTSIZ4_PKTCNT3                         *((volatile unsigned int*)(0x4380B258UL))
#define bM4_USF_HCTSIZ4_PKTCNT4                         *((volatile unsigned int*)(0x4380B25CUL))
#define bM4_USF_HCTSIZ4_PKTCNT5                         *((volatile unsigned int*)(0x4380B260UL))
#define bM4_USF_HCTSIZ4_PKTCNT6                         *((volatile unsigned int*)(0x4380B264UL))
#define bM4_USF_HCTSIZ4_PKTCNT7                         *((volatile unsigned int*)(0x4380B268UL))
#define bM4_USF_HCTSIZ4_PKTCNT8                         *((volatile unsigned int*)(0x4380B26CUL))
#define bM4_USF_HCTSIZ4_PKTCNT9                         *((volatile unsigned int*)(0x4380B270UL))
#define bM4_USF_HCTSIZ4_PID0                            *((volatile unsigned int*)(0x4380B274UL))
#define bM4_USF_HCTSIZ4_PID1                            *((volatile unsigned int*)(0x4380B278UL))
#define bM4_USF_HCTSIZ4_DOPNG                           *((volatile unsigned int*)(0x4380B27CUL))
#define bM4_USF_HCCHAR5_MPS0                            *((volatile unsigned int*)(0x4380B400UL))
#define bM4_USF_HCCHAR5_MPS1                            *((volatile unsigned int*)(0x4380B404UL))
#define bM4_USF_HCCHAR5_MPS2                            *((volatile unsigned int*)(0x4380B408UL))
#define bM4_USF_HCCHAR5_MPS3                            *((volatile unsigned int*)(0x4380B40CUL))
#define bM4_USF_HCCHAR5_MPS4                            *((volatile unsigned int*)(0x4380B410UL))
#define bM4_USF_HCCHAR5_MPS5                            *((volatile unsigned int*)(0x4380B414UL))
#define bM4_USF_HCCHAR5_MPS6                            *((volatile unsigned int*)(0x4380B418UL))
#define bM4_USF_HCCHAR5_MPS7                            *((volatile unsigned int*)(0x4380B41CUL))
#define bM4_USF_HCCHAR5_MPS8                            *((volatile unsigned int*)(0x4380B420UL))
#define bM4_USF_HCCHAR5_MPS9                            *((volatile unsigned int*)(0x4380B424UL))
#define bM4_USF_HCCHAR5_MPS10                           *((volatile unsigned int*)(0x4380B428UL))
#define bM4_USF_HCCHAR5_EPNUM0                          *((volatile unsigned int*)(0x4380B42CUL))
#define bM4_USF_HCCHAR5_EPNUM1                          *((volatile unsigned int*)(0x4380B430UL))
#define bM4_USF_HCCHAR5_EPNUM2                          *((volatile unsigned int*)(0x4380B434UL))
#define bM4_USF_HCCHAR5_EPNUM3                          *((volatile unsigned int*)(0x4380B438UL))
#define bM4_USF_HCCHAR5_EPDIR                           *((volatile unsigned int*)(0x4380B43CUL))
#define bM4_USF_HCCHAR5_LSPDDEV                         *((volatile unsigned int*)(0x4380B444UL))
#define bM4_USF_HCCHAR5_EPTYPE0                         *((volatile unsigned int*)(0x4380B448UL))
#define bM4_USF_HCCHAR5_EPTYPE1                         *((volatile unsigned int*)(0x4380B44CUL))
#define bM4_USF_HCCHAR5_EC0                             *((volatile unsigned int*)(0x4380B450UL))
#define bM4_USF_HCCHAR5_EC1                             *((volatile unsigned int*)(0x4380B454UL))
#define bM4_USF_HCCHAR5_DEVADDR0                        *((volatile unsigned int*)(0x4380B458UL))
#define bM4_USF_HCCHAR5_DEVADDR1                        *((volatile unsigned int*)(0x4380B45CUL))
#define bM4_USF_HCCHAR5_DEVADDR2                        *((volatile unsigned int*)(0x4380B460UL))
#define bM4_USF_HCCHAR5_DEVADDR3                        *((volatile unsigned int*)(0x4380B464UL))
#define bM4_USF_HCCHAR5_DEVADDR4                        *((volatile unsigned int*)(0x4380B468UL))
#define bM4_USF_HCCHAR5_DEVADDR5                        *((volatile unsigned int*)(0x4380B46CUL))
#define bM4_USF_HCCHAR5_DEVADDR6                        *((volatile unsigned int*)(0x4380B470UL))
#define bM4_USF_HCCHAR5_ODDFRM                          *((volatile unsigned int*)(0x4380B474UL))
#define bM4_USF_HCCHAR5_CHDIS                           *((volatile unsigned int*)(0x4380B478UL))
#define bM4_USF_HCCHAR5_CHENA                           *((volatile unsigned int*)(0x4380B47CUL))
#define bM4_USF_HCSPLT5_PRTADDR0                        *((volatile unsigned int*)(0x4380B480UL))
#define bM4_USF_HCSPLT5_PRTADDR1                        *((volatile unsigned int*)(0x4380B484UL))
#define bM4_USF_HCSPLT5_PRTADDR2                        *((volatile unsigned int*)(0x4380B488UL))
#define bM4_USF_HCSPLT5_PRTADDR3                        *((volatile unsigned int*)(0x4380B48CUL))
#define bM4_USF_HCSPLT5_PRTADDR4                        *((volatile unsigned int*)(0x4380B490UL))
#define bM4_USF_HCSPLT5_PRTADDR5                        *((volatile unsigned int*)(0x4380B494UL))
#define bM4_USF_HCSPLT5_PRTADDR6                        *((volatile unsigned int*)(0x4380B498UL))
#define bM4_USF_HCSPLT5_HUBADDR0                        *((volatile unsigned int*)(0x4380B49CUL))
#define bM4_USF_HCSPLT5_HUBADDR1                        *((volatile unsigned int*)(0x4380B4A0UL))
#define bM4_USF_HCSPLT5_HUBADDR2                        *((volatile unsigned int*)(0x4380B4A4UL))
#define bM4_USF_HCSPLT5_HUBADDR3                        *((volatile unsigned int*)(0x4380B4A8UL))
#define bM4_USF_HCSPLT5_HUBADDR4                        *((volatile unsigned int*)(0x4380B4ACUL))
#define bM4_USF_HCSPLT5_HUBADDR5                        *((volatile unsigned int*)(0x4380B4B0UL))
#define bM4_USF_HCSPLT5_HUBADDR6                        *((volatile unsigned int*)(0x4380B4B4UL))
#define bM4_USF_HCSPLT5_XACTPOS0                        *((volatile unsigned int*)(0x4380B4B8UL))
#define bM4_USF_HCSPLT5_XACTPOS1                        *((volatile unsigned int*)(0x4380B4BCUL))
#define bM4_USF_HCSPLT5_COMPSPLT                        *((volatile unsigned int*)(0x4380B4C0UL))
#define bM4_USF_HCSPLT5_RESV                            *((volatile unsigned int*)(0x4380B4E0UL))
#define bM4_USF_HCSPLT5_SPLTENA                         *((volatile unsigned int*)(0x4380B4FCUL))
#define bM4_USF_HCINT5_XFERCOMPL                        *((volatile unsigned int*)(0x4380B500UL))
#define bM4_USF_HCINT5_CHHLTD                           *((volatile unsigned int*)(0x4380B504UL))
#define bM4_USF_HCINT5_AHBERR                           *((volatile unsigned int*)(0x4380B508UL))
#define bM4_USF_HCINT5_STALL                            *((volatile unsigned int*)(0x4380B50CUL))
#define bM4_USF_HCINT5_NAK                              *((volatile unsigned int*)(0x4380B510UL))
#define bM4_USF_HCINT5_ACK                              *((volatile unsigned int*)(0x4380B514UL))
#define bM4_USF_HCINT5_NYET                             *((volatile unsigned int*)(0x4380B518UL))
#define bM4_USF_HCINT5_XACTERR                          *((volatile unsigned int*)(0x4380B51CUL))
#define bM4_USF_HCINT5_BBLERR                           *((volatile unsigned int*)(0x4380B520UL))
#define bM4_USF_HCINT5_FRMOVRUN                         *((volatile unsigned int*)(0x4380B524UL))
#define bM4_USF_HCINT5_DATATGLERR                       *((volatile unsigned int*)(0x4380B528UL))
#define bM4_USF_HCINTMSK5_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4380B580UL))
#define bM4_USF_HCINTMSK5_CHHLTDMSK                     *((volatile unsigned int*)(0x4380B584UL))
#define bM4_USF_HCINTMSK5_AHBERRMSK                     *((volatile unsigned int*)(0x4380B588UL))
#define bM4_USF_HCINTMSK5_STALLMSK                      *((volatile unsigned int*)(0x4380B58CUL))
#define bM4_USF_HCINTMSK5_NAKMSK                        *((volatile unsigned int*)(0x4380B590UL))
#define bM4_USF_HCINTMSK5_ACKMSK                        *((volatile unsigned int*)(0x4380B594UL))
#define bM4_USF_HCINTMSK5_NYETMSK                       *((volatile unsigned int*)(0x4380B598UL))
#define bM4_USF_HCINTMSK5_XACTERRMSK                    *((volatile unsigned int*)(0x4380B59CUL))
#define bM4_USF_HCINTMSK5_BBLERRMSK                     *((volatile unsigned int*)(0x4380B5A0UL))
#define bM4_USF_HCINTMSK5_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4380B5A4UL))
#define bM4_USF_HCINTMSK5_DATATGLERRMSK                 *((volatile unsigned int*)(0x4380B5A8UL))
#define bM4_USF_HCTSIZ5_XFERSIZE0                       *((volatile unsigned int*)(0x4380B600UL))
#define bM4_USF_HCTSIZ5_XFERSIZE1                       *((volatile unsigned int*)(0x4380B604UL))
#define bM4_USF_HCTSIZ5_XFERSIZE2                       *((volatile unsigned int*)(0x4380B608UL))
#define bM4_USF_HCTSIZ5_XFERSIZE3                       *((volatile unsigned int*)(0x4380B60CUL))
#define bM4_USF_HCTSIZ5_XFERSIZE4                       *((volatile unsigned int*)(0x4380B610UL))
#define bM4_USF_HCTSIZ5_XFERSIZE5                       *((volatile unsigned int*)(0x4380B614UL))
#define bM4_USF_HCTSIZ5_XFERSIZE6                       *((volatile unsigned int*)(0x4380B618UL))
#define bM4_USF_HCTSIZ5_XFERSIZE7                       *((volatile unsigned int*)(0x4380B61CUL))
#define bM4_USF_HCTSIZ5_XFERSIZE8                       *((volatile unsigned int*)(0x4380B620UL))
#define bM4_USF_HCTSIZ5_XFERSIZE9                       *((volatile unsigned int*)(0x4380B624UL))
#define bM4_USF_HCTSIZ5_XFERSIZE10                      *((volatile unsigned int*)(0x4380B628UL))
#define bM4_USF_HCTSIZ5_XFERSIZE11                      *((volatile unsigned int*)(0x4380B62CUL))
#define bM4_USF_HCTSIZ5_XFERSIZE12                      *((volatile unsigned int*)(0x4380B630UL))
#define bM4_USF_HCTSIZ5_XFERSIZE13                      *((volatile unsigned int*)(0x4380B634UL))
#define bM4_USF_HCTSIZ5_XFERSIZE14                      *((volatile unsigned int*)(0x4380B638UL))
#define bM4_USF_HCTSIZ5_XFERSIZE15                      *((volatile unsigned int*)(0x4380B63CUL))
#define bM4_USF_HCTSIZ5_XFERSIZE16                      *((volatile unsigned int*)(0x4380B640UL))
#define bM4_USF_HCTSIZ5_XFERSIZE17                      *((volatile unsigned int*)(0x4380B644UL))
#define bM4_USF_HCTSIZ5_XFERSIZE18                      *((volatile unsigned int*)(0x4380B648UL))
#define bM4_USF_HCTSIZ5_PKTCNT0                         *((volatile unsigned int*)(0x4380B64CUL))
#define bM4_USF_HCTSIZ5_PKTCNT1                         *((volatile unsigned int*)(0x4380B650UL))
#define bM4_USF_HCTSIZ5_PKTCNT2                         *((volatile unsigned int*)(0x4380B654UL))
#define bM4_USF_HCTSIZ5_PKTCNT3                         *((volatile unsigned int*)(0x4380B658UL))
