RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_HCTSIZ5_PKTCNT4                         *((volatile unsigned int*)(0x4380B65CUL))
#define bM4_USF_HCTSIZ5_PKTCNT5                         *((volatile unsigned int*)(0x4380B660UL))
#define bM4_USF_HCTSIZ5_PKTCNT6                         *((volatile unsigned int*)(0x4380B664UL))
#define bM4_USF_HCTSIZ5_PKTCNT7                         *((volatile unsigned int*)(0x4380B668UL))
#define bM4_USF_HCTSIZ5_PKTCNT8                         *((volatile unsigned int*)(0x4380B66CUL))
#define bM4_USF_HCTSIZ5_PKTCNT9                         *((volatile unsigned int*)(0x4380B670UL))
#define bM4_USF_HCTSIZ5_PID0                            *((volatile unsigned int*)(0x4380B674UL))
#define bM4_USF_HCTSIZ5_PID1                            *((volatile unsigned int*)(0x4380B678UL))
#define bM4_USF_HCTSIZ5_DOPNG                           *((volatile unsigned int*)(0x4380B67CUL))
#define bM4_USF_HCCHAR6_MPS0                            *((volatile unsigned int*)(0x4380B800UL))
#define bM4_USF_HCCHAR6_MPS1                            *((volatile unsigned int*)(0x4380B804UL))
#define bM4_USF_HCCHAR6_MPS2                            *((volatile unsigned int*)(0x4380B808UL))
#define bM4_USF_HCCHAR6_MPS3                            *((volatile unsigned int*)(0x4380B80CUL))
#define bM4_USF_HCCHAR6_MPS4                            *((volatile unsigned int*)(0x4380B810UL))
#define bM4_USF_HCCHAR6_MPS5                            *((volatile unsigned int*)(0x4380B814UL))
#define bM4_USF_HCCHAR6_MPS6                            *((volatile unsigned int*)(0x4380B818UL))
#define bM4_USF_HCCHAR6_MPS7                            *((volatile unsigned int*)(0x4380B81CUL))
#define bM4_USF_HCCHAR6_MPS8                            *((volatile unsigned int*)(0x4380B820UL))
#define bM4_USF_HCCHAR6_MPS9                            *((volatile unsigned int*)(0x4380B824UL))
#define bM4_USF_HCCHAR6_MPS10                           *((volatile unsigned int*)(0x4380B828UL))
#define bM4_USF_HCCHAR6_EPNUM0                          *((volatile unsigned int*)(0x4380B82CUL))
#define bM4_USF_HCCHAR6_EPNUM1                          *((volatile unsigned int*)(0x4380B830UL))
#define bM4_USF_HCCHAR6_EPNUM2                          *((volatile unsigned int*)(0x4380B834UL))
#define bM4_USF_HCCHAR6_EPNUM3                          *((volatile unsigned int*)(0x4380B838UL))
#define bM4_USF_HCCHAR6_EPDIR                           *((volatile unsigned int*)(0x4380B83CUL))
#define bM4_USF_HCCHAR6_LSPDDEV                         *((volatile unsigned int*)(0x4380B844UL))
#define bM4_USF_HCCHAR6_EPTYPE0                         *((volatile unsigned int*)(0x4380B848UL))
#define bM4_USF_HCCHAR6_EPTYPE1                         *((volatile unsigned int*)(0x4380B84CUL))
#define bM4_USF_HCCHAR6_EC0                             *((volatile unsigned int*)(0x4380B850UL))
#define bM4_USF_HCCHAR6_EC1                             *((volatile unsigned int*)(0x4380B854UL))
#define bM4_USF_HCCHAR6_DEVADDR0                        *((volatile unsigned int*)(0x4380B858UL))
#define bM4_USF_HCCHAR6_DEVADDR1                        *((volatile unsigned int*)(0x4380B85CUL))
#define bM4_USF_HCCHAR6_DEVADDR2                        *((volatile unsigned int*)(0x4380B860UL))
#define bM4_USF_HCCHAR6_DEVADDR3                        *((volatile unsigned int*)(0x4380B864UL))
#define bM4_USF_HCCHAR6_DEVADDR4                        *((volatile unsigned int*)(0x4380B868UL))
#define bM4_USF_HCCHAR6_DEVADDR5                        *((volatile unsigned int*)(0x4380B86CUL))
#define bM4_USF_HCCHAR6_DEVADDR6                        *((volatile unsigned int*)(0x4380B870UL))
#define bM4_USF_HCCHAR6_ODDFRM                          *((volatile unsigned int*)(0x4380B874UL))
#define bM4_USF_HCCHAR6_CHDIS                           *((volatile unsigned int*)(0x4380B878UL))
#define bM4_USF_HCCHAR6_CHENA                           *((volatile unsigned int*)(0x4380B87CUL))
#define bM4_USF_HCSPLT6_PRTADDR0                        *((volatile unsigned int*)(0x4380B880UL))
#define bM4_USF_HCSPLT6_PRTADDR1                        *((volatile unsigned int*)(0x4380B884UL))
#define bM4_USF_HCSPLT6_PRTADDR2                        *((volatile unsigned int*)(0x4380B888UL))
#define bM4_USF_HCSPLT6_PRTADDR3                        *((volatile unsigned int*)(0x4380B88CUL))
#define bM4_USF_HCSPLT6_PRTADDR4                        *((volatile unsigned int*)(0x4380B890UL))
#define bM4_USF_HCSPLT6_PRTADDR5                        *((volatile unsigned int*)(0x4380B894UL))
#define bM4_USF_HCSPLT6_PRTADDR6                        *((volatile unsigned int*)(0x4380B898UL))
#define bM4_USF_HCSPLT6_HUBADDR0                        *((volatile unsigned int*)(0x4380B89CUL))
#define bM4_USF_HCSPLT6_HUBADDR1                        *((volatile unsigned int*)(0x4380B8A0UL))
#define bM4_USF_HCSPLT6_HUBADDR2                        *((volatile unsigned int*)(0x4380B8A4UL))
#define bM4_USF_HCSPLT6_HUBADDR3                        *((volatile unsigned int*)(0x4380B8A8UL))
#define bM4_USF_HCSPLT6_HUBADDR4                        *((volatile unsigned int*)(0x4380B8ACUL))
#define bM4_USF_HCSPLT6_HUBADDR5                        *((volatile unsigned int*)(0x4380B8B0UL))
#define bM4_USF_HCSPLT6_HUBADDR6                        *((volatile unsigned int*)(0x4380B8B4UL))
#define bM4_USF_HCSPLT6_XACTPOS0                        *((volatile unsigned int*)(0x4380B8B8UL))
#define bM4_USF_HCSPLT6_XACTPOS1                        *((volatile unsigned int*)(0x4380B8BCUL))
#define bM4_USF_HCSPLT6_COMPSPLT                        *((volatile unsigned int*)(0x4380B8C0UL))
#define bM4_USF_HCSPLT6_RESV                            *((volatile unsigned int*)(0x4380B8E0UL))
#define bM4_USF_HCSPLT6_SPLTENA                         *((volatile unsigned int*)(0x4380B8FCUL))
#define bM4_USF_HCINT6_XFERCOMPL                        *((volatile unsigned int*)(0x4380B900UL))
#define bM4_USF_HCINT6_CHHLTD                           *((volatile unsigned int*)(0x4380B904UL))
#define bM4_USF_HCINT6_AHBERR                           *((volatile unsigned int*)(0x4380B908UL))
#define bM4_USF_HCINT6_STALL                            *((volatile unsigned int*)(0x4380B90CUL))
#define bM4_USF_HCINT6_NAK                              *((volatile unsigned int*)(0x4380B910UL))
#define bM4_USF_HCINT6_ACK                              *((volatile unsigned int*)(0x4380B914UL))
#define bM4_USF_HCINT6_NYET                             *((volatile unsigned int*)(0x4380B918UL))
#define bM4_USF_HCINT6_XACTERR                          *((volatile unsigned int*)(0x4380B91CUL))
#define bM4_USF_HCINT6_BBLERR                           *((volatile unsigned int*)(0x4380B920UL))
#define bM4_USF_HCINT6_FRMOVRUN                         *((volatile unsigned int*)(0x4380B924UL))
#define bM4_USF_HCINT6_DATATGLERR                       *((volatile unsigned int*)(0x4380B928UL))
#define bM4_USF_HCINTMSK6_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4380B980UL))
#define bM4_USF_HCINTMSK6_CHHLTDMSK                     *((volatile unsigned int*)(0x4380B984UL))
#define bM4_USF_HCINTMSK6_AHBERRMSK                     *((volatile unsigned int*)(0x4380B988UL))
#define bM4_USF_HCINTMSK6_STALLMSK                      *((volatile unsigned int*)(0x4380B98CUL))
#define bM4_USF_HCINTMSK6_NAKMSK                        *((volatile unsigned int*)(0x4380B990UL))
#define bM4_USF_HCINTMSK6_ACKMSK                        *((volatile unsigned int*)(0x4380B994UL))
#define bM4_USF_HCINTMSK6_NYETMSK                       *((volatile unsigned int*)(0x4380B998UL))
#define bM4_USF_HCINTMSK6_XACTERRMSK                    *((volatile unsigned int*)(0x4380B99CUL))
#define bM4_USF_HCINTMSK6_BBLERRMSK                     *((volatile unsigned int*)(0x4380B9A0UL))
#define bM4_USF_HCINTMSK6_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4380B9A4UL))
#define bM4_USF_HCINTMSK6_DATATGLERRMSK                 *((volatile unsigned int*)(0x4380B9A8UL))
#define bM4_USF_HCTSIZ6_XFERSIZE0                       *((volatile unsigned int*)(0x4380BA00UL))
#define bM4_USF_HCTSIZ6_XFERSIZE1                       *((volatile unsigned int*)(0x4380BA04UL))
#define bM4_USF_HCTSIZ6_XFERSIZE2                       *((volatile unsigned int*)(0x4380BA08UL))
#define bM4_USF_HCTSIZ6_XFERSIZE3                       *((volatile unsigned int*)(0x4380BA0CUL))
#define bM4_USF_HCTSIZ6_XFERSIZE4                       *((volatile unsigned int*)(0x4380BA10UL))
#define bM4_USF_HCTSIZ6_XFERSIZE5                       *((volatile unsigned int*)(0x4380BA14UL))
#define bM4_USF_HCTSIZ6_XFERSIZE6                       *((volatile unsigned int*)(0x4380BA18UL))
#define bM4_USF_HCTSIZ6_XFERSIZE7                       *((volatile unsigned int*)(0x4380BA1CUL))
#define bM4_USF_HCTSIZ6_XFERSIZE8                       *((volatile unsigned int*)(0x4380BA20UL))
#define bM4_USF_HCTSIZ6_XFERSIZE9                       *((volatile unsigned int*)(0x4380BA24UL))
#define bM4_USF_HCTSIZ6_XFERSIZE10                      *((volatile unsigned int*)(0x4380BA28UL))
#define bM4_USF_HCTSIZ6_XFERSIZE11                      *((volatile unsigned int*)(0x4380BA2CUL))
#define bM4_USF_HCTSIZ6_XFERSIZE12                      *((volatile unsigned int*)(0x4380BA30UL))
#define bM4_USF_HCTSIZ6_XFERSIZE13                      *((volatile unsigned int*)(0x4380BA34UL))
#define bM4_USF_HCTSIZ6_XFERSIZE14                      *((volatile unsigned int*)(0x4380BA38UL))
#define bM4_USF_HCTSIZ6_XFERSIZE15                      *((volatile unsigned int*)(0x4380BA3CUL))
#define bM4_USF_HCTSIZ6_XFERSIZE16                      *((volatile unsigned int*)(0x4380BA40UL))
#define bM4_USF_HCTSIZ6_XFERSIZE17                      *((volatile unsigned int*)(0x4380BA44UL))
#define bM4_USF_HCTSIZ6_XFERSIZE18                      *((volatile unsigned int*)(0x4380BA48UL))
#define bM4_USF_HCTSIZ6_PKTCNT0                         *((volatile unsigned int*)(0x4380BA4CUL))
#define bM4_USF_HCTSIZ6_PKTCNT1                         *((volatile unsigned int*)(0x4380BA50UL))
#define bM4_USF_HCTSIZ6_PKTCNT2                         *((volatile unsigned int*)(0x4380BA54UL))
#define bM4_USF_HCTSIZ6_PKTCNT3                         *((volatile unsigned int*)(0x4380BA58UL))
#define bM4_USF_HCTSIZ6_PKTCNT4                         *((volatile unsigned int*)(0x4380BA5CUL))
#define bM4_USF_HCTSIZ6_PKTCNT5                         *((volatile unsigned int*)(0x4380BA60UL))
#define bM4_USF_HCTSIZ6_PKTCNT6                         *((volatile unsigned int*)(0x4380BA64UL))
#define bM4_USF_HCTSIZ6_PKTCNT7                         *((volatile unsigned int*)(0x4380BA68UL))
#define bM4_USF_HCTSIZ6_PKTCNT8                         *((volatile unsigned int*)(0x4380BA6CUL))
#define bM4_USF_HCTSIZ6_PKTCNT9                         *((volatile unsigned int*)(0x4380BA70UL))
#define bM4_USF_HCTSIZ6_PID0                            *((volatile unsigned int*)(0x4380BA74UL))
#define bM4_USF_HCTSIZ6_PID1                            *((volatile unsigned int*)(0x4380BA78UL))
#define bM4_USF_HCTSIZ6_DOPNG                           *((volatile unsigned int*)(0x4380BA7CUL))
#define bM4_USF_HCCHAR7_MPS0                            *((volatile unsigned int*)(0x4380BC00UL))
#define bM4_USF_HCCHAR7_MPS1                            *((volatile unsigned int*)(0x4380BC04UL))
#define bM4_USF_HCCHAR7_MPS2                            *((volatile unsigned int*)(0x4380BC08UL))
#define bM4_USF_HCCHAR7_MPS3                            *((volatile unsigned int*)(0x4380BC0CUL))
#define bM4_USF_HCCHAR7_MPS4                            *((volatile unsigned int*)(0x4380BC10UL))
#define bM4_USF_HCCHAR7_MPS5                            *((volatile unsigned int*)(0x4380BC14UL))
#define bM4_USF_HCCHAR7_MPS6                            *((volatile unsigned int*)(0x4380BC18UL))
#define bM4_USF_HCCHAR7_MPS7                            *((volatile unsigned int*)(0x4380BC1CUL))
#define bM4_USF_HCCHAR7_MPS8                            *((volatile unsigned int*)(0x4380BC20UL))
#define bM4_USF_HCCHAR7_MPS9                            *((volatile unsigned int*)(0x4380BC24UL))
#define bM4_USF_HCCHAR7_MPS10                           *((volatile unsigned int*)(0x4380BC28UL))
#define bM4_USF_HCCHAR7_EPNUM0                          *((volatile unsigned int*)(0x4380BC2CUL))
#define bM4_USF_HCCHAR7_EPNUM1                          *((volatile unsigned int*)(0x4380BC30UL))
#define bM4_USF_HCCHAR7_EPNUM2                          *((volatile unsigned int*)(0x4380BC34UL))
#define bM4_USF_HCCHAR7_EPNUM3                          *((volatile unsigned int*)(0x4380BC38UL))
#define bM4_USF_HCCHAR7_EPDIR                           *((volatile unsigned int*)(0x4380BC3CUL))
#define bM4_USF_HCCHAR7_LSPDDEV                         *((volatile unsigned int*)(0x4380BC44UL))
#define bM4_USF_HCCHAR7_EPTYPE0                         *((volatile unsigned int*)(0x4380BC48UL))
#define bM4_USF_HCCHAR7_EPTYPE1                         *((volatile unsigned int*)(0x4380BC4CUL))
#define bM4_USF_HCCHAR7_EC0                             *((volatile unsigned int*)(0x4380BC50UL))
#define bM4_USF_HCCHAR7_EC1                             *((volatile unsigned int*)(0x4380BC54UL))
#define bM4_USF_HCCHAR7_DEVADDR0                        *((volatile unsigned int*)(0x4380BC58UL))
#define bM4_USF_HCCHAR7_DEVADDR1                        *((volatile unsigned int*)(0x4380BC5CUL))
#define bM4_USF_HCCHAR7_DEVADDR2                        *((volatile unsigned int*)(0x4380BC60UL))
#define bM4_USF_HCCHAR7_DEVADDR3                        *((volatile unsigned int*)(0x4380BC64UL))
#define bM4_USF_HCCHAR7_DEVADDR4                        *((volatile unsigned int*)(0x4380BC68UL))
#define bM4_USF_HCCHAR7_DEVADDR5                        *((volatile unsigned int*)(0x4380BC6CUL))
#define bM4_USF_HCCHAR7_DEVADDR6                        *((volatile unsigned int*)(0x4380BC70UL))
#define bM4_USF_HCCHAR7_ODDFRM                          *((volatile unsigned int*)(0x4380BC74UL))
#define bM4_USF_HCCHAR7_CHDIS                           *((volatile unsigned int*)(0x4380BC78UL))
#define bM4_USF_HCCHAR7_CHENA                           *((volatile unsigned int*)(0x4380BC7CUL))
#define bM4_USF_HCSPLT7_PRTADDR0                        *((volatile unsigned int*)(0x4380BC80UL))
#define bM4_USF_HCSPLT7_PRTADDR1                        *((volatile unsigned int*)(0x4380BC84UL))
#define bM4_USF_HCSPLT7_PRTADDR2                        *((volatile unsigned int*)(0x4380BC88UL))
#define bM4_USF_HCSPLT7_PRTADDR3                        *((volatile unsigned int*)(0x4380BC8CUL))
#define bM4_USF_HCSPLT7_PRTADDR4                        *((volatile unsigned int*)(0x4380BC90UL))
#define bM4_USF_HCSPLT7_PRTADDR5                        *((volatile unsigned int*)(0x4380BC94UL))
#define bM4_USF_HCSPLT7_PRTADDR6                        *((volatile unsigned int*)(0x4380BC98UL))
#define bM4_USF_HCSPLT7_HUBADDR0                        *((volatile unsigned int*)(0x4380BC9CUL))
#define bM4_USF_HCSPLT7_HUBADDR1                        *((volatile unsigned int*)(0x4380BCA0UL))
#define bM4_USF_HCSPLT7_HUBADDR2                        *((volatile unsigned int*)(0x4380BCA4UL))
#define bM4_USF_HCSPLT7_HUBADDR3                        *((volatile unsigned int*)(0x4380BCA8UL))
#define bM4_USF_HCSPLT7_HUBADDR4                        *((volatile unsigned int*)(0x4380BCACUL))
#define bM4_USF_HCSPLT7_HUBADDR5                        *((volatile unsigned int*)(0x4380BCB0UL))
#define bM4_USF_HCSPLT7_HUBADDR6                        *((volatile unsigned int*)(0x4380BCB4UL))
#define bM4_USF_HCSPLT7_XACTPOS0                        *((volatile unsigned int*)(0x4380BCB8UL))
#define bM4_USF_HCSPLT7_XACTPOS1                        *((volatile unsigned int*)(0x4380BCBCUL))
#define bM4_USF_HCSPLT7_COMPSPLT                        *((volatile unsigned int*)(0x4380BCC0UL))
#define bM4_USF_HCSPLT7_RESV                            *((volatile unsigned int*)(0x4380BCE0UL))
#define bM4_USF_HCSPLT7_SPLTENA                         *((volatile unsigned int*)(0x4380BCFCUL))
#define bM4_USF_HCINT7_XFERCOMPL                        *((volatile unsigned int*)(0x4380BD00UL))
#define bM4_USF_HCINT7_CHHLTD                           *((volatile unsigned int*)(0x4380BD04UL))
#define bM4_USF_HCINT7_AHBERR                           *((volatile unsigned int*)(0x4380BD08UL))
#define bM4_USF_HCINT7_STALL                            *((volatile unsigned int*)(0x4380BD0CUL))
#define bM4_USF_HCINT7_NAK                              *((volatile unsigned int*)(0x4380BD10UL))
#define bM4_USF_HCINT7_ACK                              *((volatile unsigned int*)(0x4380BD14UL))
#define bM4_USF_HCINT7_NYET                             *((volatile unsigned int*)(0x4380BD18UL))
#define bM4_USF_HCINT7_XACTERR                          *((volatile unsigned int*)(0x4380BD1CUL))
#define bM4_USF_HCINT7_BBLERR                           *((volatile unsigned int*)(0x4380BD20UL))
#define bM4_USF_HCINT7_FRMOVRUN                         *((volatile unsigned int*)(0x4380BD24UL))
#define bM4_USF_HCINT7_DATATGLERR                       *((volatile unsigned int*)(0x4380BD28UL))
#define bM4_USF_HCINTMSK7_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4380BD80UL))
#define bM4_USF_HCINTMSK7_CHHLTDMSK                     *((volatile unsigned int*)(0x4380BD84UL))
#define bM4_USF_HCINTMSK7_AHBERRMSK                     *((volatile unsigned int*)(0x4380BD88UL))
#define bM4_USF_HCINTMSK7_STALLMSK                      *((volatile unsigned int*)(0x4380BD8CUL))
#define bM4_USF_HCINTMSK7_NAKMSK                        *((volatile unsigned int*)(0x4380BD90UL))
#define bM4_USF_HCINTMSK7_ACKMSK                        *((volatile unsigned int*)(0x4380BD94UL))
#define bM4_USF_HCINTMSK7_NYETMSK                       *((volatile unsigned int*)(0x4380BD98UL))
#define bM4_USF_HCINTMSK7_XACTERRMSK                    *((volatile unsigned int*)(0x4380BD9CUL))
#define bM4_USF_HCINTMSK7_BBLERRMSK                     *((volatile unsigned int*)(0x4380BDA0UL))
#define bM4_USF_HCINTMSK7_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4380BDA4UL))
#define bM4_USF_HCINTMSK7_DATATGLERRMSK                 *((volatile unsigned int*)(0x4380BDA8UL))
#define bM4_USF_HCTSIZ7_XFERSIZE0                       *((volatile unsigned int*)(0x4380BE00UL))
#define bM4_USF_HCTSIZ7_XFERSIZE1                       *((volatile unsigned int*)(0x4380BE04UL))
#define bM4_USF_HCTSIZ7_XFERSIZE2                       *((volatile unsigned int*)(0x4380BE08UL))
#define bM4_USF_HCTSIZ7_XFERSIZE3                       *((volatile unsigned int*)(0x4380BE0CUL))
#define bM4_USF_HCTSIZ7_XFERSIZE4                       *((volatile unsigned int*)(0x4380BE10UL))
#define bM4_USF_HCTSIZ7_XFERSIZE5                       *((volatile unsigned int*)(0x4380BE14UL))
#define bM4_USF_HCTSIZ7_XFERSIZE6                       *((volatile unsigned int*)(0x4380BE18UL))
#define bM4_USF_HCTSIZ7_XFERSIZE7                       *((volatile unsigned int*)(0x4380BE1CUL))
#define bM4_USF_HCTSIZ7_XFERSIZE8                       *((volatile unsigned int*)(0x4380BE20UL))
#define bM4_USF_HCTSIZ7_XFERSIZE9                       *((volatile unsigned int*)(0x4380BE24UL))
#define bM4_USF_HCTSIZ7_XFERSIZE10                      *((volatile unsigned int*)(0x4380BE28UL))
#define bM4_USF_HCTSIZ7_XFERSIZE11                      *((volatile unsigned int*)(0x4380BE2CUL))
#define bM4_USF_HCTSIZ7_XFERSIZE12                      *((volatile unsigned int*)(0x4380BE30UL))
#define bM4_USF_HCTSIZ7_XFERSIZE13                      *((volatile unsigned int*)(0x4380BE34UL))
#define bM4_USF_HCTSIZ7_XFERSIZE14                      *((volatile unsigned int*)(0x4380BE38UL))
#define bM4_USF_HCTSIZ7_XFERSIZE15                      *((volatile unsigned int*)(0x4380BE3CUL))
#define bM4_USF_HCTSIZ7_XFERSIZE16                      *((volatile unsigned int*)(0x4380BE40UL))
#define bM4_USF_HCTSIZ7_XFERSIZE17                      *((volatile unsigned int*)(0x4380BE44UL))
#define bM4_USF_HCTSIZ7_XFERSIZE18                      *((volatile unsigned int*)(0x4380BE48UL))
#define bM4_USF_HCTSIZ7_PKTCNT0                         *((volatile unsigned int*)(0x4380BE4CUL))
#define bM4_USF_HCTSIZ7_PKTCNT1                         *((volatile unsigned int*)(0x4380BE50UL))
#define bM4_USF_HCTSIZ7_PKTCNT2                         *((volatile unsigned int*)(0x4380BE54UL))
#define bM4_USF_HCTSIZ7_PKTCNT3                         *((volatile unsigned int*)(0x4380BE58UL))
#define bM4_USF_HCTSIZ7_PKTCNT4                         *((volatile unsigned int*)(0x4380BE5CUL))
#define bM4_USF_HCTSIZ7_PKTCNT5                         *((volatile unsigned int*)(0x4380BE60UL))
#define bM4_USF_HCTSIZ7_PKTCNT6                         *((volatile unsigned int*)(0x4380BE64UL))
#define bM4_USF_HCTSIZ7_PKTCNT7                         *((volatile unsigned int*)(0x4380BE68UL))
#define bM4_USF_HCTSIZ7_PKTCNT8                         *((volatile unsigned int*)(0x4380BE6CUL))
#define bM4_USF_HCTSIZ7_PKTCNT9                         *((volatile unsigned int*)(0x4380BE70UL))
#define bM4_USF_HCTSIZ7_PID0                            *((volatile unsigned int*)(0x4380BE74UL))
#define bM4_USF_HCTSIZ7_PID1                            *((volatile unsigned int*)(0x4380BE78UL))
#define bM4_USF_HCTSIZ7_DOPNG                           *((volatile unsigned int*)(0x4380BE7CUL))
#define bM4_USF_HCCHAR8_MPS0                            *((volatile unsigned int*)(0x4380C000UL))
#define bM4_USF_HCCHAR8_MPS1                            *((volatile unsigned int*)(0x4380C004UL))
#define bM4_USF_HCCHAR8_MPS2                            *((volatile unsigned int*)(0x4380C008UL))
#define bM4_USF_HCCHAR8_MPS3                            *((volatile unsigned int*)(0x4380C00CUL))
#define bM4_USF_HCCHAR8_MPS4                            *((volatile unsigned int*)(0x4380C010UL))
#define bM4_USF_HCCHAR8_MPS5                            *((volatile unsigned int*)(0x4380C014UL))
#define bM4_USF_HCCHAR8_MPS6                            *((volatile unsigned int*)(0x4380C018UL))
#define bM4_USF_HCCHAR8_MPS7                            *((volatile unsigned int*)(0x4380C01CUL))
#define bM4_USF_HCCHAR8_MPS8                            *((volatile unsigned int*)(0x4380C020UL))
#define bM4_USF_HCCHAR8_MPS9                            *((volatile unsigned int*)(0x4380C024UL))
#define bM4_USF_HCCHAR8_MPS10                           *((volatile unsigned int*)(0x4380C028UL))
#define bM4_USF_HCCHAR8_EPNUM0                          *((volatile unsigned int*)(0x4380C02CUL))
#define bM4_USF_HCCHAR8_EPNUM1                          *((volatile unsigned int*)(0x4380C030UL))
#define bM4_USF_HCCHAR8_EPNUM2                          *((volatile unsigned int*)(0x4380C034UL))
#define bM4_USF_HCCHAR8_EPNUM3                          *((volatile unsigned int*)(0x4380C038UL))
#define bM4_USF_HCCHAR8_EPDIR                           *((volatile unsigned int*)(0x4380C03CUL))
#define bM4_USF_HCCHAR8_LSPDDEV                         *((volatile unsigned int*)(0x4380C044UL))
#define bM4_USF_HCCHAR8_EPTYPE0                         *((volatile unsigned int*)(0x4380C048UL))
#define bM4_USF_HCCHAR8_EPTYPE1                         *((volatile unsigned int*)(0x4380C04CUL))
#define bM4_USF_HCCHAR8_EC0                             *((volatile unsigned int*)(0x4380C050UL))
#define bM4_USF_HCCHAR8_EC1                             *((volatile unsigned int*)(0x4380C054UL))
#define bM4_USF_HCCHAR8_DEVADDR0                        *((volatile unsigned int*)(0x4380C058UL))
#define bM4_USF_HCCHAR8_DEVADDR1                        *((volatile unsigned int*)(0x4380C05CUL))
#define bM4_USF_HCCHAR8_DEVADDR2                        *((volatile unsigned int*)(0x4380C060UL))
#define bM4_USF_HCCHAR8_DEVADDR3                        *((volatile unsigned int*)(0x4380C064UL))
#define bM4_USF_HCCHAR8_DEVADDR4                        *((volatile unsigned int*)(0x4380C068UL))
#define bM4_USF_HCCHAR8_DEVADDR5                        *((volatile unsigned int*)(0x4380C06CUL))
