RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_HCCHAR8_DEVADDR6                        *((volatile unsigned int*)(0x4380C070UL))
#define bM4_USF_HCCHAR8_ODDFRM                          *((volatile unsigned int*)(0x4380C074UL))
#define bM4_USF_HCCHAR8_CHDIS                           *((volatile unsigned int*)(0x4380C078UL))
#define bM4_USF_HCCHAR8_CHENA                           *((volatile unsigned int*)(0x4380C07CUL))
#define bM4_USF_HCSPLT8_PRTADDR0                        *((volatile unsigned int*)(0x4380C080UL))
#define bM4_USF_HCSPLT8_PRTADDR1                        *((volatile unsigned int*)(0x4380C084UL))
#define bM4_USF_HCSPLT8_PRTADDR2                        *((volatile unsigned int*)(0x4380C088UL))
#define bM4_USF_HCSPLT8_PRTADDR3                        *((volatile unsigned int*)(0x4380C08CUL))
#define bM4_USF_HCSPLT8_PRTADDR4                        *((volatile unsigned int*)(0x4380C090UL))
#define bM4_USF_HCSPLT8_PRTADDR5                        *((volatile unsigned int*)(0x4380C094UL))
#define bM4_USF_HCSPLT8_PRTADDR6                        *((volatile unsigned int*)(0x4380C098UL))
#define bM4_USF_HCSPLT8_HUBADDR0                        *((volatile unsigned int*)(0x4380C09CUL))
#define bM4_USF_HCSPLT8_HUBADDR1                        *((volatile unsigned int*)(0x4380C0A0UL))
#define bM4_USF_HCSPLT8_HUBADDR2                        *((volatile unsigned int*)(0x4380C0A4UL))
#define bM4_USF_HCSPLT8_HUBADDR3                        *((volatile unsigned int*)(0x4380C0A8UL))
#define bM4_USF_HCSPLT8_HUBADDR4                        *((volatile unsigned int*)(0x4380C0ACUL))
#define bM4_USF_HCSPLT8_HUBADDR5                        *((volatile unsigned int*)(0x4380C0B0UL))
#define bM4_USF_HCSPLT8_HUBADDR6                        *((volatile unsigned int*)(0x4380C0B4UL))
#define bM4_USF_HCSPLT8_XACTPOS0                        *((volatile unsigned int*)(0x4380C0B8UL))
#define bM4_USF_HCSPLT8_XACTPOS1                        *((volatile unsigned int*)(0x4380C0BCUL))
#define bM4_USF_HCSPLT8_COMPSPLT                        *((volatile unsigned int*)(0x4380C0C0UL))
#define bM4_USF_HCSPLT8_RESV                            *((volatile unsigned int*)(0x4380C0E0UL))
#define bM4_USF_HCSPLT8_SPLTENA                         *((volatile unsigned int*)(0x4380C0FCUL))
#define bM4_USF_HCINT8_XFERCOMPL                        *((volatile unsigned int*)(0x4380C100UL))
#define bM4_USF_HCINT8_CHHLTD                           *((volatile unsigned int*)(0x4380C104UL))
#define bM4_USF_HCINT8_AHBERR                           *((volatile unsigned int*)(0x4380C108UL))
#define bM4_USF_HCINT8_STALL                            *((volatile unsigned int*)(0x4380C10CUL))
#define bM4_USF_HCINT8_NAK                              *((volatile unsigned int*)(0x4380C110UL))
#define bM4_USF_HCINT8_ACK                              *((volatile unsigned int*)(0x4380C114UL))
#define bM4_USF_HCINT8_NYET                             *((volatile unsigned int*)(0x4380C118UL))
#define bM4_USF_HCINT8_XACTERR                          *((volatile unsigned int*)(0x4380C11CUL))
#define bM4_USF_HCINT8_BBLERR                           *((volatile unsigned int*)(0x4380C120UL))
#define bM4_USF_HCINT8_FRMOVRUN                         *((volatile unsigned int*)(0x4380C124UL))
#define bM4_USF_HCINT8_DATATGLERR                       *((volatile unsigned int*)(0x4380C128UL))
#define bM4_USF_HCINTMSK8_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4380C180UL))
#define bM4_USF_HCINTMSK8_CHHLTDMSK                     *((volatile unsigned int*)(0x4380C184UL))
#define bM4_USF_HCINTMSK8_AHBERRMSK                     *((volatile unsigned int*)(0x4380C188UL))
#define bM4_USF_HCINTMSK8_STALLMSK                      *((volatile unsigned int*)(0x4380C18CUL))
#define bM4_USF_HCINTMSK8_NAKMSK                        *((volatile unsigned int*)(0x4380C190UL))
#define bM4_USF_HCINTMSK8_ACKMSK                        *((volatile unsigned int*)(0x4380C194UL))
#define bM4_USF_HCINTMSK8_NYETMSK                       *((volatile unsigned int*)(0x4380C198UL))
#define bM4_USF_HCINTMSK8_XACTERRMSK                    *((volatile unsigned int*)(0x4380C19CUL))
#define bM4_USF_HCINTMSK8_BBLERRMSK                     *((volatile unsigned int*)(0x4380C1A0UL))
#define bM4_USF_HCINTMSK8_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4380C1A4UL))
#define bM4_USF_HCINTMSK8_DATATGLERRMSK                 *((volatile unsigned int*)(0x4380C1A8UL))
#define bM4_USF_HCTSIZ8_XFERSIZE0                       *((volatile unsigned int*)(0x4380C200UL))
#define bM4_USF_HCTSIZ8_XFERSIZE1                       *((volatile unsigned int*)(0x4380C204UL))
#define bM4_USF_HCTSIZ8_XFERSIZE2                       *((volatile unsigned int*)(0x4380C208UL))
#define bM4_USF_HCTSIZ8_XFERSIZE3                       *((volatile unsigned int*)(0x4380C20CUL))
#define bM4_USF_HCTSIZ8_XFERSIZE4                       *((volatile unsigned int*)(0x4380C210UL))
#define bM4_USF_HCTSIZ8_XFERSIZE5                       *((volatile unsigned int*)(0x4380C214UL))
#define bM4_USF_HCTSIZ8_XFERSIZE6                       *((volatile unsigned int*)(0x4380C218UL))
#define bM4_USF_HCTSIZ8_XFERSIZE7                       *((volatile unsigned int*)(0x4380C21CUL))
#define bM4_USF_HCTSIZ8_XFERSIZE8                       *((volatile unsigned int*)(0x4380C220UL))
#define bM4_USF_HCTSIZ8_XFERSIZE9                       *((volatile unsigned int*)(0x4380C224UL))
#define bM4_USF_HCTSIZ8_XFERSIZE10                      *((volatile unsigned int*)(0x4380C228UL))
#define bM4_USF_HCTSIZ8_XFERSIZE11                      *((volatile unsigned int*)(0x4380C22CUL))
#define bM4_USF_HCTSIZ8_XFERSIZE12                      *((volatile unsigned int*)(0x4380C230UL))
#define bM4_USF_HCTSIZ8_XFERSIZE13                      *((volatile unsigned int*)(0x4380C234UL))
#define bM4_USF_HCTSIZ8_XFERSIZE14                      *((volatile unsigned int*)(0x4380C238UL))
#define bM4_USF_HCTSIZ8_XFERSIZE15                      *((volatile unsigned int*)(0x4380C23CUL))
#define bM4_USF_HCTSIZ8_XFERSIZE16                      *((volatile unsigned int*)(0x4380C240UL))
#define bM4_USF_HCTSIZ8_XFERSIZE17                      *((volatile unsigned int*)(0x4380C244UL))
#define bM4_USF_HCTSIZ8_XFERSIZE18                      *((volatile unsigned int*)(0x4380C248UL))
#define bM4_USF_HCTSIZ8_PKTCNT0                         *((volatile unsigned int*)(0x4380C24CUL))
#define bM4_USF_HCTSIZ8_PKTCNT1                         *((volatile unsigned int*)(0x4380C250UL))
#define bM4_USF_HCTSIZ8_PKTCNT2                         *((volatile unsigned int*)(0x4380C254UL))
#define bM4_USF_HCTSIZ8_PKTCNT3                         *((volatile unsigned int*)(0x4380C258UL))
#define bM4_USF_HCTSIZ8_PKTCNT4                         *((volatile unsigned int*)(0x4380C25CUL))
#define bM4_USF_HCTSIZ8_PKTCNT5                         *((volatile unsigned int*)(0x4380C260UL))
#define bM4_USF_HCTSIZ8_PKTCNT6                         *((volatile unsigned int*)(0x4380C264UL))
#define bM4_USF_HCTSIZ8_PKTCNT7                         *((volatile unsigned int*)(0x4380C268UL))
#define bM4_USF_HCTSIZ8_PKTCNT8                         *((volatile unsigned int*)(0x4380C26CUL))
#define bM4_USF_HCTSIZ8_PKTCNT9                         *((volatile unsigned int*)(0x4380C270UL))
#define bM4_USF_HCTSIZ8_PID0                            *((volatile unsigned int*)(0x4380C274UL))
#define bM4_USF_HCTSIZ8_PID1                            *((volatile unsigned int*)(0x4380C278UL))
#define bM4_USF_HCTSIZ8_DOPNG                           *((volatile unsigned int*)(0x4380C27CUL))
#define bM4_USF_HCCHAR9_MPS0                            *((volatile unsigned int*)(0x4380C400UL))
#define bM4_USF_HCCHAR9_MPS1                            *((volatile unsigned int*)(0x4380C404UL))
#define bM4_USF_HCCHAR9_MPS2                            *((volatile unsigned int*)(0x4380C408UL))
#define bM4_USF_HCCHAR9_MPS3                            *((volatile unsigned int*)(0x4380C40CUL))
#define bM4_USF_HCCHAR9_MPS4                            *((volatile unsigned int*)(0x4380C410UL))
#define bM4_USF_HCCHAR9_MPS5                            *((volatile unsigned int*)(0x4380C414UL))
#define bM4_USF_HCCHAR9_MPS6                            *((volatile unsigned int*)(0x4380C418UL))
#define bM4_USF_HCCHAR9_MPS7                            *((volatile unsigned int*)(0x4380C41CUL))
#define bM4_USF_HCCHAR9_MPS8                            *((volatile unsigned int*)(0x4380C420UL))
#define bM4_USF_HCCHAR9_MPS9                            *((volatile unsigned int*)(0x4380C424UL))
#define bM4_USF_HCCHAR9_MPS10                           *((volatile unsigned int*)(0x4380C428UL))
#define bM4_USF_HCCHAR9_EPNUM0                          *((volatile unsigned int*)(0x4380C42CUL))
#define bM4_USF_HCCHAR9_EPNUM1                          *((volatile unsigned int*)(0x4380C430UL))
#define bM4_USF_HCCHAR9_EPNUM2                          *((volatile unsigned int*)(0x4380C434UL))
#define bM4_USF_HCCHAR9_EPNUM3                          *((volatile unsigned int*)(0x4380C438UL))
#define bM4_USF_HCCHAR9_EPDIR                           *((volatile unsigned int*)(0x4380C43CUL))
#define bM4_USF_HCCHAR9_LSPDDEV                         *((volatile unsigned int*)(0x4380C444UL))
#define bM4_USF_HCCHAR9_EPTYPE0                         *((volatile unsigned int*)(0x4380C448UL))
#define bM4_USF_HCCHAR9_EPTYPE1                         *((volatile unsigned int*)(0x4380C44CUL))
#define bM4_USF_HCCHAR9_EC0                             *((volatile unsigned int*)(0x4380C450UL))
#define bM4_USF_HCCHAR9_EC1                             *((volatile unsigned int*)(0x4380C454UL))
#define bM4_USF_HCCHAR9_DEVADDR0                        *((volatile unsigned int*)(0x4380C458UL))
#define bM4_USF_HCCHAR9_DEVADDR1                        *((volatile unsigned int*)(0x4380C45CUL))
#define bM4_USF_HCCHAR9_DEVADDR2                        *((volatile unsigned int*)(0x4380C460UL))
#define bM4_USF_HCCHAR9_DEVADDR3                        *((volatile unsigned int*)(0x4380C464UL))
#define bM4_USF_HCCHAR9_DEVADDR4                        *((volatile unsigned int*)(0x4380C468UL))
#define bM4_USF_HCCHAR9_DEVADDR5                        *((volatile unsigned int*)(0x4380C46CUL))
#define bM4_USF_HCCHAR9_DEVADDR6                        *((volatile unsigned int*)(0x4380C470UL))
#define bM4_USF_HCCHAR9_ODDFRM                          *((volatile unsigned int*)(0x4380C474UL))
#define bM4_USF_HCCHAR9_CHDIS                           *((volatile unsigned int*)(0x4380C478UL))
#define bM4_USF_HCCHAR9_CHENA                           *((volatile unsigned int*)(0x4380C47CUL))
#define bM4_USF_HCSPLT9_PRTADDR0                        *((volatile unsigned int*)(0x4380C480UL))
#define bM4_USF_HCSPLT9_PRTADDR1                        *((volatile unsigned int*)(0x4380C484UL))
#define bM4_USF_HCSPLT9_PRTADDR2                        *((volatile unsigned int*)(0x4380C488UL))
#define bM4_USF_HCSPLT9_PRTADDR3                        *((volatile unsigned int*)(0x4380C48CUL))
#define bM4_USF_HCSPLT9_PRTADDR4                        *((volatile unsigned int*)(0x4380C490UL))
#define bM4_USF_HCSPLT9_PRTADDR5                        *((volatile unsigned int*)(0x4380C494UL))
#define bM4_USF_HCSPLT9_PRTADDR6                        *((volatile unsigned int*)(0x4380C498UL))
#define bM4_USF_HCSPLT9_HUBADDR0                        *((volatile unsigned int*)(0x4380C49CUL))
#define bM4_USF_HCSPLT9_HUBADDR1                        *((volatile unsigned int*)(0x4380C4A0UL))
#define bM4_USF_HCSPLT9_HUBADDR2                        *((volatile unsigned int*)(0x4380C4A4UL))
#define bM4_USF_HCSPLT9_HUBADDR3                        *((volatile unsigned int*)(0x4380C4A8UL))
#define bM4_USF_HCSPLT9_HUBADDR4                        *((volatile unsigned int*)(0x4380C4ACUL))
#define bM4_USF_HCSPLT9_HUBADDR5                        *((volatile unsigned int*)(0x4380C4B0UL))
#define bM4_USF_HCSPLT9_HUBADDR6                        *((volatile unsigned int*)(0x4380C4B4UL))
#define bM4_USF_HCSPLT9_XACTPOS0                        *((volatile unsigned int*)(0x4380C4B8UL))
#define bM4_USF_HCSPLT9_XACTPOS1                        *((volatile unsigned int*)(0x4380C4BCUL))
#define bM4_USF_HCSPLT9_COMPSPLT                        *((volatile unsigned int*)(0x4380C4C0UL))
#define bM4_USF_HCSPLT9_RESV                            *((volatile unsigned int*)(0x4380C4E0UL))
#define bM4_USF_HCSPLT9_SPLTENA                         *((volatile unsigned int*)(0x4380C4FCUL))
#define bM4_USF_HCINT9_XFERCOMPL                        *((volatile unsigned int*)(0x4380C500UL))
#define bM4_USF_HCINT9_CHHLTD                           *((volatile unsigned int*)(0x4380C504UL))
#define bM4_USF_HCINT9_AHBERR                           *((volatile unsigned int*)(0x4380C508UL))
#define bM4_USF_HCINT9_STALL                            *((volatile unsigned int*)(0x4380C50CUL))
#define bM4_USF_HCINT9_NAK                              *((volatile unsigned int*)(0x4380C510UL))
#define bM4_USF_HCINT9_ACK                              *((volatile unsigned int*)(0x4380C514UL))
#define bM4_USF_HCINT9_NYET                             *((volatile unsigned int*)(0x4380C518UL))
#define bM4_USF_HCINT9_XACTERR                          *((volatile unsigned int*)(0x4380C51CUL))
#define bM4_USF_HCINT9_BBLERR                           *((volatile unsigned int*)(0x4380C520UL))
#define bM4_USF_HCINT9_FRMOVRUN                         *((volatile unsigned int*)(0x4380C524UL))
#define bM4_USF_HCINT9_DATATGLERR                       *((volatile unsigned int*)(0x4380C528UL))
#define bM4_USF_HCINTMSK9_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4380C580UL))
#define bM4_USF_HCINTMSK9_CHHLTDMSK                     *((volatile unsigned int*)(0x4380C584UL))
#define bM4_USF_HCINTMSK9_AHBERRMSK                     *((volatile unsigned int*)(0x4380C588UL))
#define bM4_USF_HCINTMSK9_STALLMSK                      *((volatile unsigned int*)(0x4380C58CUL))
#define bM4_USF_HCINTMSK9_NAKMSK                        *((volatile unsigned int*)(0x4380C590UL))
#define bM4_USF_HCINTMSK9_ACKMSK                        *((volatile unsigned int*)(0x4380C594UL))
#define bM4_USF_HCINTMSK9_NYETMSK                       *((volatile unsigned int*)(0x4380C598UL))
#define bM4_USF_HCINTMSK9_XACTERRMSK                    *((volatile unsigned int*)(0x4380C59CUL))
#define bM4_USF_HCINTMSK9_BBLERRMSK                     *((volatile unsigned int*)(0x4380C5A0UL))
#define bM4_USF_HCINTMSK9_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4380C5A4UL))
#define bM4_USF_HCINTMSK9_DATATGLERRMSK                 *((volatile unsigned int*)(0x4380C5A8UL))
#define bM4_USF_HCTSIZ9_XFERSIZE0                       *((volatile unsigned int*)(0x4380C600UL))
#define bM4_USF_HCTSIZ9_XFERSIZE1                       *((volatile unsigned int*)(0x4380C604UL))
#define bM4_USF_HCTSIZ9_XFERSIZE2                       *((volatile unsigned int*)(0x4380C608UL))
#define bM4_USF_HCTSIZ9_XFERSIZE3                       *((volatile unsigned int*)(0x4380C60CUL))
#define bM4_USF_HCTSIZ9_XFERSIZE4                       *((volatile unsigned int*)(0x4380C610UL))
#define bM4_USF_HCTSIZ9_XFERSIZE5                       *((volatile unsigned int*)(0x4380C614UL))
#define bM4_USF_HCTSIZ9_XFERSIZE6                       *((volatile unsigned int*)(0x4380C618UL))
#define bM4_USF_HCTSIZ9_XFERSIZE7                       *((volatile unsigned int*)(0x4380C61CUL))
#define bM4_USF_HCTSIZ9_XFERSIZE8                       *((volatile unsigned int*)(0x4380C620UL))
#define bM4_USF_HCTSIZ9_XFERSIZE9                       *((volatile unsigned int*)(0x4380C624UL))
#define bM4_USF_HCTSIZ9_XFERSIZE10                      *((volatile unsigned int*)(0x4380C628UL))
#define bM4_USF_HCTSIZ9_XFERSIZE11                      *((volatile unsigned int*)(0x4380C62CUL))
#define bM4_USF_HCTSIZ9_XFERSIZE12                      *((volatile unsigned int*)(0x4380C630UL))
#define bM4_USF_HCTSIZ9_XFERSIZE13                      *((volatile unsigned int*)(0x4380C634UL))
#define bM4_USF_HCTSIZ9_XFERSIZE14                      *((volatile unsigned int*)(0x4380C638UL))
#define bM4_USF_HCTSIZ9_XFERSIZE15                      *((volatile unsigned int*)(0x4380C63CUL))
#define bM4_USF_HCTSIZ9_XFERSIZE16                      *((volatile unsigned int*)(0x4380C640UL))
#define bM4_USF_HCTSIZ9_XFERSIZE17                      *((volatile unsigned int*)(0x4380C644UL))
#define bM4_USF_HCTSIZ9_XFERSIZE18                      *((volatile unsigned int*)(0x4380C648UL))
#define bM4_USF_HCTSIZ9_PKTCNT0                         *((volatile unsigned int*)(0x4380C64CUL))
#define bM4_USF_HCTSIZ9_PKTCNT1                         *((volatile unsigned int*)(0x4380C650UL))
#define bM4_USF_HCTSIZ9_PKTCNT2                         *((volatile unsigned int*)(0x4380C654UL))
#define bM4_USF_HCTSIZ9_PKTCNT3                         *((volatile unsigned int*)(0x4380C658UL))
#define bM4_USF_HCTSIZ9_PKTCNT4                         *((volatile unsigned int*)(0x4380C65CUL))
#define bM4_USF_HCTSIZ9_PKTCNT5                         *((volatile unsigned int*)(0x4380C660UL))
#define bM4_USF_HCTSIZ9_PKTCNT6                         *((volatile unsigned int*)(0x4380C664UL))
#define bM4_USF_HCTSIZ9_PKTCNT7                         *((volatile unsigned int*)(0x4380C668UL))
#define bM4_USF_HCTSIZ9_PKTCNT8                         *((volatile unsigned int*)(0x4380C66CUL))
#define bM4_USF_HCTSIZ9_PKTCNT9                         *((volatile unsigned int*)(0x4380C670UL))
#define bM4_USF_HCTSIZ9_PID0                            *((volatile unsigned int*)(0x4380C674UL))
#define bM4_USF_HCTSIZ9_PID1                            *((volatile unsigned int*)(0x4380C678UL))
#define bM4_USF_HCTSIZ9_DOPNG                           *((volatile unsigned int*)(0x4380C67CUL))
#define bM4_USF_HCCHAR10_MPS0                           *((volatile unsigned int*)(0x4380C800UL))
#define bM4_USF_HCCHAR10_MPS1                           *((volatile unsigned int*)(0x4380C804UL))
#define bM4_USF_HCCHAR10_MPS2                           *((volatile unsigned int*)(0x4380C808UL))
#define bM4_USF_HCCHAR10_MPS3                           *((volatile unsigned int*)(0x4380C80CUL))
#define bM4_USF_HCCHAR10_MPS4                           *((volatile unsigned int*)(0x4380C810UL))
#define bM4_USF_HCCHAR10_MPS5                           *((volatile unsigned int*)(0x4380C814UL))
#define bM4_USF_HCCHAR10_MPS6                           *((volatile unsigned int*)(0x4380C818UL))
#define bM4_USF_HCCHAR10_MPS7                           *((volatile unsigned int*)(0x4380C81CUL))
#define bM4_USF_HCCHAR10_MPS8                           *((volatile unsigned int*)(0x4380C820UL))
#define bM4_USF_HCCHAR10_MPS9                           *((volatile unsigned int*)(0x4380C824UL))
#define bM4_USF_HCCHAR10_MPS10                          *((volatile unsigned int*)(0x4380C828UL))
#define bM4_USF_HCCHAR10_EPNUM0                         *((volatile unsigned int*)(0x4380C82CUL))
#define bM4_USF_HCCHAR10_EPNUM1                         *((volatile unsigned int*)(0x4380C830UL))
#define bM4_USF_HCCHAR10_EPNUM2                         *((volatile unsigned int*)(0x4380C834UL))
#define bM4_USF_HCCHAR10_EPNUM3                         *((volatile unsigned int*)(0x4380C838UL))
#define bM4_USF_HCCHAR10_EPDIR                          *((volatile unsigned int*)(0x4380C83CUL))
#define bM4_USF_HCCHAR10_LSPDDEV                        *((volatile unsigned int*)(0x4380C844UL))
#define bM4_USF_HCCHAR10_EPTYPE0                        *((volatile unsigned int*)(0x4380C848UL))
#define bM4_USF_HCCHAR10_EPTYPE1                        *((volatile unsigned int*)(0x4380C84CUL))
#define bM4_USF_HCCHAR10_EC0                            *((volatile unsigned int*)(0x4380C850UL))
#define bM4_USF_HCCHAR10_EC1                            *((volatile unsigned int*)(0x4380C854UL))
#define bM4_USF_HCCHAR10_DEVADDR0                       *((volatile unsigned int*)(0x4380C858UL))
#define bM4_USF_HCCHAR10_DEVADDR1                       *((volatile unsigned int*)(0x4380C85CUL))
#define bM4_USF_HCCHAR10_DEVADDR2                       *((volatile unsigned int*)(0x4380C860UL))
#define bM4_USF_HCCHAR10_DEVADDR3                       *((volatile unsigned int*)(0x4380C864UL))
#define bM4_USF_HCCHAR10_DEVADDR4                       *((volatile unsigned int*)(0x4380C868UL))
#define bM4_USF_HCCHAR10_DEVADDR5                       *((volatile unsigned int*)(0x4380C86CUL))
#define bM4_USF_HCCHAR10_DEVADDR6                       *((volatile unsigned int*)(0x4380C870UL))
#define bM4_USF_HCCHAR10_ODDFRM                         *((volatile unsigned int*)(0x4380C874UL))
#define bM4_USF_HCCHAR10_CHDIS                          *((volatile unsigned int*)(0x4380C878UL))
#define bM4_USF_HCCHAR10_CHENA                          *((volatile unsigned int*)(0x4380C87CUL))
#define bM4_USF_HCSPLT10_PRTADDR0                       *((volatile unsigned int*)(0x4380C880UL))
#define bM4_USF_HCSPLT10_PRTADDR1                       *((volatile unsigned int*)(0x4380C884UL))
#define bM4_USF_HCSPLT10_PRTADDR2                       *((volatile unsigned int*)(0x4380C888UL))
#define bM4_USF_HCSPLT10_PRTADDR3                       *((volatile unsigned int*)(0x4380C88CUL))
#define bM4_USF_HCSPLT10_PRTADDR4                       *((volatile unsigned int*)(0x4380C890UL))
#define bM4_USF_HCSPLT10_PRTADDR5                       *((volatile unsigned int*)(0x4380C894UL))
#define bM4_USF_HCSPLT10_PRTADDR6                       *((volatile unsigned int*)(0x4380C898UL))
#define bM4_USF_HCSPLT10_HUBADDR0                       *((volatile unsigned int*)(0x4380C89CUL))
#define bM4_USF_HCSPLT10_HUBADDR1                       *((volatile unsigned int*)(0x4380C8A0UL))
#define bM4_USF_HCSPLT10_HUBADDR2                       *((volatile unsigned int*)(0x4380C8A4UL))
#define bM4_USF_HCSPLT10_HUBADDR3                       *((volatile unsigned int*)(0x4380C8A8UL))
#define bM4_USF_HCSPLT10_HUBADDR4                       *((volatile unsigned int*)(0x4380C8ACUL))
#define bM4_USF_HCSPLT10_HUBADDR5                       *((volatile unsigned int*)(0x4380C8B0UL))
#define bM4_USF_HCSPLT10_HUBADDR6                       *((volatile unsigned int*)(0x4380C8B4UL))
#define bM4_USF_HCSPLT10_XACTPOS0                       *((volatile unsigned int*)(0x4380C8B8UL))
#define bM4_USF_HCSPLT10_XACTPOS1                       *((volatile unsigned int*)(0x4380C8BCUL))
#define bM4_USF_HCSPLT10_COMPSPLT                       *((volatile unsigned int*)(0x4380C8C0UL))
#define bM4_USF_HCSPLT10_RESV                           *((volatile unsigned int*)(0x4380C8E0UL))
#define bM4_USF_HCSPLT10_SPLTENA                        *((volatile unsigned int*)(0x4380C8FCUL))
#define bM4_USF_HCINT10_XFERCOMPL                       *((volatile unsigned int*)(0x4380C900UL))
#define bM4_USF_HCINT10_CHHLTD                          *((volatile unsigned int*)(0x4380C904UL))
#define bM4_USF_HCINT10_AHBERR                          *((volatile unsigned int*)(0x4380C908UL))
#define bM4_USF_HCINT10_STALL                           *((volatile unsigned int*)(0x4380C90CUL))
#define bM4_USF_HCINT10_NAK                             *((volatile unsigned int*)(0x4380C910UL))
#define bM4_USF_HCINT10_ACK                             *((volatile unsigned int*)(0x4380C914UL))
#define bM4_USF_HCINT10_NYET                            *((volatile unsigned int*)(0x4380C918UL))
#define bM4_USF_HCINT10_XACTERR                         *((volatile unsigned int*)(0x4380C91CUL))
#define bM4_USF_HCINT10_BBLERR                          *((volatile unsigned int*)(0x4380C920UL))
#define bM4_USF_HCINT10_FRMOVRUN                        *((volatile unsigned int*)(0x4380C924UL))
#define bM4_USF_HCINT10_DATATGLERR                      *((volatile unsigned int*)(0x4380C928UL))
#define bM4_USF_HCINTMSK10_XFERCOMPLMSK                 *((volatile unsigned int*)(0x4380C980UL))
#define bM4_USF_HCINTMSK10_CHHLTDMSK                    *((volatile unsigned int*)(0x4380C984UL))
