RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_HCINTMSK10_AHBERRMSK                    *((volatile unsigned int*)(0x4380C988UL))
#define bM4_USF_HCINTMSK10_STALLMSK                     *((volatile unsigned int*)(0x4380C98CUL))
#define bM4_USF_HCINTMSK10_NAKMSK                       *((volatile unsigned int*)(0x4380C990UL))
#define bM4_USF_HCINTMSK10_ACKMSK                       *((volatile unsigned int*)(0x4380C994UL))
#define bM4_USF_HCINTMSK10_NYETMSK                      *((volatile unsigned int*)(0x4380C998UL))
#define bM4_USF_HCINTMSK10_XACTERRMSK                   *((volatile unsigned int*)(0x4380C99CUL))
#define bM4_USF_HCINTMSK10_BBLERRMSK                    *((volatile unsigned int*)(0x4380C9A0UL))
#define bM4_USF_HCINTMSK10_FRMOVRUNMSK                  *((volatile unsigned int*)(0x4380C9A4UL))
#define bM4_USF_HCINTMSK10_DATATGLERRMSK                *((volatile unsigned int*)(0x4380C9A8UL))
#define bM4_USF_HCTSIZ10_XFERSIZE0                      *((volatile unsigned int*)(0x4380CA00UL))
#define bM4_USF_HCTSIZ10_XFERSIZE1                      *((volatile unsigned int*)(0x4380CA04UL))
#define bM4_USF_HCTSIZ10_XFERSIZE2                      *((volatile unsigned int*)(0x4380CA08UL))
#define bM4_USF_HCTSIZ10_XFERSIZE3                      *((volatile unsigned int*)(0x4380CA0CUL))
#define bM4_USF_HCTSIZ10_XFERSIZE4                      *((volatile unsigned int*)(0x4380CA10UL))
#define bM4_USF_HCTSIZ10_XFERSIZE5                      *((volatile unsigned int*)(0x4380CA14UL))
#define bM4_USF_HCTSIZ10_XFERSIZE6                      *((volatile unsigned int*)(0x4380CA18UL))
#define bM4_USF_HCTSIZ10_XFERSIZE7                      *((volatile unsigned int*)(0x4380CA1CUL))
#define bM4_USF_HCTSIZ10_XFERSIZE8                      *((volatile unsigned int*)(0x4380CA20UL))
#define bM4_USF_HCTSIZ10_XFERSIZE9                      *((volatile unsigned int*)(0x4380CA24UL))
#define bM4_USF_HCTSIZ10_XFERSIZE10                     *((volatile unsigned int*)(0x4380CA28UL))
#define bM4_USF_HCTSIZ10_XFERSIZE11                     *((volatile unsigned int*)(0x4380CA2CUL))
#define bM4_USF_HCTSIZ10_XFERSIZE12                     *((volatile unsigned int*)(0x4380CA30UL))
#define bM4_USF_HCTSIZ10_XFERSIZE13                     *((volatile unsigned int*)(0x4380CA34UL))
#define bM4_USF_HCTSIZ10_XFERSIZE14                     *((volatile unsigned int*)(0x4380CA38UL))
#define bM4_USF_HCTSIZ10_XFERSIZE15                     *((volatile unsigned int*)(0x4380CA3CUL))
#define bM4_USF_HCTSIZ10_XFERSIZE16                     *((volatile unsigned int*)(0x4380CA40UL))
#define bM4_USF_HCTSIZ10_XFERSIZE17                     *((volatile unsigned int*)(0x4380CA44UL))
#define bM4_USF_HCTSIZ10_XFERSIZE18                     *((volatile unsigned int*)(0x4380CA48UL))
#define bM4_USF_HCTSIZ10_PKTCNT0                        *((volatile unsigned int*)(0x4380CA4CUL))
#define bM4_USF_HCTSIZ10_PKTCNT1                        *((volatile unsigned int*)(0x4380CA50UL))
#define bM4_USF_HCTSIZ10_PKTCNT2                        *((volatile unsigned int*)(0x4380CA54UL))
#define bM4_USF_HCTSIZ10_PKTCNT3                        *((volatile unsigned int*)(0x4380CA58UL))
#define bM4_USF_HCTSIZ10_PKTCNT4                        *((volatile unsigned int*)(0x4380CA5CUL))
#define bM4_USF_HCTSIZ10_PKTCNT5                        *((volatile unsigned int*)(0x4380CA60UL))
#define bM4_USF_HCTSIZ10_PKTCNT6                        *((volatile unsigned int*)(0x4380CA64UL))
#define bM4_USF_HCTSIZ10_PKTCNT7                        *((volatile unsigned int*)(0x4380CA68UL))
#define bM4_USF_HCTSIZ10_PKTCNT8                        *((volatile unsigned int*)(0x4380CA6CUL))
#define bM4_USF_HCTSIZ10_PKTCNT9                        *((volatile unsigned int*)(0x4380CA70UL))
#define bM4_USF_HCTSIZ10_PID0                           *((volatile unsigned int*)(0x4380CA74UL))
#define bM4_USF_HCTSIZ10_PID1                           *((volatile unsigned int*)(0x4380CA78UL))
#define bM4_USF_HCTSIZ10_DOPNG                          *((volatile unsigned int*)(0x4380CA7CUL))
#define bM4_USF_HCCHAR11_MPS0                           *((volatile unsigned int*)(0x4380CC00UL))
#define bM4_USF_HCCHAR11_MPS1                           *((volatile unsigned int*)(0x4380CC04UL))
#define bM4_USF_HCCHAR11_MPS2                           *((volatile unsigned int*)(0x4380CC08UL))
#define bM4_USF_HCCHAR11_MPS3                           *((volatile unsigned int*)(0x4380CC0CUL))
#define bM4_USF_HCCHAR11_MPS4                           *((volatile unsigned int*)(0x4380CC10UL))
#define bM4_USF_HCCHAR11_MPS5                           *((volatile unsigned int*)(0x4380CC14UL))
#define bM4_USF_HCCHAR11_MPS6                           *((volatile unsigned int*)(0x4380CC18UL))
#define bM4_USF_HCCHAR11_MPS7                           *((volatile unsigned int*)(0x4380CC1CUL))
#define bM4_USF_HCCHAR11_MPS8                           *((volatile unsigned int*)(0x4380CC20UL))
#define bM4_USF_HCCHAR11_MPS9                           *((volatile unsigned int*)(0x4380CC24UL))
#define bM4_USF_HCCHAR11_MPS10                          *((volatile unsigned int*)(0x4380CC28UL))
#define bM4_USF_HCCHAR11_EPNUM0                         *((volatile unsigned int*)(0x4380CC2CUL))
#define bM4_USF_HCCHAR11_EPNUM1                         *((volatile unsigned int*)(0x4380CC30UL))
#define bM4_USF_HCCHAR11_EPNUM2                         *((volatile unsigned int*)(0x4380CC34UL))
#define bM4_USF_HCCHAR11_EPNUM3                         *((volatile unsigned int*)(0x4380CC38UL))
#define bM4_USF_HCCHAR11_EPDIR                          *((volatile unsigned int*)(0x4380CC3CUL))
#define bM4_USF_HCCHAR11_LSPDDEV                        *((volatile unsigned int*)(0x4380CC44UL))
#define bM4_USF_HCCHAR11_EPTYPE0                        *((volatile unsigned int*)(0x4380CC48UL))
#define bM4_USF_HCCHAR11_EPTYPE1                        *((volatile unsigned int*)(0x4380CC4CUL))
#define bM4_USF_HCCHAR11_EC0                            *((volatile unsigned int*)(0x4380CC50UL))
#define bM4_USF_HCCHAR11_EC1                            *((volatile unsigned int*)(0x4380CC54UL))
#define bM4_USF_HCCHAR11_DEVADDR0                       *((volatile unsigned int*)(0x4380CC58UL))
#define bM4_USF_HCCHAR11_DEVADDR1                       *((volatile unsigned int*)(0x4380CC5CUL))
#define bM4_USF_HCCHAR11_DEVADDR2                       *((volatile unsigned int*)(0x4380CC60UL))
#define bM4_USF_HCCHAR11_DEVADDR3                       *((volatile unsigned int*)(0x4380CC64UL))
#define bM4_USF_HCCHAR11_DEVADDR4                       *((volatile unsigned int*)(0x4380CC68UL))
#define bM4_USF_HCCHAR11_DEVADDR5                       *((volatile unsigned int*)(0x4380CC6CUL))
#define bM4_USF_HCCHAR11_DEVADDR6                       *((volatile unsigned int*)(0x4380CC70UL))
#define bM4_USF_HCCHAR11_ODDFRM                         *((volatile unsigned int*)(0x4380CC74UL))
#define bM4_USF_HCCHAR11_CHDIS                          *((volatile unsigned int*)(0x4380CC78UL))
#define bM4_USF_HCCHAR11_CHENA                          *((volatile unsigned int*)(0x4380CC7CUL))
#define bM4_USF_HCSPLT11_PRTADDR0                       *((volatile unsigned int*)(0x4380CC80UL))
#define bM4_USF_HCSPLT11_PRTADDR1                       *((volatile unsigned int*)(0x4380CC84UL))
#define bM4_USF_HCSPLT11_PRTADDR2                       *((volatile unsigned int*)(0x4380CC88UL))
#define bM4_USF_HCSPLT11_PRTADDR3                       *((volatile unsigned int*)(0x4380CC8CUL))
#define bM4_USF_HCSPLT11_PRTADDR4                       *((volatile unsigned int*)(0x4380CC90UL))
#define bM4_USF_HCSPLT11_PRTADDR5                       *((volatile unsigned int*)(0x4380CC94UL))
#define bM4_USF_HCSPLT11_PRTADDR6                       *((volatile unsigned int*)(0x4380CC98UL))
#define bM4_USF_HCSPLT11_HUBADDR0                       *((volatile unsigned int*)(0x4380CC9CUL))
#define bM4_USF_HCSPLT11_HUBADDR1                       *((volatile unsigned int*)(0x4380CCA0UL))
#define bM4_USF_HCSPLT11_HUBADDR2                       *((volatile unsigned int*)(0x4380CCA4UL))
#define bM4_USF_HCSPLT11_HUBADDR3                       *((volatile unsigned int*)(0x4380CCA8UL))
#define bM4_USF_HCSPLT11_HUBADDR4                       *((volatile unsigned int*)(0x4380CCACUL))
#define bM4_USF_HCSPLT11_HUBADDR5                       *((volatile unsigned int*)(0x4380CCB0UL))
#define bM4_USF_HCSPLT11_HUBADDR6                       *((volatile unsigned int*)(0x4380CCB4UL))
#define bM4_USF_HCSPLT11_XACTPOS0                       *((volatile unsigned int*)(0x4380CCB8UL))
#define bM4_USF_HCSPLT11_XACTPOS1                       *((volatile unsigned int*)(0x4380CCBCUL))
#define bM4_USF_HCSPLT11_COMPSPLT                       *((volatile unsigned int*)(0x4380CCC0UL))
#define bM4_USF_HCSPLT11_RESV                           *((volatile unsigned int*)(0x4380CCE0UL))
#define bM4_USF_HCSPLT11_SPLTENA                        *((volatile unsigned int*)(0x4380CCFCUL))
#define bM4_USF_HCINT11_XFERCOMPL                       *((volatile unsigned int*)(0x4380CD00UL))
#define bM4_USF_HCINT11_CHHLTD                          *((volatile unsigned int*)(0x4380CD04UL))
#define bM4_USF_HCINT11_AHBERR                          *((volatile unsigned int*)(0x4380CD08UL))
#define bM4_USF_HCINT11_STALL                           *((volatile unsigned int*)(0x4380CD0CUL))
#define bM4_USF_HCINT11_NAK                             *((volatile unsigned int*)(0x4380CD10UL))
#define bM4_USF_HCINT11_ACK                             *((volatile unsigned int*)(0x4380CD14UL))
#define bM4_USF_HCINT11_NYET                            *((volatile unsigned int*)(0x4380CD18UL))
#define bM4_USF_HCINT11_XACTERR                         *((volatile unsigned int*)(0x4380CD1CUL))
#define bM4_USF_HCINT11_BBLERR                          *((volatile unsigned int*)(0x4380CD20UL))
#define bM4_USF_HCINT11_FRMOVRUN                        *((volatile unsigned int*)(0x4380CD24UL))
#define bM4_USF_HCINT11_DATATGLERR                      *((volatile unsigned int*)(0x4380CD28UL))
#define bM4_USF_HCINTMSK11_XFERCOMPLMSK                 *((volatile unsigned int*)(0x4380CD80UL))
#define bM4_USF_HCINTMSK11_CHHLTDMSK                    *((volatile unsigned int*)(0x4380CD84UL))
#define bM4_USF_HCINTMSK11_AHBERRMSK                    *((volatile unsigned int*)(0x4380CD88UL))
#define bM4_USF_HCINTMSK11_STALLMSK                     *((volatile unsigned int*)(0x4380CD8CUL))
#define bM4_USF_HCINTMSK11_NAKMSK                       *((volatile unsigned int*)(0x4380CD90UL))
#define bM4_USF_HCINTMSK11_ACKMSK                       *((volatile unsigned int*)(0x4380CD94UL))
#define bM4_USF_HCINTMSK11_NYETMSK                      *((volatile unsigned int*)(0x4380CD98UL))
#define bM4_USF_HCINTMSK11_XACTERRMSK                   *((volatile unsigned int*)(0x4380CD9CUL))
#define bM4_USF_HCINTMSK11_BBLERRMSK                    *((volatile unsigned int*)(0x4380CDA0UL))
#define bM4_USF_HCINTMSK11_FRMOVRUNMSK                  *((volatile unsigned int*)(0x4380CDA4UL))
#define bM4_USF_HCINTMSK11_DATATGLERRMSK                *((volatile unsigned int*)(0x4380CDA8UL))
#define bM4_USF_HCTSIZ11_XFERSIZE0                      *((volatile unsigned int*)(0x4380CE00UL))
#define bM4_USF_HCTSIZ11_XFERSIZE1                      *((volatile unsigned int*)(0x4380CE04UL))
#define bM4_USF_HCTSIZ11_XFERSIZE2                      *((volatile unsigned int*)(0x4380CE08UL))
#define bM4_USF_HCTSIZ11_XFERSIZE3                      *((volatile unsigned int*)(0x4380CE0CUL))
#define bM4_USF_HCTSIZ11_XFERSIZE4                      *((volatile unsigned int*)(0x4380CE10UL))
#define bM4_USF_HCTSIZ11_XFERSIZE5                      *((volatile unsigned int*)(0x4380CE14UL))
#define bM4_USF_HCTSIZ11_XFERSIZE6                      *((volatile unsigned int*)(0x4380CE18UL))
#define bM4_USF_HCTSIZ11_XFERSIZE7                      *((volatile unsigned int*)(0x4380CE1CUL))
#define bM4_USF_HCTSIZ11_XFERSIZE8                      *((volatile unsigned int*)(0x4380CE20UL))
#define bM4_USF_HCTSIZ11_XFERSIZE9                      *((volatile unsigned int*)(0x4380CE24UL))
#define bM4_USF_HCTSIZ11_XFERSIZE10                     *((volatile unsigned int*)(0x4380CE28UL))
#define bM4_USF_HCTSIZ11_XFERSIZE11                     *((volatile unsigned int*)(0x4380CE2CUL))
#define bM4_USF_HCTSIZ11_XFERSIZE12                     *((volatile unsigned int*)(0x4380CE30UL))
#define bM4_USF_HCTSIZ11_XFERSIZE13                     *((volatile unsigned int*)(0x4380CE34UL))
#define bM4_USF_HCTSIZ11_XFERSIZE14                     *((volatile unsigned int*)(0x4380CE38UL))
#define bM4_USF_HCTSIZ11_XFERSIZE15                     *((volatile unsigned int*)(0x4380CE3CUL))
#define bM4_USF_HCTSIZ11_XFERSIZE16                     *((volatile unsigned int*)(0x4380CE40UL))
#define bM4_USF_HCTSIZ11_XFERSIZE17                     *((volatile unsigned int*)(0x4380CE44UL))
#define bM4_USF_HCTSIZ11_XFERSIZE18                     *((volatile unsigned int*)(0x4380CE48UL))
#define bM4_USF_HCTSIZ11_PKTCNT0                        *((volatile unsigned int*)(0x4380CE4CUL))
#define bM4_USF_HCTSIZ11_PKTCNT1                        *((volatile unsigned int*)(0x4380CE50UL))
#define bM4_USF_HCTSIZ11_PKTCNT2                        *((volatile unsigned int*)(0x4380CE54UL))
#define bM4_USF_HCTSIZ11_PKTCNT3                        *((volatile unsigned int*)(0x4380CE58UL))
#define bM4_USF_HCTSIZ11_PKTCNT4                        *((volatile unsigned int*)(0x4380CE5CUL))
#define bM4_USF_HCTSIZ11_PKTCNT5                        *((volatile unsigned int*)(0x4380CE60UL))
#define bM4_USF_HCTSIZ11_PKTCNT6                        *((volatile unsigned int*)(0x4380CE64UL))
#define bM4_USF_HCTSIZ11_PKTCNT7                        *((volatile unsigned int*)(0x4380CE68UL))
#define bM4_USF_HCTSIZ11_PKTCNT8                        *((volatile unsigned int*)(0x4380CE6CUL))
#define bM4_USF_HCTSIZ11_PKTCNT9                        *((volatile unsigned int*)(0x4380CE70UL))
#define bM4_USF_HCTSIZ11_PID0                           *((volatile unsigned int*)(0x4380CE74UL))
#define bM4_USF_HCTSIZ11_PID1                           *((volatile unsigned int*)(0x4380CE78UL))
#define bM4_USF_HCTSIZ11_DOPNG                          *((volatile unsigned int*)(0x4380CE7CUL))
#define bM4_USF_DCFG_DEVSPD0                            *((volatile unsigned int*)(0x43810000UL))
#define bM4_USF_DCFG_DEVSPD1                            *((volatile unsigned int*)(0x43810004UL))
#define bM4_USF_DCFG_NZSTSOUTHSHK                       *((volatile unsigned int*)(0x43810008UL))
#define bM4_USF_DCFG_ENA32KHZSUSP                       *((volatile unsigned int*)(0x4381000CUL))
#define bM4_USF_DCFG_DEVADDR0                           *((volatile unsigned int*)(0x43810010UL))
#define bM4_USF_DCFG_DEVADDR1                           *((volatile unsigned int*)(0x43810014UL))
#define bM4_USF_DCFG_DEVADDR2                           *((volatile unsigned int*)(0x43810018UL))
#define bM4_USF_DCFG_DEVADDR3                           *((volatile unsigned int*)(0x4381001CUL))
#define bM4_USF_DCFG_DEVADDR4                           *((volatile unsigned int*)(0x43810020UL))
#define bM4_USF_DCFG_DEVADDR5                           *((volatile unsigned int*)(0x43810024UL))
#define bM4_USF_DCFG_DEVADDR6                           *((volatile unsigned int*)(0x43810028UL))
#define bM4_USF_DCFG_PERFRINT0                          *((volatile unsigned int*)(0x4381002CUL))
#define bM4_USF_DCFG_PERFRINT1                          *((volatile unsigned int*)(0x43810030UL))
#define bM4_USF_DCFG_ENDEVOUTNAK                        *((volatile unsigned int*)(0x43810034UL))
#define bM4_USF_DCFG_XCVRDLY                            *((volatile unsigned int*)(0x43810038UL))
#define bM4_USF_DCFG_ERRATICINTMSK                      *((volatile unsigned int*)(0x4381003CUL))
#define bM4_USF_DCFG_PERSCHINTVL0                       *((volatile unsigned int*)(0x43810060UL))
#define bM4_USF_DCFG_PERSCHINTVL1                       *((volatile unsigned int*)(0x43810064UL))
#define bM4_USF_DCTL_RMTWKUPSIG                         *((volatile unsigned int*)(0x43810080UL))
#define bM4_USF_DCTL_SFTDISCON                          *((volatile unsigned int*)(0x43810084UL))
#define bM4_USF_DCTL_GNPINNAKSTS                        *((volatile unsigned int*)(0x43810088UL))
#define bM4_USF_DCTL_GOUTNAKSTS                         *((volatile unsigned int*)(0x4381008CUL))
#define bM4_USF_DCTL_TSTCTL0                            *((volatile unsigned int*)(0x43810090UL))
#define bM4_USF_DCTL_TSTCTL1                            *((volatile unsigned int*)(0x43810094UL))
#define bM4_USF_DCTL_TSTCTL2                            *((volatile unsigned int*)(0x43810098UL))
#define bM4_USF_DCTL_SGNPINNAK                          *((volatile unsigned int*)(0x4381009CUL))
#define bM4_USF_DCTL_CGNPINNAK                          *((volatile unsigned int*)(0x438100A0UL))
#define bM4_USF_DCTL_SGOUTNAK                           *((volatile unsigned int*)(0x438100A4UL))
#define bM4_USF_DCTL_CGOUTNAK                           *((volatile unsigned int*)(0x438100A8UL))
#define bM4_USF_DCTL_PWRONPRGDONE                       *((volatile unsigned int*)(0x438100ACUL))
#define bM4_USF_DCTL_IGNRFRMNUM                         *((volatile unsigned int*)(0x438100BCUL))
#define bM4_USF_DCTL_NAKONBBLE                          *((volatile unsigned int*)(0x438100C0UL))
#define bM4_USF_DCTL_RESV                               *((volatile unsigned int*)(0x438100E0UL))
#define bM4_USF_DSTS_SUSPSTS                            *((volatile unsigned int*)(0x43810100UL))
#define bM4_USF_DSTS_ENUMSPD0                           *((volatile unsigned int*)(0x43810104UL))
#define bM4_USF_DSTS_ENUMSPD1                           *((volatile unsigned int*)(0x43810108UL))
#define bM4_USF_DSTS_ERRTICERR                          *((volatile unsigned int*)(0x4381010CUL))
#define bM4_USF_DSTS_SOFFN0                             *((volatile unsigned int*)(0x43810120UL))
#define bM4_USF_DSTS_SOFFN1                             *((volatile unsigned int*)(0x43810124UL))
#define bM4_USF_DSTS_SOFFN2                             *((volatile unsigned int*)(0x43810128UL))
#define bM4_USF_DSTS_SOFFN3                             *((volatile unsigned int*)(0x4381012CUL))
#define bM4_USF_DSTS_SOFFN4                             *((volatile unsigned int*)(0x43810130UL))
#define bM4_USF_DSTS_SOFFN5                             *((volatile unsigned int*)(0x43810134UL))
#define bM4_USF_DSTS_SOFFN6                             *((volatile unsigned int*)(0x43810138UL))
#define bM4_USF_DSTS_SOFFN7                             *((volatile unsigned int*)(0x4381013CUL))
#define bM4_USF_DSTS_SOFFN8                             *((volatile unsigned int*)(0x43810140UL))
#define bM4_USF_DSTS_SOFFN9                             *((volatile unsigned int*)(0x43810144UL))
#define bM4_USF_DSTS_SOFFN10                            *((volatile unsigned int*)(0x43810148UL))
#define bM4_USF_DSTS_SOFFN11                            *((volatile unsigned int*)(0x4381014CUL))
#define bM4_USF_DSTS_SOFFN12                            *((volatile unsigned int*)(0x43810150UL))
#define bM4_USF_DSTS_SOFFN13                            *((volatile unsigned int*)(0x43810154UL))
#define bM4_USF_DSTS_DEVLNSTS0                          *((volatile unsigned int*)(0x43810158UL))
#define bM4_USF_DSTS_DEVLNSTS1                          *((volatile unsigned int*)(0x4381015CUL))
#define bM4_USF_DSTS_RESV                               *((volatile unsigned int*)(0x43810160UL))
#define bM4_USF_DIEPMSK_XFERCOMPLMSK                    *((volatile unsigned int*)(0x43810200UL))
#define bM4_USF_DIEPMSK_EPDISBLDMSK                     *((volatile unsigned int*)(0x43810204UL))
#define bM4_USF_DIEPMSK_AHBERRMSK                       *((volatile unsigned int*)(0x43810208UL))
#define bM4_USF_DIEPMSK_TIMEOUTMSK                      *((volatile unsigned int*)(0x4381020CUL))
#define bM4_USF_DIEPMSK_INTKNTXFEMPMSK                  *((volatile unsigned int*)(0x43810210UL))
#define bM4_USF_DIEPMSK_INTKNEPMISMSK                   *((volatile unsigned int*)(0x43810214UL))
#define bM4_USF_DIEPMSK_INEPNAKEFFMSK                   *((volatile unsigned int*)(0x43810218UL))
#define bM4_USF_DIEPMSK_TXFIFOUNDRNMSK                  *((volatile unsigned int*)(0x43810220UL))
#define bM4_USF_DIEPMSK_NAKMSK                          *((volatile unsigned int*)(0x43810234UL))
#define bM4_USF_DOEPMSK_XFERCOMPLMSK                    *((volatile unsigned int*)(0x43810280UL))
#define bM4_USF_DOEPMSK_EPDISBLDMSK                     *((volatile unsigned int*)(0x43810284UL))
#define bM4_USF_DOEPMSK_AHBERRMSK                       *((volatile unsigned int*)(0x43810288UL))
#define bM4_USF_DOEPMSK_SETUPMSK                        *((volatile unsigned int*)(0x4381028CUL))
#define bM4_USF_DOEPMSK_OUTTKNEPDISMSK                  *((volatile unsigned int*)(0x43810290UL))
#define bM4_USF_DOEPMSK_STSPHSERCVDMSK                  *((volatile unsigned int*)(0x43810294UL))
#define bM4_USF_DOEPMSK_BACK2BACKSETUP                  *((volatile unsigned int*)(0x43810298UL))
#define bM4_USF_DOEPMSK_OUTPKTERRMSK                    *((volatile unsigned int*)(0x438102A0UL))
#define bM4_USF_DOEPMSK_BBLEERRMSK                      *((volatile unsigned int*)(0x438102B0UL))
#define bM4_USF_DOEPMSK_NAKMSK                          *((volatile unsigned int*)(0x438102B4UL))
#define bM4_USF_DOEPMSK_NYETMSK                         *((volatile unsigned int*)(0x438102B8UL))
#define bM4_USF_DAINT_INEPINT0                          *((volatile unsigned int*)(0x43810300UL))
#define bM4_USF_DAINT_INEPINT1                          *((volatile unsigned int*)(0x43810304UL))
#define bM4_USF_DAINT_INEPINT2                          *((volatile unsigned int*)(0x43810308UL))
#define bM4_USF_DAINT_INEPINT3                          *((volatile unsigned int*)(0x4381030CUL))
#define bM4_USF_DAINT_INEPINT4                          *((volatile unsigned int*)(0x43810310UL))
#define bM4_USF_DAINT_INEPINT5                          *((volatile unsigned int*)(0x43810314UL))
#define bM4_USF_DAINT_INEPINT6                          *((volatile unsigned int*)(0x43810318UL))
#define bM4_USF_DAINT_INEPINT7                          *((volatile unsigned int*)(0x4381031CUL))
#define bM4_USF_DAINT_OUTEPINT0                         *((volatile unsigned int*)(0x43810340UL))
#define bM4_USF_DAINT_OUTEPINT1                         *((volatile unsigned int*)(0x43810344UL))
#define bM4_USF_DAINT_OUTEPINT2                         *((volatile unsigned int*)(0x43810348UL))
#define bM4_USF_DAINT_OUTEPINT3                         *((volatile unsigned int*)(0x4381034CUL))
#define bM4_USF_DAINT_OUTEPINT4                         *((volatile unsigned int*)(0x43810350UL))
#define bM4_USF_DAINT_OUTEPINT5                         *((volatile unsigned int*)(0x43810354UL))
#define bM4_USF_DAINT_OUTEPINT6                         *((volatile unsigned int*)(0x43810358UL))
#define bM4_USF_DAINT_OUTEPINT7                         *((volatile unsigned int*)(0x4381035CUL))
#define bM4_USF_DAINT_RESV                              *((volatile unsigned int*)(0x43810360UL))
#define bM4_USF_DAINTMSK_INEPMSK0                       *((volatile unsigned int*)(0x43810380UL))
#define bM4_USF_DAINTMSK_INEPMSK1                       *((volatile unsigned int*)(0x43810384UL))
#define bM4_USF_DAINTMSK_INEPMSK2                       *((volatile unsigned int*)(0x43810388UL))
#define bM4_USF_DAINTMSK_INEPMSK3                       *((volatile unsigned int*)(0x4381038CUL))
#define bM4_USF_DAINTMSK_INEPMSK4                       *((volatile unsigned int*)(0x43810390UL))
#define bM4_USF_DAINTMSK_INEPMSK5                       *((volatile unsigned int*)(0x43810394UL))
#define bM4_USF_DAINTMSK_INEPMSK6                       *((volatile unsigned int*)(0x43810398UL))
#define bM4_USF_DAINTMSK_INEPMSK7                       *((volatile unsigned int*)(0x4381039CUL))
