RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_DAINTMSK_OUTEPMSK0                      *((volatile unsigned int*)(0x438103C0UL))
#define bM4_USF_DAINTMSK_OUTEPMSK1                      *((volatile unsigned int*)(0x438103C4UL))
#define bM4_USF_DAINTMSK_OUTEPMSK2                      *((volatile unsigned int*)(0x438103C8UL))
#define bM4_USF_DAINTMSK_OUTEPMSK3                      *((volatile unsigned int*)(0x438103CCUL))
#define bM4_USF_DAINTMSK_OUTEPMSK4                      *((volatile unsigned int*)(0x438103D0UL))
#define bM4_USF_DAINTMSK_OUTEPMSK5                      *((volatile unsigned int*)(0x438103D4UL))
#define bM4_USF_DAINTMSK_OUTEPMSK6                      *((volatile unsigned int*)(0x438103D8UL))
#define bM4_USF_DAINTMSK_OUTEPMSK7                      *((volatile unsigned int*)(0x438103DCUL))
#define bM4_USF_DAINTMSK_RESV                           *((volatile unsigned int*)(0x438103E0UL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE0                  *((volatile unsigned int*)(0x43810580UL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE1                  *((volatile unsigned int*)(0x43810584UL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE2                  *((volatile unsigned int*)(0x43810588UL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE3                  *((volatile unsigned int*)(0x4381058CUL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE4                  *((volatile unsigned int*)(0x43810590UL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE5                  *((volatile unsigned int*)(0x43810594UL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE6                  *((volatile unsigned int*)(0x43810598UL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE7                  *((volatile unsigned int*)(0x4381059CUL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE8                  *((volatile unsigned int*)(0x438105A0UL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE9                  *((volatile unsigned int*)(0x438105A4UL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE10                 *((volatile unsigned int*)(0x438105A8UL))
#define bM4_USF_DVBUSPULSE_DVBUSPULSE11                 *((volatile unsigned int*)(0x438105ACUL))
#define bM4_USF_DTHRCTL_NONISOTHREN                     *((volatile unsigned int*)(0x43810600UL))
#define bM4_USF_DTHRCTL_ISOTHREN                        *((volatile unsigned int*)(0x43810604UL))
#define bM4_USF_DTHRCTL_TXTHRLEN0                       *((volatile unsigned int*)(0x43810608UL))
#define bM4_USF_DTHRCTL_TXTHRLEN1                       *((volatile unsigned int*)(0x4381060CUL))
#define bM4_USF_DTHRCTL_TXTHRLEN2                       *((volatile unsigned int*)(0x43810610UL))
#define bM4_USF_DTHRCTL_TXTHRLEN3                       *((volatile unsigned int*)(0x43810614UL))
#define bM4_USF_DTHRCTL_TXTHRLEN4                       *((volatile unsigned int*)(0x43810618UL))
#define bM4_USF_DTHRCTL_TXTHRLEN5                       *((volatile unsigned int*)(0x4381061CUL))
#define bM4_USF_DTHRCTL_TXTHRLEN6                       *((volatile unsigned int*)(0x43810620UL))
#define bM4_USF_DTHRCTL_TXTHRLEN7                       *((volatile unsigned int*)(0x43810624UL))
#define bM4_USF_DTHRCTL_TXTHRLEN8                       *((volatile unsigned int*)(0x43810628UL))
#define bM4_USF_DTHRCTL_AHBTHRRATIO0                    *((volatile unsigned int*)(0x4381062CUL))
#define bM4_USF_DTHRCTL_AHBTHRRATIO1                    *((volatile unsigned int*)(0x43810630UL))
#define bM4_USF_DTHRCTL_RXTHREN                         *((volatile unsigned int*)(0x43810640UL))
#define bM4_USF_DTHRCTL_RXTHRLEN0                       *((volatile unsigned int*)(0x43810644UL))
#define bM4_USF_DTHRCTL_RXTHRLEN1                       *((volatile unsigned int*)(0x43810648UL))
#define bM4_USF_DTHRCTL_RXTHRLEN2                       *((volatile unsigned int*)(0x4381064CUL))
#define bM4_USF_DTHRCTL_RXTHRLEN3                       *((volatile unsigned int*)(0x43810650UL))
#define bM4_USF_DTHRCTL_RXTHRLEN4                       *((volatile unsigned int*)(0x43810654UL))
#define bM4_USF_DTHRCTL_RXTHRLEN5                       *((volatile unsigned int*)(0x43810658UL))
#define bM4_USF_DTHRCTL_RXTHRLEN6                       *((volatile unsigned int*)(0x4381065CUL))
#define bM4_USF_DTHRCTL_RXTHRLEN7                       *((volatile unsigned int*)(0x43810660UL))
#define bM4_USF_DTHRCTL_RXTHRLEN8                       *((volatile unsigned int*)(0x43810664UL))
#define bM4_USF_DTHRCTL_ARBPRKEN                        *((volatile unsigned int*)(0x4381066CUL))
#define bM4_USF_DIEPCTL0_MPS0                           *((volatile unsigned int*)(0x43812000UL))
#define bM4_USF_DIEPCTL0_MPS1                           *((volatile unsigned int*)(0x43812004UL))
#define bM4_USF_DIEPCTL0_USBACTEP                       *((volatile unsigned int*)(0x4381203CUL))
#define bM4_USF_DIEPCTL0_NAKSTS                         *((volatile unsigned int*)(0x43812044UL))
#define bM4_USF_DIEPCTL0_EPTYPE0                        *((volatile unsigned int*)(0x43812048UL))
#define bM4_USF_DIEPCTL0_EPTYPE1                        *((volatile unsigned int*)(0x4381204CUL))
#define bM4_USF_DIEPCTL0_STALL                          *((volatile unsigned int*)(0x43812054UL))
#define bM4_USF_DIEPCTL0_TXFNUM0                        *((volatile unsigned int*)(0x43812058UL))
#define bM4_USF_DIEPCTL0_TXFNUM1                        *((volatile unsigned int*)(0x4381205CUL))
#define bM4_USF_DIEPCTL0_TXFNUM2                        *((volatile unsigned int*)(0x43812060UL))
#define bM4_USF_DIEPCTL0_TXFNUM3                        *((volatile unsigned int*)(0x43812064UL))
#define bM4_USF_DIEPCTL0_CNAK                           *((volatile unsigned int*)(0x43812068UL))
#define bM4_USF_DIEPCTL0_SNAK                           *((volatile unsigned int*)(0x4381206CUL))
#define bM4_USF_DIEPCTL0_EPDIS                          *((volatile unsigned int*)(0x43812078UL))
#define bM4_USF_DIEPCTL0_EPENA                          *((volatile unsigned int*)(0x4381207CUL))
#define bM4_USF_DIEPINT0_XFERCOMPL                      *((volatile unsigned int*)(0x43812100UL))
#define bM4_USF_DIEPINT0_EPDISBLD                       *((volatile unsigned int*)(0x43812104UL))
#define bM4_USF_DIEPINT0_AHBERR                         *((volatile unsigned int*)(0x43812108UL))
#define bM4_USF_DIEPINT0_TIMEOUT                        *((volatile unsigned int*)(0x4381210CUL))
#define bM4_USF_DIEPINT0_INTKNTXFEMP                    *((volatile unsigned int*)(0x43812110UL))
#define bM4_USF_DIEPINT0_INTKNEPMIS                     *((volatile unsigned int*)(0x43812114UL))
#define bM4_USF_DIEPINT0_INEPNAKEFF                     *((volatile unsigned int*)(0x43812118UL))
#define bM4_USF_DIEPINT0_TXFEMP                         *((volatile unsigned int*)(0x4381211CUL))
#define bM4_USF_DIEPINT0_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43812120UL))
#define bM4_USF_DIEPINT0_BNAINTR                        *((volatile unsigned int*)(0x43812124UL))
#define bM4_USF_DIEPINT0_PKTDRPSTS                      *((volatile unsigned int*)(0x4381212CUL))
#define bM4_USF_DIEPINT0_BBLEERR                        *((volatile unsigned int*)(0x43812130UL))
#define bM4_USF_DIEPINT0_NAKINTRPT                      *((volatile unsigned int*)(0x43812134UL))
#define bM4_USF_DIEPINT0_NYETINTRPT                     *((volatile unsigned int*)(0x43812138UL))
#define bM4_USF_DIEPTSIZ0_XFERSIZE0                     *((volatile unsigned int*)(0x43812200UL))
#define bM4_USF_DIEPTSIZ0_XFERSIZE1                     *((volatile unsigned int*)(0x43812204UL))
#define bM4_USF_DIEPTSIZ0_XFERSIZE2                     *((volatile unsigned int*)(0x43812208UL))
#define bM4_USF_DIEPTSIZ0_XFERSIZE3                     *((volatile unsigned int*)(0x4381220CUL))
#define bM4_USF_DIEPTSIZ0_XFERSIZE4                     *((volatile unsigned int*)(0x43812210UL))
#define bM4_USF_DIEPTSIZ0_XFERSIZE5                     *((volatile unsigned int*)(0x43812214UL))
#define bM4_USF_DIEPTSIZ0_XFERSIZE6                     *((volatile unsigned int*)(0x43812218UL))
#define bM4_USF_DIEPTSIZ0_PKTCNT0                       *((volatile unsigned int*)(0x4381224CUL))
#define bM4_USF_DIEPTSIZ0_PKTCNT1                       *((volatile unsigned int*)(0x43812250UL))
#define bM4_USF_DIEPTSIZ0_RESV                          *((volatile unsigned int*)(0x43812260UL))
#define bM4_USF_DIEPCTL1_MPS0                           *((volatile unsigned int*)(0x43812400UL))
#define bM4_USF_DIEPCTL1_MPS1                           *((volatile unsigned int*)(0x43812404UL))
#define bM4_USF_DIEPCTL1_MPS2                           *((volatile unsigned int*)(0x43812408UL))
#define bM4_USF_DIEPCTL1_MPS3                           *((volatile unsigned int*)(0x4381240CUL))
#define bM4_USF_DIEPCTL1_MPS4                           *((volatile unsigned int*)(0x43812410UL))
#define bM4_USF_DIEPCTL1_MPS5                           *((volatile unsigned int*)(0x43812414UL))
#define bM4_USF_DIEPCTL1_MPS6                           *((volatile unsigned int*)(0x43812418UL))
#define bM4_USF_DIEPCTL1_MPS7                           *((volatile unsigned int*)(0x4381241CUL))
#define bM4_USF_DIEPCTL1_MPS8                           *((volatile unsigned int*)(0x43812420UL))
#define bM4_USF_DIEPCTL1_MPS9                           *((volatile unsigned int*)(0x43812424UL))
#define bM4_USF_DIEPCTL1_MPS10                          *((volatile unsigned int*)(0x43812428UL))
#define bM4_USF_DIEPCTL1_USBACTEP                       *((volatile unsigned int*)(0x4381243CUL))
#define bM4_USF_DIEPCTL1_DPID                           *((volatile unsigned int*)(0x43812440UL))
#define bM4_USF_DIEPCTL1_NAKSTS                         *((volatile unsigned int*)(0x43812444UL))
#define bM4_USF_DIEPCTL1_EPTYPE0                        *((volatile unsigned int*)(0x43812448UL))
#define bM4_USF_DIEPCTL1_EPTYPE1                        *((volatile unsigned int*)(0x4381244CUL))
#define bM4_USF_DIEPCTL1_STALL                          *((volatile unsigned int*)(0x43812454UL))
#define bM4_USF_DIEPCTL1_TXFNUM0                        *((volatile unsigned int*)(0x43812458UL))
#define bM4_USF_DIEPCTL1_TXFNUM1                        *((volatile unsigned int*)(0x4381245CUL))
#define bM4_USF_DIEPCTL1_TXFNUM2                        *((volatile unsigned int*)(0x43812460UL))
#define bM4_USF_DIEPCTL1_TXFNUM3                        *((volatile unsigned int*)(0x43812464UL))
#define bM4_USF_DIEPCTL1_CNAK                           *((volatile unsigned int*)(0x43812468UL))
#define bM4_USF_DIEPCTL1_SNAK                           *((volatile unsigned int*)(0x4381246CUL))
#define bM4_USF_DIEPCTL1_SETD0PID                       *((volatile unsigned int*)(0x43812470UL))
#define bM4_USF_DIEPCTL1_SETD1PID                       *((volatile unsigned int*)(0x43812474UL))
#define bM4_USF_DIEPCTL1_EPDIS                          *((volatile unsigned int*)(0x43812478UL))
#define bM4_USF_DIEPCTL1_EPENA                          *((volatile unsigned int*)(0x4381247CUL))
#define bM4_USF_DIEPINT1_XFERCOMPL                      *((volatile unsigned int*)(0x43812500UL))
#define bM4_USF_DIEPINT1_EPDISBLD                       *((volatile unsigned int*)(0x43812504UL))
#define bM4_USF_DIEPINT1_AHBERR                         *((volatile unsigned int*)(0x43812508UL))
#define bM4_USF_DIEPINT1_TIMEOUT                        *((volatile unsigned int*)(0x4381250CUL))
#define bM4_USF_DIEPINT1_INTKNTXFEMP                    *((volatile unsigned int*)(0x43812510UL))
#define bM4_USF_DIEPINT1_INTKNEPMIS                     *((volatile unsigned int*)(0x43812514UL))
#define bM4_USF_DIEPINT1_INEPNAKEFF                     *((volatile unsigned int*)(0x43812518UL))
#define bM4_USF_DIEPINT1_TXFEMP                         *((volatile unsigned int*)(0x4381251CUL))
#define bM4_USF_DIEPINT1_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43812520UL))
#define bM4_USF_DIEPINT1_BNAINTR                        *((volatile unsigned int*)(0x43812524UL))
#define bM4_USF_DIEPINT1_PKTDRPSTS                      *((volatile unsigned int*)(0x4381252CUL))
#define bM4_USF_DIEPINT1_BBLEERR                        *((volatile unsigned int*)(0x43812530UL))
#define bM4_USF_DIEPINT1_NAKINTRPT                      *((volatile unsigned int*)(0x43812534UL))
#define bM4_USF_DIEPINT1_NYETINTRPT                     *((volatile unsigned int*)(0x43812538UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE0                     *((volatile unsigned int*)(0x43812600UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE1                     *((volatile unsigned int*)(0x43812604UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE2                     *((volatile unsigned int*)(0x43812608UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE3                     *((volatile unsigned int*)(0x4381260CUL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE4                     *((volatile unsigned int*)(0x43812610UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE5                     *((volatile unsigned int*)(0x43812614UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE6                     *((volatile unsigned int*)(0x43812618UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE7                     *((volatile unsigned int*)(0x4381261CUL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE8                     *((volatile unsigned int*)(0x43812620UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE9                     *((volatile unsigned int*)(0x43812624UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE10                    *((volatile unsigned int*)(0x43812628UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE11                    *((volatile unsigned int*)(0x4381262CUL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE12                    *((volatile unsigned int*)(0x43812630UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE13                    *((volatile unsigned int*)(0x43812634UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE14                    *((volatile unsigned int*)(0x43812638UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE15                    *((volatile unsigned int*)(0x4381263CUL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE16                    *((volatile unsigned int*)(0x43812640UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE17                    *((volatile unsigned int*)(0x43812644UL))
#define bM4_USF_DIEPTSIZ1_XFERSIZE18                    *((volatile unsigned int*)(0x43812648UL))
#define bM4_USF_DIEPTSIZ1_PKTCNT0                       *((volatile unsigned int*)(0x4381264CUL))
#define bM4_USF_DIEPTSIZ1_PKTCNT1                       *((volatile unsigned int*)(0x43812650UL))
#define bM4_USF_DIEPTSIZ1_PKTCNT2                       *((volatile unsigned int*)(0x43812654UL))
#define bM4_USF_DIEPTSIZ1_PKTCNT3                       *((volatile unsigned int*)(0x43812658UL))
#define bM4_USF_DIEPTSIZ1_PKTCNT4                       *((volatile unsigned int*)(0x4381265CUL))
#define bM4_USF_DIEPTSIZ1_PKTCNT5                       *((volatile unsigned int*)(0x43812660UL))
#define bM4_USF_DIEPTSIZ1_PKTCNT6                       *((volatile unsigned int*)(0x43812664UL))
#define bM4_USF_DIEPTSIZ1_PKTCNT7                       *((volatile unsigned int*)(0x43812668UL))
#define bM4_USF_DIEPTSIZ1_PKTCNT8                       *((volatile unsigned int*)(0x4381266CUL))
#define bM4_USF_DIEPTSIZ1_PKTCNT9                       *((volatile unsigned int*)(0x43812670UL))
#define bM4_USF_DIEPTSIZ1_MC0                           *((volatile unsigned int*)(0x43812674UL))
#define bM4_USF_DIEPTSIZ1_MC1                           *((volatile unsigned int*)(0x43812678UL))
#define bM4_USF_DIEPCTL2_MPS0                           *((volatile unsigned int*)(0x43812800UL))
#define bM4_USF_DIEPCTL2_MPS1                           *((volatile unsigned int*)(0x43812804UL))
#define bM4_USF_DIEPCTL2_MPS2                           *((volatile unsigned int*)(0x43812808UL))
#define bM4_USF_DIEPCTL2_MPS3                           *((volatile unsigned int*)(0x4381280CUL))
#define bM4_USF_DIEPCTL2_MPS4                           *((volatile unsigned int*)(0x43812810UL))
#define bM4_USF_DIEPCTL2_MPS5                           *((volatile unsigned int*)(0x43812814UL))
#define bM4_USF_DIEPCTL2_MPS6                           *((volatile unsigned int*)(0x43812818UL))
#define bM4_USF_DIEPCTL2_MPS7                           *((volatile unsigned int*)(0x4381281CUL))
#define bM4_USF_DIEPCTL2_MPS8                           *((volatile unsigned int*)(0x43812820UL))
#define bM4_USF_DIEPCTL2_MPS9                           *((volatile unsigned int*)(0x43812824UL))
#define bM4_USF_DIEPCTL2_MPS10                          *((volatile unsigned int*)(0x43812828UL))
#define bM4_USF_DIEPCTL2_USBACTEP                       *((volatile unsigned int*)(0x4381283CUL))
#define bM4_USF_DIEPCTL2_DPID                           *((volatile unsigned int*)(0x43812840UL))
#define bM4_USF_DIEPCTL2_NAKSTS                         *((volatile unsigned int*)(0x43812844UL))
#define bM4_USF_DIEPCTL2_EPTYPE0                        *((volatile unsigned int*)(0x43812848UL))
#define bM4_USF_DIEPCTL2_EPTYPE1                        *((volatile unsigned int*)(0x4381284CUL))
#define bM4_USF_DIEPCTL2_STALL                          *((volatile unsigned int*)(0x43812854UL))
#define bM4_USF_DIEPCTL2_TXFNUM0                        *((volatile unsigned int*)(0x43812858UL))
#define bM4_USF_DIEPCTL2_TXFNUM1                        *((volatile unsigned int*)(0x4381285CUL))
#define bM4_USF_DIEPCTL2_TXFNUM2                        *((volatile unsigned int*)(0x43812860UL))
#define bM4_USF_DIEPCTL2_TXFNUM3                        *((volatile unsigned int*)(0x43812864UL))
#define bM4_USF_DIEPCTL2_CNAK                           *((volatile unsigned int*)(0x43812868UL))
#define bM4_USF_DIEPCTL2_SNAK                           *((volatile unsigned int*)(0x4381286CUL))
#define bM4_USF_DIEPCTL2_SETD0PID                       *((volatile unsigned int*)(0x43812870UL))
#define bM4_USF_DIEPCTL2_SETD1PID                       *((volatile unsigned int*)(0x43812874UL))
#define bM4_USF_DIEPCTL2_EPDIS                          *((volatile unsigned int*)(0x43812878UL))
#define bM4_USF_DIEPCTL2_EPENA                          *((volatile unsigned int*)(0x4381287CUL))
#define bM4_USF_DIEPINT2_XFERCOMPL                      *((volatile unsigned int*)(0x43812900UL))
#define bM4_USF_DIEPINT2_EPDISBLD                       *((volatile unsigned int*)(0x43812904UL))
#define bM4_USF_DIEPINT2_AHBERR                         *((volatile unsigned int*)(0x43812908UL))
#define bM4_USF_DIEPINT2_TIMEOUT                        *((volatile unsigned int*)(0x4381290CUL))
#define bM4_USF_DIEPINT2_INTKNTXFEMP                    *((volatile unsigned int*)(0x43812910UL))
#define bM4_USF_DIEPINT2_INTKNEPMIS                     *((volatile unsigned int*)(0x43812914UL))
#define bM4_USF_DIEPINT2_INEPNAKEFF                     *((volatile unsigned int*)(0x43812918UL))
#define bM4_USF_DIEPINT2_TXFEMP                         *((volatile unsigned int*)(0x4381291CUL))
#define bM4_USF_DIEPINT2_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43812920UL))
#define bM4_USF_DIEPINT2_BNAINTR                        *((volatile unsigned int*)(0x43812924UL))
#define bM4_USF_DIEPINT2_PKTDRPSTS                      *((volatile unsigned int*)(0x4381292CUL))
#define bM4_USF_DIEPINT2_BBLEERR                        *((volatile unsigned int*)(0x43812930UL))
#define bM4_USF_DIEPINT2_NAKINTRPT                      *((volatile unsigned int*)(0x43812934UL))
#define bM4_USF_DIEPINT2_NYETINTRPT                     *((volatile unsigned int*)(0x43812938UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE0                     *((volatile unsigned int*)(0x43812A00UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE1                     *((volatile unsigned int*)(0x43812A04UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE2                     *((volatile unsigned int*)(0x43812A08UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE3                     *((volatile unsigned int*)(0x43812A0CUL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE4                     *((volatile unsigned int*)(0x43812A10UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE5                     *((volatile unsigned int*)(0x43812A14UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE6                     *((volatile unsigned int*)(0x43812A18UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE7                     *((volatile unsigned int*)(0x43812A1CUL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE8                     *((volatile unsigned int*)(0x43812A20UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE9                     *((volatile unsigned int*)(0x43812A24UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE10                    *((volatile unsigned int*)(0x43812A28UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE11                    *((volatile unsigned int*)(0x43812A2CUL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE12                    *((volatile unsigned int*)(0x43812A30UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE13                    *((volatile unsigned int*)(0x43812A34UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE14                    *((volatile unsigned int*)(0x43812A38UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE15                    *((volatile unsigned int*)(0x43812A3CUL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE16                    *((volatile unsigned int*)(0x43812A40UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE17                    *((volatile unsigned int*)(0x43812A44UL))
#define bM4_USF_DIEPTSIZ2_XFERSIZE18                    *((volatile unsigned int*)(0x43812A48UL))
#define bM4_USF_DIEPTSIZ2_PKTCNT0                       *((volatile unsigned int*)(0x43812A4CUL))
#define bM4_USF_DIEPTSIZ2_PKTCNT1                       *((volatile unsigned int*)(0x43812A50UL))
#define bM4_USF_DIEPTSIZ2_PKTCNT2                       *((volatile unsigned int*)(0x43812A54UL))
#define bM4_USF_DIEPTSIZ2_PKTCNT3                       *((volatile unsigned int*)(0x43812A58UL))
#define bM4_USF_DIEPTSIZ2_PKTCNT4                       *((volatile unsigned int*)(0x43812A5CUL))
#define bM4_USF_DIEPTSIZ2_PKTCNT5                       *((volatile unsigned int*)(0x43812A60UL))
#define bM4_USF_DIEPTSIZ2_PKTCNT6                       *((volatile unsigned int*)(0x43812A64UL))
#define bM4_USF_DIEPTSIZ2_PKTCNT7                       *((volatile unsigned int*)(0x43812A68UL))
#define bM4_USF_DIEPTSIZ2_PKTCNT8                       *((volatile unsigned int*)(0x43812A6CUL))
#define bM4_USF_DIEPTSIZ2_PKTCNT9                       *((volatile unsigned int*)(0x43812A70UL))
#define bM4_USF_DIEPTSIZ2_MC0                           *((volatile unsigned int*)(0x43812A74UL))
#define bM4_USF_DIEPTSIZ2_MC1                           *((volatile unsigned int*)(0x43812A78UL))
#define bM4_USF_DIEPCTL3_MPS0                           *((volatile unsigned int*)(0x43812C00UL))
#define bM4_USF_DIEPCTL3_MPS1                           *((volatile unsigned int*)(0x43812C04UL))
#define bM4_USF_DIEPCTL3_MPS2                           *((volatile unsigned int*)(0x43812C08UL))
#define bM4_USF_DIEPCTL3_MPS3                           *((volatile unsigned int*)(0x43812C0CUL))
#define bM4_USF_DIEPCTL3_MPS4                           *((volatile unsigned int*)(0x43812C10UL))
#define bM4_USF_DIEPCTL3_MPS5                           *((volatile unsigned int*)(0x43812C14UL))
#define bM4_USF_DIEPCTL3_MPS6                           *((volatile unsigned int*)(0x43812C18UL))
#define bM4_USF_DIEPCTL3_MPS7                           *((volatile unsigned int*)(0x43812C1CUL))
#define bM4_USF_DIEPCTL3_MPS8                           *((volatile unsigned int*)(0x43812C20UL))
#define bM4_USF_DIEPCTL3_MPS9                           *((volatile unsigned int*)(0x43812C24UL))
#define bM4_USF_DIEPCTL3_MPS10                          *((volatile unsigned int*)(0x43812C28UL))
#define bM4_USF_DIEPCTL3_USBACTEP                       *((volatile unsigned int*)(0x43812C3CUL))
#define bM4_USF_DIEPCTL3_DPID                           *((volatile unsigned int*)(0x43812C40UL))
#define bM4_USF_DIEPCTL3_NAKSTS                         *((volatile unsigned int*)(0x43812C44UL))
#define bM4_USF_DIEPCTL3_EPTYPE0                        *((volatile unsigned int*)(0x43812C48UL))
#define bM4_USF_DIEPCTL3_EPTYPE1                        *((volatile unsigned int*)(0x43812C4CUL))
