RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_DIEPCTL3_STALL                          *((volatile unsigned int*)(0x43812C54UL))
#define bM4_USF_DIEPCTL3_TXFNUM0                        *((volatile unsigned int*)(0x43812C58UL))
#define bM4_USF_DIEPCTL3_TXFNUM1                        *((volatile unsigned int*)(0x43812C5CUL))
#define bM4_USF_DIEPCTL3_TXFNUM2                        *((volatile unsigned int*)(0x43812C60UL))
#define bM4_USF_DIEPCTL3_TXFNUM3                        *((volatile unsigned int*)(0x43812C64UL))
#define bM4_USF_DIEPCTL3_CNAK                           *((volatile unsigned int*)(0x43812C68UL))
#define bM4_USF_DIEPCTL3_SNAK                           *((volatile unsigned int*)(0x43812C6CUL))
#define bM4_USF_DIEPCTL3_SETD0PID                       *((volatile unsigned int*)(0x43812C70UL))
#define bM4_USF_DIEPCTL3_SETD1PID                       *((volatile unsigned int*)(0x43812C74UL))
#define bM4_USF_DIEPCTL3_EPDIS                          *((volatile unsigned int*)(0x43812C78UL))
#define bM4_USF_DIEPCTL3_EPENA                          *((volatile unsigned int*)(0x43812C7CUL))
#define bM4_USF_DIEPINT3_XFERCOMPL                      *((volatile unsigned int*)(0x43812D00UL))
#define bM4_USF_DIEPINT3_EPDISBLD                       *((volatile unsigned int*)(0x43812D04UL))
#define bM4_USF_DIEPINT3_AHBERR                         *((volatile unsigned int*)(0x43812D08UL))
#define bM4_USF_DIEPINT3_TIMEOUT                        *((volatile unsigned int*)(0x43812D0CUL))
#define bM4_USF_DIEPINT3_INTKNTXFEMP                    *((volatile unsigned int*)(0x43812D10UL))
#define bM4_USF_DIEPINT3_INTKNEPMIS                     *((volatile unsigned int*)(0x43812D14UL))
#define bM4_USF_DIEPINT3_INEPNAKEFF                     *((volatile unsigned int*)(0x43812D18UL))
#define bM4_USF_DIEPINT3_TXFEMP                         *((volatile unsigned int*)(0x43812D1CUL))
#define bM4_USF_DIEPINT3_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43812D20UL))
#define bM4_USF_DIEPINT3_BNAINTR                        *((volatile unsigned int*)(0x43812D24UL))
#define bM4_USF_DIEPINT3_PKTDRPSTS                      *((volatile unsigned int*)(0x43812D2CUL))
#define bM4_USF_DIEPINT3_BBLEERR                        *((volatile unsigned int*)(0x43812D30UL))
#define bM4_USF_DIEPINT3_NAKINTRPT                      *((volatile unsigned int*)(0x43812D34UL))
#define bM4_USF_DIEPINT3_NYETINTRPT                     *((volatile unsigned int*)(0x43812D38UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE0                     *((volatile unsigned int*)(0x43812E00UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE1                     *((volatile unsigned int*)(0x43812E04UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE2                     *((volatile unsigned int*)(0x43812E08UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE3                     *((volatile unsigned int*)(0x43812E0CUL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE4                     *((volatile unsigned int*)(0x43812E10UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE5                     *((volatile unsigned int*)(0x43812E14UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE6                     *((volatile unsigned int*)(0x43812E18UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE7                     *((volatile unsigned int*)(0x43812E1CUL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE8                     *((volatile unsigned int*)(0x43812E20UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE9                     *((volatile unsigned int*)(0x43812E24UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE10                    *((volatile unsigned int*)(0x43812E28UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE11                    *((volatile unsigned int*)(0x43812E2CUL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE12                    *((volatile unsigned int*)(0x43812E30UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE13                    *((volatile unsigned int*)(0x43812E34UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE14                    *((volatile unsigned int*)(0x43812E38UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE15                    *((volatile unsigned int*)(0x43812E3CUL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE16                    *((volatile unsigned int*)(0x43812E40UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE17                    *((volatile unsigned int*)(0x43812E44UL))
#define bM4_USF_DIEPTSIZ3_XFERSIZE18                    *((volatile unsigned int*)(0x43812E48UL))
#define bM4_USF_DIEPTSIZ3_PKTCNT0                       *((volatile unsigned int*)(0x43812E4CUL))
#define bM4_USF_DIEPTSIZ3_PKTCNT1                       *((volatile unsigned int*)(0x43812E50UL))
#define bM4_USF_DIEPTSIZ3_PKTCNT2                       *((volatile unsigned int*)(0x43812E54UL))
#define bM4_USF_DIEPTSIZ3_PKTCNT3                       *((volatile unsigned int*)(0x43812E58UL))
#define bM4_USF_DIEPTSIZ3_PKTCNT4                       *((volatile unsigned int*)(0x43812E5CUL))
#define bM4_USF_DIEPTSIZ3_PKTCNT5                       *((volatile unsigned int*)(0x43812E60UL))
#define bM4_USF_DIEPTSIZ3_PKTCNT6                       *((volatile unsigned int*)(0x43812E64UL))
#define bM4_USF_DIEPTSIZ3_PKTCNT7                       *((volatile unsigned int*)(0x43812E68UL))
#define bM4_USF_DIEPTSIZ3_PKTCNT8                       *((volatile unsigned int*)(0x43812E6CUL))
#define bM4_USF_DIEPTSIZ3_PKTCNT9                       *((volatile unsigned int*)(0x43812E70UL))
#define bM4_USF_DIEPTSIZ3_MC0                           *((volatile unsigned int*)(0x43812E74UL))
#define bM4_USF_DIEPTSIZ3_MC1                           *((volatile unsigned int*)(0x43812E78UL))
#define bM4_USF_DIEPCTL4_MPS0                           *((volatile unsigned int*)(0x43813000UL))
#define bM4_USF_DIEPCTL4_MPS1                           *((volatile unsigned int*)(0x43813004UL))
#define bM4_USF_DIEPCTL4_MPS2                           *((volatile unsigned int*)(0x43813008UL))
#define bM4_USF_DIEPCTL4_MPS3                           *((volatile unsigned int*)(0x4381300CUL))
#define bM4_USF_DIEPCTL4_MPS4                           *((volatile unsigned int*)(0x43813010UL))
#define bM4_USF_DIEPCTL4_MPS5                           *((volatile unsigned int*)(0x43813014UL))
#define bM4_USF_DIEPCTL4_MPS6                           *((volatile unsigned int*)(0x43813018UL))
#define bM4_USF_DIEPCTL4_MPS7                           *((volatile unsigned int*)(0x4381301CUL))
#define bM4_USF_DIEPCTL4_MPS8                           *((volatile unsigned int*)(0x43813020UL))
#define bM4_USF_DIEPCTL4_MPS9                           *((volatile unsigned int*)(0x43813024UL))
#define bM4_USF_DIEPCTL4_MPS10                          *((volatile unsigned int*)(0x43813028UL))
#define bM4_USF_DIEPCTL4_USBACTEP                       *((volatile unsigned int*)(0x4381303CUL))
#define bM4_USF_DIEPCTL4_DPID                           *((volatile unsigned int*)(0x43813040UL))
#define bM4_USF_DIEPCTL4_NAKSTS                         *((volatile unsigned int*)(0x43813044UL))
#define bM4_USF_DIEPCTL4_EPTYPE0                        *((volatile unsigned int*)(0x43813048UL))
#define bM4_USF_DIEPCTL4_EPTYPE1                        *((volatile unsigned int*)(0x4381304CUL))
#define bM4_USF_DIEPCTL4_STALL                          *((volatile unsigned int*)(0x43813054UL))
#define bM4_USF_DIEPCTL4_TXFNUM0                        *((volatile unsigned int*)(0x43813058UL))
#define bM4_USF_DIEPCTL4_TXFNUM1                        *((volatile unsigned int*)(0x4381305CUL))
#define bM4_USF_DIEPCTL4_TXFNUM2                        *((volatile unsigned int*)(0x43813060UL))
#define bM4_USF_DIEPCTL4_TXFNUM3                        *((volatile unsigned int*)(0x43813064UL))
#define bM4_USF_DIEPCTL4_CNAK                           *((volatile unsigned int*)(0x43813068UL))
#define bM4_USF_DIEPCTL4_SNAK                           *((volatile unsigned int*)(0x4381306CUL))
#define bM4_USF_DIEPCTL4_SETD0PID                       *((volatile unsigned int*)(0x43813070UL))
#define bM4_USF_DIEPCTL4_SETD1PID                       *((volatile unsigned int*)(0x43813074UL))
#define bM4_USF_DIEPCTL4_EPDIS                          *((volatile unsigned int*)(0x43813078UL))
#define bM4_USF_DIEPCTL4_EPENA                          *((volatile unsigned int*)(0x4381307CUL))
#define bM4_USF_DIEPINT4_XFERCOMPL                      *((volatile unsigned int*)(0x43813100UL))
#define bM4_USF_DIEPINT4_EPDISBLD                       *((volatile unsigned int*)(0x43813104UL))
#define bM4_USF_DIEPINT4_AHBERR                         *((volatile unsigned int*)(0x43813108UL))
#define bM4_USF_DIEPINT4_TIMEOUT                        *((volatile unsigned int*)(0x4381310CUL))
#define bM4_USF_DIEPINT4_INTKNTXFEMP                    *((volatile unsigned int*)(0x43813110UL))
#define bM4_USF_DIEPINT4_INTKNEPMIS                     *((volatile unsigned int*)(0x43813114UL))
#define bM4_USF_DIEPINT4_INEPNAKEFF                     *((volatile unsigned int*)(0x43813118UL))
#define bM4_USF_DIEPINT4_TXFEMP                         *((volatile unsigned int*)(0x4381311CUL))
#define bM4_USF_DIEPINT4_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43813120UL))
#define bM4_USF_DIEPINT4_BNAINTR                        *((volatile unsigned int*)(0x43813124UL))
#define bM4_USF_DIEPINT4_PKTDRPSTS                      *((volatile unsigned int*)(0x4381312CUL))
#define bM4_USF_DIEPINT4_BBLEERR                        *((volatile unsigned int*)(0x43813130UL))
#define bM4_USF_DIEPINT4_NAKINTRPT                      *((volatile unsigned int*)(0x43813134UL))
#define bM4_USF_DIEPINT4_NYETINTRPT                     *((volatile unsigned int*)(0x43813138UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE0                     *((volatile unsigned int*)(0x43813200UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE1                     *((volatile unsigned int*)(0x43813204UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE2                     *((volatile unsigned int*)(0x43813208UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE3                     *((volatile unsigned int*)(0x4381320CUL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE4                     *((volatile unsigned int*)(0x43813210UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE5                     *((volatile unsigned int*)(0x43813214UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE6                     *((volatile unsigned int*)(0x43813218UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE7                     *((volatile unsigned int*)(0x4381321CUL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE8                     *((volatile unsigned int*)(0x43813220UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE9                     *((volatile unsigned int*)(0x43813224UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE10                    *((volatile unsigned int*)(0x43813228UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE11                    *((volatile unsigned int*)(0x4381322CUL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE12                    *((volatile unsigned int*)(0x43813230UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE13                    *((volatile unsigned int*)(0x43813234UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE14                    *((volatile unsigned int*)(0x43813238UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE15                    *((volatile unsigned int*)(0x4381323CUL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE16                    *((volatile unsigned int*)(0x43813240UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE17                    *((volatile unsigned int*)(0x43813244UL))
#define bM4_USF_DIEPTSIZ4_XFERSIZE18                    *((volatile unsigned int*)(0x43813248UL))
#define bM4_USF_DIEPTSIZ4_PKTCNT0                       *((volatile unsigned int*)(0x4381324CUL))
#define bM4_USF_DIEPTSIZ4_PKTCNT1                       *((volatile unsigned int*)(0x43813250UL))
#define bM4_USF_DIEPTSIZ4_PKTCNT2                       *((volatile unsigned int*)(0x43813254UL))
#define bM4_USF_DIEPTSIZ4_PKTCNT3                       *((volatile unsigned int*)(0x43813258UL))
#define bM4_USF_DIEPTSIZ4_PKTCNT4                       *((volatile unsigned int*)(0x4381325CUL))
#define bM4_USF_DIEPTSIZ4_PKTCNT5                       *((volatile unsigned int*)(0x43813260UL))
#define bM4_USF_DIEPTSIZ4_PKTCNT6                       *((volatile unsigned int*)(0x43813264UL))
#define bM4_USF_DIEPTSIZ4_PKTCNT7                       *((volatile unsigned int*)(0x43813268UL))
#define bM4_USF_DIEPTSIZ4_PKTCNT8                       *((volatile unsigned int*)(0x4381326CUL))
#define bM4_USF_DIEPTSIZ4_PKTCNT9                       *((volatile unsigned int*)(0x43813270UL))
#define bM4_USF_DIEPTSIZ4_MC0                           *((volatile unsigned int*)(0x43813274UL))
#define bM4_USF_DIEPTSIZ4_MC1                           *((volatile unsigned int*)(0x43813278UL))
#define bM4_USF_DIEPCTL5_MPS0                           *((volatile unsigned int*)(0x43813400UL))
#define bM4_USF_DIEPCTL5_MPS1                           *((volatile unsigned int*)(0x43813404UL))
#define bM4_USF_DIEPCTL5_MPS2                           *((volatile unsigned int*)(0x43813408UL))
#define bM4_USF_DIEPCTL5_MPS3                           *((volatile unsigned int*)(0x4381340CUL))
#define bM4_USF_DIEPCTL5_MPS4                           *((volatile unsigned int*)(0x43813410UL))
#define bM4_USF_DIEPCTL5_MPS5                           *((volatile unsigned int*)(0x43813414UL))
#define bM4_USF_DIEPCTL5_MPS6                           *((volatile unsigned int*)(0x43813418UL))
#define bM4_USF_DIEPCTL5_MPS7                           *((volatile unsigned int*)(0x4381341CUL))
#define bM4_USF_DIEPCTL5_MPS8                           *((volatile unsigned int*)(0x43813420UL))
#define bM4_USF_DIEPCTL5_MPS9                           *((volatile unsigned int*)(0x43813424UL))
#define bM4_USF_DIEPCTL5_MPS10                          *((volatile unsigned int*)(0x43813428UL))
#define bM4_USF_DIEPCTL5_USBACTEP                       *((volatile unsigned int*)(0x4381343CUL))
#define bM4_USF_DIEPCTL5_DPID                           *((volatile unsigned int*)(0x43813440UL))
#define bM4_USF_DIEPCTL5_NAKSTS                         *((volatile unsigned int*)(0x43813444UL))
#define bM4_USF_DIEPCTL5_EPTYPE0                        *((volatile unsigned int*)(0x43813448UL))
#define bM4_USF_DIEPCTL5_EPTYPE1                        *((volatile unsigned int*)(0x4381344CUL))
#define bM4_USF_DIEPCTL5_STALL                          *((volatile unsigned int*)(0x43813454UL))
#define bM4_USF_DIEPCTL5_TXFNUM0                        *((volatile unsigned int*)(0x43813458UL))
#define bM4_USF_DIEPCTL5_TXFNUM1                        *((volatile unsigned int*)(0x4381345CUL))
#define bM4_USF_DIEPCTL5_TXFNUM2                        *((volatile unsigned int*)(0x43813460UL))
#define bM4_USF_DIEPCTL5_TXFNUM3                        *((volatile unsigned int*)(0x43813464UL))
#define bM4_USF_DIEPCTL5_CNAK                           *((volatile unsigned int*)(0x43813468UL))
#define bM4_USF_DIEPCTL5_SNAK                           *((volatile unsigned int*)(0x4381346CUL))
#define bM4_USF_DIEPCTL5_SETD0PID                       *((volatile unsigned int*)(0x43813470UL))
#define bM4_USF_DIEPCTL5_SETD1PID                       *((volatile unsigned int*)(0x43813474UL))
#define bM4_USF_DIEPCTL5_EPDIS                          *((volatile unsigned int*)(0x43813478UL))
#define bM4_USF_DIEPCTL5_EPENA                          *((volatile unsigned int*)(0x4381347CUL))
#define bM4_USF_DIEPINT5_XFERCOMPL                      *((volatile unsigned int*)(0x43813500UL))
#define bM4_USF_DIEPINT5_EPDISBLD                       *((volatile unsigned int*)(0x43813504UL))
#define bM4_USF_DIEPINT5_AHBERR                         *((volatile unsigned int*)(0x43813508UL))
#define bM4_USF_DIEPINT5_TIMEOUT                        *((volatile unsigned int*)(0x4381350CUL))
#define bM4_USF_DIEPINT5_INTKNTXFEMP                    *((volatile unsigned int*)(0x43813510UL))
#define bM4_USF_DIEPINT5_INTKNEPMIS                     *((volatile unsigned int*)(0x43813514UL))
#define bM4_USF_DIEPINT5_INEPNAKEFF                     *((volatile unsigned int*)(0x43813518UL))
#define bM4_USF_DIEPINT5_TXFEMP                         *((volatile unsigned int*)(0x4381351CUL))
#define bM4_USF_DIEPINT5_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43813520UL))
#define bM4_USF_DIEPINT5_BNAINTR                        *((volatile unsigned int*)(0x43813524UL))
#define bM4_USF_DIEPINT5_PKTDRPSTS                      *((volatile unsigned int*)(0x4381352CUL))
#define bM4_USF_DIEPINT5_BBLEERR                        *((volatile unsigned int*)(0x43813530UL))
#define bM4_USF_DIEPINT5_NAKINTRPT                      *((volatile unsigned int*)(0x43813534UL))
#define bM4_USF_DIEPINT5_NYETINTRPT                     *((volatile unsigned int*)(0x43813538UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE0                     *((volatile unsigned int*)(0x43813600UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE1                     *((volatile unsigned int*)(0x43813604UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE2                     *((volatile unsigned int*)(0x43813608UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE3                     *((volatile unsigned int*)(0x4381360CUL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE4                     *((volatile unsigned int*)(0x43813610UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE5                     *((volatile unsigned int*)(0x43813614UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE6                     *((volatile unsigned int*)(0x43813618UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE7                     *((volatile unsigned int*)(0x4381361CUL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE8                     *((volatile unsigned int*)(0x43813620UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE9                     *((volatile unsigned int*)(0x43813624UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE10                    *((volatile unsigned int*)(0x43813628UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE11                    *((volatile unsigned int*)(0x4381362CUL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE12                    *((volatile unsigned int*)(0x43813630UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE13                    *((volatile unsigned int*)(0x43813634UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE14                    *((volatile unsigned int*)(0x43813638UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE15                    *((volatile unsigned int*)(0x4381363CUL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE16                    *((volatile unsigned int*)(0x43813640UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE17                    *((volatile unsigned int*)(0x43813644UL))
#define bM4_USF_DIEPTSIZ5_XFERSIZE18                    *((volatile unsigned int*)(0x43813648UL))
#define bM4_USF_DIEPTSIZ5_PKTCNT0                       *((volatile unsigned int*)(0x4381364CUL))
#define bM4_USF_DIEPTSIZ5_PKTCNT1                       *((volatile unsigned int*)(0x43813650UL))
#define bM4_USF_DIEPTSIZ5_PKTCNT2                       *((volatile unsigned int*)(0x43813654UL))
#define bM4_USF_DIEPTSIZ5_PKTCNT3                       *((volatile unsigned int*)(0x43813658UL))
#define bM4_USF_DIEPTSIZ5_PKTCNT4                       *((volatile unsigned int*)(0x4381365CUL))
#define bM4_USF_DIEPTSIZ5_PKTCNT5                       *((volatile unsigned int*)(0x43813660UL))
#define bM4_USF_DIEPTSIZ5_PKTCNT6                       *((volatile unsigned int*)(0x43813664UL))
#define bM4_USF_DIEPTSIZ5_PKTCNT7                       *((volatile unsigned int*)(0x43813668UL))
#define bM4_USF_DIEPTSIZ5_PKTCNT8                       *((volatile unsigned int*)(0x4381366CUL))
#define bM4_USF_DIEPTSIZ5_PKTCNT9                       *((volatile unsigned int*)(0x43813670UL))
#define bM4_USF_DIEPTSIZ5_MC0                           *((volatile unsigned int*)(0x43813674UL))
#define bM4_USF_DIEPTSIZ5_MC1                           *((volatile unsigned int*)(0x43813678UL))
#define bM4_USF_DOEPCTL0_MPS0                           *((volatile unsigned int*)(0x43816000UL))
#define bM4_USF_DOEPCTL0_MPS1                           *((volatile unsigned int*)(0x43816004UL))
#define bM4_USF_DOEPCTL0_USBACTEP                       *((volatile unsigned int*)(0x4381603CUL))
#define bM4_USF_DOEPCTL0_NAKSTS                         *((volatile unsigned int*)(0x43816044UL))
#define bM4_USF_DOEPCTL0_EPTYPE0                        *((volatile unsigned int*)(0x43816048UL))
#define bM4_USF_DOEPCTL0_EPTYPE1                        *((volatile unsigned int*)(0x4381604CUL))
#define bM4_USF_DOEPCTL0_SNP                            *((volatile unsigned int*)(0x43816050UL))
#define bM4_USF_DOEPCTL0_STALL                          *((volatile unsigned int*)(0x43816054UL))
#define bM4_USF_DOEPCTL0_CNAK                           *((volatile unsigned int*)(0x43816068UL))
#define bM4_USF_DOEPCTL0_SNAK                           *((volatile unsigned int*)(0x4381606CUL))
#define bM4_USF_DOEPCTL0_EPDIS                          *((volatile unsigned int*)(0x43816078UL))
#define bM4_USF_DOEPCTL0_EPENA                          *((volatile unsigned int*)(0x4381607CUL))
#define bM4_USF_DOEPINT0_XFERCOMPL                      *((volatile unsigned int*)(0x43816100UL))
#define bM4_USF_DOEPINT0_EPDISBLD                       *((volatile unsigned int*)(0x43816104UL))
#define bM4_USF_DOEPINT0_AHBERR                         *((volatile unsigned int*)(0x43816108UL))
#define bM4_USF_DOEPINT0_SETUP                          *((volatile unsigned int*)(0x4381610CUL))
#define bM4_USF_DOEPINT0_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43816110UL))
#define bM4_USF_DOEPINT0_STSPHSERCVD                    *((volatile unsigned int*)(0x43816114UL))
#define bM4_USF_DOEPINT0_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43816118UL))
#define bM4_USF_DOEPINT0_OUTPKTERR                      *((volatile unsigned int*)(0x43816120UL))
#define bM4_USF_DOEPINT0_BNAINTR                        *((volatile unsigned int*)(0x43816124UL))
#define bM4_USF_DOEPINT0_PKTDRPSTS                      *((volatile unsigned int*)(0x4381612CUL))
#define bM4_USF_DOEPINT0_BBLEERR                        *((volatile unsigned int*)(0x43816130UL))
#define bM4_USF_DOEPINT0_NAKINTRPT                      *((volatile unsigned int*)(0x43816134UL))
#define bM4_USF_DOEPINT0_NYETINTRPT                     *((volatile unsigned int*)(0x43816138UL))
#define bM4_USF_DOEPINT0_STUPPKTRCVD                    *((volatile unsigned int*)(0x4381613CUL))
#define bM4_USF_DOEPTSIZ0_XFERSIZE0                     *((volatile unsigned int*)(0x43816200UL))
#define bM4_USF_DOEPTSIZ0_XFERSIZE1                     *((volatile unsigned int*)(0x43816204UL))
#define bM4_USF_DOEPTSIZ0_XFERSIZE2                     *((volatile unsigned int*)(0x43816208UL))
#define bM4_USF_DOEPTSIZ0_XFERSIZE3                     *((volatile unsigned int*)(0x4381620CUL))
#define bM4_USF_DOEPTSIZ0_XFERSIZE4                     *((volatile unsigned int*)(0x43816210UL))
#define bM4_USF_DOEPTSIZ0_XFERSIZE5                     *((volatile unsigned int*)(0x43816214UL))
#define bM4_USF_DOEPTSIZ0_XFERSIZE6                     *((volatile unsigned int*)(0x43816218UL))
#define bM4_USF_DOEPTSIZ0_PKTCNT                        *((volatile unsigned int*)(0x4381624CUL))
#define bM4_USF_DOEPTSIZ0_RESV                          *((volatile unsigned int*)(0x43816260UL))
#define bM4_USF_DOEPTSIZ0_SUPCNT0                       *((volatile unsigned int*)(0x43816274UL))
#define bM4_USF_DOEPTSIZ0_SUPCNT1                       *((volatile unsigned int*)(0x43816278UL))
#define bM4_USF_DOEPCTL1_MPS0                           *((volatile unsigned int*)(0x43816400UL))
#define bM4_USF_DOEPCTL1_MPS1                           *((volatile unsigned int*)(0x43816404UL))
#define bM4_USF_DOEPCTL1_MPS2                           *((volatile unsigned int*)(0x43816408UL))
#define bM4_USF_DOEPCTL1_MPS3                           *((volatile unsigned int*)(0x4381640CUL))
#define bM4_USF_DOEPCTL1_MPS4                           *((volatile unsigned int*)(0x43816410UL))
#define bM4_USF_DOEPCTL1_MPS5                           *((volatile unsigned int*)(0x43816414UL))
#define bM4_USF_DOEPCTL1_MPS6                           *((volatile unsigned int*)(0x43816418UL))
