RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_DOEPCTL1_MPS7                           *((volatile unsigned int*)(0x4381641CUL))
#define bM4_USF_DOEPCTL1_MPS8                           *((volatile unsigned int*)(0x43816420UL))
#define bM4_USF_DOEPCTL1_MPS9                           *((volatile unsigned int*)(0x43816424UL))
#define bM4_USF_DOEPCTL1_MPS10                          *((volatile unsigned int*)(0x43816428UL))
#define bM4_USF_DOEPCTL1_USBACTEP                       *((volatile unsigned int*)(0x4381643CUL))
#define bM4_USF_DOEPCTL1_DPID                           *((volatile unsigned int*)(0x43816440UL))
#define bM4_USF_DOEPCTL1_NAKSTS                         *((volatile unsigned int*)(0x43816444UL))
#define bM4_USF_DOEPCTL1_EPTYPE0                        *((volatile unsigned int*)(0x43816448UL))
#define bM4_USF_DOEPCTL1_EPTYPE1                        *((volatile unsigned int*)(0x4381644CUL))
#define bM4_USF_DOEPCTL1_SNP                            *((volatile unsigned int*)(0x43816450UL))
#define bM4_USF_DOEPCTL1_STALL                          *((volatile unsigned int*)(0x43816454UL))
#define bM4_USF_DOEPCTL1_CNAK                           *((volatile unsigned int*)(0x43816468UL))
#define bM4_USF_DOEPCTL1_SNAK                           *((volatile unsigned int*)(0x4381646CUL))
#define bM4_USF_DOEPCTL1_SETD0PID                       *((volatile unsigned int*)(0x43816470UL))
#define bM4_USF_DOEPCTL1_SETD1PID                       *((volatile unsigned int*)(0x43816474UL))
#define bM4_USF_DOEPCTL1_EPDIS                          *((volatile unsigned int*)(0x43816478UL))
#define bM4_USF_DOEPCTL1_EPENA                          *((volatile unsigned int*)(0x4381647CUL))
#define bM4_USF_DOEPINT1_XFERCOMPL                      *((volatile unsigned int*)(0x43816500UL))
#define bM4_USF_DOEPINT1_EPDISBLD                       *((volatile unsigned int*)(0x43816504UL))
#define bM4_USF_DOEPINT1_AHBERR                         *((volatile unsigned int*)(0x43816508UL))
#define bM4_USF_DOEPINT1_SETUP                          *((volatile unsigned int*)(0x4381650CUL))
#define bM4_USF_DOEPINT1_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43816510UL))
#define bM4_USF_DOEPINT1_STSPHSERCVD                    *((volatile unsigned int*)(0x43816514UL))
#define bM4_USF_DOEPINT1_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43816518UL))
#define bM4_USF_DOEPINT1_OUTPKTERR                      *((volatile unsigned int*)(0x43816520UL))
#define bM4_USF_DOEPINT1_BNAINTR                        *((volatile unsigned int*)(0x43816524UL))
#define bM4_USF_DOEPINT1_PKTDRPSTS                      *((volatile unsigned int*)(0x4381652CUL))
#define bM4_USF_DOEPINT1_BBLEERR                        *((volatile unsigned int*)(0x43816530UL))
#define bM4_USF_DOEPINT1_NAKINTRPT                      *((volatile unsigned int*)(0x43816534UL))
#define bM4_USF_DOEPINT1_NYETINTRPT                     *((volatile unsigned int*)(0x43816538UL))
#define bM4_USF_DOEPINT1_STUPPKTRCVD                    *((volatile unsigned int*)(0x4381653CUL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE0                     *((volatile unsigned int*)(0x43816600UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE1                     *((volatile unsigned int*)(0x43816604UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE2                     *((volatile unsigned int*)(0x43816608UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE3                     *((volatile unsigned int*)(0x4381660CUL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE4                     *((volatile unsigned int*)(0x43816610UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE5                     *((volatile unsigned int*)(0x43816614UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE6                     *((volatile unsigned int*)(0x43816618UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE7                     *((volatile unsigned int*)(0x4381661CUL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE8                     *((volatile unsigned int*)(0x43816620UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE9                     *((volatile unsigned int*)(0x43816624UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE10                    *((volatile unsigned int*)(0x43816628UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE11                    *((volatile unsigned int*)(0x4381662CUL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE12                    *((volatile unsigned int*)(0x43816630UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE13                    *((volatile unsigned int*)(0x43816634UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE14                    *((volatile unsigned int*)(0x43816638UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE15                    *((volatile unsigned int*)(0x4381663CUL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE16                    *((volatile unsigned int*)(0x43816640UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE17                    *((volatile unsigned int*)(0x43816644UL))
#define bM4_USF_DOEPTSIZ1_XFERSIZE18                    *((volatile unsigned int*)(0x43816648UL))
#define bM4_USF_DOEPTSIZ1_PKTCNT0                       *((volatile unsigned int*)(0x4381664CUL))
#define bM4_USF_DOEPTSIZ1_PKTCNT1                       *((volatile unsigned int*)(0x43816650UL))
#define bM4_USF_DOEPTSIZ1_PKTCNT2                       *((volatile unsigned int*)(0x43816654UL))
#define bM4_USF_DOEPTSIZ1_PKTCNT3                       *((volatile unsigned int*)(0x43816658UL))
#define bM4_USF_DOEPTSIZ1_PKTCNT4                       *((volatile unsigned int*)(0x4381665CUL))
#define bM4_USF_DOEPTSIZ1_PKTCNT5                       *((volatile unsigned int*)(0x43816660UL))
#define bM4_USF_DOEPTSIZ1_PKTCNT6                       *((volatile unsigned int*)(0x43816664UL))
#define bM4_USF_DOEPTSIZ1_PKTCNT7                       *((volatile unsigned int*)(0x43816668UL))
#define bM4_USF_DOEPTSIZ1_PKTCNT8                       *((volatile unsigned int*)(0x4381666CUL))
#define bM4_USF_DOEPTSIZ1_PKTCNT9                       *((volatile unsigned int*)(0x43816670UL))
#define bM4_USF_DOEPTSIZ1_RXDPID0                       *((volatile unsigned int*)(0x43816674UL))
#define bM4_USF_DOEPTSIZ1_RXDPID1                       *((volatile unsigned int*)(0x43816678UL))
#define bM4_USF_DOEPCTL2_MPS0                           *((volatile unsigned int*)(0x43816800UL))
#define bM4_USF_DOEPCTL2_MPS1                           *((volatile unsigned int*)(0x43816804UL))
#define bM4_USF_DOEPCTL2_MPS2                           *((volatile unsigned int*)(0x43816808UL))
#define bM4_USF_DOEPCTL2_MPS3                           *((volatile unsigned int*)(0x4381680CUL))
#define bM4_USF_DOEPCTL2_MPS4                           *((volatile unsigned int*)(0x43816810UL))
#define bM4_USF_DOEPCTL2_MPS5                           *((volatile unsigned int*)(0x43816814UL))
#define bM4_USF_DOEPCTL2_MPS6                           *((volatile unsigned int*)(0x43816818UL))
#define bM4_USF_DOEPCTL2_MPS7                           *((volatile unsigned int*)(0x4381681CUL))
#define bM4_USF_DOEPCTL2_MPS8                           *((volatile unsigned int*)(0x43816820UL))
#define bM4_USF_DOEPCTL2_MPS9                           *((volatile unsigned int*)(0x43816824UL))
#define bM4_USF_DOEPCTL2_MPS10                          *((volatile unsigned int*)(0x43816828UL))
#define bM4_USF_DOEPCTL2_USBACTEP                       *((volatile unsigned int*)(0x4381683CUL))
#define bM4_USF_DOEPCTL2_DPID                           *((volatile unsigned int*)(0x43816840UL))
#define bM4_USF_DOEPCTL2_NAKSTS                         *((volatile unsigned int*)(0x43816844UL))
#define bM4_USF_DOEPCTL2_EPTYPE0                        *((volatile unsigned int*)(0x43816848UL))
#define bM4_USF_DOEPCTL2_EPTYPE1                        *((volatile unsigned int*)(0x4381684CUL))
#define bM4_USF_DOEPCTL2_SNP                            *((volatile unsigned int*)(0x43816850UL))
#define bM4_USF_DOEPCTL2_STALL                          *((volatile unsigned int*)(0x43816854UL))
#define bM4_USF_DOEPCTL2_CNAK                           *((volatile unsigned int*)(0x43816868UL))
#define bM4_USF_DOEPCTL2_SNAK                           *((volatile unsigned int*)(0x4381686CUL))
#define bM4_USF_DOEPCTL2_SETD0PID                       *((volatile unsigned int*)(0x43816870UL))
#define bM4_USF_DOEPCTL2_SETD1PID                       *((volatile unsigned int*)(0x43816874UL))
#define bM4_USF_DOEPCTL2_EPDIS                          *((volatile unsigned int*)(0x43816878UL))
#define bM4_USF_DOEPCTL2_EPENA                          *((volatile unsigned int*)(0x4381687CUL))
#define bM4_USF_DOEPINT2_XFERCOMPL                      *((volatile unsigned int*)(0x43816900UL))
#define bM4_USF_DOEPINT2_EPDISBLD                       *((volatile unsigned int*)(0x43816904UL))
#define bM4_USF_DOEPINT2_AHBERR                         *((volatile unsigned int*)(0x43816908UL))
#define bM4_USF_DOEPINT2_SETUP                          *((volatile unsigned int*)(0x4381690CUL))
#define bM4_USF_DOEPINT2_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43816910UL))
#define bM4_USF_DOEPINT2_STSPHSERCVD                    *((volatile unsigned int*)(0x43816914UL))
#define bM4_USF_DOEPINT2_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43816918UL))
#define bM4_USF_DOEPINT2_OUTPKTERR                      *((volatile unsigned int*)(0x43816920UL))
#define bM4_USF_DOEPINT2_BNAINTR                        *((volatile unsigned int*)(0x43816924UL))
#define bM4_USF_DOEPINT2_PKTDRPSTS                      *((volatile unsigned int*)(0x4381692CUL))
#define bM4_USF_DOEPINT2_BBLEERR                        *((volatile unsigned int*)(0x43816930UL))
#define bM4_USF_DOEPINT2_NAKINTRPT                      *((volatile unsigned int*)(0x43816934UL))
#define bM4_USF_DOEPINT2_NYETINTRPT                     *((volatile unsigned int*)(0x43816938UL))
#define bM4_USF_DOEPINT2_STUPPKTRCVD                    *((volatile unsigned int*)(0x4381693CUL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE0                     *((volatile unsigned int*)(0x43816A00UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE1                     *((volatile unsigned int*)(0x43816A04UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE2                     *((volatile unsigned int*)(0x43816A08UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE3                     *((volatile unsigned int*)(0x43816A0CUL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE4                     *((volatile unsigned int*)(0x43816A10UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE5                     *((volatile unsigned int*)(0x43816A14UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE6                     *((volatile unsigned int*)(0x43816A18UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE7                     *((volatile unsigned int*)(0x43816A1CUL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE8                     *((volatile unsigned int*)(0x43816A20UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE9                     *((volatile unsigned int*)(0x43816A24UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE10                    *((volatile unsigned int*)(0x43816A28UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE11                    *((volatile unsigned int*)(0x43816A2CUL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE12                    *((volatile unsigned int*)(0x43816A30UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE13                    *((volatile unsigned int*)(0x43816A34UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE14                    *((volatile unsigned int*)(0x43816A38UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE15                    *((volatile unsigned int*)(0x43816A3CUL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE16                    *((volatile unsigned int*)(0x43816A40UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE17                    *((volatile unsigned int*)(0x43816A44UL))
#define bM4_USF_DOEPTSIZ2_XFERSIZE18                    *((volatile unsigned int*)(0x43816A48UL))
#define bM4_USF_DOEPTSIZ2_PKTCNT0                       *((volatile unsigned int*)(0x43816A4CUL))
#define bM4_USF_DOEPTSIZ2_PKTCNT1                       *((volatile unsigned int*)(0x43816A50UL))
#define bM4_USF_DOEPTSIZ2_PKTCNT2                       *((volatile unsigned int*)(0x43816A54UL))
#define bM4_USF_DOEPTSIZ2_PKTCNT3                       *((volatile unsigned int*)(0x43816A58UL))
#define bM4_USF_DOEPTSIZ2_PKTCNT4                       *((volatile unsigned int*)(0x43816A5CUL))
#define bM4_USF_DOEPTSIZ2_PKTCNT5                       *((volatile unsigned int*)(0x43816A60UL))
#define bM4_USF_DOEPTSIZ2_PKTCNT6                       *((volatile unsigned int*)(0x43816A64UL))
#define bM4_USF_DOEPTSIZ2_PKTCNT7                       *((volatile unsigned int*)(0x43816A68UL))
#define bM4_USF_DOEPTSIZ2_PKTCNT8                       *((volatile unsigned int*)(0x43816A6CUL))
#define bM4_USF_DOEPTSIZ2_PKTCNT9                       *((volatile unsigned int*)(0x43816A70UL))
#define bM4_USF_DOEPTSIZ2_RXDPID0                       *((volatile unsigned int*)(0x43816A74UL))
#define bM4_USF_DOEPTSIZ2_RXDPID1                       *((volatile unsigned int*)(0x43816A78UL))
#define bM4_USF_DOEPCTL3_MPS0                           *((volatile unsigned int*)(0x43816C00UL))
#define bM4_USF_DOEPCTL3_MPS1                           *((volatile unsigned int*)(0x43816C04UL))
#define bM4_USF_DOEPCTL3_MPS2                           *((volatile unsigned int*)(0x43816C08UL))
#define bM4_USF_DOEPCTL3_MPS3                           *((volatile unsigned int*)(0x43816C0CUL))
#define bM4_USF_DOEPCTL3_MPS4                           *((volatile unsigned int*)(0x43816C10UL))
#define bM4_USF_DOEPCTL3_MPS5                           *((volatile unsigned int*)(0x43816C14UL))
#define bM4_USF_DOEPCTL3_MPS6                           *((volatile unsigned int*)(0x43816C18UL))
#define bM4_USF_DOEPCTL3_MPS7                           *((volatile unsigned int*)(0x43816C1CUL))
#define bM4_USF_DOEPCTL3_MPS8                           *((volatile unsigned int*)(0x43816C20UL))
#define bM4_USF_DOEPCTL3_MPS9                           *((volatile unsigned int*)(0x43816C24UL))
#define bM4_USF_DOEPCTL3_MPS10                          *((volatile unsigned int*)(0x43816C28UL))
#define bM4_USF_DOEPCTL3_USBACTEP                       *((volatile unsigned int*)(0x43816C3CUL))
#define bM4_USF_DOEPCTL3_DPID                           *((volatile unsigned int*)(0x43816C40UL))
#define bM4_USF_DOEPCTL3_NAKSTS                         *((volatile unsigned int*)(0x43816C44UL))
#define bM4_USF_DOEPCTL3_EPTYPE0                        *((volatile unsigned int*)(0x43816C48UL))
#define bM4_USF_DOEPCTL3_EPTYPE1                        *((volatile unsigned int*)(0x43816C4CUL))
#define bM4_USF_DOEPCTL3_SNP                            *((volatile unsigned int*)(0x43816C50UL))
#define bM4_USF_DOEPCTL3_STALL                          *((volatile unsigned int*)(0x43816C54UL))
#define bM4_USF_DOEPCTL3_CNAK                           *((volatile unsigned int*)(0x43816C68UL))
#define bM4_USF_DOEPCTL3_SNAK                           *((volatile unsigned int*)(0x43816C6CUL))
#define bM4_USF_DOEPCTL3_SETD0PID                       *((volatile unsigned int*)(0x43816C70UL))
#define bM4_USF_DOEPCTL3_SETD1PID                       *((volatile unsigned int*)(0x43816C74UL))
#define bM4_USF_DOEPCTL3_EPDIS                          *((volatile unsigned int*)(0x43816C78UL))
#define bM4_USF_DOEPCTL3_EPENA                          *((volatile unsigned int*)(0x43816C7CUL))
#define bM4_USF_DOEPINT3_XFERCOMPL                      *((volatile unsigned int*)(0x43816D00UL))
#define bM4_USF_DOEPINT3_EPDISBLD                       *((volatile unsigned int*)(0x43816D04UL))
#define bM4_USF_DOEPINT3_AHBERR                         *((volatile unsigned int*)(0x43816D08UL))
#define bM4_USF_DOEPINT3_SETUP                          *((volatile unsigned int*)(0x43816D0CUL))
#define bM4_USF_DOEPINT3_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43816D10UL))
#define bM4_USF_DOEPINT3_STSPHSERCVD                    *((volatile unsigned int*)(0x43816D14UL))
#define bM4_USF_DOEPINT3_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43816D18UL))
#define bM4_USF_DOEPINT3_OUTPKTERR                      *((volatile unsigned int*)(0x43816D20UL))
#define bM4_USF_DOEPINT3_BNAINTR                        *((volatile unsigned int*)(0x43816D24UL))
#define bM4_USF_DOEPINT3_PKTDRPSTS                      *((volatile unsigned int*)(0x43816D2CUL))
#define bM4_USF_DOEPINT3_BBLEERR                        *((volatile unsigned int*)(0x43816D30UL))
#define bM4_USF_DOEPINT3_NAKINTRPT                      *((volatile unsigned int*)(0x43816D34UL))
#define bM4_USF_DOEPINT3_NYETINTRPT                     *((volatile unsigned int*)(0x43816D38UL))
#define bM4_USF_DOEPINT3_STUPPKTRCVD                    *((volatile unsigned int*)(0x43816D3CUL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE0                     *((volatile unsigned int*)(0x43816E00UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE1                     *((volatile unsigned int*)(0x43816E04UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE2                     *((volatile unsigned int*)(0x43816E08UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE3                     *((volatile unsigned int*)(0x43816E0CUL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE4                     *((volatile unsigned int*)(0x43816E10UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE5                     *((volatile unsigned int*)(0x43816E14UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE6                     *((volatile unsigned int*)(0x43816E18UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE7                     *((volatile unsigned int*)(0x43816E1CUL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE8                     *((volatile unsigned int*)(0x43816E20UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE9                     *((volatile unsigned int*)(0x43816E24UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE10                    *((volatile unsigned int*)(0x43816E28UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE11                    *((volatile unsigned int*)(0x43816E2CUL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE12                    *((volatile unsigned int*)(0x43816E30UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE13                    *((volatile unsigned int*)(0x43816E34UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE14                    *((volatile unsigned int*)(0x43816E38UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE15                    *((volatile unsigned int*)(0x43816E3CUL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE16                    *((volatile unsigned int*)(0x43816E40UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE17                    *((volatile unsigned int*)(0x43816E44UL))
#define bM4_USF_DOEPTSIZ3_XFERSIZE18                    *((volatile unsigned int*)(0x43816E48UL))
#define bM4_USF_DOEPTSIZ3_PKTCNT0                       *((volatile unsigned int*)(0x43816E4CUL))
#define bM4_USF_DOEPTSIZ3_PKTCNT1                       *((volatile unsigned int*)(0x43816E50UL))
#define bM4_USF_DOEPTSIZ3_PKTCNT2                       *((volatile unsigned int*)(0x43816E54UL))
#define bM4_USF_DOEPTSIZ3_PKTCNT3                       *((volatile unsigned int*)(0x43816E58UL))
#define bM4_USF_DOEPTSIZ3_PKTCNT4                       *((volatile unsigned int*)(0x43816E5CUL))
#define bM4_USF_DOEPTSIZ3_PKTCNT5                       *((volatile unsigned int*)(0x43816E60UL))
#define bM4_USF_DOEPTSIZ3_PKTCNT6                       *((volatile unsigned int*)(0x43816E64UL))
#define bM4_USF_DOEPTSIZ3_PKTCNT7                       *((volatile unsigned int*)(0x43816E68UL))
#define bM4_USF_DOEPTSIZ3_PKTCNT8                       *((volatile unsigned int*)(0x43816E6CUL))
#define bM4_USF_DOEPTSIZ3_PKTCNT9                       *((volatile unsigned int*)(0x43816E70UL))
#define bM4_USF_DOEPTSIZ3_RXDPID0                       *((volatile unsigned int*)(0x43816E74UL))
#define bM4_USF_DOEPTSIZ3_RXDPID1                       *((volatile unsigned int*)(0x43816E78UL))
#define bM4_USF_DOEPCTL4_MPS0                           *((volatile unsigned int*)(0x43817000UL))
#define bM4_USF_DOEPCTL4_MPS1                           *((volatile unsigned int*)(0x43817004UL))
#define bM4_USF_DOEPCTL4_MPS2                           *((volatile unsigned int*)(0x43817008UL))
#define bM4_USF_DOEPCTL4_MPS3                           *((volatile unsigned int*)(0x4381700CUL))
#define bM4_USF_DOEPCTL4_MPS4                           *((volatile unsigned int*)(0x43817010UL))
#define bM4_USF_DOEPCTL4_MPS5                           *((volatile unsigned int*)(0x43817014UL))
#define bM4_USF_DOEPCTL4_MPS6                           *((volatile unsigned int*)(0x43817018UL))
#define bM4_USF_DOEPCTL4_MPS7                           *((volatile unsigned int*)(0x4381701CUL))
#define bM4_USF_DOEPCTL4_MPS8                           *((volatile unsigned int*)(0x43817020UL))
#define bM4_USF_DOEPCTL4_MPS9                           *((volatile unsigned int*)(0x43817024UL))
#define bM4_USF_DOEPCTL4_MPS10                          *((volatile unsigned int*)(0x43817028UL))
#define bM4_USF_DOEPCTL4_USBACTEP                       *((volatile unsigned int*)(0x4381703CUL))
#define bM4_USF_DOEPCTL4_DPID                           *((volatile unsigned int*)(0x43817040UL))
#define bM4_USF_DOEPCTL4_NAKSTS                         *((volatile unsigned int*)(0x43817044UL))
#define bM4_USF_DOEPCTL4_EPTYPE0                        *((volatile unsigned int*)(0x43817048UL))
#define bM4_USF_DOEPCTL4_EPTYPE1                        *((volatile unsigned int*)(0x4381704CUL))
#define bM4_USF_DOEPCTL4_SNP                            *((volatile unsigned int*)(0x43817050UL))
#define bM4_USF_DOEPCTL4_STALL                          *((volatile unsigned int*)(0x43817054UL))
#define bM4_USF_DOEPCTL4_CNAK                           *((volatile unsigned int*)(0x43817068UL))
#define bM4_USF_DOEPCTL4_SNAK                           *((volatile unsigned int*)(0x4381706CUL))
#define bM4_USF_DOEPCTL4_SETD0PID                       *((volatile unsigned int*)(0x43817070UL))
#define bM4_USF_DOEPCTL4_SETD1PID                       *((volatile unsigned int*)(0x43817074UL))
#define bM4_USF_DOEPCTL4_EPDIS                          *((volatile unsigned int*)(0x43817078UL))
#define bM4_USF_DOEPCTL4_EPENA                          *((volatile unsigned int*)(0x4381707CUL))
#define bM4_USF_DOEPINT4_XFERCOMPL                      *((volatile unsigned int*)(0x43817100UL))
#define bM4_USF_DOEPINT4_EPDISBLD                       *((volatile unsigned int*)(0x43817104UL))
#define bM4_USF_DOEPINT4_AHBERR                         *((volatile unsigned int*)(0x43817108UL))
#define bM4_USF_DOEPINT4_SETUP                          *((volatile unsigned int*)(0x4381710CUL))
#define bM4_USF_DOEPINT4_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43817110UL))
#define bM4_USF_DOEPINT4_STSPHSERCVD                    *((volatile unsigned int*)(0x43817114UL))
#define bM4_USF_DOEPINT4_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43817118UL))
#define bM4_USF_DOEPINT4_OUTPKTERR                      *((volatile unsigned int*)(0x43817120UL))
#define bM4_USF_DOEPINT4_BNAINTR                        *((volatile unsigned int*)(0x43817124UL))
#define bM4_USF_DOEPINT4_PKTDRPSTS                      *((volatile unsigned int*)(0x4381712CUL))
#define bM4_USF_DOEPINT4_BBLEERR                        *((volatile unsigned int*)(0x43817130UL))
#define bM4_USF_DOEPINT4_NAKINTRPT                      *((volatile unsigned int*)(0x43817134UL))
#define bM4_USF_DOEPINT4_NYETINTRPT                     *((volatile unsigned int*)(0x43817138UL))
#define bM4_USF_DOEPINT4_STUPPKTRCVD                    *((volatile unsigned int*)(0x4381713CUL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE0                     *((volatile unsigned int*)(0x43817200UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE1                     *((volatile unsigned int*)(0x43817204UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE2                     *((volatile unsigned int*)(0x43817208UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE3                     *((volatile unsigned int*)(0x4381720CUL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE4                     *((volatile unsigned int*)(0x43817210UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE5                     *((volatile unsigned int*)(0x43817214UL))
