RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USF_DOEPTSIZ4_XFERSIZE6                     *((volatile unsigned int*)(0x43817218UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE7                     *((volatile unsigned int*)(0x4381721CUL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE8                     *((volatile unsigned int*)(0x43817220UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE9                     *((volatile unsigned int*)(0x43817224UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE10                    *((volatile unsigned int*)(0x43817228UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE11                    *((volatile unsigned int*)(0x4381722CUL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE12                    *((volatile unsigned int*)(0x43817230UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE13                    *((volatile unsigned int*)(0x43817234UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE14                    *((volatile unsigned int*)(0x43817238UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE15                    *((volatile unsigned int*)(0x4381723CUL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE16                    *((volatile unsigned int*)(0x43817240UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE17                    *((volatile unsigned int*)(0x43817244UL))
#define bM4_USF_DOEPTSIZ4_XFERSIZE18                    *((volatile unsigned int*)(0x43817248UL))
#define bM4_USF_DOEPTSIZ4_PKTCNT0                       *((volatile unsigned int*)(0x4381724CUL))
#define bM4_USF_DOEPTSIZ4_PKTCNT1                       *((volatile unsigned int*)(0x43817250UL))
#define bM4_USF_DOEPTSIZ4_PKTCNT2                       *((volatile unsigned int*)(0x43817254UL))
#define bM4_USF_DOEPTSIZ4_PKTCNT3                       *((volatile unsigned int*)(0x43817258UL))
#define bM4_USF_DOEPTSIZ4_PKTCNT4                       *((volatile unsigned int*)(0x4381725CUL))
#define bM4_USF_DOEPTSIZ4_PKTCNT5                       *((volatile unsigned int*)(0x43817260UL))
#define bM4_USF_DOEPTSIZ4_PKTCNT6                       *((volatile unsigned int*)(0x43817264UL))
#define bM4_USF_DOEPTSIZ4_PKTCNT7                       *((volatile unsigned int*)(0x43817268UL))
#define bM4_USF_DOEPTSIZ4_PKTCNT8                       *((volatile unsigned int*)(0x4381726CUL))
#define bM4_USF_DOEPTSIZ4_PKTCNT9                       *((volatile unsigned int*)(0x43817270UL))
#define bM4_USF_DOEPTSIZ4_RXDPID0                       *((volatile unsigned int*)(0x43817274UL))
#define bM4_USF_DOEPTSIZ4_RXDPID1                       *((volatile unsigned int*)(0x43817278UL))
#define bM4_USF_DOEPCTL5_MPS0                           *((volatile unsigned int*)(0x43817400UL))
#define bM4_USF_DOEPCTL5_MPS1                           *((volatile unsigned int*)(0x43817404UL))
#define bM4_USF_DOEPCTL5_MPS2                           *((volatile unsigned int*)(0x43817408UL))
#define bM4_USF_DOEPCTL5_MPS3                           *((volatile unsigned int*)(0x4381740CUL))
#define bM4_USF_DOEPCTL5_MPS4                           *((volatile unsigned int*)(0x43817410UL))
#define bM4_USF_DOEPCTL5_MPS5                           *((volatile unsigned int*)(0x43817414UL))
#define bM4_USF_DOEPCTL5_MPS6                           *((volatile unsigned int*)(0x43817418UL))
#define bM4_USF_DOEPCTL5_MPS7                           *((volatile unsigned int*)(0x4381741CUL))
#define bM4_USF_DOEPCTL5_MPS8                           *((volatile unsigned int*)(0x43817420UL))
#define bM4_USF_DOEPCTL5_MPS9                           *((volatile unsigned int*)(0x43817424UL))
#define bM4_USF_DOEPCTL5_MPS10                          *((volatile unsigned int*)(0x43817428UL))
#define bM4_USF_DOEPCTL5_USBACTEP                       *((volatile unsigned int*)(0x4381743CUL))
#define bM4_USF_DOEPCTL5_DPID                           *((volatile unsigned int*)(0x43817440UL))
#define bM4_USF_DOEPCTL5_NAKSTS                         *((volatile unsigned int*)(0x43817444UL))
#define bM4_USF_DOEPCTL5_EPTYPE0                        *((volatile unsigned int*)(0x43817448UL))
#define bM4_USF_DOEPCTL5_EPTYPE1                        *((volatile unsigned int*)(0x4381744CUL))
#define bM4_USF_DOEPCTL5_SNP                            *((volatile unsigned int*)(0x43817450UL))
#define bM4_USF_DOEPCTL5_STALL                          *((volatile unsigned int*)(0x43817454UL))
#define bM4_USF_DOEPCTL5_CNAK                           *((volatile unsigned int*)(0x43817468UL))
#define bM4_USF_DOEPCTL5_SNAK                           *((volatile unsigned int*)(0x4381746CUL))
#define bM4_USF_DOEPCTL5_SETD0PID                       *((volatile unsigned int*)(0x43817470UL))
#define bM4_USF_DOEPCTL5_SETD1PID                       *((volatile unsigned int*)(0x43817474UL))
#define bM4_USF_DOEPCTL5_EPDIS                          *((volatile unsigned int*)(0x43817478UL))
#define bM4_USF_DOEPCTL5_EPENA                          *((volatile unsigned int*)(0x4381747CUL))
#define bM4_USF_DOEPINT5_XFERCOMPL                      *((volatile unsigned int*)(0x43817500UL))
#define bM4_USF_DOEPINT5_EPDISBLD                       *((volatile unsigned int*)(0x43817504UL))
#define bM4_USF_DOEPINT5_AHBERR                         *((volatile unsigned int*)(0x43817508UL))
#define bM4_USF_DOEPINT5_SETUP                          *((volatile unsigned int*)(0x4381750CUL))
#define bM4_USF_DOEPINT5_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43817510UL))
#define bM4_USF_DOEPINT5_STSPHSERCVD                    *((volatile unsigned int*)(0x43817514UL))
#define bM4_USF_DOEPINT5_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43817518UL))
#define bM4_USF_DOEPINT5_OUTPKTERR                      *((volatile unsigned int*)(0x43817520UL))
#define bM4_USF_DOEPINT5_BNAINTR                        *((volatile unsigned int*)(0x43817524UL))
#define bM4_USF_DOEPINT5_PKTDRPSTS                      *((volatile unsigned int*)(0x4381752CUL))
#define bM4_USF_DOEPINT5_BBLEERR                        *((volatile unsigned int*)(0x43817530UL))
#define bM4_USF_DOEPINT5_NAKINTRPT                      *((volatile unsigned int*)(0x43817534UL))
#define bM4_USF_DOEPINT5_NYETINTRPT                     *((volatile unsigned int*)(0x43817538UL))
#define bM4_USF_DOEPINT5_STUPPKTRCVD                    *((volatile unsigned int*)(0x4381753CUL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE0                     *((volatile unsigned int*)(0x43817600UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE1                     *((volatile unsigned int*)(0x43817604UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE2                     *((volatile unsigned int*)(0x43817608UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE3                     *((volatile unsigned int*)(0x4381760CUL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE4                     *((volatile unsigned int*)(0x43817610UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE5                     *((volatile unsigned int*)(0x43817614UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE6                     *((volatile unsigned int*)(0x43817618UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE7                     *((volatile unsigned int*)(0x4381761CUL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE8                     *((volatile unsigned int*)(0x43817620UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE9                     *((volatile unsigned int*)(0x43817624UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE10                    *((volatile unsigned int*)(0x43817628UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE11                    *((volatile unsigned int*)(0x4381762CUL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE12                    *((volatile unsigned int*)(0x43817630UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE13                    *((volatile unsigned int*)(0x43817634UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE14                    *((volatile unsigned int*)(0x43817638UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE15                    *((volatile unsigned int*)(0x4381763CUL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE16                    *((volatile unsigned int*)(0x43817640UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE17                    *((volatile unsigned int*)(0x43817644UL))
#define bM4_USF_DOEPTSIZ5_XFERSIZE18                    *((volatile unsigned int*)(0x43817648UL))
#define bM4_USF_DOEPTSIZ5_PKTCNT0                       *((volatile unsigned int*)(0x4381764CUL))
#define bM4_USF_DOEPTSIZ5_PKTCNT1                       *((volatile unsigned int*)(0x43817650UL))
#define bM4_USF_DOEPTSIZ5_PKTCNT2                       *((volatile unsigned int*)(0x43817654UL))
#define bM4_USF_DOEPTSIZ5_PKTCNT3                       *((volatile unsigned int*)(0x43817658UL))
#define bM4_USF_DOEPTSIZ5_PKTCNT4                       *((volatile unsigned int*)(0x4381765CUL))
#define bM4_USF_DOEPTSIZ5_PKTCNT5                       *((volatile unsigned int*)(0x43817660UL))
#define bM4_USF_DOEPTSIZ5_PKTCNT6                       *((volatile unsigned int*)(0x43817664UL))
#define bM4_USF_DOEPTSIZ5_PKTCNT7                       *((volatile unsigned int*)(0x43817668UL))
#define bM4_USF_DOEPTSIZ5_PKTCNT8                       *((volatile unsigned int*)(0x4381766CUL))
#define bM4_USF_DOEPTSIZ5_PKTCNT9                       *((volatile unsigned int*)(0x43817670UL))
#define bM4_USF_DOEPTSIZ5_RXDPID0                       *((volatile unsigned int*)(0x43817674UL))
#define bM4_USF_DOEPTSIZ5_RXDPID1                       *((volatile unsigned int*)(0x43817678UL))
#define bM4_USF_PCGCCTL_STOPPCLK                        *((volatile unsigned int*)(0x4381C000UL))
#define bM4_USF_PCGCCTL_GATEHCLK                        *((volatile unsigned int*)(0x4381C004UL))
#define bM4_USF_PCGCCTL_PWRCLMP                         *((volatile unsigned int*)(0x4381C008UL))
#define bM4_USF_PCGCCTL_RSTPDWNMODULE                   *((volatile unsigned int*)(0x4381C00CUL))
#define bM4_USF_PCGCCTL_PHYSLEEP                        *((volatile unsigned int*)(0x4381C018UL))
#define bM4_USF_PCGCCTL_L1SUSPENDED                     *((volatile unsigned int*)(0x4381C01CUL))
#define bM4_USF_PCGCCTL_RESETAFTERSUSP                  *((volatile unsigned int*)(0x4381C020UL))
#define bM4_USH_GOTGCTL_SESREQSCS                       *((volatile unsigned int*)(0x43000000UL))
#define bM4_USH_GOTGCTL_SESREQ                          *((volatile unsigned int*)(0x43000004UL))
#define bM4_USH_GOTGCTL_VBVALIDOVEN                     *((volatile unsigned int*)(0x43000008UL))
#define bM4_USH_GOTGCTL_VBVALIDOVVAL                    *((volatile unsigned int*)(0x4300000CUL))
#define bM4_USH_GOTGCTL_AVALIDOVEN                      *((volatile unsigned int*)(0x43000010UL))
#define bM4_USH_GOTGCTL_AVALIDOVVAL                     *((volatile unsigned int*)(0x43000014UL))
#define bM4_USH_GOTGCTL_BVALIDOVEN                      *((volatile unsigned int*)(0x43000018UL))
#define bM4_USH_GOTGCTL_BVALIDOVVAL                     *((volatile unsigned int*)(0x4300001CUL))
#define bM4_USH_GOTGCTL_HSTNEGSCS                       *((volatile unsigned int*)(0x43000020UL))
#define bM4_USH_GOTGCTL_HNPREQ                          *((volatile unsigned int*)(0x43000024UL))
#define bM4_USH_GOTGCTL_HSTSETHNPEN                     *((volatile unsigned int*)(0x43000028UL))
#define bM4_USH_GOTGCTL_DEVHNPEN                        *((volatile unsigned int*)(0x4300002CUL))
#define bM4_USH_GOTGCTL_EHEN                            *((volatile unsigned int*)(0x43000030UL))
#define bM4_USH_GOTGCTL_DBNCEFLTRBYPASS                 *((volatile unsigned int*)(0x4300003CUL))
#define bM4_USH_GOTGCTL_CONIDSTS                        *((volatile unsigned int*)(0x43000040UL))
#define bM4_USH_GOTGCTL_DBNCTIME                        *((volatile unsigned int*)(0x43000044UL))
#define bM4_USH_GOTGCTL_ASESVLD                         *((volatile unsigned int*)(0x43000048UL))
#define bM4_USH_GOTGCTL_BSESVLD                         *((volatile unsigned int*)(0x4300004CUL))
#define bM4_USH_GOTGCTL_OTGVER                          *((volatile unsigned int*)(0x43000050UL))
#define bM4_USH_GOTGCTL_CURMOD                          *((volatile unsigned int*)(0x43000054UL))
#define bM4_USH_GOTGCTL_RESV                            *((volatile unsigned int*)(0x43000060UL))
#define bM4_USH_GOTGINT_SESENDDET                       *((volatile unsigned int*)(0x43000088UL))
#define bM4_USH_GOTGINT_SESREQSUCSTSCHNG                *((volatile unsigned int*)(0x430000A0UL))
#define bM4_USH_GOTGINT_HSTNEGSUCSTSCHNG                *((volatile unsigned int*)(0x430000A4UL))
#define bM4_USH_GOTGINT_HSTNEGDET                       *((volatile unsigned int*)(0x430000C4UL))
#define bM4_USH_GOTGINT_ADEVTOUTCHG                     *((volatile unsigned int*)(0x430000C8UL))
#define bM4_USH_GOTGINT_DBNCEDONE                       *((volatile unsigned int*)(0x430000CCUL))
#define bM4_USH_GOTGINT_RESV                            *((volatile unsigned int*)(0x430000E0UL))
#define bM4_USH_GAHBCFG_GLBLINTRMSK                     *((volatile unsigned int*)(0x43000100UL))
#define bM4_USH_GAHBCFG_HBSTLEN0                        *((volatile unsigned int*)(0x43000104UL))
#define bM4_USH_GAHBCFG_HBSTLEN1                        *((volatile unsigned int*)(0x43000108UL))
#define bM4_USH_GAHBCFG_HBSTLEN2                        *((volatile unsigned int*)(0x4300010CUL))
#define bM4_USH_GAHBCFG_HBSTLEN3                        *((volatile unsigned int*)(0x43000110UL))
#define bM4_USH_GAHBCFG_DMAEN                           *((volatile unsigned int*)(0x43000114UL))
#define bM4_USH_GAHBCFG_NPTXFEMPLVL                     *((volatile unsigned int*)(0x4300011CUL))
#define bM4_USH_GAHBCFG_PTXFEMPLVL                      *((volatile unsigned int*)(0x43000120UL))
#define bM4_USH_GAHBCFG_REMMEMSUPP                      *((volatile unsigned int*)(0x43000154UL))
#define bM4_USH_GAHBCFG_NOTIALLDMAWRIT                  *((volatile unsigned int*)(0x43000158UL))
#define bM4_USH_GAHBCFG_AHBSINGLE                       *((volatile unsigned int*)(0x4300015CUL))
#define bM4_USH_GAHBCFG_RESV                            *((volatile unsigned int*)(0x43000160UL))
#define bM4_USH_GUSBCFG_TOUTCAL0                        *((volatile unsigned int*)(0x43000180UL))
#define bM4_USH_GUSBCFG_TOUTCAL1                        *((volatile unsigned int*)(0x43000184UL))
#define bM4_USH_GUSBCFG_TOUTCAL2                        *((volatile unsigned int*)(0x43000188UL))
#define bM4_USH_GUSBCFG_PHYIF                           *((volatile unsigned int*)(0x4300018CUL))
#define bM4_USH_GUSBCFG_ULPI_UTMI_SEL                   *((volatile unsigned int*)(0x43000190UL))
#define bM4_USH_GUSBCFG_FSINTF                          *((volatile unsigned int*)(0x43000194UL))
#define bM4_USH_GUSBCFG_PHYSEL                          *((volatile unsigned int*)(0x43000198UL))
#define bM4_USH_GUSBCFG_DDRSEL                          *((volatile unsigned int*)(0x4300019CUL))
#define bM4_USH_GUSBCFG_SRPCAP                          *((volatile unsigned int*)(0x430001A0UL))
#define bM4_USH_GUSBCFG_HNPCAP                          *((volatile unsigned int*)(0x430001A4UL))
#define bM4_USH_GUSBCFG_USBTRDTIM0                      *((volatile unsigned int*)(0x430001A8UL))
#define bM4_USH_GUSBCFG_USBTRDTIM1                      *((volatile unsigned int*)(0x430001ACUL))
#define bM4_USH_GUSBCFG_USBTRDTIM2                      *((volatile unsigned int*)(0x430001B0UL))
#define bM4_USH_GUSBCFG_USBTRDTIM3                      *((volatile unsigned int*)(0x430001B4UL))
#define bM4_USH_GUSBCFG_ULPIFSLS                        *((volatile unsigned int*)(0x430001C4UL))
#define bM4_USH_GUSBCFG_ULPIAUTORES                     *((volatile unsigned int*)(0x430001C8UL))
#define bM4_USH_GUSBCFG_ULPICLKSUSM                     *((volatile unsigned int*)(0x430001CCUL))
#define bM4_USH_GUSBCFG_ULPIEXTVBUSDRV                  *((volatile unsigned int*)(0x430001D0UL))
#define bM4_USH_GUSBCFG_ULPIEXTVBUSINDICATOR            *((volatile unsigned int*)(0x430001D4UL))
#define bM4_USH_GUSBCFG_TERMSELDLPULSE                  *((volatile unsigned int*)(0x430001D8UL))
#define bM4_USH_GUSBCFG_COMPLEMENT                      *((volatile unsigned int*)(0x430001DCUL))
#define bM4_USH_GUSBCFG_INDICATOR                       *((volatile unsigned int*)(0x430001E0UL))
#define bM4_USH_GUSBCFG_ULPI                            *((volatile unsigned int*)(0x430001E4UL))
#define bM4_USH_GUSBCFG_IC_USBCAP                       *((volatile unsigned int*)(0x430001E8UL))
#define bM4_USH_GUSBCFG_TXENDDELAY                      *((volatile unsigned int*)(0x430001F0UL))
#define bM4_USH_GUSBCFG_FORCEHSTMODE                    *((volatile unsigned int*)(0x430001F4UL))
#define bM4_USH_GUSBCFG_FORCEDEVMODE                    *((volatile unsigned int*)(0x430001F8UL))
#define bM4_USH_GUSBCFG_CORRUPTTXPKT                    *((volatile unsigned int*)(0x430001FCUL))
#define bM4_USH_GRSTCTL_CSFTRST                         *((volatile unsigned int*)(0x43000200UL))
#define bM4_USH_GRSTCTL_PIUFSSFTRST                     *((volatile unsigned int*)(0x43000204UL))
#define bM4_USH_GRSTCTL_FRMCNTRRST                      *((volatile unsigned int*)(0x43000208UL))
#define bM4_USH_GRSTCTL_RXFFLSH                         *((volatile unsigned int*)(0x43000210UL))
#define bM4_USH_GRSTCTL_TXFFLSH                         *((volatile unsigned int*)(0x43000214UL))
#define bM4_USH_GRSTCTL_TXFNUM0                         *((volatile unsigned int*)(0x43000218UL))
#define bM4_USH_GRSTCTL_TXFNUM1                         *((volatile unsigned int*)(0x4300021CUL))
#define bM4_USH_GRSTCTL_TXFNUM2                         *((volatile unsigned int*)(0x43000220UL))
#define bM4_USH_GRSTCTL_TXFNUM3                         *((volatile unsigned int*)(0x43000224UL))
#define bM4_USH_GRSTCTL_TXFNUM4                         *((volatile unsigned int*)(0x43000228UL))
#define bM4_USH_GRSTCTL_DMAREQ                          *((volatile unsigned int*)(0x43000278UL))
#define bM4_USH_GRSTCTL_AHBIDLE                         *((volatile unsigned int*)(0x4300027CUL))
#define bM4_USH_GINTSTS_CURMOD                          *((volatile unsigned int*)(0x43000280UL))
#define bM4_USH_GINTSTS_MODEMIS                         *((volatile unsigned int*)(0x43000284UL))
#define bM4_USH_GINTSTS_OTGINT                          *((volatile unsigned int*)(0x43000288UL))
#define bM4_USH_GINTSTS_SOF                             *((volatile unsigned int*)(0x4300028CUL))
#define bM4_USH_GINTSTS_RXFLVL                          *((volatile unsigned int*)(0x43000290UL))
#define bM4_USH_GINTSTS_NPTXFEMP                        *((volatile unsigned int*)(0x43000294UL))
#define bM4_USH_GINTSTS_GINNAKEFF                       *((volatile unsigned int*)(0x43000298UL))
#define bM4_USH_GINTSTS_GOUTNAKEFF                      *((volatile unsigned int*)(0x4300029CUL))
#define bM4_USH_GINTSTS_ERLYSUSP                        *((volatile unsigned int*)(0x430002A8UL))
#define bM4_USH_GINTSTS_USBSUSP                         *((volatile unsigned int*)(0x430002ACUL))
#define bM4_USH_GINTSTS_USBRST                          *((volatile unsigned int*)(0x430002B0UL))
#define bM4_USH_GINTSTS_ENUMDONE                        *((volatile unsigned int*)(0x430002B4UL))
#define bM4_USH_GINTSTS_ISOOUTDROP                      *((volatile unsigned int*)(0x430002B8UL))
#define bM4_USH_GINTSTS_EOPF                            *((volatile unsigned int*)(0x430002BCUL))
#define bM4_USH_GINTSTS_EPMIS                           *((volatile unsigned int*)(0x430002C4UL))
#define bM4_USH_GINTSTS_IEPINT                          *((volatile unsigned int*)(0x430002C8UL))
#define bM4_USH_GINTSTS_OEPINT                          *((volatile unsigned int*)(0x430002CCUL))
#define bM4_USH_GINTSTS_INCOMPISOIN                     *((volatile unsigned int*)(0x430002D0UL))
#define bM4_USH_GINTSTS_INCOMPLP                        *((volatile unsigned int*)(0x430002D4UL))
#define bM4_USH_GINTSTS_FETSUSP                         *((volatile unsigned int*)(0x430002D8UL))
#define bM4_USH_GINTSTS_RESETDET                        *((volatile unsigned int*)(0x430002DCUL))
#define bM4_USH_GINTSTS_PRTINT                          *((volatile unsigned int*)(0x430002E0UL))
#define bM4_USH_GINTSTS_HCHINT                          *((volatile unsigned int*)(0x430002E4UL))
#define bM4_USH_GINTSTS_PTXFEMP                         *((volatile unsigned int*)(0x430002E8UL))
#define bM4_USH_GINTSTS_CONIDSTSCHNG                    *((volatile unsigned int*)(0x430002F0UL))
#define bM4_USH_GINTSTS_DISCONNINT                      *((volatile unsigned int*)(0x430002F4UL))
#define bM4_USH_GINTSTS_SESSREQINT                      *((volatile unsigned int*)(0x430002F8UL))
#define bM4_USH_GINTSTS_WKUPINT                         *((volatile unsigned int*)(0x430002FCUL))
#define bM4_USH_GINTMSK_MODEMISMSK                      *((volatile unsigned int*)(0x43000304UL))
#define bM4_USH_GINTMSK_OTGINTMSK                       *((volatile unsigned int*)(0x43000308UL))
#define bM4_USH_GINTMSK_SOFMSK                          *((volatile unsigned int*)(0x4300030CUL))
#define bM4_USH_GINTMSK_RXFLVLMSK                       *((volatile unsigned int*)(0x43000310UL))
#define bM4_USH_GINTMSK_NPTXFEMPMSK                     *((volatile unsigned int*)(0x43000314UL))
#define bM4_USH_GINTMSK_GINNAKEFFMSK                    *((volatile unsigned int*)(0x43000318UL))
#define bM4_USH_GINTMSK_GOUTNAKEFFMSK                   *((volatile unsigned int*)(0x4300031CUL))
#define bM4_USH_GINTMSK_ERLYSUSPMSK                     *((volatile unsigned int*)(0x43000328UL))
#define bM4_USH_GINTMSK_USBSUSPMSK                      *((volatile unsigned int*)(0x4300032CUL))
#define bM4_USH_GINTMSK_USBRSTMSK                       *((volatile unsigned int*)(0x43000330UL))
#define bM4_USH_GINTMSK_ENUMDONEMSK                     *((volatile unsigned int*)(0x43000334UL))
#define bM4_USH_GINTMSK_ISOOUTDROPMSK                   *((volatile unsigned int*)(0x43000338UL))
#define bM4_USH_GINTMSK_EOPFMSK                         *((volatile unsigned int*)(0x4300033CUL))
#define bM4_USH_GINTMSK_EPMISMSK                        *((volatile unsigned int*)(0x43000344UL))
#define bM4_USH_GINTMSK_IEPINTMSK                       *((volatile unsigned int*)(0x43000348UL))
#define bM4_USH_GINTMSK_OEPINTMSK                       *((volatile unsigned int*)(0x4300034CUL))
#define bM4_USH_GINTMSK_INCOMPISOINMSK                  *((volatile unsigned int*)(0x43000350UL))
#define bM4_USH_GINTMSK_INCOMPLPMSK                     *((volatile unsigned int*)(0x43000354UL))
#define bM4_USH_GINTMSK_FETSUSPMSK                      *((volatile unsigned int*)(0x43000358UL))
#define bM4_USH_GINTMSK_RESETDETMSK                     *((volatile unsigned int*)(0x4300035CUL))
#define bM4_USH_GINTMSK_PRTINTMSK                       *((volatile unsigned int*)(0x43000360UL))
#define bM4_USH_GINTMSK_HCHINTMSK                       *((volatile unsigned int*)(0x43000364UL))
#define bM4_USH_GINTMSK_PTXFEMPMSK                      *((volatile unsigned int*)(0x43000368UL))
#define bM4_USH_GINTMSK_CONIDSTSCHNGMSK                 *((volatile unsigned int*)(0x43000370UL))
#define bM4_USH_GINTMSK_DISCONNINTMSK                   *((volatile unsigned int*)(0x43000374UL))
#define bM4_USH_GINTMSK_SESSREQINTMSK                   *((volatile unsigned int*)(0x43000378UL))
#define bM4_USH_GINTMSK_WKUPINTMSK                      *((volatile unsigned int*)(0x4300037CUL))
#define bM4_USH_GRXSTSR_CHNUM0                          *((volatile unsigned int*)(0x43000380UL))
#define bM4_USH_GRXSTSR_CHNUM1                          *((volatile unsigned int*)(0x43000384UL))
#define bM4_USH_GRXSTSR_CHNUM2                          *((volatile unsigned int*)(0x43000388UL))
#define bM4_USH_GRXSTSR_CHNUM3                          *((volatile unsigned int*)(0x4300038CUL))
#define bM4_USH_GRXSTSR_BCNT0                           *((volatile unsigned int*)(0x43000390UL))
#define bM4_USH_GRXSTSR_BCNT1                           *((volatile unsigned int*)(0x43000394UL))
#define bM4_USH_GRXSTSR_BCNT2                           *((volatile unsigned int*)(0x43000398UL))
#define bM4_USH_GRXSTSR_BCNT3                           *((volatile unsigned int*)(0x4300039CUL))
