RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_GRXSTSR_BCNT4                           *((volatile unsigned int*)(0x430003A0UL))
#define bM4_USH_GRXSTSR_BCNT5                           *((volatile unsigned int*)(0x430003A4UL))
#define bM4_USH_GRXSTSR_BCNT6                           *((volatile unsigned int*)(0x430003A8UL))
#define bM4_USH_GRXSTSR_BCNT7                           *((volatile unsigned int*)(0x430003ACUL))
#define bM4_USH_GRXSTSR_BCNT8                           *((volatile unsigned int*)(0x430003B0UL))
#define bM4_USH_GRXSTSR_BCNT9                           *((volatile unsigned int*)(0x430003B4UL))
#define bM4_USH_GRXSTSR_BCNT10                          *((volatile unsigned int*)(0x430003B8UL))
#define bM4_USH_GRXSTSR_DPID0                           *((volatile unsigned int*)(0x430003BCUL))
#define bM4_USH_GRXSTSR_DPID1                           *((volatile unsigned int*)(0x430003C0UL))
#define bM4_USH_GRXSTSR_PKTSTS0                         *((volatile unsigned int*)(0x430003C4UL))
#define bM4_USH_GRXSTSR_PKTSTS1                         *((volatile unsigned int*)(0x430003C8UL))
#define bM4_USH_GRXSTSR_PKTSTS2                         *((volatile unsigned int*)(0x430003CCUL))
#define bM4_USH_GRXSTSR_PKTSTS3                         *((volatile unsigned int*)(0x430003D0UL))
#define bM4_USH_GRXSTSR_RESV                            *((volatile unsigned int*)(0x430003E0UL))
#define bM4_USH_GRXSTSP_CHNUM0                          *((volatile unsigned int*)(0x43000400UL))
#define bM4_USH_GRXSTSP_CHNUM1                          *((volatile unsigned int*)(0x43000404UL))
#define bM4_USH_GRXSTSP_CHNUM2                          *((volatile unsigned int*)(0x43000408UL))
#define bM4_USH_GRXSTSP_CHNUM3                          *((volatile unsigned int*)(0x4300040CUL))
#define bM4_USH_GRXSTSP_BCNT0                           *((volatile unsigned int*)(0x43000410UL))
#define bM4_USH_GRXSTSP_BCNT1                           *((volatile unsigned int*)(0x43000414UL))
#define bM4_USH_GRXSTSP_BCNT2                           *((volatile unsigned int*)(0x43000418UL))
#define bM4_USH_GRXSTSP_BCNT3                           *((volatile unsigned int*)(0x4300041CUL))
#define bM4_USH_GRXSTSP_BCNT4                           *((volatile unsigned int*)(0x43000420UL))
#define bM4_USH_GRXSTSP_BCNT5                           *((volatile unsigned int*)(0x43000424UL))
#define bM4_USH_GRXSTSP_BCNT6                           *((volatile unsigned int*)(0x43000428UL))
#define bM4_USH_GRXSTSP_BCNT7                           *((volatile unsigned int*)(0x4300042CUL))
#define bM4_USH_GRXSTSP_BCNT8                           *((volatile unsigned int*)(0x43000430UL))
#define bM4_USH_GRXSTSP_BCNT9                           *((volatile unsigned int*)(0x43000434UL))
#define bM4_USH_GRXSTSP_BCNT10                          *((volatile unsigned int*)(0x43000438UL))
#define bM4_USH_GRXSTSP_DPID0                           *((volatile unsigned int*)(0x4300043CUL))
#define bM4_USH_GRXSTSP_DPID1                           *((volatile unsigned int*)(0x43000440UL))
#define bM4_USH_GRXSTSP_PKTSTS0                         *((volatile unsigned int*)(0x43000444UL))
#define bM4_USH_GRXSTSP_PKTSTS1                         *((volatile unsigned int*)(0x43000448UL))
#define bM4_USH_GRXSTSP_PKTSTS2                         *((volatile unsigned int*)(0x4300044CUL))
#define bM4_USH_GRXSTSP_PKTSTS3                         *((volatile unsigned int*)(0x43000450UL))
#define bM4_USH_GRXSTSP_RESV                            *((volatile unsigned int*)(0x43000460UL))
#define bM4_USH_GRXFSIZ_RXFDEP0                         *((volatile unsigned int*)(0x43000480UL))
#define bM4_USH_GRXFSIZ_RXFDEP1                         *((volatile unsigned int*)(0x43000484UL))
#define bM4_USH_GRXFSIZ_RXFDEP2                         *((volatile unsigned int*)(0x43000488UL))
#define bM4_USH_GRXFSIZ_RXFDEP3                         *((volatile unsigned int*)(0x4300048CUL))
#define bM4_USH_GRXFSIZ_RXFDEP4                         *((volatile unsigned int*)(0x43000490UL))
#define bM4_USH_GRXFSIZ_RXFDEP5                         *((volatile unsigned int*)(0x43000494UL))
#define bM4_USH_GRXFSIZ_RXFDEP6                         *((volatile unsigned int*)(0x43000498UL))
#define bM4_USH_GRXFSIZ_RXFDEP7                         *((volatile unsigned int*)(0x4300049CUL))
#define bM4_USH_GRXFSIZ_RXFDEP8                         *((volatile unsigned int*)(0x430004A0UL))
#define bM4_USH_GRXFSIZ_RXFDEP9                         *((volatile unsigned int*)(0x430004A4UL))
#define bM4_USH_GRXFSIZ_RXFDEP10                        *((volatile unsigned int*)(0x430004A8UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR0                  *((volatile unsigned int*)(0x43000500UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR1                  *((volatile unsigned int*)(0x43000504UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR2                  *((volatile unsigned int*)(0x43000508UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR3                  *((volatile unsigned int*)(0x4300050CUL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR4                  *((volatile unsigned int*)(0x43000510UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR5                  *((volatile unsigned int*)(0x43000514UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR6                  *((volatile unsigned int*)(0x43000518UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR7                  *((volatile unsigned int*)(0x4300051CUL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR8                  *((volatile unsigned int*)(0x43000520UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR9                  *((volatile unsigned int*)(0x43000524UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR10                 *((volatile unsigned int*)(0x43000528UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR11                 *((volatile unsigned int*)(0x4300052CUL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR12                 *((volatile unsigned int*)(0x43000530UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR13                 *((volatile unsigned int*)(0x43000534UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR14                 *((volatile unsigned int*)(0x43000538UL))
#define bM4_USH_GNPTXFSIZ_NPTXFSTADDR15                 *((volatile unsigned int*)(0x4300053CUL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP0                     *((volatile unsigned int*)(0x43000540UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP1                     *((volatile unsigned int*)(0x43000544UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP2                     *((volatile unsigned int*)(0x43000548UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP3                     *((volatile unsigned int*)(0x4300054CUL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP4                     *((volatile unsigned int*)(0x43000550UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP5                     *((volatile unsigned int*)(0x43000554UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP6                     *((volatile unsigned int*)(0x43000558UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP7                     *((volatile unsigned int*)(0x4300055CUL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP8                     *((volatile unsigned int*)(0x43000560UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP9                     *((volatile unsigned int*)(0x43000564UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP10                    *((volatile unsigned int*)(0x43000568UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP11                    *((volatile unsigned int*)(0x4300056CUL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP12                    *((volatile unsigned int*)(0x43000570UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP13                    *((volatile unsigned int*)(0x43000574UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP14                    *((volatile unsigned int*)(0x43000578UL))
#define bM4_USH_GNPTXFSIZ_NPTXFDEP15                    *((volatile unsigned int*)(0x4300057CUL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL0                 *((volatile unsigned int*)(0x43000580UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL1                 *((volatile unsigned int*)(0x43000584UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL2                 *((volatile unsigned int*)(0x43000588UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL3                 *((volatile unsigned int*)(0x4300058CUL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL4                 *((volatile unsigned int*)(0x43000590UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL5                 *((volatile unsigned int*)(0x43000594UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL6                 *((volatile unsigned int*)(0x43000598UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL7                 *((volatile unsigned int*)(0x4300059CUL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL8                 *((volatile unsigned int*)(0x430005A0UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL9                 *((volatile unsigned int*)(0x430005A4UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL10                *((volatile unsigned int*)(0x430005A8UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL11                *((volatile unsigned int*)(0x430005ACUL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL12                *((volatile unsigned int*)(0x430005B0UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL13                *((volatile unsigned int*)(0x430005B4UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL14                *((volatile unsigned int*)(0x430005B8UL))
#define bM4_USH_GNPTXSTS_NPTXFSPCAVAIL15                *((volatile unsigned int*)(0x430005BCUL))
#define bM4_USH_GNPTXSTS_NPTXQSPCAVAIL0                 *((volatile unsigned int*)(0x430005C0UL))
#define bM4_USH_GNPTXSTS_NPTXQSPCAVAIL1                 *((volatile unsigned int*)(0x430005C4UL))
#define bM4_USH_GNPTXSTS_NPTXQSPCAVAIL2                 *((volatile unsigned int*)(0x430005C8UL))
#define bM4_USH_GNPTXSTS_NPTXQSPCAVAIL3                 *((volatile unsigned int*)(0x430005CCUL))
#define bM4_USH_GNPTXSTS_NPTXQSPCAVAIL4                 *((volatile unsigned int*)(0x430005D0UL))
#define bM4_USH_GNPTXSTS_NPTXQSPCAVAIL5                 *((volatile unsigned int*)(0x430005D4UL))
#define bM4_USH_GNPTXSTS_NPTXQSPCAVAIL6                 *((volatile unsigned int*)(0x430005D8UL))
#define bM4_USH_GNPTXSTS_NPTXQSPCAVAIL7                 *((volatile unsigned int*)(0x430005DCUL))
#define bM4_USH_GNPTXSTS_NPTXQTOP0                      *((volatile unsigned int*)(0x430005E0UL))
#define bM4_USH_GNPTXSTS_NPTXQTOP1                      *((volatile unsigned int*)(0x430005E4UL))
#define bM4_USH_GNPTXSTS_NPTXQTOP2                      *((volatile unsigned int*)(0x430005E8UL))
#define bM4_USH_GNPTXSTS_NPTXQTOP3                      *((volatile unsigned int*)(0x430005ECUL))
#define bM4_USH_GNPTXSTS_NPTXQTOP4                      *((volatile unsigned int*)(0x430005F0UL))
#define bM4_USH_GNPTXSTS_NPTXQTOP5                      *((volatile unsigned int*)(0x430005F4UL))
#define bM4_USH_GNPTXSTS_NPTXQTOP6                      *((volatile unsigned int*)(0x430005F8UL))
#define bM4_USH_GPVNDCTL_REGDATA0                       *((volatile unsigned int*)(0x43000680UL))
#define bM4_USH_GPVNDCTL_REGDATA1                       *((volatile unsigned int*)(0x43000684UL))
#define bM4_USH_GPVNDCTL_REGDATA2                       *((volatile unsigned int*)(0x43000688UL))
#define bM4_USH_GPVNDCTL_REGDATA3                       *((volatile unsigned int*)(0x4300068CUL))
#define bM4_USH_GPVNDCTL_REGDATA4                       *((volatile unsigned int*)(0x43000690UL))
#define bM4_USH_GPVNDCTL_REGDATA5                       *((volatile unsigned int*)(0x43000694UL))
#define bM4_USH_GPVNDCTL_REGDATA6                       *((volatile unsigned int*)(0x43000698UL))
#define bM4_USH_GPVNDCTL_REGDATA7                       *((volatile unsigned int*)(0x4300069CUL))
#define bM4_USH_GPVNDCTL_VCTRL0                         *((volatile unsigned int*)(0x430006A0UL))
#define bM4_USH_GPVNDCTL_VCTRL1                         *((volatile unsigned int*)(0x430006A4UL))
#define bM4_USH_GPVNDCTL_VCTRL2                         *((volatile unsigned int*)(0x430006A8UL))
#define bM4_USH_GPVNDCTL_VCTRL3                         *((volatile unsigned int*)(0x430006ACUL))
#define bM4_USH_GPVNDCTL_VCTRL4                         *((volatile unsigned int*)(0x430006B0UL))
#define bM4_USH_GPVNDCTL_VCTRL5                         *((volatile unsigned int*)(0x430006B4UL))
#define bM4_USH_GPVNDCTL_VCTRL6                         *((volatile unsigned int*)(0x430006B8UL))
#define bM4_USH_GPVNDCTL_VCTRL7                         *((volatile unsigned int*)(0x430006BCUL))
#define bM4_USH_GPVNDCTL_REGADDR0                       *((volatile unsigned int*)(0x430006C0UL))
#define bM4_USH_GPVNDCTL_REGADDR1                       *((volatile unsigned int*)(0x430006C4UL))
#define bM4_USH_GPVNDCTL_REGADDR2                       *((volatile unsigned int*)(0x430006C8UL))
#define bM4_USH_GPVNDCTL_REGADDR3                       *((volatile unsigned int*)(0x430006CCUL))
#define bM4_USH_GPVNDCTL_REGADDR4                       *((volatile unsigned int*)(0x430006D0UL))
#define bM4_USH_GPVNDCTL_REGADDR5                       *((volatile unsigned int*)(0x430006D4UL))
#define bM4_USH_GPVNDCTL_REGWR                          *((volatile unsigned int*)(0x430006D8UL))
#define bM4_USH_GPVNDCTL_NEWREGREQ                      *((volatile unsigned int*)(0x430006E4UL))
#define bM4_USH_GPVNDCTL_VSTSBSY                        *((volatile unsigned int*)(0x430006E8UL))
#define bM4_USH_GPVNDCTL_VSTSDONE                       *((volatile unsigned int*)(0x430006ECUL))
#define bM4_USH_GGPIO_GPI0                              *((volatile unsigned int*)(0x43000700UL))
#define bM4_USH_GGPIO_GPI1                              *((volatile unsigned int*)(0x43000704UL))
#define bM4_USH_GGPIO_GPI2                              *((volatile unsigned int*)(0x43000708UL))
#define bM4_USH_GGPIO_GPI3                              *((volatile unsigned int*)(0x4300070CUL))
#define bM4_USH_GGPIO_GPI4                              *((volatile unsigned int*)(0x43000710UL))
#define bM4_USH_GGPIO_GPI5                              *((volatile unsigned int*)(0x43000714UL))
#define bM4_USH_GGPIO_GPI6                              *((volatile unsigned int*)(0x43000718UL))
#define bM4_USH_GGPIO_GPI7                              *((volatile unsigned int*)(0x4300071CUL))
#define bM4_USH_GGPIO_GPI8                              *((volatile unsigned int*)(0x43000720UL))
#define bM4_USH_GGPIO_GPI9                              *((volatile unsigned int*)(0x43000724UL))
#define bM4_USH_GGPIO_GPI10                             *((volatile unsigned int*)(0x43000728UL))
#define bM4_USH_GGPIO_GPI11                             *((volatile unsigned int*)(0x4300072CUL))
#define bM4_USH_GGPIO_GPI12                             *((volatile unsigned int*)(0x43000730UL))
#define bM4_USH_GGPIO_GPI13                             *((volatile unsigned int*)(0x43000734UL))
#define bM4_USH_GGPIO_GPI14                             *((volatile unsigned int*)(0x43000738UL))
#define bM4_USH_GGPIO_GPI15                             *((volatile unsigned int*)(0x4300073CUL))
#define bM4_USH_GGPIO_GPO0                              *((volatile unsigned int*)(0x43000740UL))
#define bM4_USH_GGPIO_GPO1                              *((volatile unsigned int*)(0x43000744UL))
#define bM4_USH_GGPIO_GPO2                              *((volatile unsigned int*)(0x43000748UL))
#define bM4_USH_GGPIO_GPO3                              *((volatile unsigned int*)(0x4300074CUL))
#define bM4_USH_GGPIO_GPO4                              *((volatile unsigned int*)(0x43000750UL))
#define bM4_USH_GGPIO_GPO5                              *((volatile unsigned int*)(0x43000754UL))
#define bM4_USH_GGPIO_GPO6                              *((volatile unsigned int*)(0x43000758UL))
#define bM4_USH_GGPIO_GPO7                              *((volatile unsigned int*)(0x4300075CUL))
#define bM4_USH_GGPIO_GPO8                              *((volatile unsigned int*)(0x43000760UL))
#define bM4_USH_GGPIO_GPO9                              *((volatile unsigned int*)(0x43000764UL))
#define bM4_USH_GGPIO_GPO10                             *((volatile unsigned int*)(0x43000768UL))
#define bM4_USH_GGPIO_GPO11                             *((volatile unsigned int*)(0x4300076CUL))
#define bM4_USH_GGPIO_GPO12                             *((volatile unsigned int*)(0x43000770UL))
#define bM4_USH_GGPIO_GPO13                             *((volatile unsigned int*)(0x43000774UL))
#define bM4_USH_GGPIO_GPO14                             *((volatile unsigned int*)(0x43000778UL))
#define bM4_USH_GGPIO_GPO15                             *((volatile unsigned int*)(0x4300077CUL))
#define bM4_USH_GHWCFG2_OTGMODE0                        *((volatile unsigned int*)(0x43000900UL))
#define bM4_USH_GHWCFG2_OTGMODE1                        *((volatile unsigned int*)(0x43000904UL))
#define bM4_USH_GHWCFG2_OTGMODE2                        *((volatile unsigned int*)(0x43000908UL))
#define bM4_USH_GHWCFG2_OTGARCH0                        *((volatile unsigned int*)(0x4300090CUL))
#define bM4_USH_GHWCFG2_OTGARCH1                        *((volatile unsigned int*)(0x43000910UL))
#define bM4_USH_GHWCFG2_SINGPNT                         *((volatile unsigned int*)(0x43000914UL))
#define bM4_USH_GHWCFG2_HSPHYTYPE0                      *((volatile unsigned int*)(0x43000918UL))
#define bM4_USH_GHWCFG2_HSPHYTYPE1                      *((volatile unsigned int*)(0x4300091CUL))
#define bM4_USH_GHWCFG2_FSPHYTYPE0                      *((volatile unsigned int*)(0x43000920UL))
#define bM4_USH_GHWCFG2_FSPHYTYPE1                      *((volatile unsigned int*)(0x43000924UL))
#define bM4_USH_GHWCFG2_NUMDEVEPS0                      *((volatile unsigned int*)(0x43000928UL))
#define bM4_USH_GHWCFG2_NUMDEVEPS1                      *((volatile unsigned int*)(0x4300092CUL))
#define bM4_USH_GHWCFG2_NUMDEVEPS2                      *((volatile unsigned int*)(0x43000930UL))
#define bM4_USH_GHWCFG2_NUMDEVEPS3                      *((volatile unsigned int*)(0x43000934UL))
#define bM4_USH_GHWCFG2_NUMHSTCHNL0                     *((volatile unsigned int*)(0x43000938UL))
#define bM4_USH_GHWCFG2_NUMHSTCHNL1                     *((volatile unsigned int*)(0x4300093CUL))
#define bM4_USH_GHWCFG2_NUMHSTCHNL2                     *((volatile unsigned int*)(0x43000940UL))
#define bM4_USH_GHWCFG2_NUMHSTCHNL3                     *((volatile unsigned int*)(0x43000944UL))
#define bM4_USH_GHWCFG2_PERIOSUPPORT                    *((volatile unsigned int*)(0x43000948UL))
#define bM4_USH_GHWCFG2_DYNFIFOSIZING                   *((volatile unsigned int*)(0x4300094CUL))
#define bM4_USH_GHWCFG2_MULTIPROCINTRPT                 *((volatile unsigned int*)(0x43000950UL))
#define bM4_USH_GHWCFG2_NPTXQDEPTH0                     *((volatile unsigned int*)(0x43000958UL))
#define bM4_USH_GHWCFG2_NPTXQDEPTH1                     *((volatile unsigned int*)(0x4300095CUL))
#define bM4_USH_GHWCFG2_PTXQDEPTH0                      *((volatile unsigned int*)(0x43000960UL))
#define bM4_USH_GHWCFG2_PTXQDEPTH1                      *((volatile unsigned int*)(0x43000964UL))
#define bM4_USH_GHWCFG2_TKNQDEPTH0                      *((volatile unsigned int*)(0x43000968UL))
#define bM4_USH_GHWCFG2_TKNQDEPTH1                      *((volatile unsigned int*)(0x4300096CUL))
#define bM4_USH_GHWCFG2_TKNQDEPTH2                      *((volatile unsigned int*)(0x43000970UL))
#define bM4_USH_GHWCFG2_TKNQDEPTH3                      *((volatile unsigned int*)(0x43000974UL))
#define bM4_USH_GHWCFG2_TKNQDEPTH4                      *((volatile unsigned int*)(0x43000978UL))
#define bM4_USH_GHWCFG3_XFERSIZEWIDTH0                  *((volatile unsigned int*)(0x43000980UL))
#define bM4_USH_GHWCFG3_XFERSIZEWIDTH1                  *((volatile unsigned int*)(0x43000984UL))
#define bM4_USH_GHWCFG3_XFERSIZEWIDTH2                  *((volatile unsigned int*)(0x43000988UL))
#define bM4_USH_GHWCFG3_XFERSIZEWIDTH3                  *((volatile unsigned int*)(0x4300098CUL))
#define bM4_USH_GHWCFG3_PKTSIZEWIDTH0                   *((volatile unsigned int*)(0x43000990UL))
#define bM4_USH_GHWCFG3_PKTSIZEWIDTH1                   *((volatile unsigned int*)(0x43000994UL))
#define bM4_USH_GHWCFG3_PKTSIZEWIDTH2                   *((volatile unsigned int*)(0x43000998UL))
#define bM4_USH_GHWCFG3_OTGEN                           *((volatile unsigned int*)(0x4300099CUL))
#define bM4_USH_GHWCFG3_I2CINTSEL                       *((volatile unsigned int*)(0x430009A0UL))
#define bM4_USH_GHWCFG3_VNDCTLSUPT                      *((volatile unsigned int*)(0x430009A4UL))
#define bM4_USH_GHWCFG3_OPTFEATURE                      *((volatile unsigned int*)(0x430009A8UL))
#define bM4_USH_GHWCFG3_RSTTYPE                         *((volatile unsigned int*)(0x430009ACUL))
#define bM4_USH_GHWCFG3_ADPSUPPORT                      *((volatile unsigned int*)(0x430009B0UL))
#define bM4_USH_GHWCFG3_HSICMODE                        *((volatile unsigned int*)(0x430009B4UL))
#define bM4_USH_GHWCFG3_BCSUPPORT                       *((volatile unsigned int*)(0x430009B8UL))
#define bM4_USH_GHWCFG3_LPMMODE                         *((volatile unsigned int*)(0x430009BCUL))
#define bM4_USH_GHWCFG3_DFIFODEPTH0                     *((volatile unsigned int*)(0x430009C0UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH1                     *((volatile unsigned int*)(0x430009C4UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH2                     *((volatile unsigned int*)(0x430009C8UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH3                     *((volatile unsigned int*)(0x430009CCUL))
#define bM4_USH_GHWCFG3_DFIFODEPTH4                     *((volatile unsigned int*)(0x430009D0UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH5                     *((volatile unsigned int*)(0x430009D4UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH6                     *((volatile unsigned int*)(0x430009D8UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH7                     *((volatile unsigned int*)(0x430009DCUL))
#define bM4_USH_GHWCFG3_DFIFODEPTH8                     *((volatile unsigned int*)(0x430009E0UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH9                     *((volatile unsigned int*)(0x430009E4UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH10                    *((volatile unsigned int*)(0x430009E8UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH11                    *((volatile unsigned int*)(0x430009ECUL))
#define bM4_USH_GHWCFG3_DFIFODEPTH12                    *((volatile unsigned int*)(0x430009F0UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH13                    *((volatile unsigned int*)(0x430009F4UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH14                    *((volatile unsigned int*)(0x430009F8UL))
#define bM4_USH_GHWCFG3_DFIFODEPTH15                    *((volatile unsigned int*)(0x430009FCUL))
#define bM4_USH_GHWCFG4_NUMDEVPERIOEPS0                 *((volatile unsigned int*)(0x43000A00UL))
#define bM4_USH_GHWCFG4_NUMDEVPERIOEPS1                 *((volatile unsigned int*)(0x43000A04UL))
#define bM4_USH_GHWCFG4_NUMDEVPERIOEPS2                 *((volatile unsigned int*)(0x43000A08UL))
#define bM4_USH_GHWCFG4_NUMDEVPERIOEPS3                 *((volatile unsigned int*)(0x43000A0CUL))
#define bM4_USH_GHWCFG4_PARTIALPWRDN                    *((volatile unsigned int*)(0x43000A10UL))
#define bM4_USH_GHWCFG4_AHBFREQ                         *((volatile unsigned int*)(0x43000A14UL))
#define bM4_USH_GHWCFG4_HIBERNATION                     *((volatile unsigned int*)(0x43000A18UL))
#define bM4_USH_GHWCFG4_EXTENDEDHIBERNATION             *((volatile unsigned int*)(0x43000A1CUL))
#define bM4_USH_GHWCFG4_PHYDATAWIDTH0                   *((volatile unsigned int*)(0x43000A38UL))
#define bM4_USH_GHWCFG4_PHYDATAWIDTH1                   *((volatile unsigned int*)(0x43000A3CUL))
#define bM4_USH_GHWCFG4_NUMCTLEPS0                      *((volatile unsigned int*)(0x43000A40UL))
#define bM4_USH_GHWCFG4_NUMCTLEPS1                      *((volatile unsigned int*)(0x43000A44UL))
#define bM4_USH_GHWCFG4_NUMCTLEPS2                      *((volatile unsigned int*)(0x43000A48UL))
#define bM4_USH_GHWCFG4_NUMCTLEPS3                      *((volatile unsigned int*)(0x43000A4CUL))
