RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_GHWCFG4_IDDGFLTR                        *((volatile unsigned int*)(0x43000A50UL))
#define bM4_USH_GHWCFG4_VBUSVALIDFLTR                   *((volatile unsigned int*)(0x43000A54UL))
#define bM4_USH_GHWCFG4_AVALIDFLTR                      *((volatile unsigned int*)(0x43000A58UL))
#define bM4_USH_GHWCFG4_BVALIDFLTR                      *((volatile unsigned int*)(0x43000A5CUL))
#define bM4_USH_GHWCFG4_SESSENDFLTR                     *((volatile unsigned int*)(0x43000A60UL))
#define bM4_USH_GHWCFG4_DEDFIFOMODE                     *((volatile unsigned int*)(0x43000A64UL))
#define bM4_USH_GHWCFG4_INEPS0                          *((volatile unsigned int*)(0x43000A68UL))
#define bM4_USH_GHWCFG4_INEPS1                          *((volatile unsigned int*)(0x43000A6CUL))
#define bM4_USH_GHWCFG4_INEPS2                          *((volatile unsigned int*)(0x43000A70UL))
#define bM4_USH_GHWCFG4_INEPS3                          *((volatile unsigned int*)(0x43000A74UL))
#define bM4_USH_GHWCFG4_DESCDMAENABLED                  *((volatile unsigned int*)(0x43000A78UL))
#define bM4_USH_GHWCFG4_DESCDMA                         *((volatile unsigned int*)(0x43000A7CUL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG0                    *((volatile unsigned int*)(0x43000B80UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG1                    *((volatile unsigned int*)(0x43000B84UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG2                    *((volatile unsigned int*)(0x43000B88UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG3                    *((volatile unsigned int*)(0x43000B8CUL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG4                    *((volatile unsigned int*)(0x43000B90UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG5                    *((volatile unsigned int*)(0x43000B94UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG6                    *((volatile unsigned int*)(0x43000B98UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG7                    *((volatile unsigned int*)(0x43000B9CUL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG8                    *((volatile unsigned int*)(0x43000BA0UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG9                    *((volatile unsigned int*)(0x43000BA4UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG10                   *((volatile unsigned int*)(0x43000BA8UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG11                   *((volatile unsigned int*)(0x43000BACUL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG12                   *((volatile unsigned int*)(0x43000BB0UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG13                   *((volatile unsigned int*)(0x43000BB4UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG14                   *((volatile unsigned int*)(0x43000BB8UL))
#define bM4_USH_GDFIFOCFG_GDFIFOCFG15                   *((volatile unsigned int*)(0x43000BBCUL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR0               *((volatile unsigned int*)(0x43000BC0UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR1               *((volatile unsigned int*)(0x43000BC4UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR2               *((volatile unsigned int*)(0x43000BC8UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR3               *((volatile unsigned int*)(0x43000BCCUL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR4               *((volatile unsigned int*)(0x43000BD0UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR5               *((volatile unsigned int*)(0x43000BD4UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR6               *((volatile unsigned int*)(0x43000BD8UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR7               *((volatile unsigned int*)(0x43000BDCUL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR8               *((volatile unsigned int*)(0x43000BE0UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR9               *((volatile unsigned int*)(0x43000BE4UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR10              *((volatile unsigned int*)(0x43000BE8UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR11              *((volatile unsigned int*)(0x43000BECUL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR12              *((volatile unsigned int*)(0x43000BF0UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR13              *((volatile unsigned int*)(0x43000BF4UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR14              *((volatile unsigned int*)(0x43000BF8UL))
#define bM4_USH_GDFIFOCFG_EPINFOBASEADDR15              *((volatile unsigned int*)(0x43000BFCUL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR0                    *((volatile unsigned int*)(0x43002000UL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR1                    *((volatile unsigned int*)(0x43002004UL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR2                    *((volatile unsigned int*)(0x43002008UL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR3                    *((volatile unsigned int*)(0x4300200CUL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR4                    *((volatile unsigned int*)(0x43002010UL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR5                    *((volatile unsigned int*)(0x43002014UL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR6                    *((volatile unsigned int*)(0x43002018UL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR7                    *((volatile unsigned int*)(0x4300201CUL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR8                    *((volatile unsigned int*)(0x43002020UL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR9                    *((volatile unsigned int*)(0x43002024UL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR10                   *((volatile unsigned int*)(0x43002028UL))
#define bM4_USH_HPTXFSIZ_PTXFSTADDR11                   *((volatile unsigned int*)(0x4300202CUL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE0                      *((volatile unsigned int*)(0x43002040UL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE1                      *((volatile unsigned int*)(0x43002044UL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE2                      *((volatile unsigned int*)(0x43002048UL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE3                      *((volatile unsigned int*)(0x4300204CUL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE4                      *((volatile unsigned int*)(0x43002050UL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE5                      *((volatile unsigned int*)(0x43002054UL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE6                      *((volatile unsigned int*)(0x43002058UL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE7                      *((volatile unsigned int*)(0x4300205CUL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE8                      *((volatile unsigned int*)(0x43002060UL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE9                      *((volatile unsigned int*)(0x43002064UL))
#define bM4_USH_HPTXFSIZ_PTXFSIZE10                     *((volatile unsigned int*)(0x43002068UL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43002080UL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43002084UL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43002088UL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4300208CUL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43002090UL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43002094UL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43002098UL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4300209CUL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x430020A0UL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x430020A4UL))
#define bM4_USH_DIEPTXF1_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x430020A8UL))
#define bM4_USH_DIEPTXF1_INEPNTXFDEP0                   *((volatile unsigned int*)(0x430020C0UL))
#define bM4_USH_DIEPTXF1_INEPNTXFDEP1                   *((volatile unsigned int*)(0x430020C4UL))
#define bM4_USH_DIEPTXF1_INEPNTXFDEP2                   *((volatile unsigned int*)(0x430020C8UL))
#define bM4_USH_DIEPTXF1_INEPNTXFDEP3                   *((volatile unsigned int*)(0x430020CCUL))
#define bM4_USH_DIEPTXF1_INEPNTXFDEP4                   *((volatile unsigned int*)(0x430020D0UL))
#define bM4_USH_DIEPTXF1_INEPNTXFDEP5                   *((volatile unsigned int*)(0x430020D4UL))
#define bM4_USH_DIEPTXF1_INEPNTXFDEP6                   *((volatile unsigned int*)(0x430020D8UL))
#define bM4_USH_DIEPTXF1_INEPNTXFDEP7                   *((volatile unsigned int*)(0x430020DCUL))
#define bM4_USH_DIEPTXF1_INEPNTXFDEP8                   *((volatile unsigned int*)(0x430020E0UL))
#define bM4_USH_DIEPTXF1_INEPNTXFDEP9                   *((volatile unsigned int*)(0x430020E4UL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43002100UL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43002104UL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43002108UL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4300210CUL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43002110UL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43002114UL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43002118UL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4300211CUL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x43002120UL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x43002124UL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x43002128UL))
#define bM4_USH_DIEPTXF2_INEPNTXFSTADDR11               *((volatile unsigned int*)(0x4300212CUL))
#define bM4_USH_DIEPTXF2_INEPNTXFDEP0                   *((volatile unsigned int*)(0x43002140UL))
#define bM4_USH_DIEPTXF2_INEPNTXFDEP1                   *((volatile unsigned int*)(0x43002144UL))
#define bM4_USH_DIEPTXF2_INEPNTXFDEP2                   *((volatile unsigned int*)(0x43002148UL))
#define bM4_USH_DIEPTXF2_INEPNTXFDEP3                   *((volatile unsigned int*)(0x4300214CUL))
#define bM4_USH_DIEPTXF2_INEPNTXFDEP4                   *((volatile unsigned int*)(0x43002150UL))
#define bM4_USH_DIEPTXF2_INEPNTXFDEP5                   *((volatile unsigned int*)(0x43002154UL))
#define bM4_USH_DIEPTXF2_INEPNTXFDEP6                   *((volatile unsigned int*)(0x43002158UL))
#define bM4_USH_DIEPTXF2_INEPNTXFDEP7                   *((volatile unsigned int*)(0x4300215CUL))
#define bM4_USH_DIEPTXF2_INEPNTXFDEP8                   *((volatile unsigned int*)(0x43002160UL))
#define bM4_USH_DIEPTXF2_INEPNTXFDEP9                   *((volatile unsigned int*)(0x43002164UL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43002180UL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43002184UL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43002188UL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4300218CUL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43002190UL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43002194UL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43002198UL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4300219CUL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x430021A0UL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x430021A4UL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x430021A8UL))
#define bM4_USH_DIEPTXF3_INEPNTXFSTADDR11               *((volatile unsigned int*)(0x430021ACUL))
#define bM4_USH_DIEPTXF3_INEPNTXFDEP0                   *((volatile unsigned int*)(0x430021C0UL))
#define bM4_USH_DIEPTXF3_INEPNTXFDEP1                   *((volatile unsigned int*)(0x430021C4UL))
#define bM4_USH_DIEPTXF3_INEPNTXFDEP2                   *((volatile unsigned int*)(0x430021C8UL))
#define bM4_USH_DIEPTXF3_INEPNTXFDEP3                   *((volatile unsigned int*)(0x430021CCUL))
#define bM4_USH_DIEPTXF3_INEPNTXFDEP4                   *((volatile unsigned int*)(0x430021D0UL))
#define bM4_USH_DIEPTXF3_INEPNTXFDEP5                   *((volatile unsigned int*)(0x430021D4UL))
#define bM4_USH_DIEPTXF3_INEPNTXFDEP6                   *((volatile unsigned int*)(0x430021D8UL))
#define bM4_USH_DIEPTXF3_INEPNTXFDEP7                   *((volatile unsigned int*)(0x430021DCUL))
#define bM4_USH_DIEPTXF3_INEPNTXFDEP8                   *((volatile unsigned int*)(0x430021E0UL))
#define bM4_USH_DIEPTXF3_INEPNTXFDEP9                   *((volatile unsigned int*)(0x430021E4UL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43002200UL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43002204UL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43002208UL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4300220CUL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43002210UL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43002214UL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43002218UL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4300221CUL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x43002220UL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x43002224UL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x43002228UL))
#define bM4_USH_DIEPTXF4_INEPNTXFSTADDR11               *((volatile unsigned int*)(0x4300222CUL))
#define bM4_USH_DIEPTXF4_INEPNTXFDEP0                   *((volatile unsigned int*)(0x43002240UL))
#define bM4_USH_DIEPTXF4_INEPNTXFDEP1                   *((volatile unsigned int*)(0x43002244UL))
#define bM4_USH_DIEPTXF4_INEPNTXFDEP2                   *((volatile unsigned int*)(0x43002248UL))
#define bM4_USH_DIEPTXF4_INEPNTXFDEP3                   *((volatile unsigned int*)(0x4300224CUL))
#define bM4_USH_DIEPTXF4_INEPNTXFDEP4                   *((volatile unsigned int*)(0x43002250UL))
#define bM4_USH_DIEPTXF4_INEPNTXFDEP5                   *((volatile unsigned int*)(0x43002254UL))
#define bM4_USH_DIEPTXF4_INEPNTXFDEP6                   *((volatile unsigned int*)(0x43002258UL))
#define bM4_USH_DIEPTXF4_INEPNTXFDEP7                   *((volatile unsigned int*)(0x4300225CUL))
#define bM4_USH_DIEPTXF4_INEPNTXFDEP8                   *((volatile unsigned int*)(0x43002260UL))
#define bM4_USH_DIEPTXF4_INEPNTXFDEP9                   *((volatile unsigned int*)(0x43002264UL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43002280UL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43002284UL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43002288UL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4300228CUL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43002290UL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43002294UL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43002298UL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4300229CUL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x430022A0UL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x430022A4UL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x430022A8UL))
#define bM4_USH_DIEPTXF5_INEPNTXFSTADDR11               *((volatile unsigned int*)(0x430022ACUL))
#define bM4_USH_DIEPTXF5_INEPNTXFDEP0                   *((volatile unsigned int*)(0x430022C0UL))
#define bM4_USH_DIEPTXF5_INEPNTXFDEP1                   *((volatile unsigned int*)(0x430022C4UL))
#define bM4_USH_DIEPTXF5_INEPNTXFDEP2                   *((volatile unsigned int*)(0x430022C8UL))
#define bM4_USH_DIEPTXF5_INEPNTXFDEP3                   *((volatile unsigned int*)(0x430022CCUL))
#define bM4_USH_DIEPTXF5_INEPNTXFDEP4                   *((volatile unsigned int*)(0x430022D0UL))
#define bM4_USH_DIEPTXF5_INEPNTXFDEP5                   *((volatile unsigned int*)(0x430022D4UL))
#define bM4_USH_DIEPTXF5_INEPNTXFDEP6                   *((volatile unsigned int*)(0x430022D8UL))
#define bM4_USH_DIEPTXF5_INEPNTXFDEP7                   *((volatile unsigned int*)(0x430022DCUL))
#define bM4_USH_DIEPTXF5_INEPNTXFDEP8                   *((volatile unsigned int*)(0x430022E0UL))
#define bM4_USH_DIEPTXF5_INEPNTXFDEP9                   *((volatile unsigned int*)(0x430022E4UL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43002300UL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43002304UL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43002308UL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4300230CUL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43002310UL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43002314UL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43002318UL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4300231CUL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x43002320UL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x43002324UL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x43002328UL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR11               *((volatile unsigned int*)(0x4300232CUL))
#define bM4_USH_DIEPTXF6_INEPNTXFSTADDR12               *((volatile unsigned int*)(0x43002330UL))
#define bM4_USH_DIEPTXF6_INEPNTXFDEP0                   *((volatile unsigned int*)(0x43002340UL))
#define bM4_USH_DIEPTXF6_INEPNTXFDEP1                   *((volatile unsigned int*)(0x43002344UL))
#define bM4_USH_DIEPTXF6_INEPNTXFDEP2                   *((volatile unsigned int*)(0x43002348UL))
#define bM4_USH_DIEPTXF6_INEPNTXFDEP3                   *((volatile unsigned int*)(0x4300234CUL))
#define bM4_USH_DIEPTXF6_INEPNTXFDEP4                   *((volatile unsigned int*)(0x43002350UL))
#define bM4_USH_DIEPTXF6_INEPNTXFDEP5                   *((volatile unsigned int*)(0x43002354UL))
#define bM4_USH_DIEPTXF6_INEPNTXFDEP6                   *((volatile unsigned int*)(0x43002358UL))
#define bM4_USH_DIEPTXF6_INEPNTXFDEP7                   *((volatile unsigned int*)(0x4300235CUL))
#define bM4_USH_DIEPTXF6_INEPNTXFDEP8                   *((volatile unsigned int*)(0x43002360UL))
#define bM4_USH_DIEPTXF6_INEPNTXFDEP9                   *((volatile unsigned int*)(0x43002364UL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR0                *((volatile unsigned int*)(0x43002380UL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR1                *((volatile unsigned int*)(0x43002384UL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR2                *((volatile unsigned int*)(0x43002388UL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR3                *((volatile unsigned int*)(0x4300238CUL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR4                *((volatile unsigned int*)(0x43002390UL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR5                *((volatile unsigned int*)(0x43002394UL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR6                *((volatile unsigned int*)(0x43002398UL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR7                *((volatile unsigned int*)(0x4300239CUL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR8                *((volatile unsigned int*)(0x430023A0UL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR9                *((volatile unsigned int*)(0x430023A4UL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR10               *((volatile unsigned int*)(0x430023A8UL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR11               *((volatile unsigned int*)(0x430023ACUL))
#define bM4_USH_DIEPTXF7_INEPNTXFSTADDR12               *((volatile unsigned int*)(0x430023B0UL))
#define bM4_USH_DIEPTXF7_INEPNTXFDEP0                   *((volatile unsigned int*)(0x430023C0UL))
#define bM4_USH_DIEPTXF7_INEPNTXFDEP1                   *((volatile unsigned int*)(0x430023C4UL))
#define bM4_USH_DIEPTXF7_INEPNTXFDEP2                   *((volatile unsigned int*)(0x430023C8UL))
#define bM4_USH_DIEPTXF7_INEPNTXFDEP3                   *((volatile unsigned int*)(0x430023CCUL))
#define bM4_USH_DIEPTXF7_INEPNTXFDEP4                   *((volatile unsigned int*)(0x430023D0UL))
#define bM4_USH_DIEPTXF7_INEPNTXFDEP5                   *((volatile unsigned int*)(0x430023D4UL))
#define bM4_USH_DIEPTXF7_INEPNTXFDEP6                   *((volatile unsigned int*)(0x430023D8UL))
#define bM4_USH_DIEPTXF7_INEPNTXFDEP7                   *((volatile unsigned int*)(0x430023DCUL))
#define bM4_USH_DIEPTXF7_INEPNTXFDEP8                   *((volatile unsigned int*)(0x430023E0UL))
#define bM4_USH_DIEPTXF7_INEPNTXFDEP9                   *((volatile unsigned int*)(0x430023E4UL))
#define bM4_USH_HCFG_FSLSPCLKSEL0                       *((volatile unsigned int*)(0x43008000UL))
#define bM4_USH_HCFG_FSLSPCLKSEL1                       *((volatile unsigned int*)(0x43008004UL))
#define bM4_USH_HCFG_FSLSSUPP                           *((volatile unsigned int*)(0x43008008UL))
#define bM4_USH_HCFG_ENA32KHZS                          *((volatile unsigned int*)(0x4300801CUL))
#define bM4_USH_HCFG_RESVALID0                          *((volatile unsigned int*)(0x43008020UL))
#define bM4_USH_HCFG_RESVALID1                          *((volatile unsigned int*)(0x43008024UL))
#define bM4_USH_HCFG_RESVALID2                          *((volatile unsigned int*)(0x43008028UL))
#define bM4_USH_HCFG_RESVALID3                          *((volatile unsigned int*)(0x4300802CUL))
#define bM4_USH_HCFG_RESVALID4                          *((volatile unsigned int*)(0x43008030UL))
#define bM4_USH_HCFG_RESVALID5                          *((volatile unsigned int*)(0x43008034UL))
#define bM4_USH_HCFG_RESVALID6                          *((volatile unsigned int*)(0x43008038UL))
#define bM4_USH_HCFG_RESVALID7                          *((volatile unsigned int*)(0x4300803CUL))
#define bM4_USH_HCFG_MODECHTIMEN                        *((volatile unsigned int*)(0x4300807CUL))
#define bM4_USH_HFIR_FRINT0                             *((volatile unsigned int*)(0x43008080UL))
#define bM4_USH_HFIR_FRINT1                             *((volatile unsigned int*)(0x43008084UL))
#define bM4_USH_HFIR_FRINT2                             *((volatile unsigned int*)(0x43008088UL))
#define bM4_USH_HFIR_FRINT3                             *((volatile unsigned int*)(0x4300808CUL))
#define bM4_USH_HFIR_FRINT4                             *((volatile unsigned int*)(0x43008090UL))
#define bM4_USH_HFIR_FRINT5                             *((volatile unsigned int*)(0x43008094UL))
#define bM4_USH_HFIR_FRINT6                             *((volatile unsigned int*)(0x43008098UL))
#define bM4_USH_HFIR_FRINT7                             *((volatile unsigned int*)(0x4300809CUL))
#define bM4_USH_HFIR_FRINT8                             *((volatile unsigned int*)(0x430080A0UL))
