RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_HFIR_FRINT9                             *((volatile unsigned int*)(0x430080A4UL))
#define bM4_USH_HFIR_FRINT10                            *((volatile unsigned int*)(0x430080A8UL))
#define bM4_USH_HFIR_FRINT11                            *((volatile unsigned int*)(0x430080ACUL))
#define bM4_USH_HFIR_FRINT12                            *((volatile unsigned int*)(0x430080B0UL))
#define bM4_USH_HFIR_FRINT13                            *((volatile unsigned int*)(0x430080B4UL))
#define bM4_USH_HFIR_FRINT14                            *((volatile unsigned int*)(0x430080B8UL))
#define bM4_USH_HFIR_FRINT15                            *((volatile unsigned int*)(0x430080BCUL))
#define bM4_USH_HFIR_HFIRRLDCTRL                        *((volatile unsigned int*)(0x430080C0UL))
#define bM4_USH_HFIR_RESV                               *((volatile unsigned int*)(0x430080E0UL))
#define bM4_USH_HFNUM_FRNUM0                            *((volatile unsigned int*)(0x43008100UL))
#define bM4_USH_HFNUM_FRNUM1                            *((volatile unsigned int*)(0x43008104UL))
#define bM4_USH_HFNUM_FRNUM2                            *((volatile unsigned int*)(0x43008108UL))
#define bM4_USH_HFNUM_FRNUM3                            *((volatile unsigned int*)(0x4300810CUL))
#define bM4_USH_HFNUM_FRNUM4                            *((volatile unsigned int*)(0x43008110UL))
#define bM4_USH_HFNUM_FRNUM5                            *((volatile unsigned int*)(0x43008114UL))
#define bM4_USH_HFNUM_FRNUM6                            *((volatile unsigned int*)(0x43008118UL))
#define bM4_USH_HFNUM_FRNUM7                            *((volatile unsigned int*)(0x4300811CUL))
#define bM4_USH_HFNUM_FRNUM8                            *((volatile unsigned int*)(0x43008120UL))
#define bM4_USH_HFNUM_FRNUM9                            *((volatile unsigned int*)(0x43008124UL))
#define bM4_USH_HFNUM_FRNUM10                           *((volatile unsigned int*)(0x43008128UL))
#define bM4_USH_HFNUM_FRNUM11                           *((volatile unsigned int*)(0x4300812CUL))
#define bM4_USH_HFNUM_FRNUM12                           *((volatile unsigned int*)(0x43008130UL))
#define bM4_USH_HFNUM_FRNUM13                           *((volatile unsigned int*)(0x43008134UL))
#define bM4_USH_HFNUM_FRNUM14                           *((volatile unsigned int*)(0x43008138UL))
#define bM4_USH_HFNUM_FRNUM15                           *((volatile unsigned int*)(0x4300813CUL))
#define bM4_USH_HFNUM_FRREM0                            *((volatile unsigned int*)(0x43008140UL))
#define bM4_USH_HFNUM_FRREM1                            *((volatile unsigned int*)(0x43008144UL))
#define bM4_USH_HFNUM_FRREM2                            *((volatile unsigned int*)(0x43008148UL))
#define bM4_USH_HFNUM_FRREM3                            *((volatile unsigned int*)(0x4300814CUL))
#define bM4_USH_HFNUM_FRREM4                            *((volatile unsigned int*)(0x43008150UL))
#define bM4_USH_HFNUM_FRREM5                            *((volatile unsigned int*)(0x43008154UL))
#define bM4_USH_HFNUM_FRREM6                            *((volatile unsigned int*)(0x43008158UL))
#define bM4_USH_HFNUM_FRREM7                            *((volatile unsigned int*)(0x4300815CUL))
#define bM4_USH_HFNUM_FRREM8                            *((volatile unsigned int*)(0x43008160UL))
#define bM4_USH_HFNUM_FRREM9                            *((volatile unsigned int*)(0x43008164UL))
#define bM4_USH_HFNUM_FRREM10                           *((volatile unsigned int*)(0x43008168UL))
#define bM4_USH_HFNUM_FRREM11                           *((volatile unsigned int*)(0x4300816CUL))
#define bM4_USH_HFNUM_FRREM12                           *((volatile unsigned int*)(0x43008170UL))
#define bM4_USH_HFNUM_FRREM13                           *((volatile unsigned int*)(0x43008174UL))
#define bM4_USH_HFNUM_FRREM14                           *((volatile unsigned int*)(0x43008178UL))
#define bM4_USH_HFNUM_FRREM15                           *((volatile unsigned int*)(0x4300817CUL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL0                   *((volatile unsigned int*)(0x43008200UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL1                   *((volatile unsigned int*)(0x43008204UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL2                   *((volatile unsigned int*)(0x43008208UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL3                   *((volatile unsigned int*)(0x4300820CUL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL4                   *((volatile unsigned int*)(0x43008210UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL5                   *((volatile unsigned int*)(0x43008214UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL6                   *((volatile unsigned int*)(0x43008218UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL7                   *((volatile unsigned int*)(0x4300821CUL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL8                   *((volatile unsigned int*)(0x43008220UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL9                   *((volatile unsigned int*)(0x43008224UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL10                  *((volatile unsigned int*)(0x43008228UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL11                  *((volatile unsigned int*)(0x4300822CUL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL12                  *((volatile unsigned int*)(0x43008230UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL13                  *((volatile unsigned int*)(0x43008234UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL14                  *((volatile unsigned int*)(0x43008238UL))
#define bM4_USH_HPTXSTS_PTXFSPCAVAIL15                  *((volatile unsigned int*)(0x4300823CUL))
#define bM4_USH_HPTXSTS_PTXQSPCAVAIL0                   *((volatile unsigned int*)(0x43008240UL))
#define bM4_USH_HPTXSTS_PTXQSPCAVAIL1                   *((volatile unsigned int*)(0x43008244UL))
#define bM4_USH_HPTXSTS_PTXQSPCAVAIL2                   *((volatile unsigned int*)(0x43008248UL))
#define bM4_USH_HPTXSTS_PTXQSPCAVAIL3                   *((volatile unsigned int*)(0x4300824CUL))
#define bM4_USH_HPTXSTS_PTXQSPCAVAIL4                   *((volatile unsigned int*)(0x43008250UL))
#define bM4_USH_HPTXSTS_PTXQSPCAVAIL5                   *((volatile unsigned int*)(0x43008254UL))
#define bM4_USH_HPTXSTS_PTXQSPCAVAIL6                   *((volatile unsigned int*)(0x43008258UL))
#define bM4_USH_HPTXSTS_PTXQSPCAVAIL7                   *((volatile unsigned int*)(0x4300825CUL))
#define bM4_USH_HPTXSTS_PTXQTOP0                        *((volatile unsigned int*)(0x43008260UL))
#define bM4_USH_HPTXSTS_PTXQTOP1                        *((volatile unsigned int*)(0x43008264UL))
#define bM4_USH_HPTXSTS_PTXQTOP2                        *((volatile unsigned int*)(0x43008268UL))
#define bM4_USH_HPTXSTS_PTXQTOP3                        *((volatile unsigned int*)(0x4300826CUL))
#define bM4_USH_HPTXSTS_PTXQTOP4                        *((volatile unsigned int*)(0x43008270UL))
#define bM4_USH_HPTXSTS_PTXQTOP5                        *((volatile unsigned int*)(0x43008274UL))
#define bM4_USH_HPTXSTS_PTXQTOP6                        *((volatile unsigned int*)(0x43008278UL))
#define bM4_USH_HPTXSTS_PTXQTOP7                        *((volatile unsigned int*)(0x4300827CUL))
#define bM4_USH_HPRT_PRTCONNSTS                         *((volatile unsigned int*)(0x43008800UL))
#define bM4_USH_HPRT_PRTCONNDET                         *((volatile unsigned int*)(0x43008804UL))
#define bM4_USH_HPRT_PRTENA                             *((volatile unsigned int*)(0x43008808UL))
#define bM4_USH_HPRT_PRTENCHNG                          *((volatile unsigned int*)(0x4300880CUL))
#define bM4_USH_HPRT_PRTOVRCURRACT                      *((volatile unsigned int*)(0x43008810UL))
#define bM4_USH_HPRT_PRTOVRCURRCHNG                     *((volatile unsigned int*)(0x43008814UL))
#define bM4_USH_HPRT_PRTRES                             *((volatile unsigned int*)(0x43008818UL))
#define bM4_USH_HPRT_PRTSUSP                            *((volatile unsigned int*)(0x4300881CUL))
#define bM4_USH_HPRT_PRTRST                             *((volatile unsigned int*)(0x43008820UL))
#define bM4_USH_HPRT_PRTLNSTS0                          *((volatile unsigned int*)(0x43008828UL))
#define bM4_USH_HPRT_PRTLNSTS1                          *((volatile unsigned int*)(0x4300882CUL))
#define bM4_USH_HPRT_PRTPWR                             *((volatile unsigned int*)(0x43008830UL))
#define bM4_USH_HPRT_PRTTSTCTL0                         *((volatile unsigned int*)(0x43008834UL))
#define bM4_USH_HPRT_PRTTSTCTL1                         *((volatile unsigned int*)(0x43008838UL))
#define bM4_USH_HPRT_PRTTSTCTL2                         *((volatile unsigned int*)(0x4300883CUL))
#define bM4_USH_HPRT_PRTTSTCTL3                         *((volatile unsigned int*)(0x43008840UL))
#define bM4_USH_HPRT_PRTSPD0                            *((volatile unsigned int*)(0x43008844UL))
#define bM4_USH_HPRT_PRTSPD1                            *((volatile unsigned int*)(0x43008848UL))
#define bM4_USH_HPRT_RESV                               *((volatile unsigned int*)(0x43008860UL))
#define bM4_USH_HCCHAR0_MPS0                            *((volatile unsigned int*)(0x4300A000UL))
#define bM4_USH_HCCHAR0_MPS1                            *((volatile unsigned int*)(0x4300A004UL))
#define bM4_USH_HCCHAR0_MPS2                            *((volatile unsigned int*)(0x4300A008UL))
#define bM4_USH_HCCHAR0_MPS3                            *((volatile unsigned int*)(0x4300A00CUL))
#define bM4_USH_HCCHAR0_MPS4                            *((volatile unsigned int*)(0x4300A010UL))
#define bM4_USH_HCCHAR0_MPS5                            *((volatile unsigned int*)(0x4300A014UL))
#define bM4_USH_HCCHAR0_MPS6                            *((volatile unsigned int*)(0x4300A018UL))
#define bM4_USH_HCCHAR0_MPS7                            *((volatile unsigned int*)(0x4300A01CUL))
#define bM4_USH_HCCHAR0_MPS8                            *((volatile unsigned int*)(0x4300A020UL))
#define bM4_USH_HCCHAR0_MPS9                            *((volatile unsigned int*)(0x4300A024UL))
#define bM4_USH_HCCHAR0_MPS10                           *((volatile unsigned int*)(0x4300A028UL))
#define bM4_USH_HCCHAR0_EPNUM0                          *((volatile unsigned int*)(0x4300A02CUL))
#define bM4_USH_HCCHAR0_EPNUM1                          *((volatile unsigned int*)(0x4300A030UL))
#define bM4_USH_HCCHAR0_EPNUM2                          *((volatile unsigned int*)(0x4300A034UL))
#define bM4_USH_HCCHAR0_EPNUM3                          *((volatile unsigned int*)(0x4300A038UL))
#define bM4_USH_HCCHAR0_EPDIR                           *((volatile unsigned int*)(0x4300A03CUL))
#define bM4_USH_HCCHAR0_LSPDDEV                         *((volatile unsigned int*)(0x4300A044UL))
#define bM4_USH_HCCHAR0_EPTYPE0                         *((volatile unsigned int*)(0x4300A048UL))
#define bM4_USH_HCCHAR0_EPTYPE1                         *((volatile unsigned int*)(0x4300A04CUL))
#define bM4_USH_HCCHAR0_EC0                             *((volatile unsigned int*)(0x4300A050UL))
#define bM4_USH_HCCHAR0_EC1                             *((volatile unsigned int*)(0x4300A054UL))
#define bM4_USH_HCCHAR0_DEVADDR0                        *((volatile unsigned int*)(0x4300A058UL))
#define bM4_USH_HCCHAR0_DEVADDR1                        *((volatile unsigned int*)(0x4300A05CUL))
#define bM4_USH_HCCHAR0_DEVADDR2                        *((volatile unsigned int*)(0x4300A060UL))
#define bM4_USH_HCCHAR0_DEVADDR3                        *((volatile unsigned int*)(0x4300A064UL))
#define bM4_USH_HCCHAR0_DEVADDR4                        *((volatile unsigned int*)(0x4300A068UL))
#define bM4_USH_HCCHAR0_DEVADDR5                        *((volatile unsigned int*)(0x4300A06CUL))
#define bM4_USH_HCCHAR0_DEVADDR6                        *((volatile unsigned int*)(0x4300A070UL))
#define bM4_USH_HCCHAR0_ODDFRM                          *((volatile unsigned int*)(0x4300A074UL))
#define bM4_USH_HCCHAR0_CHDIS                           *((volatile unsigned int*)(0x4300A078UL))
#define bM4_USH_HCCHAR0_CHENA                           *((volatile unsigned int*)(0x4300A07CUL))
#define bM4_USH_HCSPLT0_PRTADDR0                        *((volatile unsigned int*)(0x4300A080UL))
#define bM4_USH_HCSPLT0_PRTADDR1                        *((volatile unsigned int*)(0x4300A084UL))
#define bM4_USH_HCSPLT0_PRTADDR2                        *((volatile unsigned int*)(0x4300A088UL))
#define bM4_USH_HCSPLT0_PRTADDR3                        *((volatile unsigned int*)(0x4300A08CUL))
#define bM4_USH_HCSPLT0_PRTADDR4                        *((volatile unsigned int*)(0x4300A090UL))
#define bM4_USH_HCSPLT0_PRTADDR5                        *((volatile unsigned int*)(0x4300A094UL))
#define bM4_USH_HCSPLT0_PRTADDR6                        *((volatile unsigned int*)(0x4300A098UL))
#define bM4_USH_HCSPLT0_HUBADDR0                        *((volatile unsigned int*)(0x4300A09CUL))
#define bM4_USH_HCSPLT0_HUBADDR1                        *((volatile unsigned int*)(0x4300A0A0UL))
#define bM4_USH_HCSPLT0_HUBADDR2                        *((volatile unsigned int*)(0x4300A0A4UL))
#define bM4_USH_HCSPLT0_HUBADDR3                        *((volatile unsigned int*)(0x4300A0A8UL))
#define bM4_USH_HCSPLT0_HUBADDR4                        *((volatile unsigned int*)(0x4300A0ACUL))
#define bM4_USH_HCSPLT0_HUBADDR5                        *((volatile unsigned int*)(0x4300A0B0UL))
#define bM4_USH_HCSPLT0_HUBADDR6                        *((volatile unsigned int*)(0x4300A0B4UL))
#define bM4_USH_HCSPLT0_XACTPOS0                        *((volatile unsigned int*)(0x4300A0B8UL))
#define bM4_USH_HCSPLT0_XACTPOS1                        *((volatile unsigned int*)(0x4300A0BCUL))
#define bM4_USH_HCSPLT0_COMPSPLT                        *((volatile unsigned int*)(0x4300A0C0UL))
#define bM4_USH_HCSPLT0_SPLTENA                         *((volatile unsigned int*)(0x4300A0FCUL))
#define bM4_USH_HCINT0_XFERCOMPL                        *((volatile unsigned int*)(0x4300A100UL))
#define bM4_USH_HCINT0_CHHLTD                           *((volatile unsigned int*)(0x4300A104UL))
#define bM4_USH_HCINT0_AHBERR                           *((volatile unsigned int*)(0x4300A108UL))
#define bM4_USH_HCINT0_STALL                            *((volatile unsigned int*)(0x4300A10CUL))
#define bM4_USH_HCINT0_NAK                              *((volatile unsigned int*)(0x4300A110UL))
#define bM4_USH_HCINT0_ACK                              *((volatile unsigned int*)(0x4300A114UL))
#define bM4_USH_HCINT0_NYET                             *((volatile unsigned int*)(0x4300A118UL))
#define bM4_USH_HCINT0_XACTERR                          *((volatile unsigned int*)(0x4300A11CUL))
#define bM4_USH_HCINT0_BBLERR                           *((volatile unsigned int*)(0x4300A120UL))
#define bM4_USH_HCINT0_FRMOVRUN                         *((volatile unsigned int*)(0x4300A124UL))
#define bM4_USH_HCINT0_DATATGLERR                       *((volatile unsigned int*)(0x4300A128UL))
#define bM4_USH_HCINTMSK0_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4300A180UL))
#define bM4_USH_HCINTMSK0_CHHLTDMSK                     *((volatile unsigned int*)(0x4300A184UL))
#define bM4_USH_HCINTMSK0_AHBERRMSK                     *((volatile unsigned int*)(0x4300A188UL))
#define bM4_USH_HCINTMSK0_STALLMSK                      *((volatile unsigned int*)(0x4300A18CUL))
#define bM4_USH_HCINTMSK0_NAKMSK                        *((volatile unsigned int*)(0x4300A190UL))
#define bM4_USH_HCINTMSK0_ACKMSK                        *((volatile unsigned int*)(0x4300A194UL))
#define bM4_USH_HCINTMSK0_NYETMSK                       *((volatile unsigned int*)(0x4300A198UL))
#define bM4_USH_HCINTMSK0_XACTERRMSK                    *((volatile unsigned int*)(0x4300A19CUL))
#define bM4_USH_HCINTMSK0_BBLERRMSK                     *((volatile unsigned int*)(0x4300A1A0UL))
#define bM4_USH_HCINTMSK0_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4300A1A4UL))
#define bM4_USH_HCINTMSK0_DATATGLERRMSK                 *((volatile unsigned int*)(0x4300A1A8UL))
#define bM4_USH_HCTSIZ0_XFERSIZE0                       *((volatile unsigned int*)(0x4300A200UL))
#define bM4_USH_HCTSIZ0_XFERSIZE1                       *((volatile unsigned int*)(0x4300A204UL))
#define bM4_USH_HCTSIZ0_XFERSIZE2                       *((volatile unsigned int*)(0x4300A208UL))
#define bM4_USH_HCTSIZ0_XFERSIZE3                       *((volatile unsigned int*)(0x4300A20CUL))
#define bM4_USH_HCTSIZ0_XFERSIZE4                       *((volatile unsigned int*)(0x4300A210UL))
#define bM4_USH_HCTSIZ0_XFERSIZE5                       *((volatile unsigned int*)(0x4300A214UL))
#define bM4_USH_HCTSIZ0_XFERSIZE6                       *((volatile unsigned int*)(0x4300A218UL))
#define bM4_USH_HCTSIZ0_XFERSIZE7                       *((volatile unsigned int*)(0x4300A21CUL))
#define bM4_USH_HCTSIZ0_XFERSIZE8                       *((volatile unsigned int*)(0x4300A220UL))
#define bM4_USH_HCTSIZ0_XFERSIZE9                       *((volatile unsigned int*)(0x4300A224UL))
#define bM4_USH_HCTSIZ0_XFERSIZE10                      *((volatile unsigned int*)(0x4300A228UL))
#define bM4_USH_HCTSIZ0_XFERSIZE11                      *((volatile unsigned int*)(0x4300A22CUL))
#define bM4_USH_HCTSIZ0_XFERSIZE12                      *((volatile unsigned int*)(0x4300A230UL))
#define bM4_USH_HCTSIZ0_XFERSIZE13                      *((volatile unsigned int*)(0x4300A234UL))
#define bM4_USH_HCTSIZ0_XFERSIZE14                      *((volatile unsigned int*)(0x4300A238UL))
#define bM4_USH_HCTSIZ0_XFERSIZE15                      *((volatile unsigned int*)(0x4300A23CUL))
#define bM4_USH_HCTSIZ0_XFERSIZE16                      *((volatile unsigned int*)(0x4300A240UL))
#define bM4_USH_HCTSIZ0_XFERSIZE17                      *((volatile unsigned int*)(0x4300A244UL))
#define bM4_USH_HCTSIZ0_XFERSIZE18                      *((volatile unsigned int*)(0x4300A248UL))
#define bM4_USH_HCTSIZ0_PKTCNT0                         *((volatile unsigned int*)(0x4300A24CUL))
#define bM4_USH_HCTSIZ0_PKTCNT1                         *((volatile unsigned int*)(0x4300A250UL))
#define bM4_USH_HCTSIZ0_PKTCNT2                         *((volatile unsigned int*)(0x4300A254UL))
#define bM4_USH_HCTSIZ0_PKTCNT3                         *((volatile unsigned int*)(0x4300A258UL))
#define bM4_USH_HCTSIZ0_PKTCNT4                         *((volatile unsigned int*)(0x4300A25CUL))
#define bM4_USH_HCTSIZ0_PKTCNT5                         *((volatile unsigned int*)(0x4300A260UL))
#define bM4_USH_HCTSIZ0_PKTCNT6                         *((volatile unsigned int*)(0x4300A264UL))
#define bM4_USH_HCTSIZ0_PKTCNT7                         *((volatile unsigned int*)(0x4300A268UL))
#define bM4_USH_HCTSIZ0_PKTCNT8                         *((volatile unsigned int*)(0x4300A26CUL))
#define bM4_USH_HCTSIZ0_PKTCNT9                         *((volatile unsigned int*)(0x4300A270UL))
#define bM4_USH_HCTSIZ0_PID0                            *((volatile unsigned int*)(0x4300A274UL))
#define bM4_USH_HCTSIZ0_PID1                            *((volatile unsigned int*)(0x4300A278UL))
#define bM4_USH_HCTSIZ0_DOPNG                           *((volatile unsigned int*)(0x4300A27CUL))
#define bM4_USH_HCCHAR1_MPS0                            *((volatile unsigned int*)(0x4300A400UL))
#define bM4_USH_HCCHAR1_MPS1                            *((volatile unsigned int*)(0x4300A404UL))
#define bM4_USH_HCCHAR1_MPS2                            *((volatile unsigned int*)(0x4300A408UL))
#define bM4_USH_HCCHAR1_MPS3                            *((volatile unsigned int*)(0x4300A40CUL))
#define bM4_USH_HCCHAR1_MPS4                            *((volatile unsigned int*)(0x4300A410UL))
#define bM4_USH_HCCHAR1_MPS5                            *((volatile unsigned int*)(0x4300A414UL))
#define bM4_USH_HCCHAR1_MPS6                            *((volatile unsigned int*)(0x4300A418UL))
#define bM4_USH_HCCHAR1_MPS7                            *((volatile unsigned int*)(0x4300A41CUL))
#define bM4_USH_HCCHAR1_MPS8                            *((volatile unsigned int*)(0x4300A420UL))
#define bM4_USH_HCCHAR1_MPS9                            *((volatile unsigned int*)(0x4300A424UL))
#define bM4_USH_HCCHAR1_MPS10                           *((volatile unsigned int*)(0x4300A428UL))
#define bM4_USH_HCCHAR1_EPNUM0                          *((volatile unsigned int*)(0x4300A42CUL))
#define bM4_USH_HCCHAR1_EPNUM1                          *((volatile unsigned int*)(0x4300A430UL))
#define bM4_USH_HCCHAR1_EPNUM2                          *((volatile unsigned int*)(0x4300A434UL))
#define bM4_USH_HCCHAR1_EPNUM3                          *((volatile unsigned int*)(0x4300A438UL))
#define bM4_USH_HCCHAR1_EPDIR                           *((volatile unsigned int*)(0x4300A43CUL))
#define bM4_USH_HCCHAR1_LSPDDEV                         *((volatile unsigned int*)(0x4300A444UL))
#define bM4_USH_HCCHAR1_EPTYPE0                         *((volatile unsigned int*)(0x4300A448UL))
#define bM4_USH_HCCHAR1_EPTYPE1                         *((volatile unsigned int*)(0x4300A44CUL))
#define bM4_USH_HCCHAR1_EC0                             *((volatile unsigned int*)(0x4300A450UL))
#define bM4_USH_HCCHAR1_EC1                             *((volatile unsigned int*)(0x4300A454UL))
#define bM4_USH_HCCHAR1_DEVADDR0                        *((volatile unsigned int*)(0x4300A458UL))
#define bM4_USH_HCCHAR1_DEVADDR1                        *((volatile unsigned int*)(0x4300A45CUL))
#define bM4_USH_HCCHAR1_DEVADDR2                        *((volatile unsigned int*)(0x4300A460UL))
#define bM4_USH_HCCHAR1_DEVADDR3                        *((volatile unsigned int*)(0x4300A464UL))
#define bM4_USH_HCCHAR1_DEVADDR4                        *((volatile unsigned int*)(0x4300A468UL))
#define bM4_USH_HCCHAR1_DEVADDR5                        *((volatile unsigned int*)(0x4300A46CUL))
#define bM4_USH_HCCHAR1_DEVADDR6                        *((volatile unsigned int*)(0x4300A470UL))
#define bM4_USH_HCCHAR1_ODDFRM                          *((volatile unsigned int*)(0x4300A474UL))
#define bM4_USH_HCCHAR1_CHDIS                           *((volatile unsigned int*)(0x4300A478UL))
#define bM4_USH_HCCHAR1_CHENA                           *((volatile unsigned int*)(0x4300A47CUL))
#define bM4_USH_HCSPLT1_PRTADDR0                        *((volatile unsigned int*)(0x4300A480UL))
#define bM4_USH_HCSPLT1_PRTADDR1                        *((volatile unsigned int*)(0x4300A484UL))
#define bM4_USH_HCSPLT1_PRTADDR2                        *((volatile unsigned int*)(0x4300A488UL))
#define bM4_USH_HCSPLT1_PRTADDR3                        *((volatile unsigned int*)(0x4300A48CUL))
#define bM4_USH_HCSPLT1_PRTADDR4                        *((volatile unsigned int*)(0x4300A490UL))
#define bM4_USH_HCSPLT1_PRTADDR5                        *((volatile unsigned int*)(0x4300A494UL))
#define bM4_USH_HCSPLT1_PRTADDR6                        *((volatile unsigned int*)(0x4300A498UL))
#define bM4_USH_HCSPLT1_HUBADDR0                        *((volatile unsigned int*)(0x4300A49CUL))
#define bM4_USH_HCSPLT1_HUBADDR1                        *((volatile unsigned int*)(0x4300A4A0UL))
#define bM4_USH_HCSPLT1_HUBADDR2                        *((volatile unsigned int*)(0x4300A4A4UL))
#define bM4_USH_HCSPLT1_HUBADDR3                        *((volatile unsigned int*)(0x4300A4A8UL))
#define bM4_USH_HCSPLT1_HUBADDR4                        *((volatile unsigned int*)(0x4300A4ACUL))
#define bM4_USH_HCSPLT1_HUBADDR5                        *((volatile unsigned int*)(0x4300A4B0UL))
#define bM4_USH_HCSPLT1_HUBADDR6                        *((volatile unsigned int*)(0x4300A4B4UL))
#define bM4_USH_HCSPLT1_XACTPOS0                        *((volatile unsigned int*)(0x4300A4B8UL))
#define bM4_USH_HCSPLT1_XACTPOS1                        *((volatile unsigned int*)(0x4300A4BCUL))
#define bM4_USH_HCSPLT1_COMPSPLT                        *((volatile unsigned int*)(0x4300A4C0UL))
#define bM4_USH_HCSPLT1_SPLTENA                         *((volatile unsigned int*)(0x4300A4FCUL))
