RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_HCINT1_XFERCOMPL                        *((volatile unsigned int*)(0x4300A500UL))
#define bM4_USH_HCINT1_CHHLTD                           *((volatile unsigned int*)(0x4300A504UL))
#define bM4_USH_HCINT1_AHBERR                           *((volatile unsigned int*)(0x4300A508UL))
#define bM4_USH_HCINT1_STALL                            *((volatile unsigned int*)(0x4300A50CUL))
#define bM4_USH_HCINT1_NAK                              *((volatile unsigned int*)(0x4300A510UL))
#define bM4_USH_HCINT1_ACK                              *((volatile unsigned int*)(0x4300A514UL))
#define bM4_USH_HCINT1_NYET                             *((volatile unsigned int*)(0x4300A518UL))
#define bM4_USH_HCINT1_XACTERR                          *((volatile unsigned int*)(0x4300A51CUL))
#define bM4_USH_HCINT1_BBLERR                           *((volatile unsigned int*)(0x4300A520UL))
#define bM4_USH_HCINT1_FRMOVRUN                         *((volatile unsigned int*)(0x4300A524UL))
#define bM4_USH_HCINT1_DATATGLERR                       *((volatile unsigned int*)(0x4300A528UL))
#define bM4_USH_HCINTMSK1_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4300A580UL))
#define bM4_USH_HCINTMSK1_CHHLTDMSK                     *((volatile unsigned int*)(0x4300A584UL))
#define bM4_USH_HCINTMSK1_AHBERRMSK                     *((volatile unsigned int*)(0x4300A588UL))
#define bM4_USH_HCINTMSK1_STALLMSK                      *((volatile unsigned int*)(0x4300A58CUL))
#define bM4_USH_HCINTMSK1_NAKMSK                        *((volatile unsigned int*)(0x4300A590UL))
#define bM4_USH_HCINTMSK1_ACKMSK                        *((volatile unsigned int*)(0x4300A594UL))
#define bM4_USH_HCINTMSK1_NYETMSK                       *((volatile unsigned int*)(0x4300A598UL))
#define bM4_USH_HCINTMSK1_XACTERRMSK                    *((volatile unsigned int*)(0x4300A59CUL))
#define bM4_USH_HCINTMSK1_BBLERRMSK                     *((volatile unsigned int*)(0x4300A5A0UL))
#define bM4_USH_HCINTMSK1_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4300A5A4UL))
#define bM4_USH_HCINTMSK1_DATATGLERRMSK                 *((volatile unsigned int*)(0x4300A5A8UL))
#define bM4_USH_HCTSIZ1_XFERSIZE0                       *((volatile unsigned int*)(0x4300A600UL))
#define bM4_USH_HCTSIZ1_XFERSIZE1                       *((volatile unsigned int*)(0x4300A604UL))
#define bM4_USH_HCTSIZ1_XFERSIZE2                       *((volatile unsigned int*)(0x4300A608UL))
#define bM4_USH_HCTSIZ1_XFERSIZE3                       *((volatile unsigned int*)(0x4300A60CUL))
#define bM4_USH_HCTSIZ1_XFERSIZE4                       *((volatile unsigned int*)(0x4300A610UL))
#define bM4_USH_HCTSIZ1_XFERSIZE5                       *((volatile unsigned int*)(0x4300A614UL))
#define bM4_USH_HCTSIZ1_XFERSIZE6                       *((volatile unsigned int*)(0x4300A618UL))
#define bM4_USH_HCTSIZ1_XFERSIZE7                       *((volatile unsigned int*)(0x4300A61CUL))
#define bM4_USH_HCTSIZ1_XFERSIZE8                       *((volatile unsigned int*)(0x4300A620UL))
#define bM4_USH_HCTSIZ1_XFERSIZE9                       *((volatile unsigned int*)(0x4300A624UL))
#define bM4_USH_HCTSIZ1_XFERSIZE10                      *((volatile unsigned int*)(0x4300A628UL))
#define bM4_USH_HCTSIZ1_XFERSIZE11                      *((volatile unsigned int*)(0x4300A62CUL))
#define bM4_USH_HCTSIZ1_XFERSIZE12                      *((volatile unsigned int*)(0x4300A630UL))
#define bM4_USH_HCTSIZ1_XFERSIZE13                      *((volatile unsigned int*)(0x4300A634UL))
#define bM4_USH_HCTSIZ1_XFERSIZE14                      *((volatile unsigned int*)(0x4300A638UL))
#define bM4_USH_HCTSIZ1_XFERSIZE15                      *((volatile unsigned int*)(0x4300A63CUL))
#define bM4_USH_HCTSIZ1_XFERSIZE16                      *((volatile unsigned int*)(0x4300A640UL))
#define bM4_USH_HCTSIZ1_XFERSIZE17                      *((volatile unsigned int*)(0x4300A644UL))
#define bM4_USH_HCTSIZ1_XFERSIZE18                      *((volatile unsigned int*)(0x4300A648UL))
#define bM4_USH_HCTSIZ1_PKTCNT0                         *((volatile unsigned int*)(0x4300A64CUL))
#define bM4_USH_HCTSIZ1_PKTCNT1                         *((volatile unsigned int*)(0x4300A650UL))
#define bM4_USH_HCTSIZ1_PKTCNT2                         *((volatile unsigned int*)(0x4300A654UL))
#define bM4_USH_HCTSIZ1_PKTCNT3                         *((volatile unsigned int*)(0x4300A658UL))
#define bM4_USH_HCTSIZ1_PKTCNT4                         *((volatile unsigned int*)(0x4300A65CUL))
#define bM4_USH_HCTSIZ1_PKTCNT5                         *((volatile unsigned int*)(0x4300A660UL))
#define bM4_USH_HCTSIZ1_PKTCNT6                         *((volatile unsigned int*)(0x4300A664UL))
#define bM4_USH_HCTSIZ1_PKTCNT7                         *((volatile unsigned int*)(0x4300A668UL))
#define bM4_USH_HCTSIZ1_PKTCNT8                         *((volatile unsigned int*)(0x4300A66CUL))
#define bM4_USH_HCTSIZ1_PKTCNT9                         *((volatile unsigned int*)(0x4300A670UL))
#define bM4_USH_HCTSIZ1_PID0                            *((volatile unsigned int*)(0x4300A674UL))
#define bM4_USH_HCTSIZ1_PID1                            *((volatile unsigned int*)(0x4300A678UL))
#define bM4_USH_HCTSIZ1_DOPNG                           *((volatile unsigned int*)(0x4300A67CUL))
#define bM4_USH_HCCHAR2_MPS0                            *((volatile unsigned int*)(0x4300A800UL))
#define bM4_USH_HCCHAR2_MPS1                            *((volatile unsigned int*)(0x4300A804UL))
#define bM4_USH_HCCHAR2_MPS2                            *((volatile unsigned int*)(0x4300A808UL))
#define bM4_USH_HCCHAR2_MPS3                            *((volatile unsigned int*)(0x4300A80CUL))
#define bM4_USH_HCCHAR2_MPS4                            *((volatile unsigned int*)(0x4300A810UL))
#define bM4_USH_HCCHAR2_MPS5                            *((volatile unsigned int*)(0x4300A814UL))
#define bM4_USH_HCCHAR2_MPS6                            *((volatile unsigned int*)(0x4300A818UL))
#define bM4_USH_HCCHAR2_MPS7                            *((volatile unsigned int*)(0x4300A81CUL))
#define bM4_USH_HCCHAR2_MPS8                            *((volatile unsigned int*)(0x4300A820UL))
#define bM4_USH_HCCHAR2_MPS9                            *((volatile unsigned int*)(0x4300A824UL))
#define bM4_USH_HCCHAR2_MPS10                           *((volatile unsigned int*)(0x4300A828UL))
#define bM4_USH_HCCHAR2_EPNUM0                          *((volatile unsigned int*)(0x4300A82CUL))
#define bM4_USH_HCCHAR2_EPNUM1                          *((volatile unsigned int*)(0x4300A830UL))
#define bM4_USH_HCCHAR2_EPNUM2                          *((volatile unsigned int*)(0x4300A834UL))
#define bM4_USH_HCCHAR2_EPNUM3                          *((volatile unsigned int*)(0x4300A838UL))
#define bM4_USH_HCCHAR2_EPDIR                           *((volatile unsigned int*)(0x4300A83CUL))
#define bM4_USH_HCCHAR2_LSPDDEV                         *((volatile unsigned int*)(0x4300A844UL))
#define bM4_USH_HCCHAR2_EPTYPE0                         *((volatile unsigned int*)(0x4300A848UL))
#define bM4_USH_HCCHAR2_EPTYPE1                         *((volatile unsigned int*)(0x4300A84CUL))
#define bM4_USH_HCCHAR2_EC0                             *((volatile unsigned int*)(0x4300A850UL))
#define bM4_USH_HCCHAR2_EC1                             *((volatile unsigned int*)(0x4300A854UL))
#define bM4_USH_HCCHAR2_DEVADDR0                        *((volatile unsigned int*)(0x4300A858UL))
#define bM4_USH_HCCHAR2_DEVADDR1                        *((volatile unsigned int*)(0x4300A85CUL))
#define bM4_USH_HCCHAR2_DEVADDR2                        *((volatile unsigned int*)(0x4300A860UL))
#define bM4_USH_HCCHAR2_DEVADDR3                        *((volatile unsigned int*)(0x4300A864UL))
#define bM4_USH_HCCHAR2_DEVADDR4                        *((volatile unsigned int*)(0x4300A868UL))
#define bM4_USH_HCCHAR2_DEVADDR5                        *((volatile unsigned int*)(0x4300A86CUL))
#define bM4_USH_HCCHAR2_DEVADDR6                        *((volatile unsigned int*)(0x4300A870UL))
#define bM4_USH_HCCHAR2_ODDFRM                          *((volatile unsigned int*)(0x4300A874UL))
#define bM4_USH_HCCHAR2_CHDIS                           *((volatile unsigned int*)(0x4300A878UL))
#define bM4_USH_HCCHAR2_CHENA                           *((volatile unsigned int*)(0x4300A87CUL))
#define bM4_USH_HCSPLT2_PRTADDR0                        *((volatile unsigned int*)(0x4300A880UL))
#define bM4_USH_HCSPLT2_PRTADDR1                        *((volatile unsigned int*)(0x4300A884UL))
#define bM4_USH_HCSPLT2_PRTADDR2                        *((volatile unsigned int*)(0x4300A888UL))
#define bM4_USH_HCSPLT2_PRTADDR3                        *((volatile unsigned int*)(0x4300A88CUL))
#define bM4_USH_HCSPLT2_PRTADDR4                        *((volatile unsigned int*)(0x4300A890UL))
#define bM4_USH_HCSPLT2_PRTADDR5                        *((volatile unsigned int*)(0x4300A894UL))
#define bM4_USH_HCSPLT2_PRTADDR6                        *((volatile unsigned int*)(0x4300A898UL))
#define bM4_USH_HCSPLT2_HUBADDR0                        *((volatile unsigned int*)(0x4300A89CUL))
#define bM4_USH_HCSPLT2_HUBADDR1                        *((volatile unsigned int*)(0x4300A8A0UL))
#define bM4_USH_HCSPLT2_HUBADDR2                        *((volatile unsigned int*)(0x4300A8A4UL))
#define bM4_USH_HCSPLT2_HUBADDR3                        *((volatile unsigned int*)(0x4300A8A8UL))
#define bM4_USH_HCSPLT2_HUBADDR4                        *((volatile unsigned int*)(0x4300A8ACUL))
#define bM4_USH_HCSPLT2_HUBADDR5                        *((volatile unsigned int*)(0x4300A8B0UL))
#define bM4_USH_HCSPLT2_HUBADDR6                        *((volatile unsigned int*)(0x4300A8B4UL))
#define bM4_USH_HCSPLT2_XACTPOS0                        *((volatile unsigned int*)(0x4300A8B8UL))
#define bM4_USH_HCSPLT2_XACTPOS1                        *((volatile unsigned int*)(0x4300A8BCUL))
#define bM4_USH_HCSPLT2_COMPSPLT                        *((volatile unsigned int*)(0x4300A8C0UL))
#define bM4_USH_HCSPLT2_SPLTENA                         *((volatile unsigned int*)(0x4300A8FCUL))
#define bM4_USH_HCINT2_XFERCOMPL                        *((volatile unsigned int*)(0x4300A900UL))
#define bM4_USH_HCINT2_CHHLTD                           *((volatile unsigned int*)(0x4300A904UL))
#define bM4_USH_HCINT2_AHBERR                           *((volatile unsigned int*)(0x4300A908UL))
#define bM4_USH_HCINT2_STALL                            *((volatile unsigned int*)(0x4300A90CUL))
#define bM4_USH_HCINT2_NAK                              *((volatile unsigned int*)(0x4300A910UL))
#define bM4_USH_HCINT2_ACK                              *((volatile unsigned int*)(0x4300A914UL))
#define bM4_USH_HCINT2_NYET                             *((volatile unsigned int*)(0x4300A918UL))
#define bM4_USH_HCINT2_XACTERR                          *((volatile unsigned int*)(0x4300A91CUL))
#define bM4_USH_HCINT2_BBLERR                           *((volatile unsigned int*)(0x4300A920UL))
#define bM4_USH_HCINT2_FRMOVRUN                         *((volatile unsigned int*)(0x4300A924UL))
#define bM4_USH_HCINT2_DATATGLERR                       *((volatile unsigned int*)(0x4300A928UL))
#define bM4_USH_HCINTMSK2_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4300A980UL))
#define bM4_USH_HCINTMSK2_CHHLTDMSK                     *((volatile unsigned int*)(0x4300A984UL))
#define bM4_USH_HCINTMSK2_AHBERRMSK                     *((volatile unsigned int*)(0x4300A988UL))
#define bM4_USH_HCINTMSK2_STALLMSK                      *((volatile unsigned int*)(0x4300A98CUL))
#define bM4_USH_HCINTMSK2_NAKMSK                        *((volatile unsigned int*)(0x4300A990UL))
#define bM4_USH_HCINTMSK2_ACKMSK                        *((volatile unsigned int*)(0x4300A994UL))
#define bM4_USH_HCINTMSK2_NYETMSK                       *((volatile unsigned int*)(0x4300A998UL))
#define bM4_USH_HCINTMSK2_XACTERRMSK                    *((volatile unsigned int*)(0x4300A99CUL))
#define bM4_USH_HCINTMSK2_BBLERRMSK                     *((volatile unsigned int*)(0x4300A9A0UL))
#define bM4_USH_HCINTMSK2_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4300A9A4UL))
#define bM4_USH_HCINTMSK2_DATATGLERRMSK                 *((volatile unsigned int*)(0x4300A9A8UL))
#define bM4_USH_HCTSIZ2_XFERSIZE0                       *((volatile unsigned int*)(0x4300AA00UL))
#define bM4_USH_HCTSIZ2_XFERSIZE1                       *((volatile unsigned int*)(0x4300AA04UL))
#define bM4_USH_HCTSIZ2_XFERSIZE2                       *((volatile unsigned int*)(0x4300AA08UL))
#define bM4_USH_HCTSIZ2_XFERSIZE3                       *((volatile unsigned int*)(0x4300AA0CUL))
#define bM4_USH_HCTSIZ2_XFERSIZE4                       *((volatile unsigned int*)(0x4300AA10UL))
#define bM4_USH_HCTSIZ2_XFERSIZE5                       *((volatile unsigned int*)(0x4300AA14UL))
#define bM4_USH_HCTSIZ2_XFERSIZE6                       *((volatile unsigned int*)(0x4300AA18UL))
#define bM4_USH_HCTSIZ2_XFERSIZE7                       *((volatile unsigned int*)(0x4300AA1CUL))
#define bM4_USH_HCTSIZ2_XFERSIZE8                       *((volatile unsigned int*)(0x4300AA20UL))
#define bM4_USH_HCTSIZ2_XFERSIZE9                       *((volatile unsigned int*)(0x4300AA24UL))
#define bM4_USH_HCTSIZ2_XFERSIZE10                      *((volatile unsigned int*)(0x4300AA28UL))
#define bM4_USH_HCTSIZ2_XFERSIZE11                      *((volatile unsigned int*)(0x4300AA2CUL))
#define bM4_USH_HCTSIZ2_XFERSIZE12                      *((volatile unsigned int*)(0x4300AA30UL))
#define bM4_USH_HCTSIZ2_XFERSIZE13                      *((volatile unsigned int*)(0x4300AA34UL))
#define bM4_USH_HCTSIZ2_XFERSIZE14                      *((volatile unsigned int*)(0x4300AA38UL))
#define bM4_USH_HCTSIZ2_XFERSIZE15                      *((volatile unsigned int*)(0x4300AA3CUL))
#define bM4_USH_HCTSIZ2_XFERSIZE16                      *((volatile unsigned int*)(0x4300AA40UL))
#define bM4_USH_HCTSIZ2_XFERSIZE17                      *((volatile unsigned int*)(0x4300AA44UL))
#define bM4_USH_HCTSIZ2_XFERSIZE18                      *((volatile unsigned int*)(0x4300AA48UL))
#define bM4_USH_HCTSIZ2_PKTCNT0                         *((volatile unsigned int*)(0x4300AA4CUL))
#define bM4_USH_HCTSIZ2_PKTCNT1                         *((volatile unsigned int*)(0x4300AA50UL))
#define bM4_USH_HCTSIZ2_PKTCNT2                         *((volatile unsigned int*)(0x4300AA54UL))
#define bM4_USH_HCTSIZ2_PKTCNT3                         *((volatile unsigned int*)(0x4300AA58UL))
#define bM4_USH_HCTSIZ2_PKTCNT4                         *((volatile unsigned int*)(0x4300AA5CUL))
#define bM4_USH_HCTSIZ2_PKTCNT5                         *((volatile unsigned int*)(0x4300AA60UL))
#define bM4_USH_HCTSIZ2_PKTCNT6                         *((volatile unsigned int*)(0x4300AA64UL))
#define bM4_USH_HCTSIZ2_PKTCNT7                         *((volatile unsigned int*)(0x4300AA68UL))
#define bM4_USH_HCTSIZ2_PKTCNT8                         *((volatile unsigned int*)(0x4300AA6CUL))
#define bM4_USH_HCTSIZ2_PKTCNT9                         *((volatile unsigned int*)(0x4300AA70UL))
#define bM4_USH_HCTSIZ2_PID0                            *((volatile unsigned int*)(0x4300AA74UL))
#define bM4_USH_HCTSIZ2_PID1                            *((volatile unsigned int*)(0x4300AA78UL))
#define bM4_USH_HCTSIZ2_DOPNG                           *((volatile unsigned int*)(0x4300AA7CUL))
#define bM4_USH_HCCHAR3_MPS0                            *((volatile unsigned int*)(0x4300AC00UL))
#define bM4_USH_HCCHAR3_MPS1                            *((volatile unsigned int*)(0x4300AC04UL))
#define bM4_USH_HCCHAR3_MPS2                            *((volatile unsigned int*)(0x4300AC08UL))
#define bM4_USH_HCCHAR3_MPS3                            *((volatile unsigned int*)(0x4300AC0CUL))
#define bM4_USH_HCCHAR3_MPS4                            *((volatile unsigned int*)(0x4300AC10UL))
#define bM4_USH_HCCHAR3_MPS5                            *((volatile unsigned int*)(0x4300AC14UL))
#define bM4_USH_HCCHAR3_MPS6                            *((volatile unsigned int*)(0x4300AC18UL))
#define bM4_USH_HCCHAR3_MPS7                            *((volatile unsigned int*)(0x4300AC1CUL))
#define bM4_USH_HCCHAR3_MPS8                            *((volatile unsigned int*)(0x4300AC20UL))
#define bM4_USH_HCCHAR3_MPS9                            *((volatile unsigned int*)(0x4300AC24UL))
#define bM4_USH_HCCHAR3_MPS10                           *((volatile unsigned int*)(0x4300AC28UL))
#define bM4_USH_HCCHAR3_EPNUM0                          *((volatile unsigned int*)(0x4300AC2CUL))
#define bM4_USH_HCCHAR3_EPNUM1                          *((volatile unsigned int*)(0x4300AC30UL))
#define bM4_USH_HCCHAR3_EPNUM2                          *((volatile unsigned int*)(0x4300AC34UL))
#define bM4_USH_HCCHAR3_EPNUM3                          *((volatile unsigned int*)(0x4300AC38UL))
#define bM4_USH_HCCHAR3_EPDIR                           *((volatile unsigned int*)(0x4300AC3CUL))
#define bM4_USH_HCCHAR3_LSPDDEV                         *((volatile unsigned int*)(0x4300AC44UL))
#define bM4_USH_HCCHAR3_EPTYPE0                         *((volatile unsigned int*)(0x4300AC48UL))
#define bM4_USH_HCCHAR3_EPTYPE1                         *((volatile unsigned int*)(0x4300AC4CUL))
#define bM4_USH_HCCHAR3_EC0                             *((volatile unsigned int*)(0x4300AC50UL))
#define bM4_USH_HCCHAR3_EC1                             *((volatile unsigned int*)(0x4300AC54UL))
#define bM4_USH_HCCHAR3_DEVADDR0                        *((volatile unsigned int*)(0x4300AC58UL))
#define bM4_USH_HCCHAR3_DEVADDR1                        *((volatile unsigned int*)(0x4300AC5CUL))
#define bM4_USH_HCCHAR3_DEVADDR2                        *((volatile unsigned int*)(0x4300AC60UL))
#define bM4_USH_HCCHAR3_DEVADDR3                        *((volatile unsigned int*)(0x4300AC64UL))
#define bM4_USH_HCCHAR3_DEVADDR4                        *((volatile unsigned int*)(0x4300AC68UL))
#define bM4_USH_HCCHAR3_DEVADDR5                        *((volatile unsigned int*)(0x4300AC6CUL))
#define bM4_USH_HCCHAR3_DEVADDR6                        *((volatile unsigned int*)(0x4300AC70UL))
#define bM4_USH_HCCHAR3_ODDFRM                          *((volatile unsigned int*)(0x4300AC74UL))
#define bM4_USH_HCCHAR3_CHDIS                           *((volatile unsigned int*)(0x4300AC78UL))
#define bM4_USH_HCCHAR3_CHENA                           *((volatile unsigned int*)(0x4300AC7CUL))
#define bM4_USH_HCSPLT3_PRTADDR0                        *((volatile unsigned int*)(0x4300AC80UL))
#define bM4_USH_HCSPLT3_PRTADDR1                        *((volatile unsigned int*)(0x4300AC84UL))
#define bM4_USH_HCSPLT3_PRTADDR2                        *((volatile unsigned int*)(0x4300AC88UL))
#define bM4_USH_HCSPLT3_PRTADDR3                        *((volatile unsigned int*)(0x4300AC8CUL))
#define bM4_USH_HCSPLT3_PRTADDR4                        *((volatile unsigned int*)(0x4300AC90UL))
#define bM4_USH_HCSPLT3_PRTADDR5                        *((volatile unsigned int*)(0x4300AC94UL))
#define bM4_USH_HCSPLT3_PRTADDR6                        *((volatile unsigned int*)(0x4300AC98UL))
#define bM4_USH_HCSPLT3_HUBADDR0                        *((volatile unsigned int*)(0x4300AC9CUL))
#define bM4_USH_HCSPLT3_HUBADDR1                        *((volatile unsigned int*)(0x4300ACA0UL))
#define bM4_USH_HCSPLT3_HUBADDR2                        *((volatile unsigned int*)(0x4300ACA4UL))
#define bM4_USH_HCSPLT3_HUBADDR3                        *((volatile unsigned int*)(0x4300ACA8UL))
#define bM4_USH_HCSPLT3_HUBADDR4                        *((volatile unsigned int*)(0x4300ACACUL))
#define bM4_USH_HCSPLT3_HUBADDR5                        *((volatile unsigned int*)(0x4300ACB0UL))
#define bM4_USH_HCSPLT3_HUBADDR6                        *((volatile unsigned int*)(0x4300ACB4UL))
#define bM4_USH_HCSPLT3_XACTPOS0                        *((volatile unsigned int*)(0x4300ACB8UL))
#define bM4_USH_HCSPLT3_XACTPOS1                        *((volatile unsigned int*)(0x4300ACBCUL))
#define bM4_USH_HCSPLT3_COMPSPLT                        *((volatile unsigned int*)(0x4300ACC0UL))
#define bM4_USH_HCSPLT3_SPLTENA                         *((volatile unsigned int*)(0x4300ACFCUL))
#define bM4_USH_HCINT3_XFERCOMPL                        *((volatile unsigned int*)(0x4300AD00UL))
#define bM4_USH_HCINT3_CHHLTD                           *((volatile unsigned int*)(0x4300AD04UL))
#define bM4_USH_HCINT3_AHBERR                           *((volatile unsigned int*)(0x4300AD08UL))
#define bM4_USH_HCINT3_STALL                            *((volatile unsigned int*)(0x4300AD0CUL))
#define bM4_USH_HCINT3_NAK                              *((volatile unsigned int*)(0x4300AD10UL))
#define bM4_USH_HCINT3_ACK                              *((volatile unsigned int*)(0x4300AD14UL))
#define bM4_USH_HCINT3_NYET                             *((volatile unsigned int*)(0x4300AD18UL))
#define bM4_USH_HCINT3_XACTERR                          *((volatile unsigned int*)(0x4300AD1CUL))
#define bM4_USH_HCINT3_BBLERR                           *((volatile unsigned int*)(0x4300AD20UL))
#define bM4_USH_HCINT3_FRMOVRUN                         *((volatile unsigned int*)(0x4300AD24UL))
#define bM4_USH_HCINT3_DATATGLERR                       *((volatile unsigned int*)(0x4300AD28UL))
#define bM4_USH_HCINTMSK3_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4300AD80UL))
#define bM4_USH_HCINTMSK3_CHHLTDMSK                     *((volatile unsigned int*)(0x4300AD84UL))
#define bM4_USH_HCINTMSK3_AHBERRMSK                     *((volatile unsigned int*)(0x4300AD88UL))
#define bM4_USH_HCINTMSK3_STALLMSK                      *((volatile unsigned int*)(0x4300AD8CUL))
#define bM4_USH_HCINTMSK3_NAKMSK                        *((volatile unsigned int*)(0x4300AD90UL))
#define bM4_USH_HCINTMSK3_ACKMSK                        *((volatile unsigned int*)(0x4300AD94UL))
#define bM4_USH_HCINTMSK3_NYETMSK                       *((volatile unsigned int*)(0x4300AD98UL))
#define bM4_USH_HCINTMSK3_XACTERRMSK                    *((volatile unsigned int*)(0x4300AD9CUL))
#define bM4_USH_HCINTMSK3_BBLERRMSK                     *((volatile unsigned int*)(0x4300ADA0UL))
#define bM4_USH_HCINTMSK3_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4300ADA4UL))
#define bM4_USH_HCINTMSK3_DATATGLERRMSK                 *((volatile unsigned int*)(0x4300ADA8UL))
#define bM4_USH_HCTSIZ3_XFERSIZE0                       *((volatile unsigned int*)(0x4300AE00UL))
#define bM4_USH_HCTSIZ3_XFERSIZE1                       *((volatile unsigned int*)(0x4300AE04UL))
#define bM4_USH_HCTSIZ3_XFERSIZE2                       *((volatile unsigned int*)(0x4300AE08UL))
#define bM4_USH_HCTSIZ3_XFERSIZE3                       *((volatile unsigned int*)(0x4300AE0CUL))
#define bM4_USH_HCTSIZ3_XFERSIZE4                       *((volatile unsigned int*)(0x4300AE10UL))
#define bM4_USH_HCTSIZ3_XFERSIZE5                       *((volatile unsigned int*)(0x4300AE14UL))
#define bM4_USH_HCTSIZ3_XFERSIZE6                       *((volatile unsigned int*)(0x4300AE18UL))
#define bM4_USH_HCTSIZ3_XFERSIZE7                       *((volatile unsigned int*)(0x4300AE1CUL))
#define bM4_USH_HCTSIZ3_XFERSIZE8                       *((volatile unsigned int*)(0x4300AE20UL))
#define bM4_USH_HCTSIZ3_XFERSIZE9                       *((volatile unsigned int*)(0x4300AE24UL))
#define bM4_USH_HCTSIZ3_XFERSIZE10                      *((volatile unsigned int*)(0x4300AE28UL))
#define bM4_USH_HCTSIZ3_XFERSIZE11                      *((volatile unsigned int*)(0x4300AE2CUL))
#define bM4_USH_HCTSIZ3_XFERSIZE12                      *((volatile unsigned int*)(0x4300AE30UL))
#define bM4_USH_HCTSIZ3_XFERSIZE13                      *((volatile unsigned int*)(0x4300AE34UL))
#define bM4_USH_HCTSIZ3_XFERSIZE14                      *((volatile unsigned int*)(0x4300AE38UL))
#define bM4_USH_HCTSIZ3_XFERSIZE15                      *((volatile unsigned int*)(0x4300AE3CUL))
