RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_HCTSIZ3_XFERSIZE16                      *((volatile unsigned int*)(0x4300AE40UL))
#define bM4_USH_HCTSIZ3_XFERSIZE17                      *((volatile unsigned int*)(0x4300AE44UL))
#define bM4_USH_HCTSIZ3_XFERSIZE18                      *((volatile unsigned int*)(0x4300AE48UL))
#define bM4_USH_HCTSIZ3_PKTCNT0                         *((volatile unsigned int*)(0x4300AE4CUL))
#define bM4_USH_HCTSIZ3_PKTCNT1                         *((volatile unsigned int*)(0x4300AE50UL))
#define bM4_USH_HCTSIZ3_PKTCNT2                         *((volatile unsigned int*)(0x4300AE54UL))
#define bM4_USH_HCTSIZ3_PKTCNT3                         *((volatile unsigned int*)(0x4300AE58UL))
#define bM4_USH_HCTSIZ3_PKTCNT4                         *((volatile unsigned int*)(0x4300AE5CUL))
#define bM4_USH_HCTSIZ3_PKTCNT5                         *((volatile unsigned int*)(0x4300AE60UL))
#define bM4_USH_HCTSIZ3_PKTCNT6                         *((volatile unsigned int*)(0x4300AE64UL))
#define bM4_USH_HCTSIZ3_PKTCNT7                         *((volatile unsigned int*)(0x4300AE68UL))
#define bM4_USH_HCTSIZ3_PKTCNT8                         *((volatile unsigned int*)(0x4300AE6CUL))
#define bM4_USH_HCTSIZ3_PKTCNT9                         *((volatile unsigned int*)(0x4300AE70UL))
#define bM4_USH_HCTSIZ3_PID0                            *((volatile unsigned int*)(0x4300AE74UL))
#define bM4_USH_HCTSIZ3_PID1                            *((volatile unsigned int*)(0x4300AE78UL))
#define bM4_USH_HCTSIZ3_DOPNG                           *((volatile unsigned int*)(0x4300AE7CUL))
#define bM4_USH_HCCHAR4_MPS0                            *((volatile unsigned int*)(0x4300B000UL))
#define bM4_USH_HCCHAR4_MPS1                            *((volatile unsigned int*)(0x4300B004UL))
#define bM4_USH_HCCHAR4_MPS2                            *((volatile unsigned int*)(0x4300B008UL))
#define bM4_USH_HCCHAR4_MPS3                            *((volatile unsigned int*)(0x4300B00CUL))
#define bM4_USH_HCCHAR4_MPS4                            *((volatile unsigned int*)(0x4300B010UL))
#define bM4_USH_HCCHAR4_MPS5                            *((volatile unsigned int*)(0x4300B014UL))
#define bM4_USH_HCCHAR4_MPS6                            *((volatile unsigned int*)(0x4300B018UL))
#define bM4_USH_HCCHAR4_MPS7                            *((volatile unsigned int*)(0x4300B01CUL))
#define bM4_USH_HCCHAR4_MPS8                            *((volatile unsigned int*)(0x4300B020UL))
#define bM4_USH_HCCHAR4_MPS9                            *((volatile unsigned int*)(0x4300B024UL))
#define bM4_USH_HCCHAR4_MPS10                           *((volatile unsigned int*)(0x4300B028UL))
#define bM4_USH_HCCHAR4_EPNUM0                          *((volatile unsigned int*)(0x4300B02CUL))
#define bM4_USH_HCCHAR4_EPNUM1                          *((volatile unsigned int*)(0x4300B030UL))
#define bM4_USH_HCCHAR4_EPNUM2                          *((volatile unsigned int*)(0x4300B034UL))
#define bM4_USH_HCCHAR4_EPNUM3                          *((volatile unsigned int*)(0x4300B038UL))
#define bM4_USH_HCCHAR4_EPDIR                           *((volatile unsigned int*)(0x4300B03CUL))
#define bM4_USH_HCCHAR4_LSPDDEV                         *((volatile unsigned int*)(0x4300B044UL))
#define bM4_USH_HCCHAR4_EPTYPE0                         *((volatile unsigned int*)(0x4300B048UL))
#define bM4_USH_HCCHAR4_EPTYPE1                         *((volatile unsigned int*)(0x4300B04CUL))
#define bM4_USH_HCCHAR4_EC0                             *((volatile unsigned int*)(0x4300B050UL))
#define bM4_USH_HCCHAR4_EC1                             *((volatile unsigned int*)(0x4300B054UL))
#define bM4_USH_HCCHAR4_DEVADDR0                        *((volatile unsigned int*)(0x4300B058UL))
#define bM4_USH_HCCHAR4_DEVADDR1                        *((volatile unsigned int*)(0x4300B05CUL))
#define bM4_USH_HCCHAR4_DEVADDR2                        *((volatile unsigned int*)(0x4300B060UL))
#define bM4_USH_HCCHAR4_DEVADDR3                        *((volatile unsigned int*)(0x4300B064UL))
#define bM4_USH_HCCHAR4_DEVADDR4                        *((volatile unsigned int*)(0x4300B068UL))
#define bM4_USH_HCCHAR4_DEVADDR5                        *((volatile unsigned int*)(0x4300B06CUL))
#define bM4_USH_HCCHAR4_DEVADDR6                        *((volatile unsigned int*)(0x4300B070UL))
#define bM4_USH_HCCHAR4_ODDFRM                          *((volatile unsigned int*)(0x4300B074UL))
#define bM4_USH_HCCHAR4_CHDIS                           *((volatile unsigned int*)(0x4300B078UL))
#define bM4_USH_HCCHAR4_CHENA                           *((volatile unsigned int*)(0x4300B07CUL))
#define bM4_USH_HCSPLT4_PRTADDR0                        *((volatile unsigned int*)(0x4300B080UL))
#define bM4_USH_HCSPLT4_PRTADDR1                        *((volatile unsigned int*)(0x4300B084UL))
#define bM4_USH_HCSPLT4_PRTADDR2                        *((volatile unsigned int*)(0x4300B088UL))
#define bM4_USH_HCSPLT4_PRTADDR3                        *((volatile unsigned int*)(0x4300B08CUL))
#define bM4_USH_HCSPLT4_PRTADDR4                        *((volatile unsigned int*)(0x4300B090UL))
#define bM4_USH_HCSPLT4_PRTADDR5                        *((volatile unsigned int*)(0x4300B094UL))
#define bM4_USH_HCSPLT4_PRTADDR6                        *((volatile unsigned int*)(0x4300B098UL))
#define bM4_USH_HCSPLT4_HUBADDR0                        *((volatile unsigned int*)(0x4300B09CUL))
#define bM4_USH_HCSPLT4_HUBADDR1                        *((volatile unsigned int*)(0x4300B0A0UL))
#define bM4_USH_HCSPLT4_HUBADDR2                        *((volatile unsigned int*)(0x4300B0A4UL))
#define bM4_USH_HCSPLT4_HUBADDR3                        *((volatile unsigned int*)(0x4300B0A8UL))
#define bM4_USH_HCSPLT4_HUBADDR4                        *((volatile unsigned int*)(0x4300B0ACUL))
#define bM4_USH_HCSPLT4_HUBADDR5                        *((volatile unsigned int*)(0x4300B0B0UL))
#define bM4_USH_HCSPLT4_HUBADDR6                        *((volatile unsigned int*)(0x4300B0B4UL))
#define bM4_USH_HCSPLT4_XACTPOS0                        *((volatile unsigned int*)(0x4300B0B8UL))
#define bM4_USH_HCSPLT4_XACTPOS1                        *((volatile unsigned int*)(0x4300B0BCUL))
#define bM4_USH_HCSPLT4_COMPSPLT                        *((volatile unsigned int*)(0x4300B0C0UL))
#define bM4_USH_HCSPLT4_SPLTENA                         *((volatile unsigned int*)(0x4300B0FCUL))
#define bM4_USH_HCINT4_XFERCOMPL                        *((volatile unsigned int*)(0x4300B100UL))
#define bM4_USH_HCINT4_CHHLTD                           *((volatile unsigned int*)(0x4300B104UL))
#define bM4_USH_HCINT4_AHBERR                           *((volatile unsigned int*)(0x4300B108UL))
#define bM4_USH_HCINT4_STALL                            *((volatile unsigned int*)(0x4300B10CUL))
#define bM4_USH_HCINT4_NAK                              *((volatile unsigned int*)(0x4300B110UL))
#define bM4_USH_HCINT4_ACK                              *((volatile unsigned int*)(0x4300B114UL))
#define bM4_USH_HCINT4_NYET                             *((volatile unsigned int*)(0x4300B118UL))
#define bM4_USH_HCINT4_XACTERR                          *((volatile unsigned int*)(0x4300B11CUL))
#define bM4_USH_HCINT4_BBLERR                           *((volatile unsigned int*)(0x4300B120UL))
#define bM4_USH_HCINT4_FRMOVRUN                         *((volatile unsigned int*)(0x4300B124UL))
#define bM4_USH_HCINT4_DATATGLERR                       *((volatile unsigned int*)(0x4300B128UL))
#define bM4_USH_HCINTMSK4_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4300B180UL))
#define bM4_USH_HCINTMSK4_CHHLTDMSK                     *((volatile unsigned int*)(0x4300B184UL))
#define bM4_USH_HCINTMSK4_AHBERRMSK                     *((volatile unsigned int*)(0x4300B188UL))
#define bM4_USH_HCINTMSK4_STALLMSK                      *((volatile unsigned int*)(0x4300B18CUL))
#define bM4_USH_HCINTMSK4_NAKMSK                        *((volatile unsigned int*)(0x4300B190UL))
#define bM4_USH_HCINTMSK4_ACKMSK                        *((volatile unsigned int*)(0x4300B194UL))
#define bM4_USH_HCINTMSK4_NYETMSK                       *((volatile unsigned int*)(0x4300B198UL))
#define bM4_USH_HCINTMSK4_XACTERRMSK                    *((volatile unsigned int*)(0x4300B19CUL))
#define bM4_USH_HCINTMSK4_BBLERRMSK                     *((volatile unsigned int*)(0x4300B1A0UL))
#define bM4_USH_HCINTMSK4_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4300B1A4UL))
#define bM4_USH_HCINTMSK4_DATATGLERRMSK                 *((volatile unsigned int*)(0x4300B1A8UL))
#define bM4_USH_HCTSIZ4_XFERSIZE0                       *((volatile unsigned int*)(0x4300B200UL))
#define bM4_USH_HCTSIZ4_XFERSIZE1                       *((volatile unsigned int*)(0x4300B204UL))
#define bM4_USH_HCTSIZ4_XFERSIZE2                       *((volatile unsigned int*)(0x4300B208UL))
#define bM4_USH_HCTSIZ4_XFERSIZE3                       *((volatile unsigned int*)(0x4300B20CUL))
#define bM4_USH_HCTSIZ4_XFERSIZE4                       *((volatile unsigned int*)(0x4300B210UL))
#define bM4_USH_HCTSIZ4_XFERSIZE5                       *((volatile unsigned int*)(0x4300B214UL))
#define bM4_USH_HCTSIZ4_XFERSIZE6                       *((volatile unsigned int*)(0x4300B218UL))
#define bM4_USH_HCTSIZ4_XFERSIZE7                       *((volatile unsigned int*)(0x4300B21CUL))
#define bM4_USH_HCTSIZ4_XFERSIZE8                       *((volatile unsigned int*)(0x4300B220UL))
#define bM4_USH_HCTSIZ4_XFERSIZE9                       *((volatile unsigned int*)(0x4300B224UL))
#define bM4_USH_HCTSIZ4_XFERSIZE10                      *((volatile unsigned int*)(0x4300B228UL))
#define bM4_USH_HCTSIZ4_XFERSIZE11                      *((volatile unsigned int*)(0x4300B22CUL))
#define bM4_USH_HCTSIZ4_XFERSIZE12                      *((volatile unsigned int*)(0x4300B230UL))
#define bM4_USH_HCTSIZ4_XFERSIZE13                      *((volatile unsigned int*)(0x4300B234UL))
#define bM4_USH_HCTSIZ4_XFERSIZE14                      *((volatile unsigned int*)(0x4300B238UL))
#define bM4_USH_HCTSIZ4_XFERSIZE15                      *((volatile unsigned int*)(0x4300B23CUL))
#define bM4_USH_HCTSIZ4_XFERSIZE16                      *((volatile unsigned int*)(0x4300B240UL))
#define bM4_USH_HCTSIZ4_XFERSIZE17                      *((volatile unsigned int*)(0x4300B244UL))
#define bM4_USH_HCTSIZ4_XFERSIZE18                      *((volatile unsigned int*)(0x4300B248UL))
#define bM4_USH_HCTSIZ4_PKTCNT0                         *((volatile unsigned int*)(0x4300B24CUL))
#define bM4_USH_HCTSIZ4_PKTCNT1                         *((volatile unsigned int*)(0x4300B250UL))
#define bM4_USH_HCTSIZ4_PKTCNT2                         *((volatile unsigned int*)(0x4300B254UL))
#define bM4_USH_HCTSIZ4_PKTCNT3                         *((volatile unsigned int*)(0x4300B258UL))
#define bM4_USH_HCTSIZ4_PKTCNT4                         *((volatile unsigned int*)(0x4300B25CUL))
#define bM4_USH_HCTSIZ4_PKTCNT5                         *((volatile unsigned int*)(0x4300B260UL))
#define bM4_USH_HCTSIZ4_PKTCNT6                         *((volatile unsigned int*)(0x4300B264UL))
#define bM4_USH_HCTSIZ4_PKTCNT7                         *((volatile unsigned int*)(0x4300B268UL))
#define bM4_USH_HCTSIZ4_PKTCNT8                         *((volatile unsigned int*)(0x4300B26CUL))
#define bM4_USH_HCTSIZ4_PKTCNT9                         *((volatile unsigned int*)(0x4300B270UL))
#define bM4_USH_HCTSIZ4_PID0                            *((volatile unsigned int*)(0x4300B274UL))
#define bM4_USH_HCTSIZ4_PID1                            *((volatile unsigned int*)(0x4300B278UL))
#define bM4_USH_HCTSIZ4_DOPNG                           *((volatile unsigned int*)(0x4300B27CUL))
#define bM4_USH_HCCHAR5_MPS0                            *((volatile unsigned int*)(0x4300B400UL))
#define bM4_USH_HCCHAR5_MPS1                            *((volatile unsigned int*)(0x4300B404UL))
#define bM4_USH_HCCHAR5_MPS2                            *((volatile unsigned int*)(0x4300B408UL))
#define bM4_USH_HCCHAR5_MPS3                            *((volatile unsigned int*)(0x4300B40CUL))
#define bM4_USH_HCCHAR5_MPS4                            *((volatile unsigned int*)(0x4300B410UL))
#define bM4_USH_HCCHAR5_MPS5                            *((volatile unsigned int*)(0x4300B414UL))
#define bM4_USH_HCCHAR5_MPS6                            *((volatile unsigned int*)(0x4300B418UL))
#define bM4_USH_HCCHAR5_MPS7                            *((volatile unsigned int*)(0x4300B41CUL))
#define bM4_USH_HCCHAR5_MPS8                            *((volatile unsigned int*)(0x4300B420UL))
#define bM4_USH_HCCHAR5_MPS9                            *((volatile unsigned int*)(0x4300B424UL))
#define bM4_USH_HCCHAR5_MPS10                           *((volatile unsigned int*)(0x4300B428UL))
#define bM4_USH_HCCHAR5_EPNUM0                          *((volatile unsigned int*)(0x4300B42CUL))
#define bM4_USH_HCCHAR5_EPNUM1                          *((volatile unsigned int*)(0x4300B430UL))
#define bM4_USH_HCCHAR5_EPNUM2                          *((volatile unsigned int*)(0x4300B434UL))
#define bM4_USH_HCCHAR5_EPNUM3                          *((volatile unsigned int*)(0x4300B438UL))
#define bM4_USH_HCCHAR5_EPDIR                           *((volatile unsigned int*)(0x4300B43CUL))
#define bM4_USH_HCCHAR5_LSPDDEV                         *((volatile unsigned int*)(0x4300B444UL))
#define bM4_USH_HCCHAR5_EPTYPE0                         *((volatile unsigned int*)(0x4300B448UL))
#define bM4_USH_HCCHAR5_EPTYPE1                         *((volatile unsigned int*)(0x4300B44CUL))
#define bM4_USH_HCCHAR5_EC0                             *((volatile unsigned int*)(0x4300B450UL))
#define bM4_USH_HCCHAR5_EC1                             *((volatile unsigned int*)(0x4300B454UL))
#define bM4_USH_HCCHAR5_DEVADDR0                        *((volatile unsigned int*)(0x4300B458UL))
#define bM4_USH_HCCHAR5_DEVADDR1                        *((volatile unsigned int*)(0x4300B45CUL))
#define bM4_USH_HCCHAR5_DEVADDR2                        *((volatile unsigned int*)(0x4300B460UL))
#define bM4_USH_HCCHAR5_DEVADDR3                        *((volatile unsigned int*)(0x4300B464UL))
#define bM4_USH_HCCHAR5_DEVADDR4                        *((volatile unsigned int*)(0x4300B468UL))
#define bM4_USH_HCCHAR5_DEVADDR5                        *((volatile unsigned int*)(0x4300B46CUL))
#define bM4_USH_HCCHAR5_DEVADDR6                        *((volatile unsigned int*)(0x4300B470UL))
#define bM4_USH_HCCHAR5_ODDFRM                          *((volatile unsigned int*)(0x4300B474UL))
#define bM4_USH_HCCHAR5_CHDIS                           *((volatile unsigned int*)(0x4300B478UL))
#define bM4_USH_HCCHAR5_CHENA                           *((volatile unsigned int*)(0x4300B47CUL))
#define bM4_USH_HCSPLT5_PRTADDR0                        *((volatile unsigned int*)(0x4300B480UL))
#define bM4_USH_HCSPLT5_PRTADDR1                        *((volatile unsigned int*)(0x4300B484UL))
#define bM4_USH_HCSPLT5_PRTADDR2                        *((volatile unsigned int*)(0x4300B488UL))
#define bM4_USH_HCSPLT5_PRTADDR3                        *((volatile unsigned int*)(0x4300B48CUL))
#define bM4_USH_HCSPLT5_PRTADDR4                        *((volatile unsigned int*)(0x4300B490UL))
#define bM4_USH_HCSPLT5_PRTADDR5                        *((volatile unsigned int*)(0x4300B494UL))
#define bM4_USH_HCSPLT5_PRTADDR6                        *((volatile unsigned int*)(0x4300B498UL))
#define bM4_USH_HCSPLT5_HUBADDR0                        *((volatile unsigned int*)(0x4300B49CUL))
#define bM4_USH_HCSPLT5_HUBADDR1                        *((volatile unsigned int*)(0x4300B4A0UL))
#define bM4_USH_HCSPLT5_HUBADDR2                        *((volatile unsigned int*)(0x4300B4A4UL))
#define bM4_USH_HCSPLT5_HUBADDR3                        *((volatile unsigned int*)(0x4300B4A8UL))
#define bM4_USH_HCSPLT5_HUBADDR4                        *((volatile unsigned int*)(0x4300B4ACUL))
#define bM4_USH_HCSPLT5_HUBADDR5                        *((volatile unsigned int*)(0x4300B4B0UL))
#define bM4_USH_HCSPLT5_HUBADDR6                        *((volatile unsigned int*)(0x4300B4B4UL))
#define bM4_USH_HCSPLT5_XACTPOS0                        *((volatile unsigned int*)(0x4300B4B8UL))
#define bM4_USH_HCSPLT5_XACTPOS1                        *((volatile unsigned int*)(0x4300B4BCUL))
#define bM4_USH_HCSPLT5_COMPSPLT                        *((volatile unsigned int*)(0x4300B4C0UL))
#define bM4_USH_HCSPLT5_SPLTENA                         *((volatile unsigned int*)(0x4300B4FCUL))
#define bM4_USH_HCINT5_XFERCOMPL                        *((volatile unsigned int*)(0x4300B500UL))
#define bM4_USH_HCINT5_CHHLTD                           *((volatile unsigned int*)(0x4300B504UL))
#define bM4_USH_HCINT5_AHBERR                           *((volatile unsigned int*)(0x4300B508UL))
#define bM4_USH_HCINT5_STALL                            *((volatile unsigned int*)(0x4300B50CUL))
#define bM4_USH_HCINT5_NAK                              *((volatile unsigned int*)(0x4300B510UL))
#define bM4_USH_HCINT5_ACK                              *((volatile unsigned int*)(0x4300B514UL))
#define bM4_USH_HCINT5_NYET                             *((volatile unsigned int*)(0x4300B518UL))
#define bM4_USH_HCINT5_XACTERR                          *((volatile unsigned int*)(0x4300B51CUL))
#define bM4_USH_HCINT5_BBLERR                           *((volatile unsigned int*)(0x4300B520UL))
#define bM4_USH_HCINT5_FRMOVRUN                         *((volatile unsigned int*)(0x4300B524UL))
#define bM4_USH_HCINT5_DATATGLERR                       *((volatile unsigned int*)(0x4300B528UL))
#define bM4_USH_HCINTMSK5_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4300B580UL))
#define bM4_USH_HCINTMSK5_CHHLTDMSK                     *((volatile unsigned int*)(0x4300B584UL))
#define bM4_USH_HCINTMSK5_AHBERRMSK                     *((volatile unsigned int*)(0x4300B588UL))
#define bM4_USH_HCINTMSK5_STALLMSK                      *((volatile unsigned int*)(0x4300B58CUL))
#define bM4_USH_HCINTMSK5_NAKMSK                        *((volatile unsigned int*)(0x4300B590UL))
#define bM4_USH_HCINTMSK5_ACKMSK                        *((volatile unsigned int*)(0x4300B594UL))
#define bM4_USH_HCINTMSK5_NYETMSK                       *((volatile unsigned int*)(0x4300B598UL))
#define bM4_USH_HCINTMSK5_XACTERRMSK                    *((volatile unsigned int*)(0x4300B59CUL))
#define bM4_USH_HCINTMSK5_BBLERRMSK                     *((volatile unsigned int*)(0x4300B5A0UL))
#define bM4_USH_HCINTMSK5_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4300B5A4UL))
#define bM4_USH_HCINTMSK5_DATATGLERRMSK                 *((volatile unsigned int*)(0x4300B5A8UL))
#define bM4_USH_HCTSIZ5_XFERSIZE0                       *((volatile unsigned int*)(0x4300B600UL))
#define bM4_USH_HCTSIZ5_XFERSIZE1                       *((volatile unsigned int*)(0x4300B604UL))
#define bM4_USH_HCTSIZ5_XFERSIZE2                       *((volatile unsigned int*)(0x4300B608UL))
#define bM4_USH_HCTSIZ5_XFERSIZE3                       *((volatile unsigned int*)(0x4300B60CUL))
#define bM4_USH_HCTSIZ5_XFERSIZE4                       *((volatile unsigned int*)(0x4300B610UL))
#define bM4_USH_HCTSIZ5_XFERSIZE5                       *((volatile unsigned int*)(0x4300B614UL))
#define bM4_USH_HCTSIZ5_XFERSIZE6                       *((volatile unsigned int*)(0x4300B618UL))
#define bM4_USH_HCTSIZ5_XFERSIZE7                       *((volatile unsigned int*)(0x4300B61CUL))
#define bM4_USH_HCTSIZ5_XFERSIZE8                       *((volatile unsigned int*)(0x4300B620UL))
#define bM4_USH_HCTSIZ5_XFERSIZE9                       *((volatile unsigned int*)(0x4300B624UL))
#define bM4_USH_HCTSIZ5_XFERSIZE10                      *((volatile unsigned int*)(0x4300B628UL))
#define bM4_USH_HCTSIZ5_XFERSIZE11                      *((volatile unsigned int*)(0x4300B62CUL))
#define bM4_USH_HCTSIZ5_XFERSIZE12                      *((volatile unsigned int*)(0x4300B630UL))
#define bM4_USH_HCTSIZ5_XFERSIZE13                      *((volatile unsigned int*)(0x4300B634UL))
#define bM4_USH_HCTSIZ5_XFERSIZE14                      *((volatile unsigned int*)(0x4300B638UL))
#define bM4_USH_HCTSIZ5_XFERSIZE15                      *((volatile unsigned int*)(0x4300B63CUL))
#define bM4_USH_HCTSIZ5_XFERSIZE16                      *((volatile unsigned int*)(0x4300B640UL))
#define bM4_USH_HCTSIZ5_XFERSIZE17                      *((volatile unsigned int*)(0x4300B644UL))
#define bM4_USH_HCTSIZ5_XFERSIZE18                      *((volatile unsigned int*)(0x4300B648UL))
#define bM4_USH_HCTSIZ5_PKTCNT0                         *((volatile unsigned int*)(0x4300B64CUL))
#define bM4_USH_HCTSIZ5_PKTCNT1                         *((volatile unsigned int*)(0x4300B650UL))
#define bM4_USH_HCTSIZ5_PKTCNT2                         *((volatile unsigned int*)(0x4300B654UL))
#define bM4_USH_HCTSIZ5_PKTCNT3                         *((volatile unsigned int*)(0x4300B658UL))
#define bM4_USH_HCTSIZ5_PKTCNT4                         *((volatile unsigned int*)(0x4300B65CUL))
#define bM4_USH_HCTSIZ5_PKTCNT5                         *((volatile unsigned int*)(0x4300B660UL))
#define bM4_USH_HCTSIZ5_PKTCNT6                         *((volatile unsigned int*)(0x4300B664UL))
#define bM4_USH_HCTSIZ5_PKTCNT7                         *((volatile unsigned int*)(0x4300B668UL))
#define bM4_USH_HCTSIZ5_PKTCNT8                         *((volatile unsigned int*)(0x4300B66CUL))
#define bM4_USH_HCTSIZ5_PKTCNT9                         *((volatile unsigned int*)(0x4300B670UL))
#define bM4_USH_HCTSIZ5_PID0                            *((volatile unsigned int*)(0x4300B674UL))
#define bM4_USH_HCTSIZ5_PID1                            *((volatile unsigned int*)(0x4300B678UL))
#define bM4_USH_HCTSIZ5_DOPNG                           *((volatile unsigned int*)(0x4300B67CUL))
#define bM4_USH_HCCHAR6_MPS0                            *((volatile unsigned int*)(0x4300B800UL))
#define bM4_USH_HCCHAR6_MPS1                            *((volatile unsigned int*)(0x4300B804UL))
#define bM4_USH_HCCHAR6_MPS2                            *((volatile unsigned int*)(0x4300B808UL))
#define bM4_USH_HCCHAR6_MPS3                            *((volatile unsigned int*)(0x4300B80CUL))
#define bM4_USH_HCCHAR6_MPS4                            *((volatile unsigned int*)(0x4300B810UL))
#define bM4_USH_HCCHAR6_MPS5                            *((volatile unsigned int*)(0x4300B814UL))
#define bM4_USH_HCCHAR6_MPS6                            *((volatile unsigned int*)(0x4300B818UL))
#define bM4_USH_HCCHAR6_MPS7                            *((volatile unsigned int*)(0x4300B81CUL))
#define bM4_USH_HCCHAR6_MPS8                            *((volatile unsigned int*)(0x4300B820UL))
#define bM4_USH_HCCHAR6_MPS9                            *((volatile unsigned int*)(0x4300B824UL))
#define bM4_USH_HCCHAR6_MPS10                           *((volatile unsigned int*)(0x4300B828UL))
#define bM4_USH_HCCHAR6_EPNUM0                          *((volatile unsigned int*)(0x4300B82CUL))
#define bM4_USH_HCCHAR6_EPNUM1                          *((volatile unsigned int*)(0x4300B830UL))
#define bM4_USH_HCCHAR6_EPNUM2                          *((volatile unsigned int*)(0x4300B834UL))
#define bM4_USH_HCCHAR6_EPNUM3                          *((volatile unsigned int*)(0x4300B838UL))
#define bM4_USH_HCCHAR6_EPDIR                           *((volatile unsigned int*)(0x4300B83CUL))
#define bM4_USH_HCCHAR6_LSPDDEV                         *((volatile unsigned int*)(0x4300B844UL))
#define bM4_USH_HCCHAR6_EPTYPE0                         *((volatile unsigned int*)(0x4300B848UL))
#define bM4_USH_HCCHAR6_EPTYPE1                         *((volatile unsigned int*)(0x4300B84CUL))
#define bM4_USH_HCCHAR6_EC0                             *((volatile unsigned int*)(0x4300B850UL))
#define bM4_USH_HCCHAR6_EC1                             *((volatile unsigned int*)(0x4300B854UL))
#define bM4_USH_HCCHAR6_DEVADDR0                        *((volatile unsigned int*)(0x4300B858UL))
