RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_HCCHAR6_DEVADDR1                        *((volatile unsigned int*)(0x4300B85CUL))
#define bM4_USH_HCCHAR6_DEVADDR2                        *((volatile unsigned int*)(0x4300B860UL))
#define bM4_USH_HCCHAR6_DEVADDR3                        *((volatile unsigned int*)(0x4300B864UL))
#define bM4_USH_HCCHAR6_DEVADDR4                        *((volatile unsigned int*)(0x4300B868UL))
#define bM4_USH_HCCHAR6_DEVADDR5                        *((volatile unsigned int*)(0x4300B86CUL))
#define bM4_USH_HCCHAR6_DEVADDR6                        *((volatile unsigned int*)(0x4300B870UL))
#define bM4_USH_HCCHAR6_ODDFRM                          *((volatile unsigned int*)(0x4300B874UL))
#define bM4_USH_HCCHAR6_CHDIS                           *((volatile unsigned int*)(0x4300B878UL))
#define bM4_USH_HCCHAR6_CHENA                           *((volatile unsigned int*)(0x4300B87CUL))
#define bM4_USH_HCSPLT6_PRTADDR0                        *((volatile unsigned int*)(0x4300B880UL))
#define bM4_USH_HCSPLT6_PRTADDR1                        *((volatile unsigned int*)(0x4300B884UL))
#define bM4_USH_HCSPLT6_PRTADDR2                        *((volatile unsigned int*)(0x4300B888UL))
#define bM4_USH_HCSPLT6_PRTADDR3                        *((volatile unsigned int*)(0x4300B88CUL))
#define bM4_USH_HCSPLT6_PRTADDR4                        *((volatile unsigned int*)(0x4300B890UL))
#define bM4_USH_HCSPLT6_PRTADDR5                        *((volatile unsigned int*)(0x4300B894UL))
#define bM4_USH_HCSPLT6_PRTADDR6                        *((volatile unsigned int*)(0x4300B898UL))
#define bM4_USH_HCSPLT6_HUBADDR0                        *((volatile unsigned int*)(0x4300B89CUL))
#define bM4_USH_HCSPLT6_HUBADDR1                        *((volatile unsigned int*)(0x4300B8A0UL))
#define bM4_USH_HCSPLT6_HUBADDR2                        *((volatile unsigned int*)(0x4300B8A4UL))
#define bM4_USH_HCSPLT6_HUBADDR3                        *((volatile unsigned int*)(0x4300B8A8UL))
#define bM4_USH_HCSPLT6_HUBADDR4                        *((volatile unsigned int*)(0x4300B8ACUL))
#define bM4_USH_HCSPLT6_HUBADDR5                        *((volatile unsigned int*)(0x4300B8B0UL))
#define bM4_USH_HCSPLT6_HUBADDR6                        *((volatile unsigned int*)(0x4300B8B4UL))
#define bM4_USH_HCSPLT6_XACTPOS0                        *((volatile unsigned int*)(0x4300B8B8UL))
#define bM4_USH_HCSPLT6_XACTPOS1                        *((volatile unsigned int*)(0x4300B8BCUL))
#define bM4_USH_HCSPLT6_COMPSPLT                        *((volatile unsigned int*)(0x4300B8C0UL))
#define bM4_USH_HCSPLT6_SPLTENA                         *((volatile unsigned int*)(0x4300B8FCUL))
#define bM4_USH_HCINT6_XFERCOMPL                        *((volatile unsigned int*)(0x4300B900UL))
#define bM4_USH_HCINT6_CHHLTD                           *((volatile unsigned int*)(0x4300B904UL))
#define bM4_USH_HCINT6_AHBERR                           *((volatile unsigned int*)(0x4300B908UL))
#define bM4_USH_HCINT6_STALL                            *((volatile unsigned int*)(0x4300B90CUL))
#define bM4_USH_HCINT6_NAK                              *((volatile unsigned int*)(0x4300B910UL))
#define bM4_USH_HCINT6_ACK                              *((volatile unsigned int*)(0x4300B914UL))
#define bM4_USH_HCINT6_NYET                             *((volatile unsigned int*)(0x4300B918UL))
#define bM4_USH_HCINT6_XACTERR                          *((volatile unsigned int*)(0x4300B91CUL))
#define bM4_USH_HCINT6_BBLERR                           *((volatile unsigned int*)(0x4300B920UL))
#define bM4_USH_HCINT6_FRMOVRUN                         *((volatile unsigned int*)(0x4300B924UL))
#define bM4_USH_HCINT6_DATATGLERR                       *((volatile unsigned int*)(0x4300B928UL))
#define bM4_USH_HCINTMSK6_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4300B980UL))
#define bM4_USH_HCINTMSK6_CHHLTDMSK                     *((volatile unsigned int*)(0x4300B984UL))
#define bM4_USH_HCINTMSK6_AHBERRMSK                     *((volatile unsigned int*)(0x4300B988UL))
#define bM4_USH_HCINTMSK6_STALLMSK                      *((volatile unsigned int*)(0x4300B98CUL))
#define bM4_USH_HCINTMSK6_NAKMSK                        *((volatile unsigned int*)(0x4300B990UL))
#define bM4_USH_HCINTMSK6_ACKMSK                        *((volatile unsigned int*)(0x4300B994UL))
#define bM4_USH_HCINTMSK6_NYETMSK                       *((volatile unsigned int*)(0x4300B998UL))
#define bM4_USH_HCINTMSK6_XACTERRMSK                    *((volatile unsigned int*)(0x4300B99CUL))
#define bM4_USH_HCINTMSK6_BBLERRMSK                     *((volatile unsigned int*)(0x4300B9A0UL))
#define bM4_USH_HCINTMSK6_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4300B9A4UL))
#define bM4_USH_HCINTMSK6_DATATGLERRMSK                 *((volatile unsigned int*)(0x4300B9A8UL))
#define bM4_USH_HCTSIZ6_XFERSIZE0                       *((volatile unsigned int*)(0x4300BA00UL))
#define bM4_USH_HCTSIZ6_XFERSIZE1                       *((volatile unsigned int*)(0x4300BA04UL))
#define bM4_USH_HCTSIZ6_XFERSIZE2                       *((volatile unsigned int*)(0x4300BA08UL))
#define bM4_USH_HCTSIZ6_XFERSIZE3                       *((volatile unsigned int*)(0x4300BA0CUL))
#define bM4_USH_HCTSIZ6_XFERSIZE4                       *((volatile unsigned int*)(0x4300BA10UL))
#define bM4_USH_HCTSIZ6_XFERSIZE5                       *((volatile unsigned int*)(0x4300BA14UL))
#define bM4_USH_HCTSIZ6_XFERSIZE6                       *((volatile unsigned int*)(0x4300BA18UL))
#define bM4_USH_HCTSIZ6_XFERSIZE7                       *((volatile unsigned int*)(0x4300BA1CUL))
#define bM4_USH_HCTSIZ6_XFERSIZE8                       *((volatile unsigned int*)(0x4300BA20UL))
#define bM4_USH_HCTSIZ6_XFERSIZE9                       *((volatile unsigned int*)(0x4300BA24UL))
#define bM4_USH_HCTSIZ6_XFERSIZE10                      *((volatile unsigned int*)(0x4300BA28UL))
#define bM4_USH_HCTSIZ6_XFERSIZE11                      *((volatile unsigned int*)(0x4300BA2CUL))
#define bM4_USH_HCTSIZ6_XFERSIZE12                      *((volatile unsigned int*)(0x4300BA30UL))
#define bM4_USH_HCTSIZ6_XFERSIZE13                      *((volatile unsigned int*)(0x4300BA34UL))
#define bM4_USH_HCTSIZ6_XFERSIZE14                      *((volatile unsigned int*)(0x4300BA38UL))
#define bM4_USH_HCTSIZ6_XFERSIZE15                      *((volatile unsigned int*)(0x4300BA3CUL))
#define bM4_USH_HCTSIZ6_XFERSIZE16                      *((volatile unsigned int*)(0x4300BA40UL))
#define bM4_USH_HCTSIZ6_XFERSIZE17                      *((volatile unsigned int*)(0x4300BA44UL))
#define bM4_USH_HCTSIZ6_XFERSIZE18                      *((volatile unsigned int*)(0x4300BA48UL))
#define bM4_USH_HCTSIZ6_PKTCNT0                         *((volatile unsigned int*)(0x4300BA4CUL))
#define bM4_USH_HCTSIZ6_PKTCNT1                         *((volatile unsigned int*)(0x4300BA50UL))
#define bM4_USH_HCTSIZ6_PKTCNT2                         *((volatile unsigned int*)(0x4300BA54UL))
#define bM4_USH_HCTSIZ6_PKTCNT3                         *((volatile unsigned int*)(0x4300BA58UL))
#define bM4_USH_HCTSIZ6_PKTCNT4                         *((volatile unsigned int*)(0x4300BA5CUL))
#define bM4_USH_HCTSIZ6_PKTCNT5                         *((volatile unsigned int*)(0x4300BA60UL))
#define bM4_USH_HCTSIZ6_PKTCNT6                         *((volatile unsigned int*)(0x4300BA64UL))
#define bM4_USH_HCTSIZ6_PKTCNT7                         *((volatile unsigned int*)(0x4300BA68UL))
#define bM4_USH_HCTSIZ6_PKTCNT8                         *((volatile unsigned int*)(0x4300BA6CUL))
#define bM4_USH_HCTSIZ6_PKTCNT9                         *((volatile unsigned int*)(0x4300BA70UL))
#define bM4_USH_HCTSIZ6_PID0                            *((volatile unsigned int*)(0x4300BA74UL))
#define bM4_USH_HCTSIZ6_PID1                            *((volatile unsigned int*)(0x4300BA78UL))
#define bM4_USH_HCTSIZ6_DOPNG                           *((volatile unsigned int*)(0x4300BA7CUL))
#define bM4_USH_HCCHAR7_MPS0                            *((volatile unsigned int*)(0x4300BC00UL))
#define bM4_USH_HCCHAR7_MPS1                            *((volatile unsigned int*)(0x4300BC04UL))
#define bM4_USH_HCCHAR7_MPS2                            *((volatile unsigned int*)(0x4300BC08UL))
#define bM4_USH_HCCHAR7_MPS3                            *((volatile unsigned int*)(0x4300BC0CUL))
#define bM4_USH_HCCHAR7_MPS4                            *((volatile unsigned int*)(0x4300BC10UL))
#define bM4_USH_HCCHAR7_MPS5                            *((volatile unsigned int*)(0x4300BC14UL))
#define bM4_USH_HCCHAR7_MPS6                            *((volatile unsigned int*)(0x4300BC18UL))
#define bM4_USH_HCCHAR7_MPS7                            *((volatile unsigned int*)(0x4300BC1CUL))
#define bM4_USH_HCCHAR7_MPS8                            *((volatile unsigned int*)(0x4300BC20UL))
#define bM4_USH_HCCHAR7_MPS9                            *((volatile unsigned int*)(0x4300BC24UL))
#define bM4_USH_HCCHAR7_MPS10                           *((volatile unsigned int*)(0x4300BC28UL))
#define bM4_USH_HCCHAR7_EPNUM0                          *((volatile unsigned int*)(0x4300BC2CUL))
#define bM4_USH_HCCHAR7_EPNUM1                          *((volatile unsigned int*)(0x4300BC30UL))
#define bM4_USH_HCCHAR7_EPNUM2                          *((volatile unsigned int*)(0x4300BC34UL))
#define bM4_USH_HCCHAR7_EPNUM3                          *((volatile unsigned int*)(0x4300BC38UL))
#define bM4_USH_HCCHAR7_EPDIR                           *((volatile unsigned int*)(0x4300BC3CUL))
#define bM4_USH_HCCHAR7_LSPDDEV                         *((volatile unsigned int*)(0x4300BC44UL))
#define bM4_USH_HCCHAR7_EPTYPE0                         *((volatile unsigned int*)(0x4300BC48UL))
#define bM4_USH_HCCHAR7_EPTYPE1                         *((volatile unsigned int*)(0x4300BC4CUL))
#define bM4_USH_HCCHAR7_EC0                             *((volatile unsigned int*)(0x4300BC50UL))
#define bM4_USH_HCCHAR7_EC1                             *((volatile unsigned int*)(0x4300BC54UL))
#define bM4_USH_HCCHAR7_DEVADDR0                        *((volatile unsigned int*)(0x4300BC58UL))
#define bM4_USH_HCCHAR7_DEVADDR1                        *((volatile unsigned int*)(0x4300BC5CUL))
#define bM4_USH_HCCHAR7_DEVADDR2                        *((volatile unsigned int*)(0x4300BC60UL))
#define bM4_USH_HCCHAR7_DEVADDR3                        *((volatile unsigned int*)(0x4300BC64UL))
#define bM4_USH_HCCHAR7_DEVADDR4                        *((volatile unsigned int*)(0x4300BC68UL))
#define bM4_USH_HCCHAR7_DEVADDR5                        *((volatile unsigned int*)(0x4300BC6CUL))
#define bM4_USH_HCCHAR7_DEVADDR6                        *((volatile unsigned int*)(0x4300BC70UL))
#define bM4_USH_HCCHAR7_ODDFRM                          *((volatile unsigned int*)(0x4300BC74UL))
#define bM4_USH_HCCHAR7_CHDIS                           *((volatile unsigned int*)(0x4300BC78UL))
#define bM4_USH_HCCHAR7_CHENA                           *((volatile unsigned int*)(0x4300BC7CUL))
#define bM4_USH_HCSPLT7_PRTADDR0                        *((volatile unsigned int*)(0x4300BC80UL))
#define bM4_USH_HCSPLT7_PRTADDR1                        *((volatile unsigned int*)(0x4300BC84UL))
#define bM4_USH_HCSPLT7_PRTADDR2                        *((volatile unsigned int*)(0x4300BC88UL))
#define bM4_USH_HCSPLT7_PRTADDR3                        *((volatile unsigned int*)(0x4300BC8CUL))
#define bM4_USH_HCSPLT7_PRTADDR4                        *((volatile unsigned int*)(0x4300BC90UL))
#define bM4_USH_HCSPLT7_PRTADDR5                        *((volatile unsigned int*)(0x4300BC94UL))
#define bM4_USH_HCSPLT7_PRTADDR6                        *((volatile unsigned int*)(0x4300BC98UL))
#define bM4_USH_HCSPLT7_HUBADDR0                        *((volatile unsigned int*)(0x4300BC9CUL))
#define bM4_USH_HCSPLT7_HUBADDR1                        *((volatile unsigned int*)(0x4300BCA0UL))
#define bM4_USH_HCSPLT7_HUBADDR2                        *((volatile unsigned int*)(0x4300BCA4UL))
#define bM4_USH_HCSPLT7_HUBADDR3                        *((volatile unsigned int*)(0x4300BCA8UL))
#define bM4_USH_HCSPLT7_HUBADDR4                        *((volatile unsigned int*)(0x4300BCACUL))
#define bM4_USH_HCSPLT7_HUBADDR5                        *((volatile unsigned int*)(0x4300BCB0UL))
#define bM4_USH_HCSPLT7_HUBADDR6                        *((volatile unsigned int*)(0x4300BCB4UL))
#define bM4_USH_HCSPLT7_XACTPOS0                        *((volatile unsigned int*)(0x4300BCB8UL))
#define bM4_USH_HCSPLT7_XACTPOS1                        *((volatile unsigned int*)(0x4300BCBCUL))
#define bM4_USH_HCSPLT7_COMPSPLT                        *((volatile unsigned int*)(0x4300BCC0UL))
#define bM4_USH_HCSPLT7_SPLTENA                         *((volatile unsigned int*)(0x4300BCFCUL))
#define bM4_USH_HCINT7_XFERCOMPL                        *((volatile unsigned int*)(0x4300BD00UL))
#define bM4_USH_HCINT7_CHHLTD                           *((volatile unsigned int*)(0x4300BD04UL))
#define bM4_USH_HCINT7_AHBERR                           *((volatile unsigned int*)(0x4300BD08UL))
#define bM4_USH_HCINT7_STALL                            *((volatile unsigned int*)(0x4300BD0CUL))
#define bM4_USH_HCINT7_NAK                              *((volatile unsigned int*)(0x4300BD10UL))
#define bM4_USH_HCINT7_ACK                              *((volatile unsigned int*)(0x4300BD14UL))
#define bM4_USH_HCINT7_NYET                             *((volatile unsigned int*)(0x4300BD18UL))
#define bM4_USH_HCINT7_XACTERR                          *((volatile unsigned int*)(0x4300BD1CUL))
#define bM4_USH_HCINT7_BBLERR                           *((volatile unsigned int*)(0x4300BD20UL))
#define bM4_USH_HCINT7_FRMOVRUN                         *((volatile unsigned int*)(0x4300BD24UL))
#define bM4_USH_HCINT7_DATATGLERR                       *((volatile unsigned int*)(0x4300BD28UL))
#define bM4_USH_HCINTMSK7_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4300BD80UL))
#define bM4_USH_HCINTMSK7_CHHLTDMSK                     *((volatile unsigned int*)(0x4300BD84UL))
#define bM4_USH_HCINTMSK7_AHBERRMSK                     *((volatile unsigned int*)(0x4300BD88UL))
#define bM4_USH_HCINTMSK7_STALLMSK                      *((volatile unsigned int*)(0x4300BD8CUL))
#define bM4_USH_HCINTMSK7_NAKMSK                        *((volatile unsigned int*)(0x4300BD90UL))
#define bM4_USH_HCINTMSK7_ACKMSK                        *((volatile unsigned int*)(0x4300BD94UL))
#define bM4_USH_HCINTMSK7_NYETMSK                       *((volatile unsigned int*)(0x4300BD98UL))
#define bM4_USH_HCINTMSK7_XACTERRMSK                    *((volatile unsigned int*)(0x4300BD9CUL))
#define bM4_USH_HCINTMSK7_BBLERRMSK                     *((volatile unsigned int*)(0x4300BDA0UL))
#define bM4_USH_HCINTMSK7_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4300BDA4UL))
#define bM4_USH_HCINTMSK7_DATATGLERRMSK                 *((volatile unsigned int*)(0x4300BDA8UL))
#define bM4_USH_HCTSIZ7_XFERSIZE0                       *((volatile unsigned int*)(0x4300BE00UL))
#define bM4_USH_HCTSIZ7_XFERSIZE1                       *((volatile unsigned int*)(0x4300BE04UL))
#define bM4_USH_HCTSIZ7_XFERSIZE2                       *((volatile unsigned int*)(0x4300BE08UL))
#define bM4_USH_HCTSIZ7_XFERSIZE3                       *((volatile unsigned int*)(0x4300BE0CUL))
#define bM4_USH_HCTSIZ7_XFERSIZE4                       *((volatile unsigned int*)(0x4300BE10UL))
#define bM4_USH_HCTSIZ7_XFERSIZE5                       *((volatile unsigned int*)(0x4300BE14UL))
#define bM4_USH_HCTSIZ7_XFERSIZE6                       *((volatile unsigned int*)(0x4300BE18UL))
#define bM4_USH_HCTSIZ7_XFERSIZE7                       *((volatile unsigned int*)(0x4300BE1CUL))
#define bM4_USH_HCTSIZ7_XFERSIZE8                       *((volatile unsigned int*)(0x4300BE20UL))
#define bM4_USH_HCTSIZ7_XFERSIZE9                       *((volatile unsigned int*)(0x4300BE24UL))
#define bM4_USH_HCTSIZ7_XFERSIZE10                      *((volatile unsigned int*)(0x4300BE28UL))
#define bM4_USH_HCTSIZ7_XFERSIZE11                      *((volatile unsigned int*)(0x4300BE2CUL))
#define bM4_USH_HCTSIZ7_XFERSIZE12                      *((volatile unsigned int*)(0x4300BE30UL))
#define bM4_USH_HCTSIZ7_XFERSIZE13                      *((volatile unsigned int*)(0x4300BE34UL))
#define bM4_USH_HCTSIZ7_XFERSIZE14                      *((volatile unsigned int*)(0x4300BE38UL))
#define bM4_USH_HCTSIZ7_XFERSIZE15                      *((volatile unsigned int*)(0x4300BE3CUL))
#define bM4_USH_HCTSIZ7_XFERSIZE16                      *((volatile unsigned int*)(0x4300BE40UL))
#define bM4_USH_HCTSIZ7_XFERSIZE17                      *((volatile unsigned int*)(0x4300BE44UL))
#define bM4_USH_HCTSIZ7_XFERSIZE18                      *((volatile unsigned int*)(0x4300BE48UL))
#define bM4_USH_HCTSIZ7_PKTCNT0                         *((volatile unsigned int*)(0x4300BE4CUL))
#define bM4_USH_HCTSIZ7_PKTCNT1                         *((volatile unsigned int*)(0x4300BE50UL))
#define bM4_USH_HCTSIZ7_PKTCNT2                         *((volatile unsigned int*)(0x4300BE54UL))
#define bM4_USH_HCTSIZ7_PKTCNT3                         *((volatile unsigned int*)(0x4300BE58UL))
#define bM4_USH_HCTSIZ7_PKTCNT4                         *((volatile unsigned int*)(0x4300BE5CUL))
#define bM4_USH_HCTSIZ7_PKTCNT5                         *((volatile unsigned int*)(0x4300BE60UL))
#define bM4_USH_HCTSIZ7_PKTCNT6                         *((volatile unsigned int*)(0x4300BE64UL))
#define bM4_USH_HCTSIZ7_PKTCNT7                         *((volatile unsigned int*)(0x4300BE68UL))
#define bM4_USH_HCTSIZ7_PKTCNT8                         *((volatile unsigned int*)(0x4300BE6CUL))
#define bM4_USH_HCTSIZ7_PKTCNT9                         *((volatile unsigned int*)(0x4300BE70UL))
#define bM4_USH_HCTSIZ7_PID0                            *((volatile unsigned int*)(0x4300BE74UL))
#define bM4_USH_HCTSIZ7_PID1                            *((volatile unsigned int*)(0x4300BE78UL))
#define bM4_USH_HCTSIZ7_DOPNG                           *((volatile unsigned int*)(0x4300BE7CUL))
#define bM4_USH_HCCHAR8_MPS0                            *((volatile unsigned int*)(0x4300C000UL))
#define bM4_USH_HCCHAR8_MPS1                            *((volatile unsigned int*)(0x4300C004UL))
#define bM4_USH_HCCHAR8_MPS2                            *((volatile unsigned int*)(0x4300C008UL))
#define bM4_USH_HCCHAR8_MPS3                            *((volatile unsigned int*)(0x4300C00CUL))
#define bM4_USH_HCCHAR8_MPS4                            *((volatile unsigned int*)(0x4300C010UL))
#define bM4_USH_HCCHAR8_MPS5                            *((volatile unsigned int*)(0x4300C014UL))
#define bM4_USH_HCCHAR8_MPS6                            *((volatile unsigned int*)(0x4300C018UL))
#define bM4_USH_HCCHAR8_MPS7                            *((volatile unsigned int*)(0x4300C01CUL))
#define bM4_USH_HCCHAR8_MPS8                            *((volatile unsigned int*)(0x4300C020UL))
#define bM4_USH_HCCHAR8_MPS9                            *((volatile unsigned int*)(0x4300C024UL))
#define bM4_USH_HCCHAR8_MPS10                           *((volatile unsigned int*)(0x4300C028UL))
#define bM4_USH_HCCHAR8_EPNUM0                          *((volatile unsigned int*)(0x4300C02CUL))
#define bM4_USH_HCCHAR8_EPNUM1                          *((volatile unsigned int*)(0x4300C030UL))
#define bM4_USH_HCCHAR8_EPNUM2                          *((volatile unsigned int*)(0x4300C034UL))
#define bM4_USH_HCCHAR8_EPNUM3                          *((volatile unsigned int*)(0x4300C038UL))
#define bM4_USH_HCCHAR8_EPDIR                           *((volatile unsigned int*)(0x4300C03CUL))
#define bM4_USH_HCCHAR8_LSPDDEV                         *((volatile unsigned int*)(0x4300C044UL))
#define bM4_USH_HCCHAR8_EPTYPE0                         *((volatile unsigned int*)(0x4300C048UL))
#define bM4_USH_HCCHAR8_EPTYPE1                         *((volatile unsigned int*)(0x4300C04CUL))
#define bM4_USH_HCCHAR8_EC0                             *((volatile unsigned int*)(0x4300C050UL))
#define bM4_USH_HCCHAR8_EC1                             *((volatile unsigned int*)(0x4300C054UL))
#define bM4_USH_HCCHAR8_DEVADDR0                        *((volatile unsigned int*)(0x4300C058UL))
#define bM4_USH_HCCHAR8_DEVADDR1                        *((volatile unsigned int*)(0x4300C05CUL))
#define bM4_USH_HCCHAR8_DEVADDR2                        *((volatile unsigned int*)(0x4300C060UL))
#define bM4_USH_HCCHAR8_DEVADDR3                        *((volatile unsigned int*)(0x4300C064UL))
#define bM4_USH_HCCHAR8_DEVADDR4                        *((volatile unsigned int*)(0x4300C068UL))
#define bM4_USH_HCCHAR8_DEVADDR5                        *((volatile unsigned int*)(0x4300C06CUL))
#define bM4_USH_HCCHAR8_DEVADDR6                        *((volatile unsigned int*)(0x4300C070UL))
#define bM4_USH_HCCHAR8_ODDFRM                          *((volatile unsigned int*)(0x4300C074UL))
#define bM4_USH_HCCHAR8_CHDIS                           *((volatile unsigned int*)(0x4300C078UL))
#define bM4_USH_HCCHAR8_CHENA                           *((volatile unsigned int*)(0x4300C07CUL))
#define bM4_USH_HCSPLT8_PRTADDR0                        *((volatile unsigned int*)(0x4300C080UL))
#define bM4_USH_HCSPLT8_PRTADDR1                        *((volatile unsigned int*)(0x4300C084UL))
#define bM4_USH_HCSPLT8_PRTADDR2                        *((volatile unsigned int*)(0x4300C088UL))
#define bM4_USH_HCSPLT8_PRTADDR3                        *((volatile unsigned int*)(0x4300C08CUL))
#define bM4_USH_HCSPLT8_PRTADDR4                        *((volatile unsigned int*)(0x4300C090UL))
#define bM4_USH_HCSPLT8_PRTADDR5                        *((volatile unsigned int*)(0x4300C094UL))
#define bM4_USH_HCSPLT8_PRTADDR6                        *((volatile unsigned int*)(0x4300C098UL))
#define bM4_USH_HCSPLT8_HUBADDR0                        *((volatile unsigned int*)(0x4300C09CUL))
#define bM4_USH_HCSPLT8_HUBADDR1                        *((volatile unsigned int*)(0x4300C0A0UL))
#define bM4_USH_HCSPLT8_HUBADDR2                        *((volatile unsigned int*)(0x4300C0A4UL))
#define bM4_USH_HCSPLT8_HUBADDR3                        *((volatile unsigned int*)(0x4300C0A8UL))
#define bM4_USH_HCSPLT8_HUBADDR4                        *((volatile unsigned int*)(0x4300C0ACUL))
#define bM4_USH_HCSPLT8_HUBADDR5                        *((volatile unsigned int*)(0x4300C0B0UL))
#define bM4_USH_HCSPLT8_HUBADDR6                        *((volatile unsigned int*)(0x4300C0B4UL))
#define bM4_USH_HCSPLT8_XACTPOS0                        *((volatile unsigned int*)(0x4300C0B8UL))
#define bM4_USH_HCSPLT8_XACTPOS1                        *((volatile unsigned int*)(0x4300C0BCUL))
#define bM4_USH_HCSPLT8_COMPSPLT                        *((volatile unsigned int*)(0x4300C0C0UL))
#define bM4_USH_HCSPLT8_SPLTENA                         *((volatile unsigned int*)(0x4300C0FCUL))
#define bM4_USH_HCINT8_XFERCOMPL                        *((volatile unsigned int*)(0x4300C100UL))
#define bM4_USH_HCINT8_CHHLTD                           *((volatile unsigned int*)(0x4300C104UL))
#define bM4_USH_HCINT8_AHBERR                           *((volatile unsigned int*)(0x4300C108UL))
#define bM4_USH_HCINT8_STALL                            *((volatile unsigned int*)(0x4300C10CUL))
#define bM4_USH_HCINT8_NAK                              *((volatile unsigned int*)(0x4300C110UL))
#define bM4_USH_HCINT8_ACK                              *((volatile unsigned int*)(0x4300C114UL))
#define bM4_USH_HCINT8_NYET                             *((volatile unsigned int*)(0x4300C118UL))
#define bM4_USH_HCINT8_XACTERR                          *((volatile unsigned int*)(0x4300C11CUL))
#define bM4_USH_HCINT8_BBLERR                           *((volatile unsigned int*)(0x4300C120UL))
#define bM4_USH_HCINT8_FRMOVRUN                         *((volatile unsigned int*)(0x4300C124UL))
#define bM4_USH_HCINT8_DATATGLERR                       *((volatile unsigned int*)(0x4300C128UL))
