RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_HCINTMSK8_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4300C180UL))
#define bM4_USH_HCINTMSK8_CHHLTDMSK                     *((volatile unsigned int*)(0x4300C184UL))
#define bM4_USH_HCINTMSK8_AHBERRMSK                     *((volatile unsigned int*)(0x4300C188UL))
#define bM4_USH_HCINTMSK8_STALLMSK                      *((volatile unsigned int*)(0x4300C18CUL))
#define bM4_USH_HCINTMSK8_NAKMSK                        *((volatile unsigned int*)(0x4300C190UL))
#define bM4_USH_HCINTMSK8_ACKMSK                        *((volatile unsigned int*)(0x4300C194UL))
#define bM4_USH_HCINTMSK8_NYETMSK                       *((volatile unsigned int*)(0x4300C198UL))
#define bM4_USH_HCINTMSK8_XACTERRMSK                    *((volatile unsigned int*)(0x4300C19CUL))
#define bM4_USH_HCINTMSK8_BBLERRMSK                     *((volatile unsigned int*)(0x4300C1A0UL))
#define bM4_USH_HCINTMSK8_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4300C1A4UL))
#define bM4_USH_HCINTMSK8_DATATGLERRMSK                 *((volatile unsigned int*)(0x4300C1A8UL))
#define bM4_USH_HCTSIZ8_XFERSIZE0                       *((volatile unsigned int*)(0x4300C200UL))
#define bM4_USH_HCTSIZ8_XFERSIZE1                       *((volatile unsigned int*)(0x4300C204UL))
#define bM4_USH_HCTSIZ8_XFERSIZE2                       *((volatile unsigned int*)(0x4300C208UL))
#define bM4_USH_HCTSIZ8_XFERSIZE3                       *((volatile unsigned int*)(0x4300C20CUL))
#define bM4_USH_HCTSIZ8_XFERSIZE4                       *((volatile unsigned int*)(0x4300C210UL))
#define bM4_USH_HCTSIZ8_XFERSIZE5                       *((volatile unsigned int*)(0x4300C214UL))
#define bM4_USH_HCTSIZ8_XFERSIZE6                       *((volatile unsigned int*)(0x4300C218UL))
#define bM4_USH_HCTSIZ8_XFERSIZE7                       *((volatile unsigned int*)(0x4300C21CUL))
#define bM4_USH_HCTSIZ8_XFERSIZE8                       *((volatile unsigned int*)(0x4300C220UL))
#define bM4_USH_HCTSIZ8_XFERSIZE9                       *((volatile unsigned int*)(0x4300C224UL))
#define bM4_USH_HCTSIZ8_XFERSIZE10                      *((volatile unsigned int*)(0x4300C228UL))
#define bM4_USH_HCTSIZ8_XFERSIZE11                      *((volatile unsigned int*)(0x4300C22CUL))
#define bM4_USH_HCTSIZ8_XFERSIZE12                      *((volatile unsigned int*)(0x4300C230UL))
#define bM4_USH_HCTSIZ8_XFERSIZE13                      *((volatile unsigned int*)(0x4300C234UL))
#define bM4_USH_HCTSIZ8_XFERSIZE14                      *((volatile unsigned int*)(0x4300C238UL))
#define bM4_USH_HCTSIZ8_XFERSIZE15                      *((volatile unsigned int*)(0x4300C23CUL))
#define bM4_USH_HCTSIZ8_XFERSIZE16                      *((volatile unsigned int*)(0x4300C240UL))
#define bM4_USH_HCTSIZ8_XFERSIZE17                      *((volatile unsigned int*)(0x4300C244UL))
#define bM4_USH_HCTSIZ8_XFERSIZE18                      *((volatile unsigned int*)(0x4300C248UL))
#define bM4_USH_HCTSIZ8_PKTCNT0                         *((volatile unsigned int*)(0x4300C24CUL))
#define bM4_USH_HCTSIZ8_PKTCNT1                         *((volatile unsigned int*)(0x4300C250UL))
#define bM4_USH_HCTSIZ8_PKTCNT2                         *((volatile unsigned int*)(0x4300C254UL))
#define bM4_USH_HCTSIZ8_PKTCNT3                         *((volatile unsigned int*)(0x4300C258UL))
#define bM4_USH_HCTSIZ8_PKTCNT4                         *((volatile unsigned int*)(0x4300C25CUL))
#define bM4_USH_HCTSIZ8_PKTCNT5                         *((volatile unsigned int*)(0x4300C260UL))
#define bM4_USH_HCTSIZ8_PKTCNT6                         *((volatile unsigned int*)(0x4300C264UL))
#define bM4_USH_HCTSIZ8_PKTCNT7                         *((volatile unsigned int*)(0x4300C268UL))
#define bM4_USH_HCTSIZ8_PKTCNT8                         *((volatile unsigned int*)(0x4300C26CUL))
#define bM4_USH_HCTSIZ8_PKTCNT9                         *((volatile unsigned int*)(0x4300C270UL))
#define bM4_USH_HCTSIZ8_PID0                            *((volatile unsigned int*)(0x4300C274UL))
#define bM4_USH_HCTSIZ8_PID1                            *((volatile unsigned int*)(0x4300C278UL))
#define bM4_USH_HCTSIZ8_DOPNG                           *((volatile unsigned int*)(0x4300C27CUL))
#define bM4_USH_HCCHAR9_MPS0                            *((volatile unsigned int*)(0x4300C400UL))
#define bM4_USH_HCCHAR9_MPS1                            *((volatile unsigned int*)(0x4300C404UL))
#define bM4_USH_HCCHAR9_MPS2                            *((volatile unsigned int*)(0x4300C408UL))
#define bM4_USH_HCCHAR9_MPS3                            *((volatile unsigned int*)(0x4300C40CUL))
#define bM4_USH_HCCHAR9_MPS4                            *((volatile unsigned int*)(0x4300C410UL))
#define bM4_USH_HCCHAR9_MPS5                            *((volatile unsigned int*)(0x4300C414UL))
#define bM4_USH_HCCHAR9_MPS6                            *((volatile unsigned int*)(0x4300C418UL))
#define bM4_USH_HCCHAR9_MPS7                            *((volatile unsigned int*)(0x4300C41CUL))
#define bM4_USH_HCCHAR9_MPS8                            *((volatile unsigned int*)(0x4300C420UL))
#define bM4_USH_HCCHAR9_MPS9                            *((volatile unsigned int*)(0x4300C424UL))
#define bM4_USH_HCCHAR9_MPS10                           *((volatile unsigned int*)(0x4300C428UL))
#define bM4_USH_HCCHAR9_EPNUM0                          *((volatile unsigned int*)(0x4300C42CUL))
#define bM4_USH_HCCHAR9_EPNUM1                          *((volatile unsigned int*)(0x4300C430UL))
#define bM4_USH_HCCHAR9_EPNUM2                          *((volatile unsigned int*)(0x4300C434UL))
#define bM4_USH_HCCHAR9_EPNUM3                          *((volatile unsigned int*)(0x4300C438UL))
#define bM4_USH_HCCHAR9_EPDIR                           *((volatile unsigned int*)(0x4300C43CUL))
#define bM4_USH_HCCHAR9_LSPDDEV                         *((volatile unsigned int*)(0x4300C444UL))
#define bM4_USH_HCCHAR9_EPTYPE0                         *((volatile unsigned int*)(0x4300C448UL))
#define bM4_USH_HCCHAR9_EPTYPE1                         *((volatile unsigned int*)(0x4300C44CUL))
#define bM4_USH_HCCHAR9_EC0                             *((volatile unsigned int*)(0x4300C450UL))
#define bM4_USH_HCCHAR9_EC1                             *((volatile unsigned int*)(0x4300C454UL))
#define bM4_USH_HCCHAR9_DEVADDR0                        *((volatile unsigned int*)(0x4300C458UL))
#define bM4_USH_HCCHAR9_DEVADDR1                        *((volatile unsigned int*)(0x4300C45CUL))
#define bM4_USH_HCCHAR9_DEVADDR2                        *((volatile unsigned int*)(0x4300C460UL))
#define bM4_USH_HCCHAR9_DEVADDR3                        *((volatile unsigned int*)(0x4300C464UL))
#define bM4_USH_HCCHAR9_DEVADDR4                        *((volatile unsigned int*)(0x4300C468UL))
#define bM4_USH_HCCHAR9_DEVADDR5                        *((volatile unsigned int*)(0x4300C46CUL))
#define bM4_USH_HCCHAR9_DEVADDR6                        *((volatile unsigned int*)(0x4300C470UL))
#define bM4_USH_HCCHAR9_ODDFRM                          *((volatile unsigned int*)(0x4300C474UL))
#define bM4_USH_HCCHAR9_CHDIS                           *((volatile unsigned int*)(0x4300C478UL))
#define bM4_USH_HCCHAR9_CHENA                           *((volatile unsigned int*)(0x4300C47CUL))
#define bM4_USH_HCSPLT9_PRTADDR0                        *((volatile unsigned int*)(0x4300C480UL))
#define bM4_USH_HCSPLT9_PRTADDR1                        *((volatile unsigned int*)(0x4300C484UL))
#define bM4_USH_HCSPLT9_PRTADDR2                        *((volatile unsigned int*)(0x4300C488UL))
#define bM4_USH_HCSPLT9_PRTADDR3                        *((volatile unsigned int*)(0x4300C48CUL))
#define bM4_USH_HCSPLT9_PRTADDR4                        *((volatile unsigned int*)(0x4300C490UL))
#define bM4_USH_HCSPLT9_PRTADDR5                        *((volatile unsigned int*)(0x4300C494UL))
#define bM4_USH_HCSPLT9_PRTADDR6                        *((volatile unsigned int*)(0x4300C498UL))
#define bM4_USH_HCSPLT9_HUBADDR0                        *((volatile unsigned int*)(0x4300C49CUL))
#define bM4_USH_HCSPLT9_HUBADDR1                        *((volatile unsigned int*)(0x4300C4A0UL))
#define bM4_USH_HCSPLT9_HUBADDR2                        *((volatile unsigned int*)(0x4300C4A4UL))
#define bM4_USH_HCSPLT9_HUBADDR3                        *((volatile unsigned int*)(0x4300C4A8UL))
#define bM4_USH_HCSPLT9_HUBADDR4                        *((volatile unsigned int*)(0x4300C4ACUL))
#define bM4_USH_HCSPLT9_HUBADDR5                        *((volatile unsigned int*)(0x4300C4B0UL))
#define bM4_USH_HCSPLT9_HUBADDR6                        *((volatile unsigned int*)(0x4300C4B4UL))
#define bM4_USH_HCSPLT9_XACTPOS0                        *((volatile unsigned int*)(0x4300C4B8UL))
#define bM4_USH_HCSPLT9_XACTPOS1                        *((volatile unsigned int*)(0x4300C4BCUL))
#define bM4_USH_HCSPLT9_COMPSPLT                        *((volatile unsigned int*)(0x4300C4C0UL))
#define bM4_USH_HCSPLT9_SPLTENA                         *((volatile unsigned int*)(0x4300C4FCUL))
#define bM4_USH_HCINT9_XFERCOMPL                        *((volatile unsigned int*)(0x4300C500UL))
#define bM4_USH_HCINT9_CHHLTD                           *((volatile unsigned int*)(0x4300C504UL))
#define bM4_USH_HCINT9_AHBERR                           *((volatile unsigned int*)(0x4300C508UL))
#define bM4_USH_HCINT9_STALL                            *((volatile unsigned int*)(0x4300C50CUL))
#define bM4_USH_HCINT9_NAK                              *((volatile unsigned int*)(0x4300C510UL))
#define bM4_USH_HCINT9_ACK                              *((volatile unsigned int*)(0x4300C514UL))
#define bM4_USH_HCINT9_NYET                             *((volatile unsigned int*)(0x4300C518UL))
#define bM4_USH_HCINT9_XACTERR                          *((volatile unsigned int*)(0x4300C51CUL))
#define bM4_USH_HCINT9_BBLERR                           *((volatile unsigned int*)(0x4300C520UL))
#define bM4_USH_HCINT9_FRMOVRUN                         *((volatile unsigned int*)(0x4300C524UL))
#define bM4_USH_HCINT9_DATATGLERR                       *((volatile unsigned int*)(0x4300C528UL))
#define bM4_USH_HCINTMSK9_XFERCOMPLMSK                  *((volatile unsigned int*)(0x4300C580UL))
#define bM4_USH_HCINTMSK9_CHHLTDMSK                     *((volatile unsigned int*)(0x4300C584UL))
#define bM4_USH_HCINTMSK9_AHBERRMSK                     *((volatile unsigned int*)(0x4300C588UL))
#define bM4_USH_HCINTMSK9_STALLMSK                      *((volatile unsigned int*)(0x4300C58CUL))
#define bM4_USH_HCINTMSK9_NAKMSK                        *((volatile unsigned int*)(0x4300C590UL))
#define bM4_USH_HCINTMSK9_ACKMSK                        *((volatile unsigned int*)(0x4300C594UL))
#define bM4_USH_HCINTMSK9_NYETMSK                       *((volatile unsigned int*)(0x4300C598UL))
#define bM4_USH_HCINTMSK9_XACTERRMSK                    *((volatile unsigned int*)(0x4300C59CUL))
#define bM4_USH_HCINTMSK9_BBLERRMSK                     *((volatile unsigned int*)(0x4300C5A0UL))
#define bM4_USH_HCINTMSK9_FRMOVRUNMSK                   *((volatile unsigned int*)(0x4300C5A4UL))
#define bM4_USH_HCINTMSK9_DATATGLERRMSK                 *((volatile unsigned int*)(0x4300C5A8UL))
#define bM4_USH_HCTSIZ9_XFERSIZE0                       *((volatile unsigned int*)(0x4300C600UL))
#define bM4_USH_HCTSIZ9_XFERSIZE1                       *((volatile unsigned int*)(0x4300C604UL))
#define bM4_USH_HCTSIZ9_XFERSIZE2                       *((volatile unsigned int*)(0x4300C608UL))
#define bM4_USH_HCTSIZ9_XFERSIZE3                       *((volatile unsigned int*)(0x4300C60CUL))
#define bM4_USH_HCTSIZ9_XFERSIZE4                       *((volatile unsigned int*)(0x4300C610UL))
#define bM4_USH_HCTSIZ9_XFERSIZE5                       *((volatile unsigned int*)(0x4300C614UL))
#define bM4_USH_HCTSIZ9_XFERSIZE6                       *((volatile unsigned int*)(0x4300C618UL))
#define bM4_USH_HCTSIZ9_XFERSIZE7                       *((volatile unsigned int*)(0x4300C61CUL))
#define bM4_USH_HCTSIZ9_XFERSIZE8                       *((volatile unsigned int*)(0x4300C620UL))
#define bM4_USH_HCTSIZ9_XFERSIZE9                       *((volatile unsigned int*)(0x4300C624UL))
#define bM4_USH_HCTSIZ9_XFERSIZE10                      *((volatile unsigned int*)(0x4300C628UL))
#define bM4_USH_HCTSIZ9_XFERSIZE11                      *((volatile unsigned int*)(0x4300C62CUL))
#define bM4_USH_HCTSIZ9_XFERSIZE12                      *((volatile unsigned int*)(0x4300C630UL))
#define bM4_USH_HCTSIZ9_XFERSIZE13                      *((volatile unsigned int*)(0x4300C634UL))
#define bM4_USH_HCTSIZ9_XFERSIZE14                      *((volatile unsigned int*)(0x4300C638UL))
#define bM4_USH_HCTSIZ9_XFERSIZE15                      *((volatile unsigned int*)(0x4300C63CUL))
#define bM4_USH_HCTSIZ9_XFERSIZE16                      *((volatile unsigned int*)(0x4300C640UL))
#define bM4_USH_HCTSIZ9_XFERSIZE17                      *((volatile unsigned int*)(0x4300C644UL))
#define bM4_USH_HCTSIZ9_XFERSIZE18                      *((volatile unsigned int*)(0x4300C648UL))
#define bM4_USH_HCTSIZ9_PKTCNT0                         *((volatile unsigned int*)(0x4300C64CUL))
#define bM4_USH_HCTSIZ9_PKTCNT1                         *((volatile unsigned int*)(0x4300C650UL))
#define bM4_USH_HCTSIZ9_PKTCNT2                         *((volatile unsigned int*)(0x4300C654UL))
#define bM4_USH_HCTSIZ9_PKTCNT3                         *((volatile unsigned int*)(0x4300C658UL))
#define bM4_USH_HCTSIZ9_PKTCNT4                         *((volatile unsigned int*)(0x4300C65CUL))
#define bM4_USH_HCTSIZ9_PKTCNT5                         *((volatile unsigned int*)(0x4300C660UL))
#define bM4_USH_HCTSIZ9_PKTCNT6                         *((volatile unsigned int*)(0x4300C664UL))
#define bM4_USH_HCTSIZ9_PKTCNT7                         *((volatile unsigned int*)(0x4300C668UL))
#define bM4_USH_HCTSIZ9_PKTCNT8                         *((volatile unsigned int*)(0x4300C66CUL))
#define bM4_USH_HCTSIZ9_PKTCNT9                         *((volatile unsigned int*)(0x4300C670UL))
#define bM4_USH_HCTSIZ9_PID0                            *((volatile unsigned int*)(0x4300C674UL))
#define bM4_USH_HCTSIZ9_PID1                            *((volatile unsigned int*)(0x4300C678UL))
#define bM4_USH_HCTSIZ9_DOPNG                           *((volatile unsigned int*)(0x4300C67CUL))
#define bM4_USH_HCCHAR10_MPS0                           *((volatile unsigned int*)(0x4300C800UL))
#define bM4_USH_HCCHAR10_MPS1                           *((volatile unsigned int*)(0x4300C804UL))
#define bM4_USH_HCCHAR10_MPS2                           *((volatile unsigned int*)(0x4300C808UL))
#define bM4_USH_HCCHAR10_MPS3                           *((volatile unsigned int*)(0x4300C80CUL))
#define bM4_USH_HCCHAR10_MPS4                           *((volatile unsigned int*)(0x4300C810UL))
#define bM4_USH_HCCHAR10_MPS5                           *((volatile unsigned int*)(0x4300C814UL))
#define bM4_USH_HCCHAR10_MPS6                           *((volatile unsigned int*)(0x4300C818UL))
#define bM4_USH_HCCHAR10_MPS7                           *((volatile unsigned int*)(0x4300C81CUL))
#define bM4_USH_HCCHAR10_MPS8                           *((volatile unsigned int*)(0x4300C820UL))
#define bM4_USH_HCCHAR10_MPS9                           *((volatile unsigned int*)(0x4300C824UL))
#define bM4_USH_HCCHAR10_MPS10                          *((volatile unsigned int*)(0x4300C828UL))
#define bM4_USH_HCCHAR10_EPNUM0                         *((volatile unsigned int*)(0x4300C82CUL))
#define bM4_USH_HCCHAR10_EPNUM1                         *((volatile unsigned int*)(0x4300C830UL))
#define bM4_USH_HCCHAR10_EPNUM2                         *((volatile unsigned int*)(0x4300C834UL))
#define bM4_USH_HCCHAR10_EPNUM3                         *((volatile unsigned int*)(0x4300C838UL))
#define bM4_USH_HCCHAR10_EPDIR                          *((volatile unsigned int*)(0x4300C83CUL))
#define bM4_USH_HCCHAR10_LSPDDEV                        *((volatile unsigned int*)(0x4300C844UL))
#define bM4_USH_HCCHAR10_EPTYPE0                        *((volatile unsigned int*)(0x4300C848UL))
#define bM4_USH_HCCHAR10_EPTYPE1                        *((volatile unsigned int*)(0x4300C84CUL))
#define bM4_USH_HCCHAR10_EC0                            *((volatile unsigned int*)(0x4300C850UL))
#define bM4_USH_HCCHAR10_EC1                            *((volatile unsigned int*)(0x4300C854UL))
#define bM4_USH_HCCHAR10_DEVADDR0                       *((volatile unsigned int*)(0x4300C858UL))
#define bM4_USH_HCCHAR10_DEVADDR1                       *((volatile unsigned int*)(0x4300C85CUL))
#define bM4_USH_HCCHAR10_DEVADDR2                       *((volatile unsigned int*)(0x4300C860UL))
#define bM4_USH_HCCHAR10_DEVADDR3                       *((volatile unsigned int*)(0x4300C864UL))
#define bM4_USH_HCCHAR10_DEVADDR4                       *((volatile unsigned int*)(0x4300C868UL))
#define bM4_USH_HCCHAR10_DEVADDR5                       *((volatile unsigned int*)(0x4300C86CUL))
#define bM4_USH_HCCHAR10_DEVADDR6                       *((volatile unsigned int*)(0x4300C870UL))
#define bM4_USH_HCCHAR10_ODDFRM                         *((volatile unsigned int*)(0x4300C874UL))
#define bM4_USH_HCCHAR10_CHDIS                          *((volatile unsigned int*)(0x4300C878UL))
#define bM4_USH_HCCHAR10_CHENA                          *((volatile unsigned int*)(0x4300C87CUL))
#define bM4_USH_HCSPLT10_PRTADDR0                       *((volatile unsigned int*)(0x4300C880UL))
#define bM4_USH_HCSPLT10_PRTADDR1                       *((volatile unsigned int*)(0x4300C884UL))
#define bM4_USH_HCSPLT10_PRTADDR2                       *((volatile unsigned int*)(0x4300C888UL))
#define bM4_USH_HCSPLT10_PRTADDR3                       *((volatile unsigned int*)(0x4300C88CUL))
#define bM4_USH_HCSPLT10_PRTADDR4                       *((volatile unsigned int*)(0x4300C890UL))
#define bM4_USH_HCSPLT10_PRTADDR5                       *((volatile unsigned int*)(0x4300C894UL))
#define bM4_USH_HCSPLT10_PRTADDR6                       *((volatile unsigned int*)(0x4300C898UL))
#define bM4_USH_HCSPLT10_HUBADDR0                       *((volatile unsigned int*)(0x4300C89CUL))
#define bM4_USH_HCSPLT10_HUBADDR1                       *((volatile unsigned int*)(0x4300C8A0UL))
#define bM4_USH_HCSPLT10_HUBADDR2                       *((volatile unsigned int*)(0x4300C8A4UL))
#define bM4_USH_HCSPLT10_HUBADDR3                       *((volatile unsigned int*)(0x4300C8A8UL))
#define bM4_USH_HCSPLT10_HUBADDR4                       *((volatile unsigned int*)(0x4300C8ACUL))
#define bM4_USH_HCSPLT10_HUBADDR5                       *((volatile unsigned int*)(0x4300C8B0UL))
#define bM4_USH_HCSPLT10_HUBADDR6                       *((volatile unsigned int*)(0x4300C8B4UL))
#define bM4_USH_HCSPLT10_XACTPOS0                       *((volatile unsigned int*)(0x4300C8B8UL))
#define bM4_USH_HCSPLT10_XACTPOS1                       *((volatile unsigned int*)(0x4300C8BCUL))
#define bM4_USH_HCSPLT10_COMPSPLT                       *((volatile unsigned int*)(0x4300C8C0UL))
#define bM4_USH_HCSPLT10_SPLTENA                        *((volatile unsigned int*)(0x4300C8FCUL))
#define bM4_USH_HCINT10_XFERCOMPL                       *((volatile unsigned int*)(0x4300C900UL))
#define bM4_USH_HCINT10_CHHLTD                          *((volatile unsigned int*)(0x4300C904UL))
#define bM4_USH_HCINT10_AHBERR                          *((volatile unsigned int*)(0x4300C908UL))
#define bM4_USH_HCINT10_STALL                           *((volatile unsigned int*)(0x4300C90CUL))
#define bM4_USH_HCINT10_NAK                             *((volatile unsigned int*)(0x4300C910UL))
#define bM4_USH_HCINT10_ACK                             *((volatile unsigned int*)(0x4300C914UL))
#define bM4_USH_HCINT10_NYET                            *((volatile unsigned int*)(0x4300C918UL))
#define bM4_USH_HCINT10_XACTERR                         *((volatile unsigned int*)(0x4300C91CUL))
#define bM4_USH_HCINT10_BBLERR                          *((volatile unsigned int*)(0x4300C920UL))
#define bM4_USH_HCINT10_FRMOVRUN                        *((volatile unsigned int*)(0x4300C924UL))
#define bM4_USH_HCINT10_DATATGLERR                      *((volatile unsigned int*)(0x4300C928UL))
#define bM4_USH_HCINTMSK10_XFERCOMPLMSK                 *((volatile unsigned int*)(0x4300C980UL))
#define bM4_USH_HCINTMSK10_CHHLTDMSK                    *((volatile unsigned int*)(0x4300C984UL))
#define bM4_USH_HCINTMSK10_AHBERRMSK                    *((volatile unsigned int*)(0x4300C988UL))
#define bM4_USH_HCINTMSK10_STALLMSK                     *((volatile unsigned int*)(0x4300C98CUL))
#define bM4_USH_HCINTMSK10_NAKMSK                       *((volatile unsigned int*)(0x4300C990UL))
#define bM4_USH_HCINTMSK10_ACKMSK                       *((volatile unsigned int*)(0x4300C994UL))
#define bM4_USH_HCINTMSK10_NYETMSK                      *((volatile unsigned int*)(0x4300C998UL))
#define bM4_USH_HCINTMSK10_XACTERRMSK                   *((volatile unsigned int*)(0x4300C99CUL))
#define bM4_USH_HCINTMSK10_BBLERRMSK                    *((volatile unsigned int*)(0x4300C9A0UL))
#define bM4_USH_HCINTMSK10_FRMOVRUNMSK                  *((volatile unsigned int*)(0x4300C9A4UL))
#define bM4_USH_HCINTMSK10_DATATGLERRMSK                *((volatile unsigned int*)(0x4300C9A8UL))
#define bM4_USH_HCTSIZ10_XFERSIZE0                      *((volatile unsigned int*)(0x4300CA00UL))
#define bM4_USH_HCTSIZ10_XFERSIZE1                      *((volatile unsigned int*)(0x4300CA04UL))
#define bM4_USH_HCTSIZ10_XFERSIZE2                      *((volatile unsigned int*)(0x4300CA08UL))
#define bM4_USH_HCTSIZ10_XFERSIZE3                      *((volatile unsigned int*)(0x4300CA0CUL))
#define bM4_USH_HCTSIZ10_XFERSIZE4                      *((volatile unsigned int*)(0x4300CA10UL))
#define bM4_USH_HCTSIZ10_XFERSIZE5                      *((volatile unsigned int*)(0x4300CA14UL))
#define bM4_USH_HCTSIZ10_XFERSIZE6                      *((volatile unsigned int*)(0x4300CA18UL))
#define bM4_USH_HCTSIZ10_XFERSIZE7                      *((volatile unsigned int*)(0x4300CA1CUL))
#define bM4_USH_HCTSIZ10_XFERSIZE8                      *((volatile unsigned int*)(0x4300CA20UL))
#define bM4_USH_HCTSIZ10_XFERSIZE9                      *((volatile unsigned int*)(0x4300CA24UL))
#define bM4_USH_HCTSIZ10_XFERSIZE10                     *((volatile unsigned int*)(0x4300CA28UL))
#define bM4_USH_HCTSIZ10_XFERSIZE11                     *((volatile unsigned int*)(0x4300CA2CUL))
#define bM4_USH_HCTSIZ10_XFERSIZE12                     *((volatile unsigned int*)(0x4300CA30UL))
#define bM4_USH_HCTSIZ10_XFERSIZE13                     *((volatile unsigned int*)(0x4300CA34UL))
#define bM4_USH_HCTSIZ10_XFERSIZE14                     *((volatile unsigned int*)(0x4300CA38UL))
#define bM4_USH_HCTSIZ10_XFERSIZE15                     *((volatile unsigned int*)(0x4300CA3CUL))
#define bM4_USH_HCTSIZ10_XFERSIZE16                     *((volatile unsigned int*)(0x4300CA40UL))
#define bM4_USH_HCTSIZ10_XFERSIZE17                     *((volatile unsigned int*)(0x4300CA44UL))
#define bM4_USH_HCTSIZ10_XFERSIZE18                     *((volatile unsigned int*)(0x4300CA48UL))
#define bM4_USH_HCTSIZ10_PKTCNT0                        *((volatile unsigned int*)(0x4300CA4CUL))
#define bM4_USH_HCTSIZ10_PKTCNT1                        *((volatile unsigned int*)(0x4300CA50UL))
#define bM4_USH_HCTSIZ10_PKTCNT2                        *((volatile unsigned int*)(0x4300CA54UL))
#define bM4_USH_HCTSIZ10_PKTCNT3                        *((volatile unsigned int*)(0x4300CA58UL))
#define bM4_USH_HCTSIZ10_PKTCNT4                        *((volatile unsigned int*)(0x4300CA5CUL))
#define bM4_USH_HCTSIZ10_PKTCNT5                        *((volatile unsigned int*)(0x4300CA60UL))
#define bM4_USH_HCTSIZ10_PKTCNT6                        *((volatile unsigned int*)(0x4300CA64UL))
#define bM4_USH_HCTSIZ10_PKTCNT7                        *((volatile unsigned int*)(0x4300CA68UL))
