RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_HCTSIZ10_PKTCNT8                        *((volatile unsigned int*)(0x4300CA6CUL))
#define bM4_USH_HCTSIZ10_PKTCNT9                        *((volatile unsigned int*)(0x4300CA70UL))
#define bM4_USH_HCTSIZ10_PID0                           *((volatile unsigned int*)(0x4300CA74UL))
#define bM4_USH_HCTSIZ10_PID1                           *((volatile unsigned int*)(0x4300CA78UL))
#define bM4_USH_HCTSIZ10_DOPNG                          *((volatile unsigned int*)(0x4300CA7CUL))
#define bM4_USH_HCCHAR11_MPS0                           *((volatile unsigned int*)(0x4300CC00UL))
#define bM4_USH_HCCHAR11_MPS1                           *((volatile unsigned int*)(0x4300CC04UL))
#define bM4_USH_HCCHAR11_MPS2                           *((volatile unsigned int*)(0x4300CC08UL))
#define bM4_USH_HCCHAR11_MPS3                           *((volatile unsigned int*)(0x4300CC0CUL))
#define bM4_USH_HCCHAR11_MPS4                           *((volatile unsigned int*)(0x4300CC10UL))
#define bM4_USH_HCCHAR11_MPS5                           *((volatile unsigned int*)(0x4300CC14UL))
#define bM4_USH_HCCHAR11_MPS6                           *((volatile unsigned int*)(0x4300CC18UL))
#define bM4_USH_HCCHAR11_MPS7                           *((volatile unsigned int*)(0x4300CC1CUL))
#define bM4_USH_HCCHAR11_MPS8                           *((volatile unsigned int*)(0x4300CC20UL))
#define bM4_USH_HCCHAR11_MPS9                           *((volatile unsigned int*)(0x4300CC24UL))
#define bM4_USH_HCCHAR11_MPS10                          *((volatile unsigned int*)(0x4300CC28UL))
#define bM4_USH_HCCHAR11_EPNUM0                         *((volatile unsigned int*)(0x4300CC2CUL))
#define bM4_USH_HCCHAR11_EPNUM1                         *((volatile unsigned int*)(0x4300CC30UL))
#define bM4_USH_HCCHAR11_EPNUM2                         *((volatile unsigned int*)(0x4300CC34UL))
#define bM4_USH_HCCHAR11_EPNUM3                         *((volatile unsigned int*)(0x4300CC38UL))
#define bM4_USH_HCCHAR11_EPDIR                          *((volatile unsigned int*)(0x4300CC3CUL))
#define bM4_USH_HCCHAR11_LSPDDEV                        *((volatile unsigned int*)(0x4300CC44UL))
#define bM4_USH_HCCHAR11_EPTYPE0                        *((volatile unsigned int*)(0x4300CC48UL))
#define bM4_USH_HCCHAR11_EPTYPE1                        *((volatile unsigned int*)(0x4300CC4CUL))
#define bM4_USH_HCCHAR11_EC0                            *((volatile unsigned int*)(0x4300CC50UL))
#define bM4_USH_HCCHAR11_EC1                            *((volatile unsigned int*)(0x4300CC54UL))
#define bM4_USH_HCCHAR11_DEVADDR0                       *((volatile unsigned int*)(0x4300CC58UL))
#define bM4_USH_HCCHAR11_DEVADDR1                       *((volatile unsigned int*)(0x4300CC5CUL))
#define bM4_USH_HCCHAR11_DEVADDR2                       *((volatile unsigned int*)(0x4300CC60UL))
#define bM4_USH_HCCHAR11_DEVADDR3                       *((volatile unsigned int*)(0x4300CC64UL))
#define bM4_USH_HCCHAR11_DEVADDR4                       *((volatile unsigned int*)(0x4300CC68UL))
#define bM4_USH_HCCHAR11_DEVADDR5                       *((volatile unsigned int*)(0x4300CC6CUL))
#define bM4_USH_HCCHAR11_DEVADDR6                       *((volatile unsigned int*)(0x4300CC70UL))
#define bM4_USH_HCCHAR11_ODDFRM                         *((volatile unsigned int*)(0x4300CC74UL))
#define bM4_USH_HCCHAR11_CHDIS                          *((volatile unsigned int*)(0x4300CC78UL))
#define bM4_USH_HCCHAR11_CHENA                          *((volatile unsigned int*)(0x4300CC7CUL))
#define bM4_USH_HCSPLT11_PRTADDR0                       *((volatile unsigned int*)(0x4300CC80UL))
#define bM4_USH_HCSPLT11_PRTADDR1                       *((volatile unsigned int*)(0x4300CC84UL))
#define bM4_USH_HCSPLT11_PRTADDR2                       *((volatile unsigned int*)(0x4300CC88UL))
#define bM4_USH_HCSPLT11_PRTADDR3                       *((volatile unsigned int*)(0x4300CC8CUL))
#define bM4_USH_HCSPLT11_PRTADDR4                       *((volatile unsigned int*)(0x4300CC90UL))
#define bM4_USH_HCSPLT11_PRTADDR5                       *((volatile unsigned int*)(0x4300CC94UL))
#define bM4_USH_HCSPLT11_PRTADDR6                       *((volatile unsigned int*)(0x4300CC98UL))
#define bM4_USH_HCSPLT11_HUBADDR0                       *((volatile unsigned int*)(0x4300CC9CUL))
#define bM4_USH_HCSPLT11_HUBADDR1                       *((volatile unsigned int*)(0x4300CCA0UL))
#define bM4_USH_HCSPLT11_HUBADDR2                       *((volatile unsigned int*)(0x4300CCA4UL))
#define bM4_USH_HCSPLT11_HUBADDR3                       *((volatile unsigned int*)(0x4300CCA8UL))
#define bM4_USH_HCSPLT11_HUBADDR4                       *((volatile unsigned int*)(0x4300CCACUL))
#define bM4_USH_HCSPLT11_HUBADDR5                       *((volatile unsigned int*)(0x4300CCB0UL))
#define bM4_USH_HCSPLT11_HUBADDR6                       *((volatile unsigned int*)(0x4300CCB4UL))
#define bM4_USH_HCSPLT11_XACTPOS0                       *((volatile unsigned int*)(0x4300CCB8UL))
#define bM4_USH_HCSPLT11_XACTPOS1                       *((volatile unsigned int*)(0x4300CCBCUL))
#define bM4_USH_HCSPLT11_COMPSPLT                       *((volatile unsigned int*)(0x4300CCC0UL))
#define bM4_USH_HCSPLT11_SPLTENA                        *((volatile unsigned int*)(0x4300CCFCUL))
#define bM4_USH_HCINT11_XFERCOMPL                       *((volatile unsigned int*)(0x4300CD00UL))
#define bM4_USH_HCINT11_CHHLTD                          *((volatile unsigned int*)(0x4300CD04UL))
#define bM4_USH_HCINT11_AHBERR                          *((volatile unsigned int*)(0x4300CD08UL))
#define bM4_USH_HCINT11_STALL                           *((volatile unsigned int*)(0x4300CD0CUL))
#define bM4_USH_HCINT11_NAK                             *((volatile unsigned int*)(0x4300CD10UL))
#define bM4_USH_HCINT11_ACK                             *((volatile unsigned int*)(0x4300CD14UL))
#define bM4_USH_HCINT11_NYET                            *((volatile unsigned int*)(0x4300CD18UL))
#define bM4_USH_HCINT11_XACTERR                         *((volatile unsigned int*)(0x4300CD1CUL))
#define bM4_USH_HCINT11_BBLERR                          *((volatile unsigned int*)(0x4300CD20UL))
#define bM4_USH_HCINT11_FRMOVRUN                        *((volatile unsigned int*)(0x4300CD24UL))
#define bM4_USH_HCINT11_DATATGLERR                      *((volatile unsigned int*)(0x4300CD28UL))
#define bM4_USH_HCINTMSK11_XFERCOMPLMSK                 *((volatile unsigned int*)(0x4300CD80UL))
#define bM4_USH_HCINTMSK11_CHHLTDMSK                    *((volatile unsigned int*)(0x4300CD84UL))
#define bM4_USH_HCINTMSK11_AHBERRMSK                    *((volatile unsigned int*)(0x4300CD88UL))
#define bM4_USH_HCINTMSK11_STALLMSK                     *((volatile unsigned int*)(0x4300CD8CUL))
#define bM4_USH_HCINTMSK11_NAKMSK                       *((volatile unsigned int*)(0x4300CD90UL))
#define bM4_USH_HCINTMSK11_ACKMSK                       *((volatile unsigned int*)(0x4300CD94UL))
#define bM4_USH_HCINTMSK11_NYETMSK                      *((volatile unsigned int*)(0x4300CD98UL))
#define bM4_USH_HCINTMSK11_XACTERRMSK                   *((volatile unsigned int*)(0x4300CD9CUL))
#define bM4_USH_HCINTMSK11_BBLERRMSK                    *((volatile unsigned int*)(0x4300CDA0UL))
#define bM4_USH_HCINTMSK11_FRMOVRUNMSK                  *((volatile unsigned int*)(0x4300CDA4UL))
#define bM4_USH_HCINTMSK11_DATATGLERRMSK                *((volatile unsigned int*)(0x4300CDA8UL))
#define bM4_USH_HCTSIZ11_XFERSIZE0                      *((volatile unsigned int*)(0x4300CE00UL))
#define bM4_USH_HCTSIZ11_XFERSIZE1                      *((volatile unsigned int*)(0x4300CE04UL))
#define bM4_USH_HCTSIZ11_XFERSIZE2                      *((volatile unsigned int*)(0x4300CE08UL))
#define bM4_USH_HCTSIZ11_XFERSIZE3                      *((volatile unsigned int*)(0x4300CE0CUL))
#define bM4_USH_HCTSIZ11_XFERSIZE4                      *((volatile unsigned int*)(0x4300CE10UL))
#define bM4_USH_HCTSIZ11_XFERSIZE5                      *((volatile unsigned int*)(0x4300CE14UL))
#define bM4_USH_HCTSIZ11_XFERSIZE6                      *((volatile unsigned int*)(0x4300CE18UL))
#define bM4_USH_HCTSIZ11_XFERSIZE7                      *((volatile unsigned int*)(0x4300CE1CUL))
#define bM4_USH_HCTSIZ11_XFERSIZE8                      *((volatile unsigned int*)(0x4300CE20UL))
#define bM4_USH_HCTSIZ11_XFERSIZE9                      *((volatile unsigned int*)(0x4300CE24UL))
#define bM4_USH_HCTSIZ11_XFERSIZE10                     *((volatile unsigned int*)(0x4300CE28UL))
#define bM4_USH_HCTSIZ11_XFERSIZE11                     *((volatile unsigned int*)(0x4300CE2CUL))
#define bM4_USH_HCTSIZ11_XFERSIZE12                     *((volatile unsigned int*)(0x4300CE30UL))
#define bM4_USH_HCTSIZ11_XFERSIZE13                     *((volatile unsigned int*)(0x4300CE34UL))
#define bM4_USH_HCTSIZ11_XFERSIZE14                     *((volatile unsigned int*)(0x4300CE38UL))
#define bM4_USH_HCTSIZ11_XFERSIZE15                     *((volatile unsigned int*)(0x4300CE3CUL))
#define bM4_USH_HCTSIZ11_XFERSIZE16                     *((volatile unsigned int*)(0x4300CE40UL))
#define bM4_USH_HCTSIZ11_XFERSIZE17                     *((volatile unsigned int*)(0x4300CE44UL))
#define bM4_USH_HCTSIZ11_XFERSIZE18                     *((volatile unsigned int*)(0x4300CE48UL))
#define bM4_USH_HCTSIZ11_PKTCNT0                        *((volatile unsigned int*)(0x4300CE4CUL))
#define bM4_USH_HCTSIZ11_PKTCNT1                        *((volatile unsigned int*)(0x4300CE50UL))
#define bM4_USH_HCTSIZ11_PKTCNT2                        *((volatile unsigned int*)(0x4300CE54UL))
#define bM4_USH_HCTSIZ11_PKTCNT3                        *((volatile unsigned int*)(0x4300CE58UL))
#define bM4_USH_HCTSIZ11_PKTCNT4                        *((volatile unsigned int*)(0x4300CE5CUL))
#define bM4_USH_HCTSIZ11_PKTCNT5                        *((volatile unsigned int*)(0x4300CE60UL))
#define bM4_USH_HCTSIZ11_PKTCNT6                        *((volatile unsigned int*)(0x4300CE64UL))
#define bM4_USH_HCTSIZ11_PKTCNT7                        *((volatile unsigned int*)(0x4300CE68UL))
#define bM4_USH_HCTSIZ11_PKTCNT8                        *((volatile unsigned int*)(0x4300CE6CUL))
#define bM4_USH_HCTSIZ11_PKTCNT9                        *((volatile unsigned int*)(0x4300CE70UL))
#define bM4_USH_HCTSIZ11_PID0                           *((volatile unsigned int*)(0x4300CE74UL))
#define bM4_USH_HCTSIZ11_PID1                           *((volatile unsigned int*)(0x4300CE78UL))
#define bM4_USH_HCTSIZ11_DOPNG                          *((volatile unsigned int*)(0x4300CE7CUL))
#define bM4_USH_HCCHAR12_MPS0                           *((volatile unsigned int*)(0x4300D000UL))
#define bM4_USH_HCCHAR12_MPS1                           *((volatile unsigned int*)(0x4300D004UL))
#define bM4_USH_HCCHAR12_MPS2                           *((volatile unsigned int*)(0x4300D008UL))
#define bM4_USH_HCCHAR12_MPS3                           *((volatile unsigned int*)(0x4300D00CUL))
#define bM4_USH_HCCHAR12_MPS4                           *((volatile unsigned int*)(0x4300D010UL))
#define bM4_USH_HCCHAR12_MPS5                           *((volatile unsigned int*)(0x4300D014UL))
#define bM4_USH_HCCHAR12_MPS6                           *((volatile unsigned int*)(0x4300D018UL))
#define bM4_USH_HCCHAR12_MPS7                           *((volatile unsigned int*)(0x4300D01CUL))
#define bM4_USH_HCCHAR12_MPS8                           *((volatile unsigned int*)(0x4300D020UL))
#define bM4_USH_HCCHAR12_MPS9                           *((volatile unsigned int*)(0x4300D024UL))
#define bM4_USH_HCCHAR12_MPS10                          *((volatile unsigned int*)(0x4300D028UL))
#define bM4_USH_HCCHAR12_EPNUM0                         *((volatile unsigned int*)(0x4300D02CUL))
#define bM4_USH_HCCHAR12_EPNUM1                         *((volatile unsigned int*)(0x4300D030UL))
#define bM4_USH_HCCHAR12_EPNUM2                         *((volatile unsigned int*)(0x4300D034UL))
#define bM4_USH_HCCHAR12_EPNUM3                         *((volatile unsigned int*)(0x4300D038UL))
#define bM4_USH_HCCHAR12_EPDIR                          *((volatile unsigned int*)(0x4300D03CUL))
#define bM4_USH_HCCHAR12_LSPDDEV                        *((volatile unsigned int*)(0x4300D044UL))
#define bM4_USH_HCCHAR12_EPTYPE0                        *((volatile unsigned int*)(0x4300D048UL))
#define bM4_USH_HCCHAR12_EPTYPE1                        *((volatile unsigned int*)(0x4300D04CUL))
#define bM4_USH_HCCHAR12_EC0                            *((volatile unsigned int*)(0x4300D050UL))
#define bM4_USH_HCCHAR12_EC1                            *((volatile unsigned int*)(0x4300D054UL))
#define bM4_USH_HCCHAR12_DEVADDR0                       *((volatile unsigned int*)(0x4300D058UL))
#define bM4_USH_HCCHAR12_DEVADDR1                       *((volatile unsigned int*)(0x4300D05CUL))
#define bM4_USH_HCCHAR12_DEVADDR2                       *((volatile unsigned int*)(0x4300D060UL))
#define bM4_USH_HCCHAR12_DEVADDR3                       *((volatile unsigned int*)(0x4300D064UL))
#define bM4_USH_HCCHAR12_DEVADDR4                       *((volatile unsigned int*)(0x4300D068UL))
#define bM4_USH_HCCHAR12_DEVADDR5                       *((volatile unsigned int*)(0x4300D06CUL))
#define bM4_USH_HCCHAR12_DEVADDR6                       *((volatile unsigned int*)(0x4300D070UL))
#define bM4_USH_HCCHAR12_ODDFRM                         *((volatile unsigned int*)(0x4300D074UL))
#define bM4_USH_HCCHAR12_CHDIS                          *((volatile unsigned int*)(0x4300D078UL))
#define bM4_USH_HCCHAR12_CHENA                          *((volatile unsigned int*)(0x4300D07CUL))
#define bM4_USH_HCSPLT12_PRTADDR0                       *((volatile unsigned int*)(0x4300D080UL))
#define bM4_USH_HCSPLT12_PRTADDR1                       *((volatile unsigned int*)(0x4300D084UL))
#define bM4_USH_HCSPLT12_PRTADDR2                       *((volatile unsigned int*)(0x4300D088UL))
#define bM4_USH_HCSPLT12_PRTADDR3                       *((volatile unsigned int*)(0x4300D08CUL))
#define bM4_USH_HCSPLT12_PRTADDR4                       *((volatile unsigned int*)(0x4300D090UL))
#define bM4_USH_HCSPLT12_PRTADDR5                       *((volatile unsigned int*)(0x4300D094UL))
#define bM4_USH_HCSPLT12_PRTADDR6                       *((volatile unsigned int*)(0x4300D098UL))
#define bM4_USH_HCSPLT12_HUBADDR0                       *((volatile unsigned int*)(0x4300D09CUL))
#define bM4_USH_HCSPLT12_HUBADDR1                       *((volatile unsigned int*)(0x4300D0A0UL))
#define bM4_USH_HCSPLT12_HUBADDR2                       *((volatile unsigned int*)(0x4300D0A4UL))
#define bM4_USH_HCSPLT12_HUBADDR3                       *((volatile unsigned int*)(0x4300D0A8UL))
#define bM4_USH_HCSPLT12_HUBADDR4                       *((volatile unsigned int*)(0x4300D0ACUL))
#define bM4_USH_HCSPLT12_HUBADDR5                       *((volatile unsigned int*)(0x4300D0B0UL))
#define bM4_USH_HCSPLT12_HUBADDR6                       *((volatile unsigned int*)(0x4300D0B4UL))
#define bM4_USH_HCSPLT12_XACTPOS0                       *((volatile unsigned int*)(0x4300D0B8UL))
#define bM4_USH_HCSPLT12_XACTPOS1                       *((volatile unsigned int*)(0x4300D0BCUL))
#define bM4_USH_HCSPLT12_COMPSPLT                       *((volatile unsigned int*)(0x4300D0C0UL))
#define bM4_USH_HCSPLT12_SPLTENA                        *((volatile unsigned int*)(0x4300D0FCUL))
#define bM4_USH_HCINT12_XFERCOMPL                       *((volatile unsigned int*)(0x4300D100UL))
#define bM4_USH_HCINT12_CHHLTD                          *((volatile unsigned int*)(0x4300D104UL))
#define bM4_USH_HCINT12_AHBERR                          *((volatile unsigned int*)(0x4300D108UL))
#define bM4_USH_HCINT12_STALL                           *((volatile unsigned int*)(0x4300D10CUL))
#define bM4_USH_HCINT12_NAK                             *((volatile unsigned int*)(0x4300D110UL))
#define bM4_USH_HCINT12_ACK                             *((volatile unsigned int*)(0x4300D114UL))
#define bM4_USH_HCINT12_NYET                            *((volatile unsigned int*)(0x4300D118UL))
#define bM4_USH_HCINT12_XACTERR                         *((volatile unsigned int*)(0x4300D11CUL))
#define bM4_USH_HCINT12_BBLERR                          *((volatile unsigned int*)(0x4300D120UL))
#define bM4_USH_HCINT12_FRMOVRUN                        *((volatile unsigned int*)(0x4300D124UL))
#define bM4_USH_HCINT12_DATATGLERR                      *((volatile unsigned int*)(0x4300D128UL))
#define bM4_USH_HCINTMSK12_XFERCOMPLMSK                 *((volatile unsigned int*)(0x4300D180UL))
#define bM4_USH_HCINTMSK12_CHHLTDMSK                    *((volatile unsigned int*)(0x4300D184UL))
#define bM4_USH_HCINTMSK12_AHBERRMSK                    *((volatile unsigned int*)(0x4300D188UL))
#define bM4_USH_HCINTMSK12_STALLMSK                     *((volatile unsigned int*)(0x4300D18CUL))
#define bM4_USH_HCINTMSK12_NAKMSK                       *((volatile unsigned int*)(0x4300D190UL))
#define bM4_USH_HCINTMSK12_ACKMSK                       *((volatile unsigned int*)(0x4300D194UL))
#define bM4_USH_HCINTMSK12_NYETMSK                      *((volatile unsigned int*)(0x4300D198UL))
#define bM4_USH_HCINTMSK12_XACTERRMSK                   *((volatile unsigned int*)(0x4300D19CUL))
#define bM4_USH_HCINTMSK12_BBLERRMSK                    *((volatile unsigned int*)(0x4300D1A0UL))
#define bM4_USH_HCINTMSK12_FRMOVRUNMSK                  *((volatile unsigned int*)(0x4300D1A4UL))
#define bM4_USH_HCINTMSK12_DATATGLERRMSK                *((volatile unsigned int*)(0x4300D1A8UL))
#define bM4_USH_HCTSIZ12_XFERSIZE0                      *((volatile unsigned int*)(0x4300D200UL))
#define bM4_USH_HCTSIZ12_XFERSIZE1                      *((volatile unsigned int*)(0x4300D204UL))
#define bM4_USH_HCTSIZ12_XFERSIZE2                      *((volatile unsigned int*)(0x4300D208UL))
#define bM4_USH_HCTSIZ12_XFERSIZE3                      *((volatile unsigned int*)(0x4300D20CUL))
#define bM4_USH_HCTSIZ12_XFERSIZE4                      *((volatile unsigned int*)(0x4300D210UL))
#define bM4_USH_HCTSIZ12_XFERSIZE5                      *((volatile unsigned int*)(0x4300D214UL))
#define bM4_USH_HCTSIZ12_XFERSIZE6                      *((volatile unsigned int*)(0x4300D218UL))
#define bM4_USH_HCTSIZ12_XFERSIZE7                      *((volatile unsigned int*)(0x4300D21CUL))
#define bM4_USH_HCTSIZ12_XFERSIZE8                      *((volatile unsigned int*)(0x4300D220UL))
#define bM4_USH_HCTSIZ12_XFERSIZE9                      *((volatile unsigned int*)(0x4300D224UL))
#define bM4_USH_HCTSIZ12_XFERSIZE10                     *((volatile unsigned int*)(0x4300D228UL))
#define bM4_USH_HCTSIZ12_XFERSIZE11                     *((volatile unsigned int*)(0x4300D22CUL))
#define bM4_USH_HCTSIZ12_XFERSIZE12                     *((volatile unsigned int*)(0x4300D230UL))
#define bM4_USH_HCTSIZ12_XFERSIZE13                     *((volatile unsigned int*)(0x4300D234UL))
#define bM4_USH_HCTSIZ12_XFERSIZE14                     *((volatile unsigned int*)(0x4300D238UL))
#define bM4_USH_HCTSIZ12_XFERSIZE15                     *((volatile unsigned int*)(0x4300D23CUL))
#define bM4_USH_HCTSIZ12_XFERSIZE16                     *((volatile unsigned int*)(0x4300D240UL))
#define bM4_USH_HCTSIZ12_XFERSIZE17                     *((volatile unsigned int*)(0x4300D244UL))
#define bM4_USH_HCTSIZ12_XFERSIZE18                     *((volatile unsigned int*)(0x4300D248UL))
#define bM4_USH_HCTSIZ12_PKTCNT0                        *((volatile unsigned int*)(0x4300D24CUL))
#define bM4_USH_HCTSIZ12_PKTCNT1                        *((volatile unsigned int*)(0x4300D250UL))
#define bM4_USH_HCTSIZ12_PKTCNT2                        *((volatile unsigned int*)(0x4300D254UL))
#define bM4_USH_HCTSIZ12_PKTCNT3                        *((volatile unsigned int*)(0x4300D258UL))
#define bM4_USH_HCTSIZ12_PKTCNT4                        *((volatile unsigned int*)(0x4300D25CUL))
#define bM4_USH_HCTSIZ12_PKTCNT5                        *((volatile unsigned int*)(0x4300D260UL))
#define bM4_USH_HCTSIZ12_PKTCNT6                        *((volatile unsigned int*)(0x4300D264UL))
#define bM4_USH_HCTSIZ12_PKTCNT7                        *((volatile unsigned int*)(0x4300D268UL))
#define bM4_USH_HCTSIZ12_PKTCNT8                        *((volatile unsigned int*)(0x4300D26CUL))
#define bM4_USH_HCTSIZ12_PKTCNT9                        *((volatile unsigned int*)(0x4300D270UL))
#define bM4_USH_HCTSIZ12_PID0                           *((volatile unsigned int*)(0x4300D274UL))
#define bM4_USH_HCTSIZ12_PID1                           *((volatile unsigned int*)(0x4300D278UL))
#define bM4_USH_HCTSIZ12_DOPNG                          *((volatile unsigned int*)(0x4300D27CUL))
#define bM4_USH_HCCHAR13_MPS0                           *((volatile unsigned int*)(0x4300D400UL))
#define bM4_USH_HCCHAR13_MPS1                           *((volatile unsigned int*)(0x4300D404UL))
#define bM4_USH_HCCHAR13_MPS2                           *((volatile unsigned int*)(0x4300D408UL))
#define bM4_USH_HCCHAR13_MPS3                           *((volatile unsigned int*)(0x4300D40CUL))
#define bM4_USH_HCCHAR13_MPS4                           *((volatile unsigned int*)(0x4300D410UL))
#define bM4_USH_HCCHAR13_MPS5                           *((volatile unsigned int*)(0x4300D414UL))
#define bM4_USH_HCCHAR13_MPS6                           *((volatile unsigned int*)(0x4300D418UL))
#define bM4_USH_HCCHAR13_MPS7                           *((volatile unsigned int*)(0x4300D41CUL))
#define bM4_USH_HCCHAR13_MPS8                           *((volatile unsigned int*)(0x4300D420UL))
#define bM4_USH_HCCHAR13_MPS9                           *((volatile unsigned int*)(0x4300D424UL))
#define bM4_USH_HCCHAR13_MPS10                          *((volatile unsigned int*)(0x4300D428UL))
#define bM4_USH_HCCHAR13_EPNUM0                         *((volatile unsigned int*)(0x4300D42CUL))
#define bM4_USH_HCCHAR13_EPNUM1                         *((volatile unsigned int*)(0x4300D430UL))
#define bM4_USH_HCCHAR13_EPNUM2                         *((volatile unsigned int*)(0x4300D434UL))
#define bM4_USH_HCCHAR13_EPNUM3                         *((volatile unsigned int*)(0x4300D438UL))
#define bM4_USH_HCCHAR13_EPDIR                          *((volatile unsigned int*)(0x4300D43CUL))
#define bM4_USH_HCCHAR13_LSPDDEV                        *((volatile unsigned int*)(0x4300D444UL))
#define bM4_USH_HCCHAR13_EPTYPE0                        *((volatile unsigned int*)(0x4300D448UL))
#define bM4_USH_HCCHAR13_EPTYPE1                        *((volatile unsigned int*)(0x4300D44CUL))
#define bM4_USH_HCCHAR13_EC0                            *((volatile unsigned int*)(0x4300D450UL))
#define bM4_USH_HCCHAR13_EC1                            *((volatile unsigned int*)(0x4300D454UL))
#define bM4_USH_HCCHAR13_DEVADDR0                       *((volatile unsigned int*)(0x4300D458UL))
#define bM4_USH_HCCHAR13_DEVADDR1                       *((volatile unsigned int*)(0x4300D45CUL))
#define bM4_USH_HCCHAR13_DEVADDR2                       *((volatile unsigned int*)(0x4300D460UL))
#define bM4_USH_HCCHAR13_DEVADDR3                       *((volatile unsigned int*)(0x4300D464UL))
#define bM4_USH_HCCHAR13_DEVADDR4                       *((volatile unsigned int*)(0x4300D468UL))
#define bM4_USH_HCCHAR13_DEVADDR5                       *((volatile unsigned int*)(0x4300D46CUL))
#define bM4_USH_HCCHAR13_DEVADDR6                       *((volatile unsigned int*)(0x4300D470UL))
#define bM4_USH_HCCHAR13_ODDFRM                         *((volatile unsigned int*)(0x4300D474UL))
#define bM4_USH_HCCHAR13_CHDIS                          *((volatile unsigned int*)(0x4300D478UL))
#define bM4_USH_HCCHAR13_CHENA                          *((volatile unsigned int*)(0x4300D47CUL))
#define bM4_USH_HCSPLT13_PRTADDR0                       *((volatile unsigned int*)(0x4300D480UL))
#define bM4_USH_HCSPLT13_PRTADDR1                       *((volatile unsigned int*)(0x4300D484UL))
