RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_HCSPLT13_PRTADDR2                       *((volatile unsigned int*)(0x4300D488UL))
#define bM4_USH_HCSPLT13_PRTADDR3                       *((volatile unsigned int*)(0x4300D48CUL))
#define bM4_USH_HCSPLT13_PRTADDR4                       *((volatile unsigned int*)(0x4300D490UL))
#define bM4_USH_HCSPLT13_PRTADDR5                       *((volatile unsigned int*)(0x4300D494UL))
#define bM4_USH_HCSPLT13_PRTADDR6                       *((volatile unsigned int*)(0x4300D498UL))
#define bM4_USH_HCSPLT13_HUBADDR0                       *((volatile unsigned int*)(0x4300D49CUL))
#define bM4_USH_HCSPLT13_HUBADDR1                       *((volatile unsigned int*)(0x4300D4A0UL))
#define bM4_USH_HCSPLT13_HUBADDR2                       *((volatile unsigned int*)(0x4300D4A4UL))
#define bM4_USH_HCSPLT13_HUBADDR3                       *((volatile unsigned int*)(0x4300D4A8UL))
#define bM4_USH_HCSPLT13_HUBADDR4                       *((volatile unsigned int*)(0x4300D4ACUL))
#define bM4_USH_HCSPLT13_HUBADDR5                       *((volatile unsigned int*)(0x4300D4B0UL))
#define bM4_USH_HCSPLT13_HUBADDR6                       *((volatile unsigned int*)(0x4300D4B4UL))
#define bM4_USH_HCSPLT13_XACTPOS0                       *((volatile unsigned int*)(0x4300D4B8UL))
#define bM4_USH_HCSPLT13_XACTPOS1                       *((volatile unsigned int*)(0x4300D4BCUL))
#define bM4_USH_HCSPLT13_COMPSPLT                       *((volatile unsigned int*)(0x4300D4C0UL))
#define bM4_USH_HCSPLT13_SPLTENA                        *((volatile unsigned int*)(0x4300D4FCUL))
#define bM4_USH_HCINT13_XFERCOMPL                       *((volatile unsigned int*)(0x4300D500UL))
#define bM4_USH_HCINT13_CHHLTD                          *((volatile unsigned int*)(0x4300D504UL))
#define bM4_USH_HCINT13_AHBERR                          *((volatile unsigned int*)(0x4300D508UL))
#define bM4_USH_HCINT13_STALL                           *((volatile unsigned int*)(0x4300D50CUL))
#define bM4_USH_HCINT13_NAK                             *((volatile unsigned int*)(0x4300D510UL))
#define bM4_USH_HCINT13_ACK                             *((volatile unsigned int*)(0x4300D514UL))
#define bM4_USH_HCINT13_NYET                            *((volatile unsigned int*)(0x4300D518UL))
#define bM4_USH_HCINT13_XACTERR                         *((volatile unsigned int*)(0x4300D51CUL))
#define bM4_USH_HCINT13_BBLERR                          *((volatile unsigned int*)(0x4300D520UL))
#define bM4_USH_HCINT13_FRMOVRUN                        *((volatile unsigned int*)(0x4300D524UL))
#define bM4_USH_HCINT13_DATATGLERR                      *((volatile unsigned int*)(0x4300D528UL))
#define bM4_USH_HCINTMSK13_XFERCOMPLMSK                 *((volatile unsigned int*)(0x4300D580UL))
#define bM4_USH_HCINTMSK13_CHHLTDMSK                    *((volatile unsigned int*)(0x4300D584UL))
#define bM4_USH_HCINTMSK13_AHBERRMSK                    *((volatile unsigned int*)(0x4300D588UL))
#define bM4_USH_HCINTMSK13_STALLMSK                     *((volatile unsigned int*)(0x4300D58CUL))
#define bM4_USH_HCINTMSK13_NAKMSK                       *((volatile unsigned int*)(0x4300D590UL))
#define bM4_USH_HCINTMSK13_ACKMSK                       *((volatile unsigned int*)(0x4300D594UL))
#define bM4_USH_HCINTMSK13_NYETMSK                      *((volatile unsigned int*)(0x4300D598UL))
#define bM4_USH_HCINTMSK13_XACTERRMSK                   *((volatile unsigned int*)(0x4300D59CUL))
#define bM4_USH_HCINTMSK13_BBLERRMSK                    *((volatile unsigned int*)(0x4300D5A0UL))
#define bM4_USH_HCINTMSK13_FRMOVRUNMSK                  *((volatile unsigned int*)(0x4300D5A4UL))
#define bM4_USH_HCINTMSK13_DATATGLERRMSK                *((volatile unsigned int*)(0x4300D5A8UL))
#define bM4_USH_HCTSIZ13_XFERSIZE0                      *((volatile unsigned int*)(0x4300D600UL))
#define bM4_USH_HCTSIZ13_XFERSIZE1                      *((volatile unsigned int*)(0x4300D604UL))
#define bM4_USH_HCTSIZ13_XFERSIZE2                      *((volatile unsigned int*)(0x4300D608UL))
#define bM4_USH_HCTSIZ13_XFERSIZE3                      *((volatile unsigned int*)(0x4300D60CUL))
#define bM4_USH_HCTSIZ13_XFERSIZE4                      *((volatile unsigned int*)(0x4300D610UL))
#define bM4_USH_HCTSIZ13_XFERSIZE5                      *((volatile unsigned int*)(0x4300D614UL))
#define bM4_USH_HCTSIZ13_XFERSIZE6                      *((volatile unsigned int*)(0x4300D618UL))
#define bM4_USH_HCTSIZ13_XFERSIZE7                      *((volatile unsigned int*)(0x4300D61CUL))
#define bM4_USH_HCTSIZ13_XFERSIZE8                      *((volatile unsigned int*)(0x4300D620UL))
#define bM4_USH_HCTSIZ13_XFERSIZE9                      *((volatile unsigned int*)(0x4300D624UL))
#define bM4_USH_HCTSIZ13_XFERSIZE10                     *((volatile unsigned int*)(0x4300D628UL))
#define bM4_USH_HCTSIZ13_XFERSIZE11                     *((volatile unsigned int*)(0x4300D62CUL))
#define bM4_USH_HCTSIZ13_XFERSIZE12                     *((volatile unsigned int*)(0x4300D630UL))
#define bM4_USH_HCTSIZ13_XFERSIZE13                     *((volatile unsigned int*)(0x4300D634UL))
#define bM4_USH_HCTSIZ13_XFERSIZE14                     *((volatile unsigned int*)(0x4300D638UL))
#define bM4_USH_HCTSIZ13_XFERSIZE15                     *((volatile unsigned int*)(0x4300D63CUL))
#define bM4_USH_HCTSIZ13_XFERSIZE16                     *((volatile unsigned int*)(0x4300D640UL))
#define bM4_USH_HCTSIZ13_XFERSIZE17                     *((volatile unsigned int*)(0x4300D644UL))
#define bM4_USH_HCTSIZ13_XFERSIZE18                     *((volatile unsigned int*)(0x4300D648UL))
#define bM4_USH_HCTSIZ13_PKTCNT0                        *((volatile unsigned int*)(0x4300D64CUL))
#define bM4_USH_HCTSIZ13_PKTCNT1                        *((volatile unsigned int*)(0x4300D650UL))
#define bM4_USH_HCTSIZ13_PKTCNT2                        *((volatile unsigned int*)(0x4300D654UL))
#define bM4_USH_HCTSIZ13_PKTCNT3                        *((volatile unsigned int*)(0x4300D658UL))
#define bM4_USH_HCTSIZ13_PKTCNT4                        *((volatile unsigned int*)(0x4300D65CUL))
#define bM4_USH_HCTSIZ13_PKTCNT5                        *((volatile unsigned int*)(0x4300D660UL))
#define bM4_USH_HCTSIZ13_PKTCNT6                        *((volatile unsigned int*)(0x4300D664UL))
#define bM4_USH_HCTSIZ13_PKTCNT7                        *((volatile unsigned int*)(0x4300D668UL))
#define bM4_USH_HCTSIZ13_PKTCNT8                        *((volatile unsigned int*)(0x4300D66CUL))
#define bM4_USH_HCTSIZ13_PKTCNT9                        *((volatile unsigned int*)(0x4300D670UL))
#define bM4_USH_HCTSIZ13_PID0                           *((volatile unsigned int*)(0x4300D674UL))
#define bM4_USH_HCTSIZ13_PID1                           *((volatile unsigned int*)(0x4300D678UL))
#define bM4_USH_HCTSIZ13_DOPNG                          *((volatile unsigned int*)(0x4300D67CUL))
#define bM4_USH_HCCHAR14_MPS0                           *((volatile unsigned int*)(0x4300D800UL))
#define bM4_USH_HCCHAR14_MPS1                           *((volatile unsigned int*)(0x4300D804UL))
#define bM4_USH_HCCHAR14_MPS2                           *((volatile unsigned int*)(0x4300D808UL))
#define bM4_USH_HCCHAR14_MPS3                           *((volatile unsigned int*)(0x4300D80CUL))
#define bM4_USH_HCCHAR14_MPS4                           *((volatile unsigned int*)(0x4300D810UL))
#define bM4_USH_HCCHAR14_MPS5                           *((volatile unsigned int*)(0x4300D814UL))
#define bM4_USH_HCCHAR14_MPS6                           *((volatile unsigned int*)(0x4300D818UL))
#define bM4_USH_HCCHAR14_MPS7                           *((volatile unsigned int*)(0x4300D81CUL))
#define bM4_USH_HCCHAR14_MPS8                           *((volatile unsigned int*)(0x4300D820UL))
#define bM4_USH_HCCHAR14_MPS9                           *((volatile unsigned int*)(0x4300D824UL))
#define bM4_USH_HCCHAR14_MPS10                          *((volatile unsigned int*)(0x4300D828UL))
#define bM4_USH_HCCHAR14_EPNUM0                         *((volatile unsigned int*)(0x4300D82CUL))
#define bM4_USH_HCCHAR14_EPNUM1                         *((volatile unsigned int*)(0x4300D830UL))
#define bM4_USH_HCCHAR14_EPNUM2                         *((volatile unsigned int*)(0x4300D834UL))
#define bM4_USH_HCCHAR14_EPNUM3                         *((volatile unsigned int*)(0x4300D838UL))
#define bM4_USH_HCCHAR14_EPDIR                          *((volatile unsigned int*)(0x4300D83CUL))
#define bM4_USH_HCCHAR14_LSPDDEV                        *((volatile unsigned int*)(0x4300D844UL))
#define bM4_USH_HCCHAR14_EPTYPE0                        *((volatile unsigned int*)(0x4300D848UL))
#define bM4_USH_HCCHAR14_EPTYPE1                        *((volatile unsigned int*)(0x4300D84CUL))
#define bM4_USH_HCCHAR14_EC0                            *((volatile unsigned int*)(0x4300D850UL))
#define bM4_USH_HCCHAR14_EC1                            *((volatile unsigned int*)(0x4300D854UL))
#define bM4_USH_HCCHAR14_DEVADDR0                       *((volatile unsigned int*)(0x4300D858UL))
#define bM4_USH_HCCHAR14_DEVADDR1                       *((volatile unsigned int*)(0x4300D85CUL))
#define bM4_USH_HCCHAR14_DEVADDR2                       *((volatile unsigned int*)(0x4300D860UL))
#define bM4_USH_HCCHAR14_DEVADDR3                       *((volatile unsigned int*)(0x4300D864UL))
#define bM4_USH_HCCHAR14_DEVADDR4                       *((volatile unsigned int*)(0x4300D868UL))
#define bM4_USH_HCCHAR14_DEVADDR5                       *((volatile unsigned int*)(0x4300D86CUL))
#define bM4_USH_HCCHAR14_DEVADDR6                       *((volatile unsigned int*)(0x4300D870UL))
#define bM4_USH_HCCHAR14_ODDFRM                         *((volatile unsigned int*)(0x4300D874UL))
#define bM4_USH_HCCHAR14_CHDIS                          *((volatile unsigned int*)(0x4300D878UL))
#define bM4_USH_HCCHAR14_CHENA                          *((volatile unsigned int*)(0x4300D87CUL))
#define bM4_USH_HCSPLT14_PRTADDR0                       *((volatile unsigned int*)(0x4300D880UL))
#define bM4_USH_HCSPLT14_PRTADDR1                       *((volatile unsigned int*)(0x4300D884UL))
#define bM4_USH_HCSPLT14_PRTADDR2                       *((volatile unsigned int*)(0x4300D888UL))
#define bM4_USH_HCSPLT14_PRTADDR3                       *((volatile unsigned int*)(0x4300D88CUL))
#define bM4_USH_HCSPLT14_PRTADDR4                       *((volatile unsigned int*)(0x4300D890UL))
#define bM4_USH_HCSPLT14_PRTADDR5                       *((volatile unsigned int*)(0x4300D894UL))
#define bM4_USH_HCSPLT14_PRTADDR6                       *((volatile unsigned int*)(0x4300D898UL))
#define bM4_USH_HCSPLT14_HUBADDR0                       *((volatile unsigned int*)(0x4300D89CUL))
#define bM4_USH_HCSPLT14_HUBADDR1                       *((volatile unsigned int*)(0x4300D8A0UL))
#define bM4_USH_HCSPLT14_HUBADDR2                       *((volatile unsigned int*)(0x4300D8A4UL))
#define bM4_USH_HCSPLT14_HUBADDR3                       *((volatile unsigned int*)(0x4300D8A8UL))
#define bM4_USH_HCSPLT14_HUBADDR4                       *((volatile unsigned int*)(0x4300D8ACUL))
#define bM4_USH_HCSPLT14_HUBADDR5                       *((volatile unsigned int*)(0x4300D8B0UL))
#define bM4_USH_HCSPLT14_HUBADDR6                       *((volatile unsigned int*)(0x4300D8B4UL))
#define bM4_USH_HCSPLT14_XACTPOS0                       *((volatile unsigned int*)(0x4300D8B8UL))
#define bM4_USH_HCSPLT14_XACTPOS1                       *((volatile unsigned int*)(0x4300D8BCUL))
#define bM4_USH_HCSPLT14_COMPSPLT                       *((volatile unsigned int*)(0x4300D8C0UL))
#define bM4_USH_HCSPLT14_SPLTENA                        *((volatile unsigned int*)(0x4300D8FCUL))
#define bM4_USH_HCINT14_XFERCOMPL                       *((volatile unsigned int*)(0x4300D900UL))
#define bM4_USH_HCINT14_CHHLTD                          *((volatile unsigned int*)(0x4300D904UL))
#define bM4_USH_HCINT14_AHBERR                          *((volatile unsigned int*)(0x4300D908UL))
#define bM4_USH_HCINT14_STALL                           *((volatile unsigned int*)(0x4300D90CUL))
#define bM4_USH_HCINT14_NAK                             *((volatile unsigned int*)(0x4300D910UL))
#define bM4_USH_HCINT14_ACK                             *((volatile unsigned int*)(0x4300D914UL))
#define bM4_USH_HCINT14_NYET                            *((volatile unsigned int*)(0x4300D918UL))
#define bM4_USH_HCINT14_XACTERR                         *((volatile unsigned int*)(0x4300D91CUL))
#define bM4_USH_HCINT14_BBLERR                          *((volatile unsigned int*)(0x4300D920UL))
#define bM4_USH_HCINT14_FRMOVRUN                        *((volatile unsigned int*)(0x4300D924UL))
#define bM4_USH_HCINT14_DATATGLERR                      *((volatile unsigned int*)(0x4300D928UL))
#define bM4_USH_HCINTMSK14_XFERCOMPLMSK                 *((volatile unsigned int*)(0x4300D980UL))
#define bM4_USH_HCINTMSK14_CHHLTDMSK                    *((volatile unsigned int*)(0x4300D984UL))
#define bM4_USH_HCINTMSK14_AHBERRMSK                    *((volatile unsigned int*)(0x4300D988UL))
#define bM4_USH_HCINTMSK14_STALLMSK                     *((volatile unsigned int*)(0x4300D98CUL))
#define bM4_USH_HCINTMSK14_NAKMSK                       *((volatile unsigned int*)(0x4300D990UL))
#define bM4_USH_HCINTMSK14_ACKMSK                       *((volatile unsigned int*)(0x4300D994UL))
#define bM4_USH_HCINTMSK14_NYETMSK                      *((volatile unsigned int*)(0x4300D998UL))
#define bM4_USH_HCINTMSK14_XACTERRMSK                   *((volatile unsigned int*)(0x4300D99CUL))
#define bM4_USH_HCINTMSK14_BBLERRMSK                    *((volatile unsigned int*)(0x4300D9A0UL))
#define bM4_USH_HCINTMSK14_FRMOVRUNMSK                  *((volatile unsigned int*)(0x4300D9A4UL))
#define bM4_USH_HCINTMSK14_DATATGLERRMSK                *((volatile unsigned int*)(0x4300D9A8UL))
#define bM4_USH_HCTSIZ14_XFERSIZE0                      *((volatile unsigned int*)(0x4300DA00UL))
#define bM4_USH_HCTSIZ14_XFERSIZE1                      *((volatile unsigned int*)(0x4300DA04UL))
#define bM4_USH_HCTSIZ14_XFERSIZE2                      *((volatile unsigned int*)(0x4300DA08UL))
#define bM4_USH_HCTSIZ14_XFERSIZE3                      *((volatile unsigned int*)(0x4300DA0CUL))
#define bM4_USH_HCTSIZ14_XFERSIZE4                      *((volatile unsigned int*)(0x4300DA10UL))
#define bM4_USH_HCTSIZ14_XFERSIZE5                      *((volatile unsigned int*)(0x4300DA14UL))
#define bM4_USH_HCTSIZ14_XFERSIZE6                      *((volatile unsigned int*)(0x4300DA18UL))
#define bM4_USH_HCTSIZ14_XFERSIZE7                      *((volatile unsigned int*)(0x4300DA1CUL))
#define bM4_USH_HCTSIZ14_XFERSIZE8                      *((volatile unsigned int*)(0x4300DA20UL))
#define bM4_USH_HCTSIZ14_XFERSIZE9                      *((volatile unsigned int*)(0x4300DA24UL))
#define bM4_USH_HCTSIZ14_XFERSIZE10                     *((volatile unsigned int*)(0x4300DA28UL))
#define bM4_USH_HCTSIZ14_XFERSIZE11                     *((volatile unsigned int*)(0x4300DA2CUL))
#define bM4_USH_HCTSIZ14_XFERSIZE12                     *((volatile unsigned int*)(0x4300DA30UL))
#define bM4_USH_HCTSIZ14_XFERSIZE13                     *((volatile unsigned int*)(0x4300DA34UL))
#define bM4_USH_HCTSIZ14_XFERSIZE14                     *((volatile unsigned int*)(0x4300DA38UL))
#define bM4_USH_HCTSIZ14_XFERSIZE15                     *((volatile unsigned int*)(0x4300DA3CUL))
#define bM4_USH_HCTSIZ14_XFERSIZE16                     *((volatile unsigned int*)(0x4300DA40UL))
#define bM4_USH_HCTSIZ14_XFERSIZE17                     *((volatile unsigned int*)(0x4300DA44UL))
#define bM4_USH_HCTSIZ14_XFERSIZE18                     *((volatile unsigned int*)(0x4300DA48UL))
#define bM4_USH_HCTSIZ14_PKTCNT0                        *((volatile unsigned int*)(0x4300DA4CUL))
#define bM4_USH_HCTSIZ14_PKTCNT1                        *((volatile unsigned int*)(0x4300DA50UL))
#define bM4_USH_HCTSIZ14_PKTCNT2                        *((volatile unsigned int*)(0x4300DA54UL))
#define bM4_USH_HCTSIZ14_PKTCNT3                        *((volatile unsigned int*)(0x4300DA58UL))
#define bM4_USH_HCTSIZ14_PKTCNT4                        *((volatile unsigned int*)(0x4300DA5CUL))
#define bM4_USH_HCTSIZ14_PKTCNT5                        *((volatile unsigned int*)(0x4300DA60UL))
#define bM4_USH_HCTSIZ14_PKTCNT6                        *((volatile unsigned int*)(0x4300DA64UL))
#define bM4_USH_HCTSIZ14_PKTCNT7                        *((volatile unsigned int*)(0x4300DA68UL))
#define bM4_USH_HCTSIZ14_PKTCNT8                        *((volatile unsigned int*)(0x4300DA6CUL))
#define bM4_USH_HCTSIZ14_PKTCNT9                        *((volatile unsigned int*)(0x4300DA70UL))
#define bM4_USH_HCTSIZ14_PID0                           *((volatile unsigned int*)(0x4300DA74UL))
#define bM4_USH_HCTSIZ14_PID1                           *((volatile unsigned int*)(0x4300DA78UL))
#define bM4_USH_HCTSIZ14_DOPNG                          *((volatile unsigned int*)(0x4300DA7CUL))
#define bM4_USH_HCCHAR15_MPS0                           *((volatile unsigned int*)(0x4300DC00UL))
#define bM4_USH_HCCHAR15_MPS1                           *((volatile unsigned int*)(0x4300DC04UL))
#define bM4_USH_HCCHAR15_MPS2                           *((volatile unsigned int*)(0x4300DC08UL))
#define bM4_USH_HCCHAR15_MPS3                           *((volatile unsigned int*)(0x4300DC0CUL))
#define bM4_USH_HCCHAR15_MPS4                           *((volatile unsigned int*)(0x4300DC10UL))
#define bM4_USH_HCCHAR15_MPS5                           *((volatile unsigned int*)(0x4300DC14UL))
#define bM4_USH_HCCHAR15_MPS6                           *((volatile unsigned int*)(0x4300DC18UL))
#define bM4_USH_HCCHAR15_MPS7                           *((volatile unsigned int*)(0x4300DC1CUL))
#define bM4_USH_HCCHAR15_MPS8                           *((volatile unsigned int*)(0x4300DC20UL))
#define bM4_USH_HCCHAR15_MPS9                           *((volatile unsigned int*)(0x4300DC24UL))
#define bM4_USH_HCCHAR15_MPS10                          *((volatile unsigned int*)(0x4300DC28UL))
#define bM4_USH_HCCHAR15_EPNUM0                         *((volatile unsigned int*)(0x4300DC2CUL))
#define bM4_USH_HCCHAR15_EPNUM1                         *((volatile unsigned int*)(0x4300DC30UL))
#define bM4_USH_HCCHAR15_EPNUM2                         *((volatile unsigned int*)(0x4300DC34UL))
#define bM4_USH_HCCHAR15_EPNUM3                         *((volatile unsigned int*)(0x4300DC38UL))
#define bM4_USH_HCCHAR15_EPDIR                          *((volatile unsigned int*)(0x4300DC3CUL))
#define bM4_USH_HCCHAR15_LSPDDEV                        *((volatile unsigned int*)(0x4300DC44UL))
#define bM4_USH_HCCHAR15_EPTYPE0                        *((volatile unsigned int*)(0x4300DC48UL))
#define bM4_USH_HCCHAR15_EPTYPE1                        *((volatile unsigned int*)(0x4300DC4CUL))
#define bM4_USH_HCCHAR15_EC0                            *((volatile unsigned int*)(0x4300DC50UL))
#define bM4_USH_HCCHAR15_EC1                            *((volatile unsigned int*)(0x4300DC54UL))
#define bM4_USH_HCCHAR15_DEVADDR0                       *((volatile unsigned int*)(0x4300DC58UL))
#define bM4_USH_HCCHAR15_DEVADDR1                       *((volatile unsigned int*)(0x4300DC5CUL))
#define bM4_USH_HCCHAR15_DEVADDR2                       *((volatile unsigned int*)(0x4300DC60UL))
#define bM4_USH_HCCHAR15_DEVADDR3                       *((volatile unsigned int*)(0x4300DC64UL))
#define bM4_USH_HCCHAR15_DEVADDR4                       *((volatile unsigned int*)(0x4300DC68UL))
#define bM4_USH_HCCHAR15_DEVADDR5                       *((volatile unsigned int*)(0x4300DC6CUL))
#define bM4_USH_HCCHAR15_DEVADDR6                       *((volatile unsigned int*)(0x4300DC70UL))
#define bM4_USH_HCCHAR15_ODDFRM                         *((volatile unsigned int*)(0x4300DC74UL))
#define bM4_USH_HCCHAR15_CHDIS                          *((volatile unsigned int*)(0x4300DC78UL))
#define bM4_USH_HCCHAR15_CHENA                          *((volatile unsigned int*)(0x4300DC7CUL))
#define bM4_USH_HCSPLT15_PRTADDR0                       *((volatile unsigned int*)(0x4300DC80UL))
#define bM4_USH_HCSPLT15_PRTADDR1                       *((volatile unsigned int*)(0x4300DC84UL))
#define bM4_USH_HCSPLT15_PRTADDR2                       *((volatile unsigned int*)(0x4300DC88UL))
#define bM4_USH_HCSPLT15_PRTADDR3                       *((volatile unsigned int*)(0x4300DC8CUL))
#define bM4_USH_HCSPLT15_PRTADDR4                       *((volatile unsigned int*)(0x4300DC90UL))
#define bM4_USH_HCSPLT15_PRTADDR5                       *((volatile unsigned int*)(0x4300DC94UL))
#define bM4_USH_HCSPLT15_PRTADDR6                       *((volatile unsigned int*)(0x4300DC98UL))
#define bM4_USH_HCSPLT15_HUBADDR0                       *((volatile unsigned int*)(0x4300DC9CUL))
#define bM4_USH_HCSPLT15_HUBADDR1                       *((volatile unsigned int*)(0x4300DCA0UL))
#define bM4_USH_HCSPLT15_HUBADDR2                       *((volatile unsigned int*)(0x4300DCA4UL))
#define bM4_USH_HCSPLT15_HUBADDR3                       *((volatile unsigned int*)(0x4300DCA8UL))
#define bM4_USH_HCSPLT15_HUBADDR4                       *((volatile unsigned int*)(0x4300DCACUL))
#define bM4_USH_HCSPLT15_HUBADDR5                       *((volatile unsigned int*)(0x4300DCB0UL))
#define bM4_USH_HCSPLT15_HUBADDR6                       *((volatile unsigned int*)(0x4300DCB4UL))
#define bM4_USH_HCSPLT15_XACTPOS0                       *((volatile unsigned int*)(0x4300DCB8UL))
#define bM4_USH_HCSPLT15_XACTPOS1                       *((volatile unsigned int*)(0x4300DCBCUL))
#define bM4_USH_HCSPLT15_COMPSPLT                       *((volatile unsigned int*)(0x4300DCC0UL))
#define bM4_USH_HCSPLT15_SPLTENA                        *((volatile unsigned int*)(0x4300DCFCUL))
#define bM4_USH_HCINT15_XFERCOMPL                       *((volatile unsigned int*)(0x4300DD00UL))
#define bM4_USH_HCINT15_CHHLTD                          *((volatile unsigned int*)(0x4300DD04UL))
#define bM4_USH_HCINT15_AHBERR                          *((volatile unsigned int*)(0x4300DD08UL))
#define bM4_USH_HCINT15_STALL                           *((volatile unsigned int*)(0x4300DD0CUL))
#define bM4_USH_HCINT15_NAK                             *((volatile unsigned int*)(0x4300DD10UL))
#define bM4_USH_HCINT15_ACK                             *((volatile unsigned int*)(0x4300DD14UL))
#define bM4_USH_HCINT15_NYET                            *((volatile unsigned int*)(0x4300DD18UL))
#define bM4_USH_HCINT15_XACTERR                         *((volatile unsigned int*)(0x4300DD1CUL))
#define bM4_USH_HCINT15_BBLERR                          *((volatile unsigned int*)(0x4300DD20UL))
#define bM4_USH_HCINT15_FRMOVRUN                        *((volatile unsigned int*)(0x4300DD24UL))
#define bM4_USH_HCINT15_DATATGLERR                      *((volatile unsigned int*)(0x4300DD28UL))
#define bM4_USH_HCINTMSK15_XFERCOMPLMSK                 *((volatile unsigned int*)(0x4300DD80UL))
#define bM4_USH_HCINTMSK15_CHHLTDMSK                    *((volatile unsigned int*)(0x4300DD84UL))
#define bM4_USH_HCINTMSK15_AHBERRMSK                    *((volatile unsigned int*)(0x4300DD88UL))
#define bM4_USH_HCINTMSK15_STALLMSK                     *((volatile unsigned int*)(0x4300DD8CUL))
#define bM4_USH_HCINTMSK15_NAKMSK                       *((volatile unsigned int*)(0x4300DD90UL))
#define bM4_USH_HCINTMSK15_ACKMSK                       *((volatile unsigned int*)(0x4300DD94UL))
#define bM4_USH_HCINTMSK15_NYETMSK                      *((volatile unsigned int*)(0x4300DD98UL))
#define bM4_USH_HCINTMSK15_XACTERRMSK                   *((volatile unsigned int*)(0x4300DD9CUL))
#define bM4_USH_HCINTMSK15_BBLERRMSK                    *((volatile unsigned int*)(0x4300DDA0UL))
#define bM4_USH_HCINTMSK15_FRMOVRUNMSK                  *((volatile unsigned int*)(0x4300DDA4UL))
#define bM4_USH_HCINTMSK15_DATATGLERRMSK                *((volatile unsigned int*)(0x4300DDA8UL))
