RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_HCTSIZ15_XFERSIZE0                      *((volatile unsigned int*)(0x4300DE00UL))
#define bM4_USH_HCTSIZ15_XFERSIZE1                      *((volatile unsigned int*)(0x4300DE04UL))
#define bM4_USH_HCTSIZ15_XFERSIZE2                      *((volatile unsigned int*)(0x4300DE08UL))
#define bM4_USH_HCTSIZ15_XFERSIZE3                      *((volatile unsigned int*)(0x4300DE0CUL))
#define bM4_USH_HCTSIZ15_XFERSIZE4                      *((volatile unsigned int*)(0x4300DE10UL))
#define bM4_USH_HCTSIZ15_XFERSIZE5                      *((volatile unsigned int*)(0x4300DE14UL))
#define bM4_USH_HCTSIZ15_XFERSIZE6                      *((volatile unsigned int*)(0x4300DE18UL))
#define bM4_USH_HCTSIZ15_XFERSIZE7                      *((volatile unsigned int*)(0x4300DE1CUL))
#define bM4_USH_HCTSIZ15_XFERSIZE8                      *((volatile unsigned int*)(0x4300DE20UL))
#define bM4_USH_HCTSIZ15_XFERSIZE9                      *((volatile unsigned int*)(0x4300DE24UL))
#define bM4_USH_HCTSIZ15_XFERSIZE10                     *((volatile unsigned int*)(0x4300DE28UL))
#define bM4_USH_HCTSIZ15_XFERSIZE11                     *((volatile unsigned int*)(0x4300DE2CUL))
#define bM4_USH_HCTSIZ15_XFERSIZE12                     *((volatile unsigned int*)(0x4300DE30UL))
#define bM4_USH_HCTSIZ15_XFERSIZE13                     *((volatile unsigned int*)(0x4300DE34UL))
#define bM4_USH_HCTSIZ15_XFERSIZE14                     *((volatile unsigned int*)(0x4300DE38UL))
#define bM4_USH_HCTSIZ15_XFERSIZE15                     *((volatile unsigned int*)(0x4300DE3CUL))
#define bM4_USH_HCTSIZ15_XFERSIZE16                     *((volatile unsigned int*)(0x4300DE40UL))
#define bM4_USH_HCTSIZ15_XFERSIZE17                     *((volatile unsigned int*)(0x4300DE44UL))
#define bM4_USH_HCTSIZ15_XFERSIZE18                     *((volatile unsigned int*)(0x4300DE48UL))
#define bM4_USH_HCTSIZ15_PKTCNT0                        *((volatile unsigned int*)(0x4300DE4CUL))
#define bM4_USH_HCTSIZ15_PKTCNT1                        *((volatile unsigned int*)(0x4300DE50UL))
#define bM4_USH_HCTSIZ15_PKTCNT2                        *((volatile unsigned int*)(0x4300DE54UL))
#define bM4_USH_HCTSIZ15_PKTCNT3                        *((volatile unsigned int*)(0x4300DE58UL))
#define bM4_USH_HCTSIZ15_PKTCNT4                        *((volatile unsigned int*)(0x4300DE5CUL))
#define bM4_USH_HCTSIZ15_PKTCNT5                        *((volatile unsigned int*)(0x4300DE60UL))
#define bM4_USH_HCTSIZ15_PKTCNT6                        *((volatile unsigned int*)(0x4300DE64UL))
#define bM4_USH_HCTSIZ15_PKTCNT7                        *((volatile unsigned int*)(0x4300DE68UL))
#define bM4_USH_HCTSIZ15_PKTCNT8                        *((volatile unsigned int*)(0x4300DE6CUL))
#define bM4_USH_HCTSIZ15_PKTCNT9                        *((volatile unsigned int*)(0x4300DE70UL))
#define bM4_USH_HCTSIZ15_PID0                           *((volatile unsigned int*)(0x4300DE74UL))
#define bM4_USH_HCTSIZ15_PID1                           *((volatile unsigned int*)(0x4300DE78UL))
#define bM4_USH_HCTSIZ15_DOPNG                          *((volatile unsigned int*)(0x4300DE7CUL))
#define bM4_USH_DCFG_DEVSPD0                            *((volatile unsigned int*)(0x43010000UL))
#define bM4_USH_DCFG_DEVSPD1                            *((volatile unsigned int*)(0x43010004UL))
#define bM4_USH_DCFG_NZSTSOUTHSHK                       *((volatile unsigned int*)(0x43010008UL))
#define bM4_USH_DCFG_ENA32KHZSUSP                       *((volatile unsigned int*)(0x4301000CUL))
#define bM4_USH_DCFG_DEVADDR0                           *((volatile unsigned int*)(0x43010010UL))
#define bM4_USH_DCFG_DEVADDR1                           *((volatile unsigned int*)(0x43010014UL))
#define bM4_USH_DCFG_DEVADDR2                           *((volatile unsigned int*)(0x43010018UL))
#define bM4_USH_DCFG_DEVADDR3                           *((volatile unsigned int*)(0x4301001CUL))
#define bM4_USH_DCFG_DEVADDR4                           *((volatile unsigned int*)(0x43010020UL))
#define bM4_USH_DCFG_DEVADDR5                           *((volatile unsigned int*)(0x43010024UL))
#define bM4_USH_DCFG_DEVADDR6                           *((volatile unsigned int*)(0x43010028UL))
#define bM4_USH_DCFG_PERFRINT0                          *((volatile unsigned int*)(0x4301002CUL))
#define bM4_USH_DCFG_PERFRINT1                          *((volatile unsigned int*)(0x43010030UL))
#define bM4_USH_DCFG_ENDEVOUTNAK                        *((volatile unsigned int*)(0x43010034UL))
#define bM4_USH_DCFG_XCVRDLY                            *((volatile unsigned int*)(0x43010038UL))
#define bM4_USH_DCFG_ERRATICINTMSK                      *((volatile unsigned int*)(0x4301003CUL))
#define bM4_USH_DCFG_PERSCHINTVL0                       *((volatile unsigned int*)(0x43010060UL))
#define bM4_USH_DCFG_PERSCHINTVL1                       *((volatile unsigned int*)(0x43010064UL))
#define bM4_USH_DCTL_RMTWKUPSIG                         *((volatile unsigned int*)(0x43010080UL))
#define bM4_USH_DCTL_SFTDISCON                          *((volatile unsigned int*)(0x43010084UL))
#define bM4_USH_DCTL_GNPINNAKSTS                        *((volatile unsigned int*)(0x43010088UL))
#define bM4_USH_DCTL_GOUTNAKSTS                         *((volatile unsigned int*)(0x4301008CUL))
#define bM4_USH_DCTL_TSTCTL0                            *((volatile unsigned int*)(0x43010090UL))
#define bM4_USH_DCTL_TSTCTL1                            *((volatile unsigned int*)(0x43010094UL))
#define bM4_USH_DCTL_TSTCTL2                            *((volatile unsigned int*)(0x43010098UL))
#define bM4_USH_DCTL_SGNPINNAK                          *((volatile unsigned int*)(0x4301009CUL))
#define bM4_USH_DCTL_CGNPINNAK                          *((volatile unsigned int*)(0x430100A0UL))
#define bM4_USH_DCTL_SGOUTNAK                           *((volatile unsigned int*)(0x430100A4UL))
#define bM4_USH_DCTL_CGOUTNAK                           *((volatile unsigned int*)(0x430100A8UL))
#define bM4_USH_DCTL_PWRONPRGDONE                       *((volatile unsigned int*)(0x430100ACUL))
#define bM4_USH_DCTL_IGNRFRMNUM                         *((volatile unsigned int*)(0x430100BCUL))
#define bM4_USH_DCTL_NAKONBBLE                          *((volatile unsigned int*)(0x430100C0UL))
#define bM4_USH_DCTL_RESV                               *((volatile unsigned int*)(0x430100E0UL))
#define bM4_USH_DSTS_SUSPSTS                            *((volatile unsigned int*)(0x43010100UL))
#define bM4_USH_DSTS_ENUMSPD0                           *((volatile unsigned int*)(0x43010104UL))
#define bM4_USH_DSTS_ENUMSPD1                           *((volatile unsigned int*)(0x43010108UL))
#define bM4_USH_DSTS_ERRTICERR                          *((volatile unsigned int*)(0x4301010CUL))
#define bM4_USH_DSTS_SOFFN0                             *((volatile unsigned int*)(0x43010120UL))
#define bM4_USH_DSTS_SOFFN1                             *((volatile unsigned int*)(0x43010124UL))
#define bM4_USH_DSTS_SOFFN2                             *((volatile unsigned int*)(0x43010128UL))
#define bM4_USH_DSTS_SOFFN3                             *((volatile unsigned int*)(0x4301012CUL))
#define bM4_USH_DSTS_SOFFN4                             *((volatile unsigned int*)(0x43010130UL))
#define bM4_USH_DSTS_SOFFN5                             *((volatile unsigned int*)(0x43010134UL))
#define bM4_USH_DSTS_SOFFN6                             *((volatile unsigned int*)(0x43010138UL))
#define bM4_USH_DSTS_SOFFN7                             *((volatile unsigned int*)(0x4301013CUL))
#define bM4_USH_DSTS_SOFFN8                             *((volatile unsigned int*)(0x43010140UL))
#define bM4_USH_DSTS_SOFFN9                             *((volatile unsigned int*)(0x43010144UL))
#define bM4_USH_DSTS_SOFFN10                            *((volatile unsigned int*)(0x43010148UL))
#define bM4_USH_DSTS_SOFFN11                            *((volatile unsigned int*)(0x4301014CUL))
#define bM4_USH_DSTS_SOFFN12                            *((volatile unsigned int*)(0x43010150UL))
#define bM4_USH_DSTS_SOFFN13                            *((volatile unsigned int*)(0x43010154UL))
#define bM4_USH_DSTS_DEVLNSTS0                          *((volatile unsigned int*)(0x43010158UL))
#define bM4_USH_DSTS_DEVLNSTS1                          *((volatile unsigned int*)(0x4301015CUL))
#define bM4_USH_DSTS_RESV                               *((volatile unsigned int*)(0x43010160UL))
#define bM4_USH_DIEPMSK_XFERCOMPLMSK                    *((volatile unsigned int*)(0x43010200UL))
#define bM4_USH_DIEPMSK_EPDISBLDMSK                     *((volatile unsigned int*)(0x43010204UL))
#define bM4_USH_DIEPMSK_AHBERRMSK                       *((volatile unsigned int*)(0x43010208UL))
#define bM4_USH_DIEPMSK_TIMEOUTMSK                      *((volatile unsigned int*)(0x4301020CUL))
#define bM4_USH_DIEPMSK_INTKNTXFEMPMSK                  *((volatile unsigned int*)(0x43010210UL))
#define bM4_USH_DIEPMSK_INTKNEPMISMSK                   *((volatile unsigned int*)(0x43010214UL))
#define bM4_USH_DIEPMSK_INEPNAKEFFMSK                   *((volatile unsigned int*)(0x43010218UL))
#define bM4_USH_DIEPMSK_TXFIFOUNDRNMSK                  *((volatile unsigned int*)(0x43010220UL))
#define bM4_USH_DIEPMSK_NAKMSK                          *((volatile unsigned int*)(0x43010234UL))
#define bM4_USH_DOEPMSK_XFERCOMPLMSK                    *((volatile unsigned int*)(0x43010280UL))
#define bM4_USH_DOEPMSK_EPDISBLDMSK                     *((volatile unsigned int*)(0x43010284UL))
#define bM4_USH_DOEPMSK_AHBERRMSK                       *((volatile unsigned int*)(0x43010288UL))
#define bM4_USH_DOEPMSK_SETUPMSK                        *((volatile unsigned int*)(0x4301028CUL))
#define bM4_USH_DOEPMSK_OUTTKNEPDISMSK                  *((volatile unsigned int*)(0x43010290UL))
#define bM4_USH_DOEPMSK_STSPHSERCVDMSK                  *((volatile unsigned int*)(0x43010294UL))
#define bM4_USH_DOEPMSK_BACK2BACKSETUP                  *((volatile unsigned int*)(0x43010298UL))
#define bM4_USH_DOEPMSK_OUTPKTERRMSK                    *((volatile unsigned int*)(0x430102A0UL))
#define bM4_USH_DOEPMSK_BBLEERRMSK                      *((volatile unsigned int*)(0x430102B0UL))
#define bM4_USH_DOEPMSK_NAKMSK                          *((volatile unsigned int*)(0x430102B4UL))
#define bM4_USH_DOEPMSK_NYETMSK                         *((volatile unsigned int*)(0x430102B8UL))
#define bM4_USH_DAINT_INEPINT0                          *((volatile unsigned int*)(0x43010300UL))
#define bM4_USH_DAINT_INEPINT1                          *((volatile unsigned int*)(0x43010304UL))
#define bM4_USH_DAINT_INEPINT2                          *((volatile unsigned int*)(0x43010308UL))
#define bM4_USH_DAINT_INEPINT3                          *((volatile unsigned int*)(0x4301030CUL))
#define bM4_USH_DAINT_INEPINT4                          *((volatile unsigned int*)(0x43010310UL))
#define bM4_USH_DAINT_INEPINT5                          *((volatile unsigned int*)(0x43010314UL))
#define bM4_USH_DAINT_INEPINT6                          *((volatile unsigned int*)(0x43010318UL))
#define bM4_USH_DAINT_INEPINT7                          *((volatile unsigned int*)(0x4301031CUL))
#define bM4_USH_DAINT_OUTEPINT0                         *((volatile unsigned int*)(0x43010340UL))
#define bM4_USH_DAINT_OUTEPINT1                         *((volatile unsigned int*)(0x43010344UL))
#define bM4_USH_DAINT_OUTEPINT2                         *((volatile unsigned int*)(0x43010348UL))
#define bM4_USH_DAINT_OUTEPINT3                         *((volatile unsigned int*)(0x4301034CUL))
#define bM4_USH_DAINT_OUTEPINT4                         *((volatile unsigned int*)(0x43010350UL))
#define bM4_USH_DAINT_OUTEPINT5                         *((volatile unsigned int*)(0x43010354UL))
#define bM4_USH_DAINT_OUTEPINT6                         *((volatile unsigned int*)(0x43010358UL))
#define bM4_USH_DAINT_OUTEPINT7                         *((volatile unsigned int*)(0x4301035CUL))
#define bM4_USH_DAINT_RESV                              *((volatile unsigned int*)(0x43010360UL))
#define bM4_USH_DAINTMSK_INEPMSK0                       *((volatile unsigned int*)(0x43010380UL))
#define bM4_USH_DAINTMSK_INEPMSK1                       *((volatile unsigned int*)(0x43010384UL))
#define bM4_USH_DAINTMSK_INEPMSK2                       *((volatile unsigned int*)(0x43010388UL))
#define bM4_USH_DAINTMSK_INEPMSK3                       *((volatile unsigned int*)(0x4301038CUL))
#define bM4_USH_DAINTMSK_INEPMSK4                       *((volatile unsigned int*)(0x43010390UL))
#define bM4_USH_DAINTMSK_INEPMSK5                       *((volatile unsigned int*)(0x43010394UL))
#define bM4_USH_DAINTMSK_INEPMSK6                       *((volatile unsigned int*)(0x43010398UL))
#define bM4_USH_DAINTMSK_INEPMSK7                       *((volatile unsigned int*)(0x4301039CUL))
#define bM4_USH_DAINTMSK_OUTEPMSK0                      *((volatile unsigned int*)(0x430103C0UL))
#define bM4_USH_DAINTMSK_OUTEPMSK1                      *((volatile unsigned int*)(0x430103C4UL))
#define bM4_USH_DAINTMSK_OUTEPMSK2                      *((volatile unsigned int*)(0x430103C8UL))
#define bM4_USH_DAINTMSK_OUTEPMSK3                      *((volatile unsigned int*)(0x430103CCUL))
#define bM4_USH_DAINTMSK_OUTEPMSK4                      *((volatile unsigned int*)(0x430103D0UL))
#define bM4_USH_DAINTMSK_OUTEPMSK5                      *((volatile unsigned int*)(0x430103D4UL))
#define bM4_USH_DAINTMSK_OUTEPMSK6                      *((volatile unsigned int*)(0x430103D8UL))
#define bM4_USH_DAINTMSK_OUTEPMSK7                      *((volatile unsigned int*)(0x430103DCUL))
#define bM4_USH_DAINTMSK_RESV                           *((volatile unsigned int*)(0x430103E0UL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE0                  *((volatile unsigned int*)(0x43010580UL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE1                  *((volatile unsigned int*)(0x43010584UL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE2                  *((volatile unsigned int*)(0x43010588UL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE3                  *((volatile unsigned int*)(0x4301058CUL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE4                  *((volatile unsigned int*)(0x43010590UL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE5                  *((volatile unsigned int*)(0x43010594UL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE6                  *((volatile unsigned int*)(0x43010598UL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE7                  *((volatile unsigned int*)(0x4301059CUL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE8                  *((volatile unsigned int*)(0x430105A0UL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE9                  *((volatile unsigned int*)(0x430105A4UL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE10                 *((volatile unsigned int*)(0x430105A8UL))
#define bM4_USH_DVBUSPULSE_DVBUSPULSE11                 *((volatile unsigned int*)(0x430105ACUL))
#define bM4_USH_DTHRCTL_NONISOTHREN                     *((volatile unsigned int*)(0x43010600UL))
#define bM4_USH_DTHRCTL_ISOTHREN                        *((volatile unsigned int*)(0x43010604UL))
#define bM4_USH_DTHRCTL_TXTHRLEN0                       *((volatile unsigned int*)(0x43010608UL))
#define bM4_USH_DTHRCTL_TXTHRLEN1                       *((volatile unsigned int*)(0x4301060CUL))
#define bM4_USH_DTHRCTL_TXTHRLEN2                       *((volatile unsigned int*)(0x43010610UL))
#define bM4_USH_DTHRCTL_TXTHRLEN3                       *((volatile unsigned int*)(0x43010614UL))
#define bM4_USH_DTHRCTL_TXTHRLEN4                       *((volatile unsigned int*)(0x43010618UL))
#define bM4_USH_DTHRCTL_TXTHRLEN5                       *((volatile unsigned int*)(0x4301061CUL))
#define bM4_USH_DTHRCTL_TXTHRLEN6                       *((volatile unsigned int*)(0x43010620UL))
#define bM4_USH_DTHRCTL_TXTHRLEN7                       *((volatile unsigned int*)(0x43010624UL))
#define bM4_USH_DTHRCTL_TXTHRLEN8                       *((volatile unsigned int*)(0x43010628UL))
#define bM4_USH_DTHRCTL_AHBTHRRATIO0                    *((volatile unsigned int*)(0x4301062CUL))
#define bM4_USH_DTHRCTL_AHBTHRRATIO1                    *((volatile unsigned int*)(0x43010630UL))
#define bM4_USH_DTHRCTL_RXTHREN                         *((volatile unsigned int*)(0x43010640UL))
#define bM4_USH_DTHRCTL_RXTHRLEN0                       *((volatile unsigned int*)(0x43010644UL))
#define bM4_USH_DTHRCTL_RXTHRLEN1                       *((volatile unsigned int*)(0x43010648UL))
#define bM4_USH_DTHRCTL_RXTHRLEN2                       *((volatile unsigned int*)(0x4301064CUL))
#define bM4_USH_DTHRCTL_RXTHRLEN3                       *((volatile unsigned int*)(0x43010650UL))
#define bM4_USH_DTHRCTL_RXTHRLEN4                       *((volatile unsigned int*)(0x43010654UL))
#define bM4_USH_DTHRCTL_RXTHRLEN5                       *((volatile unsigned int*)(0x43010658UL))
#define bM4_USH_DTHRCTL_RXTHRLEN6                       *((volatile unsigned int*)(0x4301065CUL))
#define bM4_USH_DTHRCTL_RXTHRLEN7                       *((volatile unsigned int*)(0x43010660UL))
#define bM4_USH_DTHRCTL_RXTHRLEN8                       *((volatile unsigned int*)(0x43010664UL))
#define bM4_USH_DTHRCTL_ARBPRKEN                        *((volatile unsigned int*)(0x4301066CUL))
#define bM4_USH_DIEPCTL0_MPS0                           *((volatile unsigned int*)(0x43012000UL))
#define bM4_USH_DIEPCTL0_MPS1                           *((volatile unsigned int*)(0x43012004UL))
#define bM4_USH_DIEPCTL0_USBACTEP                       *((volatile unsigned int*)(0x4301203CUL))
#define bM4_USH_DIEPCTL0_NAKSTS                         *((volatile unsigned int*)(0x43012044UL))
#define bM4_USH_DIEPCTL0_EPTYPE0                        *((volatile unsigned int*)(0x43012048UL))
#define bM4_USH_DIEPCTL0_EPTYPE1                        *((volatile unsigned int*)(0x4301204CUL))
#define bM4_USH_DIEPCTL0_STALL                          *((volatile unsigned int*)(0x43012054UL))
#define bM4_USH_DIEPCTL0_TXFNUM0                        *((volatile unsigned int*)(0x43012058UL))
#define bM4_USH_DIEPCTL0_TXFNUM1                        *((volatile unsigned int*)(0x4301205CUL))
#define bM4_USH_DIEPCTL0_TXFNUM2                        *((volatile unsigned int*)(0x43012060UL))
#define bM4_USH_DIEPCTL0_TXFNUM3                        *((volatile unsigned int*)(0x43012064UL))
#define bM4_USH_DIEPCTL0_CNAK                           *((volatile unsigned int*)(0x43012068UL))
#define bM4_USH_DIEPCTL0_SNAK                           *((volatile unsigned int*)(0x4301206CUL))
#define bM4_USH_DIEPCTL0_EPDIS                          *((volatile unsigned int*)(0x43012078UL))
#define bM4_USH_DIEPCTL0_EPENA                          *((volatile unsigned int*)(0x4301207CUL))
#define bM4_USH_DIEPINT0_XFERCOMPL                      *((volatile unsigned int*)(0x43012100UL))
#define bM4_USH_DIEPINT0_EPDISBLD                       *((volatile unsigned int*)(0x43012104UL))
#define bM4_USH_DIEPINT0_AHBERR                         *((volatile unsigned int*)(0x43012108UL))
#define bM4_USH_DIEPINT0_TIMEOUT                        *((volatile unsigned int*)(0x4301210CUL))
#define bM4_USH_DIEPINT0_INTKNTXFEMP                    *((volatile unsigned int*)(0x43012110UL))
#define bM4_USH_DIEPINT0_INTKNEPMIS                     *((volatile unsigned int*)(0x43012114UL))
#define bM4_USH_DIEPINT0_INEPNAKEFF                     *((volatile unsigned int*)(0x43012118UL))
#define bM4_USH_DIEPINT0_TXFEMP                         *((volatile unsigned int*)(0x4301211CUL))
#define bM4_USH_DIEPINT0_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43012120UL))
#define bM4_USH_DIEPINT0_BNAINTR                        *((volatile unsigned int*)(0x43012124UL))
#define bM4_USH_DIEPINT0_PKTDRPSTS                      *((volatile unsigned int*)(0x4301212CUL))
#define bM4_USH_DIEPINT0_BBLEERR                        *((volatile unsigned int*)(0x43012130UL))
#define bM4_USH_DIEPINT0_NAKINTRPT                      *((volatile unsigned int*)(0x43012134UL))
#define bM4_USH_DIEPINT0_NYETINTRPT                     *((volatile unsigned int*)(0x43012138UL))
#define bM4_USH_DIEPTSIZ0_XFERSIZE0                     *((volatile unsigned int*)(0x43012200UL))
#define bM4_USH_DIEPTSIZ0_XFERSIZE1                     *((volatile unsigned int*)(0x43012204UL))
#define bM4_USH_DIEPTSIZ0_XFERSIZE2                     *((volatile unsigned int*)(0x43012208UL))
#define bM4_USH_DIEPTSIZ0_XFERSIZE3                     *((volatile unsigned int*)(0x4301220CUL))
#define bM4_USH_DIEPTSIZ0_XFERSIZE4                     *((volatile unsigned int*)(0x43012210UL))
#define bM4_USH_DIEPTSIZ0_XFERSIZE5                     *((volatile unsigned int*)(0x43012214UL))
#define bM4_USH_DIEPTSIZ0_XFERSIZE6                     *((volatile unsigned int*)(0x43012218UL))
#define bM4_USH_DIEPTSIZ0_PKTCNT0                       *((volatile unsigned int*)(0x4301224CUL))
#define bM4_USH_DIEPTSIZ0_PKTCNT1                       *((volatile unsigned int*)(0x43012250UL))
#define bM4_USH_DIEPTSIZ0_RESV                          *((volatile unsigned int*)(0x43012260UL))
#define bM4_USH_DIEPCTL1_MPS0                           *((volatile unsigned int*)(0x43012400UL))
#define bM4_USH_DIEPCTL1_MPS1                           *((volatile unsigned int*)(0x43012404UL))
#define bM4_USH_DIEPCTL1_MPS2                           *((volatile unsigned int*)(0x43012408UL))
#define bM4_USH_DIEPCTL1_MPS3                           *((volatile unsigned int*)(0x4301240CUL))
#define bM4_USH_DIEPCTL1_MPS4                           *((volatile unsigned int*)(0x43012410UL))
#define bM4_USH_DIEPCTL1_MPS5                           *((volatile unsigned int*)(0x43012414UL))
#define bM4_USH_DIEPCTL1_MPS6                           *((volatile unsigned int*)(0x43012418UL))
#define bM4_USH_DIEPCTL1_MPS7                           *((volatile unsigned int*)(0x4301241CUL))
#define bM4_USH_DIEPCTL1_MPS8                           *((volatile unsigned int*)(0x43012420UL))
#define bM4_USH_DIEPCTL1_MPS9                           *((volatile unsigned int*)(0x43012424UL))
#define bM4_USH_DIEPCTL1_MPS10                          *((volatile unsigned int*)(0x43012428UL))
#define bM4_USH_DIEPCTL1_USBACTEP                       *((volatile unsigned int*)(0x4301243CUL))
#define bM4_USH_DIEPCTL1_DPID                           *((volatile unsigned int*)(0x43012440UL))
#define bM4_USH_DIEPCTL1_NAKSTS                         *((volatile unsigned int*)(0x43012444UL))
#define bM4_USH_DIEPCTL1_EPTYPE0                        *((volatile unsigned int*)(0x43012448UL))
#define bM4_USH_DIEPCTL1_EPTYPE1                        *((volatile unsigned int*)(0x4301244CUL))
#define bM4_USH_DIEPCTL1_STALL                          *((volatile unsigned int*)(0x43012454UL))
#define bM4_USH_DIEPCTL1_TXFNUM0                        *((volatile unsigned int*)(0x43012458UL))
#define bM4_USH_DIEPCTL1_TXFNUM1                        *((volatile unsigned int*)(0x4301245CUL))
#define bM4_USH_DIEPCTL1_TXFNUM2                        *((volatile unsigned int*)(0x43012460UL))
#define bM4_USH_DIEPCTL1_TXFNUM3                        *((volatile unsigned int*)(0x43012464UL))
#define bM4_USH_DIEPCTL1_CNAK                           *((volatile unsigned int*)(0x43012468UL))
#define bM4_USH_DIEPCTL1_SNAK                           *((volatile unsigned int*)(0x4301246CUL))
#define bM4_USH_DIEPCTL1_SETD0PID                       *((volatile unsigned int*)(0x43012470UL))
#define bM4_USH_DIEPCTL1_SETD1PID                       *((volatile unsigned int*)(0x43012474UL))
#define bM4_USH_DIEPCTL1_EPDIS                          *((volatile unsigned int*)(0x43012478UL))
#define bM4_USH_DIEPCTL1_EPENA                          *((volatile unsigned int*)(0x4301247CUL))
#define bM4_USH_DIEPINT1_XFERCOMPL                      *((volatile unsigned int*)(0x43012500UL))
#define bM4_USH_DIEPINT1_EPDISBLD                       *((volatile unsigned int*)(0x43012504UL))
