RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_DIEPINT1_AHBERR                         *((volatile unsigned int*)(0x43012508UL))
#define bM4_USH_DIEPINT1_TIMEOUT                        *((volatile unsigned int*)(0x4301250CUL))
#define bM4_USH_DIEPINT1_INTKNTXFEMP                    *((volatile unsigned int*)(0x43012510UL))
#define bM4_USH_DIEPINT1_INTKNEPMIS                     *((volatile unsigned int*)(0x43012514UL))
#define bM4_USH_DIEPINT1_INEPNAKEFF                     *((volatile unsigned int*)(0x43012518UL))
#define bM4_USH_DIEPINT1_TXFEMP                         *((volatile unsigned int*)(0x4301251CUL))
#define bM4_USH_DIEPINT1_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43012520UL))
#define bM4_USH_DIEPINT1_BNAINTR                        *((volatile unsigned int*)(0x43012524UL))
#define bM4_USH_DIEPINT1_PKTDRPSTS                      *((volatile unsigned int*)(0x4301252CUL))
#define bM4_USH_DIEPINT1_BBLEERR                        *((volatile unsigned int*)(0x43012530UL))
#define bM4_USH_DIEPINT1_NAKINTRPT                      *((volatile unsigned int*)(0x43012534UL))
#define bM4_USH_DIEPINT1_NYETINTRPT                     *((volatile unsigned int*)(0x43012538UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE0                     *((volatile unsigned int*)(0x43012600UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE1                     *((volatile unsigned int*)(0x43012604UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE2                     *((volatile unsigned int*)(0x43012608UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE3                     *((volatile unsigned int*)(0x4301260CUL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE4                     *((volatile unsigned int*)(0x43012610UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE5                     *((volatile unsigned int*)(0x43012614UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE6                     *((volatile unsigned int*)(0x43012618UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE7                     *((volatile unsigned int*)(0x4301261CUL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE8                     *((volatile unsigned int*)(0x43012620UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE9                     *((volatile unsigned int*)(0x43012624UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE10                    *((volatile unsigned int*)(0x43012628UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE11                    *((volatile unsigned int*)(0x4301262CUL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE12                    *((volatile unsigned int*)(0x43012630UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE13                    *((volatile unsigned int*)(0x43012634UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE14                    *((volatile unsigned int*)(0x43012638UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE15                    *((volatile unsigned int*)(0x4301263CUL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE16                    *((volatile unsigned int*)(0x43012640UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE17                    *((volatile unsigned int*)(0x43012644UL))
#define bM4_USH_DIEPTSIZ1_XFERSIZE18                    *((volatile unsigned int*)(0x43012648UL))
#define bM4_USH_DIEPTSIZ1_PKTCNT0                       *((volatile unsigned int*)(0x4301264CUL))
#define bM4_USH_DIEPTSIZ1_PKTCNT1                       *((volatile unsigned int*)(0x43012650UL))
#define bM4_USH_DIEPTSIZ1_PKTCNT2                       *((volatile unsigned int*)(0x43012654UL))
#define bM4_USH_DIEPTSIZ1_PKTCNT3                       *((volatile unsigned int*)(0x43012658UL))
#define bM4_USH_DIEPTSIZ1_PKTCNT4                       *((volatile unsigned int*)(0x4301265CUL))
#define bM4_USH_DIEPTSIZ1_PKTCNT5                       *((volatile unsigned int*)(0x43012660UL))
#define bM4_USH_DIEPTSIZ1_PKTCNT6                       *((volatile unsigned int*)(0x43012664UL))
#define bM4_USH_DIEPTSIZ1_PKTCNT7                       *((volatile unsigned int*)(0x43012668UL))
#define bM4_USH_DIEPTSIZ1_PKTCNT8                       *((volatile unsigned int*)(0x4301266CUL))
#define bM4_USH_DIEPTSIZ1_PKTCNT9                       *((volatile unsigned int*)(0x43012670UL))
#define bM4_USH_DIEPTSIZ1_MC0                           *((volatile unsigned int*)(0x43012674UL))
#define bM4_USH_DIEPTSIZ1_MC1                           *((volatile unsigned int*)(0x43012678UL))
#define bM4_USH_DIEPCTL2_MPS0                           *((volatile unsigned int*)(0x43012800UL))
#define bM4_USH_DIEPCTL2_MPS1                           *((volatile unsigned int*)(0x43012804UL))
#define bM4_USH_DIEPCTL2_MPS2                           *((volatile unsigned int*)(0x43012808UL))
#define bM4_USH_DIEPCTL2_MPS3                           *((volatile unsigned int*)(0x4301280CUL))
#define bM4_USH_DIEPCTL2_MPS4                           *((volatile unsigned int*)(0x43012810UL))
#define bM4_USH_DIEPCTL2_MPS5                           *((volatile unsigned int*)(0x43012814UL))
#define bM4_USH_DIEPCTL2_MPS6                           *((volatile unsigned int*)(0x43012818UL))
#define bM4_USH_DIEPCTL2_MPS7                           *((volatile unsigned int*)(0x4301281CUL))
#define bM4_USH_DIEPCTL2_MPS8                           *((volatile unsigned int*)(0x43012820UL))
#define bM4_USH_DIEPCTL2_MPS9                           *((volatile unsigned int*)(0x43012824UL))
#define bM4_USH_DIEPCTL2_MPS10                          *((volatile unsigned int*)(0x43012828UL))
#define bM4_USH_DIEPCTL2_USBACTEP                       *((volatile unsigned int*)(0x4301283CUL))
#define bM4_USH_DIEPCTL2_DPID                           *((volatile unsigned int*)(0x43012840UL))
#define bM4_USH_DIEPCTL2_NAKSTS                         *((volatile unsigned int*)(0x43012844UL))
#define bM4_USH_DIEPCTL2_EPTYPE0                        *((volatile unsigned int*)(0x43012848UL))
#define bM4_USH_DIEPCTL2_EPTYPE1                        *((volatile unsigned int*)(0x4301284CUL))
#define bM4_USH_DIEPCTL2_STALL                          *((volatile unsigned int*)(0x43012854UL))
#define bM4_USH_DIEPCTL2_TXFNUM0                        *((volatile unsigned int*)(0x43012858UL))
#define bM4_USH_DIEPCTL2_TXFNUM1                        *((volatile unsigned int*)(0x4301285CUL))
#define bM4_USH_DIEPCTL2_TXFNUM2                        *((volatile unsigned int*)(0x43012860UL))
#define bM4_USH_DIEPCTL2_TXFNUM3                        *((volatile unsigned int*)(0x43012864UL))
#define bM4_USH_DIEPCTL2_CNAK                           *((volatile unsigned int*)(0x43012868UL))
#define bM4_USH_DIEPCTL2_SNAK                           *((volatile unsigned int*)(0x4301286CUL))
#define bM4_USH_DIEPCTL2_SETD0PID                       *((volatile unsigned int*)(0x43012870UL))
#define bM4_USH_DIEPCTL2_SETD1PID                       *((volatile unsigned int*)(0x43012874UL))
#define bM4_USH_DIEPCTL2_EPDIS                          *((volatile unsigned int*)(0x43012878UL))
#define bM4_USH_DIEPCTL2_EPENA                          *((volatile unsigned int*)(0x4301287CUL))
#define bM4_USH_DIEPINT2_XFERCOMPL                      *((volatile unsigned int*)(0x43012900UL))
#define bM4_USH_DIEPINT2_EPDISBLD                       *((volatile unsigned int*)(0x43012904UL))
#define bM4_USH_DIEPINT2_AHBERR                         *((volatile unsigned int*)(0x43012908UL))
#define bM4_USH_DIEPINT2_TIMEOUT                        *((volatile unsigned int*)(0x4301290CUL))
#define bM4_USH_DIEPINT2_INTKNTXFEMP                    *((volatile unsigned int*)(0x43012910UL))
#define bM4_USH_DIEPINT2_INTKNEPMIS                     *((volatile unsigned int*)(0x43012914UL))
#define bM4_USH_DIEPINT2_INEPNAKEFF                     *((volatile unsigned int*)(0x43012918UL))
#define bM4_USH_DIEPINT2_TXFEMP                         *((volatile unsigned int*)(0x4301291CUL))
#define bM4_USH_DIEPINT2_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43012920UL))
#define bM4_USH_DIEPINT2_BNAINTR                        *((volatile unsigned int*)(0x43012924UL))
#define bM4_USH_DIEPINT2_PKTDRPSTS                      *((volatile unsigned int*)(0x4301292CUL))
#define bM4_USH_DIEPINT2_BBLEERR                        *((volatile unsigned int*)(0x43012930UL))
#define bM4_USH_DIEPINT2_NAKINTRPT                      *((volatile unsigned int*)(0x43012934UL))
#define bM4_USH_DIEPINT2_NYETINTRPT                     *((volatile unsigned int*)(0x43012938UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE0                     *((volatile unsigned int*)(0x43012A00UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE1                     *((volatile unsigned int*)(0x43012A04UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE2                     *((volatile unsigned int*)(0x43012A08UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE3                     *((volatile unsigned int*)(0x43012A0CUL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE4                     *((volatile unsigned int*)(0x43012A10UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE5                     *((volatile unsigned int*)(0x43012A14UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE6                     *((volatile unsigned int*)(0x43012A18UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE7                     *((volatile unsigned int*)(0x43012A1CUL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE8                     *((volatile unsigned int*)(0x43012A20UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE9                     *((volatile unsigned int*)(0x43012A24UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE10                    *((volatile unsigned int*)(0x43012A28UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE11                    *((volatile unsigned int*)(0x43012A2CUL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE12                    *((volatile unsigned int*)(0x43012A30UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE13                    *((volatile unsigned int*)(0x43012A34UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE14                    *((volatile unsigned int*)(0x43012A38UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE15                    *((volatile unsigned int*)(0x43012A3CUL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE16                    *((volatile unsigned int*)(0x43012A40UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE17                    *((volatile unsigned int*)(0x43012A44UL))
#define bM4_USH_DIEPTSIZ2_XFERSIZE18                    *((volatile unsigned int*)(0x43012A48UL))
#define bM4_USH_DIEPTSIZ2_PKTCNT0                       *((volatile unsigned int*)(0x43012A4CUL))
#define bM4_USH_DIEPTSIZ2_PKTCNT1                       *((volatile unsigned int*)(0x43012A50UL))
#define bM4_USH_DIEPTSIZ2_PKTCNT2                       *((volatile unsigned int*)(0x43012A54UL))
#define bM4_USH_DIEPTSIZ2_PKTCNT3                       *((volatile unsigned int*)(0x43012A58UL))
#define bM4_USH_DIEPTSIZ2_PKTCNT4                       *((volatile unsigned int*)(0x43012A5CUL))
#define bM4_USH_DIEPTSIZ2_PKTCNT5                       *((volatile unsigned int*)(0x43012A60UL))
#define bM4_USH_DIEPTSIZ2_PKTCNT6                       *((volatile unsigned int*)(0x43012A64UL))
#define bM4_USH_DIEPTSIZ2_PKTCNT7                       *((volatile unsigned int*)(0x43012A68UL))
#define bM4_USH_DIEPTSIZ2_PKTCNT8                       *((volatile unsigned int*)(0x43012A6CUL))
#define bM4_USH_DIEPTSIZ2_PKTCNT9                       *((volatile unsigned int*)(0x43012A70UL))
#define bM4_USH_DIEPTSIZ2_MC0                           *((volatile unsigned int*)(0x43012A74UL))
#define bM4_USH_DIEPTSIZ2_MC1                           *((volatile unsigned int*)(0x43012A78UL))
#define bM4_USH_DIEPCTL3_MPS0                           *((volatile unsigned int*)(0x43012C00UL))
#define bM4_USH_DIEPCTL3_MPS1                           *((volatile unsigned int*)(0x43012C04UL))
#define bM4_USH_DIEPCTL3_MPS2                           *((volatile unsigned int*)(0x43012C08UL))
#define bM4_USH_DIEPCTL3_MPS3                           *((volatile unsigned int*)(0x43012C0CUL))
#define bM4_USH_DIEPCTL3_MPS4                           *((volatile unsigned int*)(0x43012C10UL))
#define bM4_USH_DIEPCTL3_MPS5                           *((volatile unsigned int*)(0x43012C14UL))
#define bM4_USH_DIEPCTL3_MPS6                           *((volatile unsigned int*)(0x43012C18UL))
#define bM4_USH_DIEPCTL3_MPS7                           *((volatile unsigned int*)(0x43012C1CUL))
#define bM4_USH_DIEPCTL3_MPS8                           *((volatile unsigned int*)(0x43012C20UL))
#define bM4_USH_DIEPCTL3_MPS9                           *((volatile unsigned int*)(0x43012C24UL))
#define bM4_USH_DIEPCTL3_MPS10                          *((volatile unsigned int*)(0x43012C28UL))
#define bM4_USH_DIEPCTL3_USBACTEP                       *((volatile unsigned int*)(0x43012C3CUL))
#define bM4_USH_DIEPCTL3_DPID                           *((volatile unsigned int*)(0x43012C40UL))
#define bM4_USH_DIEPCTL3_NAKSTS                         *((volatile unsigned int*)(0x43012C44UL))
#define bM4_USH_DIEPCTL3_EPTYPE0                        *((volatile unsigned int*)(0x43012C48UL))
#define bM4_USH_DIEPCTL3_EPTYPE1                        *((volatile unsigned int*)(0x43012C4CUL))
#define bM4_USH_DIEPCTL3_STALL                          *((volatile unsigned int*)(0x43012C54UL))
#define bM4_USH_DIEPCTL3_TXFNUM0                        *((volatile unsigned int*)(0x43012C58UL))
#define bM4_USH_DIEPCTL3_TXFNUM1                        *((volatile unsigned int*)(0x43012C5CUL))
#define bM4_USH_DIEPCTL3_TXFNUM2                        *((volatile unsigned int*)(0x43012C60UL))
#define bM4_USH_DIEPCTL3_TXFNUM3                        *((volatile unsigned int*)(0x43012C64UL))
#define bM4_USH_DIEPCTL3_CNAK                           *((volatile unsigned int*)(0x43012C68UL))
#define bM4_USH_DIEPCTL3_SNAK                           *((volatile unsigned int*)(0x43012C6CUL))
#define bM4_USH_DIEPCTL3_SETD0PID                       *((volatile unsigned int*)(0x43012C70UL))
#define bM4_USH_DIEPCTL3_SETD1PID                       *((volatile unsigned int*)(0x43012C74UL))
#define bM4_USH_DIEPCTL3_EPDIS                          *((volatile unsigned int*)(0x43012C78UL))
#define bM4_USH_DIEPCTL3_EPENA                          *((volatile unsigned int*)(0x43012C7CUL))
#define bM4_USH_DIEPINT3_XFERCOMPL                      *((volatile unsigned int*)(0x43012D00UL))
#define bM4_USH_DIEPINT3_EPDISBLD                       *((volatile unsigned int*)(0x43012D04UL))
#define bM4_USH_DIEPINT3_AHBERR                         *((volatile unsigned int*)(0x43012D08UL))
#define bM4_USH_DIEPINT3_TIMEOUT                        *((volatile unsigned int*)(0x43012D0CUL))
#define bM4_USH_DIEPINT3_INTKNTXFEMP                    *((volatile unsigned int*)(0x43012D10UL))
#define bM4_USH_DIEPINT3_INTKNEPMIS                     *((volatile unsigned int*)(0x43012D14UL))
#define bM4_USH_DIEPINT3_INEPNAKEFF                     *((volatile unsigned int*)(0x43012D18UL))
#define bM4_USH_DIEPINT3_TXFEMP                         *((volatile unsigned int*)(0x43012D1CUL))
#define bM4_USH_DIEPINT3_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43012D20UL))
#define bM4_USH_DIEPINT3_BNAINTR                        *((volatile unsigned int*)(0x43012D24UL))
#define bM4_USH_DIEPINT3_PKTDRPSTS                      *((volatile unsigned int*)(0x43012D2CUL))
#define bM4_USH_DIEPINT3_BBLEERR                        *((volatile unsigned int*)(0x43012D30UL))
#define bM4_USH_DIEPINT3_NAKINTRPT                      *((volatile unsigned int*)(0x43012D34UL))
#define bM4_USH_DIEPINT3_NYETINTRPT                     *((volatile unsigned int*)(0x43012D38UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE0                     *((volatile unsigned int*)(0x43012E00UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE1                     *((volatile unsigned int*)(0x43012E04UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE2                     *((volatile unsigned int*)(0x43012E08UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE3                     *((volatile unsigned int*)(0x43012E0CUL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE4                     *((volatile unsigned int*)(0x43012E10UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE5                     *((volatile unsigned int*)(0x43012E14UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE6                     *((volatile unsigned int*)(0x43012E18UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE7                     *((volatile unsigned int*)(0x43012E1CUL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE8                     *((volatile unsigned int*)(0x43012E20UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE9                     *((volatile unsigned int*)(0x43012E24UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE10                    *((volatile unsigned int*)(0x43012E28UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE11                    *((volatile unsigned int*)(0x43012E2CUL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE12                    *((volatile unsigned int*)(0x43012E30UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE13                    *((volatile unsigned int*)(0x43012E34UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE14                    *((volatile unsigned int*)(0x43012E38UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE15                    *((volatile unsigned int*)(0x43012E3CUL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE16                    *((volatile unsigned int*)(0x43012E40UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE17                    *((volatile unsigned int*)(0x43012E44UL))
#define bM4_USH_DIEPTSIZ3_XFERSIZE18                    *((volatile unsigned int*)(0x43012E48UL))
#define bM4_USH_DIEPTSIZ3_PKTCNT0                       *((volatile unsigned int*)(0x43012E4CUL))
#define bM4_USH_DIEPTSIZ3_PKTCNT1                       *((volatile unsigned int*)(0x43012E50UL))
#define bM4_USH_DIEPTSIZ3_PKTCNT2                       *((volatile unsigned int*)(0x43012E54UL))
#define bM4_USH_DIEPTSIZ3_PKTCNT3                       *((volatile unsigned int*)(0x43012E58UL))
#define bM4_USH_DIEPTSIZ3_PKTCNT4                       *((volatile unsigned int*)(0x43012E5CUL))
#define bM4_USH_DIEPTSIZ3_PKTCNT5                       *((volatile unsigned int*)(0x43012E60UL))
#define bM4_USH_DIEPTSIZ3_PKTCNT6                       *((volatile unsigned int*)(0x43012E64UL))
#define bM4_USH_DIEPTSIZ3_PKTCNT7                       *((volatile unsigned int*)(0x43012E68UL))
#define bM4_USH_DIEPTSIZ3_PKTCNT8                       *((volatile unsigned int*)(0x43012E6CUL))
#define bM4_USH_DIEPTSIZ3_PKTCNT9                       *((volatile unsigned int*)(0x43012E70UL))
#define bM4_USH_DIEPTSIZ3_MC0                           *((volatile unsigned int*)(0x43012E74UL))
#define bM4_USH_DIEPTSIZ3_MC1                           *((volatile unsigned int*)(0x43012E78UL))
#define bM4_USH_DIEPCTL4_MPS0                           *((volatile unsigned int*)(0x43013000UL))
#define bM4_USH_DIEPCTL4_MPS1                           *((volatile unsigned int*)(0x43013004UL))
#define bM4_USH_DIEPCTL4_MPS2                           *((volatile unsigned int*)(0x43013008UL))
#define bM4_USH_DIEPCTL4_MPS3                           *((volatile unsigned int*)(0x4301300CUL))
#define bM4_USH_DIEPCTL4_MPS4                           *((volatile unsigned int*)(0x43013010UL))
#define bM4_USH_DIEPCTL4_MPS5                           *((volatile unsigned int*)(0x43013014UL))
#define bM4_USH_DIEPCTL4_MPS6                           *((volatile unsigned int*)(0x43013018UL))
#define bM4_USH_DIEPCTL4_MPS7                           *((volatile unsigned int*)(0x4301301CUL))
#define bM4_USH_DIEPCTL4_MPS8                           *((volatile unsigned int*)(0x43013020UL))
#define bM4_USH_DIEPCTL4_MPS9                           *((volatile unsigned int*)(0x43013024UL))
#define bM4_USH_DIEPCTL4_MPS10                          *((volatile unsigned int*)(0x43013028UL))
#define bM4_USH_DIEPCTL4_USBACTEP                       *((volatile unsigned int*)(0x4301303CUL))
#define bM4_USH_DIEPCTL4_DPID                           *((volatile unsigned int*)(0x43013040UL))
#define bM4_USH_DIEPCTL4_NAKSTS                         *((volatile unsigned int*)(0x43013044UL))
#define bM4_USH_DIEPCTL4_EPTYPE0                        *((volatile unsigned int*)(0x43013048UL))
#define bM4_USH_DIEPCTL4_EPTYPE1                        *((volatile unsigned int*)(0x4301304CUL))
#define bM4_USH_DIEPCTL4_STALL                          *((volatile unsigned int*)(0x43013054UL))
#define bM4_USH_DIEPCTL4_TXFNUM0                        *((volatile unsigned int*)(0x43013058UL))
#define bM4_USH_DIEPCTL4_TXFNUM1                        *((volatile unsigned int*)(0x4301305CUL))
#define bM4_USH_DIEPCTL4_TXFNUM2                        *((volatile unsigned int*)(0x43013060UL))
#define bM4_USH_DIEPCTL4_TXFNUM3                        *((volatile unsigned int*)(0x43013064UL))
#define bM4_USH_DIEPCTL4_CNAK                           *((volatile unsigned int*)(0x43013068UL))
#define bM4_USH_DIEPCTL4_SNAK                           *((volatile unsigned int*)(0x4301306CUL))
#define bM4_USH_DIEPCTL4_SETD0PID                       *((volatile unsigned int*)(0x43013070UL))
#define bM4_USH_DIEPCTL4_SETD1PID                       *((volatile unsigned int*)(0x43013074UL))
#define bM4_USH_DIEPCTL4_EPDIS                          *((volatile unsigned int*)(0x43013078UL))
#define bM4_USH_DIEPCTL4_EPENA                          *((volatile unsigned int*)(0x4301307CUL))
#define bM4_USH_DIEPINT4_XFERCOMPL                      *((volatile unsigned int*)(0x43013100UL))
#define bM4_USH_DIEPINT4_EPDISBLD                       *((volatile unsigned int*)(0x43013104UL))
#define bM4_USH_DIEPINT4_AHBERR                         *((volatile unsigned int*)(0x43013108UL))
#define bM4_USH_DIEPINT4_TIMEOUT                        *((volatile unsigned int*)(0x4301310CUL))
#define bM4_USH_DIEPINT4_INTKNTXFEMP                    *((volatile unsigned int*)(0x43013110UL))
#define bM4_USH_DIEPINT4_INTKNEPMIS                     *((volatile unsigned int*)(0x43013114UL))
#define bM4_USH_DIEPINT4_INEPNAKEFF                     *((volatile unsigned int*)(0x43013118UL))
#define bM4_USH_DIEPINT4_TXFEMP                         *((volatile unsigned int*)(0x4301311CUL))
#define bM4_USH_DIEPINT4_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43013120UL))
#define bM4_USH_DIEPINT4_BNAINTR                        *((volatile unsigned int*)(0x43013124UL))
#define bM4_USH_DIEPINT4_PKTDRPSTS                      *((volatile unsigned int*)(0x4301312CUL))
#define bM4_USH_DIEPINT4_BBLEERR                        *((volatile unsigned int*)(0x43013130UL))
#define bM4_USH_DIEPINT4_NAKINTRPT                      *((volatile unsigned int*)(0x43013134UL))
#define bM4_USH_DIEPINT4_NYETINTRPT                     *((volatile unsigned int*)(0x43013138UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE0                     *((volatile unsigned int*)(0x43013200UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE1                     *((volatile unsigned int*)(0x43013204UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE2                     *((volatile unsigned int*)(0x43013208UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE3                     *((volatile unsigned int*)(0x4301320CUL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE4                     *((volatile unsigned int*)(0x43013210UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE5                     *((volatile unsigned int*)(0x43013214UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE6                     *((volatile unsigned int*)(0x43013218UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE7                     *((volatile unsigned int*)(0x4301321CUL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE8                     *((volatile unsigned int*)(0x43013220UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE9                     *((volatile unsigned int*)(0x43013224UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE10                    *((volatile unsigned int*)(0x43013228UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE11                    *((volatile unsigned int*)(0x4301322CUL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE12                    *((volatile unsigned int*)(0x43013230UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE13                    *((volatile unsigned int*)(0x43013234UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE14                    *((volatile unsigned int*)(0x43013238UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE15                    *((volatile unsigned int*)(0x4301323CUL))
