RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_DIEPTSIZ4_XFERSIZE16                    *((volatile unsigned int*)(0x43013240UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE17                    *((volatile unsigned int*)(0x43013244UL))
#define bM4_USH_DIEPTSIZ4_XFERSIZE18                    *((volatile unsigned int*)(0x43013248UL))
#define bM4_USH_DIEPTSIZ4_PKTCNT0                       *((volatile unsigned int*)(0x4301324CUL))
#define bM4_USH_DIEPTSIZ4_PKTCNT1                       *((volatile unsigned int*)(0x43013250UL))
#define bM4_USH_DIEPTSIZ4_PKTCNT2                       *((volatile unsigned int*)(0x43013254UL))
#define bM4_USH_DIEPTSIZ4_PKTCNT3                       *((volatile unsigned int*)(0x43013258UL))
#define bM4_USH_DIEPTSIZ4_PKTCNT4                       *((volatile unsigned int*)(0x4301325CUL))
#define bM4_USH_DIEPTSIZ4_PKTCNT5                       *((volatile unsigned int*)(0x43013260UL))
#define bM4_USH_DIEPTSIZ4_PKTCNT6                       *((volatile unsigned int*)(0x43013264UL))
#define bM4_USH_DIEPTSIZ4_PKTCNT7                       *((volatile unsigned int*)(0x43013268UL))
#define bM4_USH_DIEPTSIZ4_PKTCNT8                       *((volatile unsigned int*)(0x4301326CUL))
#define bM4_USH_DIEPTSIZ4_PKTCNT9                       *((volatile unsigned int*)(0x43013270UL))
#define bM4_USH_DIEPTSIZ4_MC0                           *((volatile unsigned int*)(0x43013274UL))
#define bM4_USH_DIEPTSIZ4_MC1                           *((volatile unsigned int*)(0x43013278UL))
#define bM4_USH_DIEPCTL5_MPS0                           *((volatile unsigned int*)(0x43013400UL))
#define bM4_USH_DIEPCTL5_MPS1                           *((volatile unsigned int*)(0x43013404UL))
#define bM4_USH_DIEPCTL5_MPS2                           *((volatile unsigned int*)(0x43013408UL))
#define bM4_USH_DIEPCTL5_MPS3                           *((volatile unsigned int*)(0x4301340CUL))
#define bM4_USH_DIEPCTL5_MPS4                           *((volatile unsigned int*)(0x43013410UL))
#define bM4_USH_DIEPCTL5_MPS5                           *((volatile unsigned int*)(0x43013414UL))
#define bM4_USH_DIEPCTL5_MPS6                           *((volatile unsigned int*)(0x43013418UL))
#define bM4_USH_DIEPCTL5_MPS7                           *((volatile unsigned int*)(0x4301341CUL))
#define bM4_USH_DIEPCTL5_MPS8                           *((volatile unsigned int*)(0x43013420UL))
#define bM4_USH_DIEPCTL5_MPS9                           *((volatile unsigned int*)(0x43013424UL))
#define bM4_USH_DIEPCTL5_MPS10                          *((volatile unsigned int*)(0x43013428UL))
#define bM4_USH_DIEPCTL5_USBACTEP                       *((volatile unsigned int*)(0x4301343CUL))
#define bM4_USH_DIEPCTL5_DPID                           *((volatile unsigned int*)(0x43013440UL))
#define bM4_USH_DIEPCTL5_NAKSTS                         *((volatile unsigned int*)(0x43013444UL))
#define bM4_USH_DIEPCTL5_EPTYPE0                        *((volatile unsigned int*)(0x43013448UL))
#define bM4_USH_DIEPCTL5_EPTYPE1                        *((volatile unsigned int*)(0x4301344CUL))
#define bM4_USH_DIEPCTL5_STALL                          *((volatile unsigned int*)(0x43013454UL))
#define bM4_USH_DIEPCTL5_TXFNUM0                        *((volatile unsigned int*)(0x43013458UL))
#define bM4_USH_DIEPCTL5_TXFNUM1                        *((volatile unsigned int*)(0x4301345CUL))
#define bM4_USH_DIEPCTL5_TXFNUM2                        *((volatile unsigned int*)(0x43013460UL))
#define bM4_USH_DIEPCTL5_TXFNUM3                        *((volatile unsigned int*)(0x43013464UL))
#define bM4_USH_DIEPCTL5_CNAK                           *((volatile unsigned int*)(0x43013468UL))
#define bM4_USH_DIEPCTL5_SNAK                           *((volatile unsigned int*)(0x4301346CUL))
#define bM4_USH_DIEPCTL5_SETD0PID                       *((volatile unsigned int*)(0x43013470UL))
#define bM4_USH_DIEPCTL5_SETD1PID                       *((volatile unsigned int*)(0x43013474UL))
#define bM4_USH_DIEPCTL5_EPDIS                          *((volatile unsigned int*)(0x43013478UL))
#define bM4_USH_DIEPCTL5_EPENA                          *((volatile unsigned int*)(0x4301347CUL))
#define bM4_USH_DIEPINT5_XFERCOMPL                      *((volatile unsigned int*)(0x43013500UL))
#define bM4_USH_DIEPINT5_EPDISBLD                       *((volatile unsigned int*)(0x43013504UL))
#define bM4_USH_DIEPINT5_AHBERR                         *((volatile unsigned int*)(0x43013508UL))
#define bM4_USH_DIEPINT5_TIMEOUT                        *((volatile unsigned int*)(0x4301350CUL))
#define bM4_USH_DIEPINT5_INTKNTXFEMP                    *((volatile unsigned int*)(0x43013510UL))
#define bM4_USH_DIEPINT5_INTKNEPMIS                     *((volatile unsigned int*)(0x43013514UL))
#define bM4_USH_DIEPINT5_INEPNAKEFF                     *((volatile unsigned int*)(0x43013518UL))
#define bM4_USH_DIEPINT5_TXFEMP                         *((volatile unsigned int*)(0x4301351CUL))
#define bM4_USH_DIEPINT5_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43013520UL))
#define bM4_USH_DIEPINT5_BNAINTR                        *((volatile unsigned int*)(0x43013524UL))
#define bM4_USH_DIEPINT5_PKTDRPSTS                      *((volatile unsigned int*)(0x4301352CUL))
#define bM4_USH_DIEPINT5_BBLEERR                        *((volatile unsigned int*)(0x43013530UL))
#define bM4_USH_DIEPINT5_NAKINTRPT                      *((volatile unsigned int*)(0x43013534UL))
#define bM4_USH_DIEPINT5_NYETINTRPT                     *((volatile unsigned int*)(0x43013538UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE0                     *((volatile unsigned int*)(0x43013600UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE1                     *((volatile unsigned int*)(0x43013604UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE2                     *((volatile unsigned int*)(0x43013608UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE3                     *((volatile unsigned int*)(0x4301360CUL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE4                     *((volatile unsigned int*)(0x43013610UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE5                     *((volatile unsigned int*)(0x43013614UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE6                     *((volatile unsigned int*)(0x43013618UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE7                     *((volatile unsigned int*)(0x4301361CUL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE8                     *((volatile unsigned int*)(0x43013620UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE9                     *((volatile unsigned int*)(0x43013624UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE10                    *((volatile unsigned int*)(0x43013628UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE11                    *((volatile unsigned int*)(0x4301362CUL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE12                    *((volatile unsigned int*)(0x43013630UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE13                    *((volatile unsigned int*)(0x43013634UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE14                    *((volatile unsigned int*)(0x43013638UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE15                    *((volatile unsigned int*)(0x4301363CUL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE16                    *((volatile unsigned int*)(0x43013640UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE17                    *((volatile unsigned int*)(0x43013644UL))
#define bM4_USH_DIEPTSIZ5_XFERSIZE18                    *((volatile unsigned int*)(0x43013648UL))
#define bM4_USH_DIEPTSIZ5_PKTCNT0                       *((volatile unsigned int*)(0x4301364CUL))
#define bM4_USH_DIEPTSIZ5_PKTCNT1                       *((volatile unsigned int*)(0x43013650UL))
#define bM4_USH_DIEPTSIZ5_PKTCNT2                       *((volatile unsigned int*)(0x43013654UL))
#define bM4_USH_DIEPTSIZ5_PKTCNT3                       *((volatile unsigned int*)(0x43013658UL))
#define bM4_USH_DIEPTSIZ5_PKTCNT4                       *((volatile unsigned int*)(0x4301365CUL))
#define bM4_USH_DIEPTSIZ5_PKTCNT5                       *((volatile unsigned int*)(0x43013660UL))
#define bM4_USH_DIEPTSIZ5_PKTCNT6                       *((volatile unsigned int*)(0x43013664UL))
#define bM4_USH_DIEPTSIZ5_PKTCNT7                       *((volatile unsigned int*)(0x43013668UL))
#define bM4_USH_DIEPTSIZ5_PKTCNT8                       *((volatile unsigned int*)(0x4301366CUL))
#define bM4_USH_DIEPTSIZ5_PKTCNT9                       *((volatile unsigned int*)(0x43013670UL))
#define bM4_USH_DIEPTSIZ5_MC0                           *((volatile unsigned int*)(0x43013674UL))
#define bM4_USH_DIEPTSIZ5_MC1                           *((volatile unsigned int*)(0x43013678UL))
#define bM4_USH_DIEPCTL6_MPS0                           *((volatile unsigned int*)(0x43013800UL))
#define bM4_USH_DIEPCTL6_MPS1                           *((volatile unsigned int*)(0x43013804UL))
#define bM4_USH_DIEPCTL6_MPS2                           *((volatile unsigned int*)(0x43013808UL))
#define bM4_USH_DIEPCTL6_MPS3                           *((volatile unsigned int*)(0x4301380CUL))
#define bM4_USH_DIEPCTL6_MPS4                           *((volatile unsigned int*)(0x43013810UL))
#define bM4_USH_DIEPCTL6_MPS5                           *((volatile unsigned int*)(0x43013814UL))
#define bM4_USH_DIEPCTL6_MPS6                           *((volatile unsigned int*)(0x43013818UL))
#define bM4_USH_DIEPCTL6_MPS7                           *((volatile unsigned int*)(0x4301381CUL))
#define bM4_USH_DIEPCTL6_MPS8                           *((volatile unsigned int*)(0x43013820UL))
#define bM4_USH_DIEPCTL6_MPS9                           *((volatile unsigned int*)(0x43013824UL))
#define bM4_USH_DIEPCTL6_MPS10                          *((volatile unsigned int*)(0x43013828UL))
#define bM4_USH_DIEPCTL6_USBACTEP                       *((volatile unsigned int*)(0x4301383CUL))
#define bM4_USH_DIEPCTL6_DPID                           *((volatile unsigned int*)(0x43013840UL))
#define bM4_USH_DIEPCTL6_NAKSTS                         *((volatile unsigned int*)(0x43013844UL))
#define bM4_USH_DIEPCTL6_EPTYPE0                        *((volatile unsigned int*)(0x43013848UL))
#define bM4_USH_DIEPCTL6_EPTYPE1                        *((volatile unsigned int*)(0x4301384CUL))
#define bM4_USH_DIEPCTL6_STALL                          *((volatile unsigned int*)(0x43013854UL))
#define bM4_USH_DIEPCTL6_TXFNUM0                        *((volatile unsigned int*)(0x43013858UL))
#define bM4_USH_DIEPCTL6_TXFNUM1                        *((volatile unsigned int*)(0x4301385CUL))
#define bM4_USH_DIEPCTL6_TXFNUM2                        *((volatile unsigned int*)(0x43013860UL))
#define bM4_USH_DIEPCTL6_TXFNUM3                        *((volatile unsigned int*)(0x43013864UL))
#define bM4_USH_DIEPCTL6_CNAK                           *((volatile unsigned int*)(0x43013868UL))
#define bM4_USH_DIEPCTL6_SNAK                           *((volatile unsigned int*)(0x4301386CUL))
#define bM4_USH_DIEPCTL6_SETD0PID                       *((volatile unsigned int*)(0x43013870UL))
#define bM4_USH_DIEPCTL6_SETD1PID                       *((volatile unsigned int*)(0x43013874UL))
#define bM4_USH_DIEPCTL6_EPDIS                          *((volatile unsigned int*)(0x43013878UL))
#define bM4_USH_DIEPCTL6_EPENA                          *((volatile unsigned int*)(0x4301387CUL))
#define bM4_USH_DIEPINT6_XFERCOMPL                      *((volatile unsigned int*)(0x43013900UL))
#define bM4_USH_DIEPINT6_EPDISBLD                       *((volatile unsigned int*)(0x43013904UL))
#define bM4_USH_DIEPINT6_AHBERR                         *((volatile unsigned int*)(0x43013908UL))
#define bM4_USH_DIEPINT6_TIMEOUT                        *((volatile unsigned int*)(0x4301390CUL))
#define bM4_USH_DIEPINT6_INTKNTXFEMP                    *((volatile unsigned int*)(0x43013910UL))
#define bM4_USH_DIEPINT6_INTKNEPMIS                     *((volatile unsigned int*)(0x43013914UL))
#define bM4_USH_DIEPINT6_INEPNAKEFF                     *((volatile unsigned int*)(0x43013918UL))
#define bM4_USH_DIEPINT6_TXFEMP                         *((volatile unsigned int*)(0x4301391CUL))
#define bM4_USH_DIEPINT6_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43013920UL))
#define bM4_USH_DIEPINT6_BNAINTR                        *((volatile unsigned int*)(0x43013924UL))
#define bM4_USH_DIEPINT6_PKTDRPSTS                      *((volatile unsigned int*)(0x4301392CUL))
#define bM4_USH_DIEPINT6_BBLEERR                        *((volatile unsigned int*)(0x43013930UL))
#define bM4_USH_DIEPINT6_NAKINTRPT                      *((volatile unsigned int*)(0x43013934UL))
#define bM4_USH_DIEPINT6_NYETINTRPT                     *((volatile unsigned int*)(0x43013938UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE0                     *((volatile unsigned int*)(0x43013A00UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE1                     *((volatile unsigned int*)(0x43013A04UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE2                     *((volatile unsigned int*)(0x43013A08UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE3                     *((volatile unsigned int*)(0x43013A0CUL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE4                     *((volatile unsigned int*)(0x43013A10UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE5                     *((volatile unsigned int*)(0x43013A14UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE6                     *((volatile unsigned int*)(0x43013A18UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE7                     *((volatile unsigned int*)(0x43013A1CUL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE8                     *((volatile unsigned int*)(0x43013A20UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE9                     *((volatile unsigned int*)(0x43013A24UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE10                    *((volatile unsigned int*)(0x43013A28UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE11                    *((volatile unsigned int*)(0x43013A2CUL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE12                    *((volatile unsigned int*)(0x43013A30UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE13                    *((volatile unsigned int*)(0x43013A34UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE14                    *((volatile unsigned int*)(0x43013A38UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE15                    *((volatile unsigned int*)(0x43013A3CUL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE16                    *((volatile unsigned int*)(0x43013A40UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE17                    *((volatile unsigned int*)(0x43013A44UL))
#define bM4_USH_DIEPTSIZ6_XFERSIZE18                    *((volatile unsigned int*)(0x43013A48UL))
#define bM4_USH_DIEPTSIZ6_PKTCNT0                       *((volatile unsigned int*)(0x43013A4CUL))
#define bM4_USH_DIEPTSIZ6_PKTCNT1                       *((volatile unsigned int*)(0x43013A50UL))
#define bM4_USH_DIEPTSIZ6_PKTCNT2                       *((volatile unsigned int*)(0x43013A54UL))
#define bM4_USH_DIEPTSIZ6_PKTCNT3                       *((volatile unsigned int*)(0x43013A58UL))
#define bM4_USH_DIEPTSIZ6_PKTCNT4                       *((volatile unsigned int*)(0x43013A5CUL))
#define bM4_USH_DIEPTSIZ6_PKTCNT5                       *((volatile unsigned int*)(0x43013A60UL))
#define bM4_USH_DIEPTSIZ6_PKTCNT6                       *((volatile unsigned int*)(0x43013A64UL))
#define bM4_USH_DIEPTSIZ6_PKTCNT7                       *((volatile unsigned int*)(0x43013A68UL))
#define bM4_USH_DIEPTSIZ6_PKTCNT8                       *((volatile unsigned int*)(0x43013A6CUL))
#define bM4_USH_DIEPTSIZ6_PKTCNT9                       *((volatile unsigned int*)(0x43013A70UL))
#define bM4_USH_DIEPTSIZ6_MC0                           *((volatile unsigned int*)(0x43013A74UL))
#define bM4_USH_DIEPTSIZ6_MC1                           *((volatile unsigned int*)(0x43013A78UL))
#define bM4_USH_DIEPCTL7_MPS0                           *((volatile unsigned int*)(0x43013C00UL))
#define bM4_USH_DIEPCTL7_MPS1                           *((volatile unsigned int*)(0x43013C04UL))
#define bM4_USH_DIEPCTL7_MPS2                           *((volatile unsigned int*)(0x43013C08UL))
#define bM4_USH_DIEPCTL7_MPS3                           *((volatile unsigned int*)(0x43013C0CUL))
#define bM4_USH_DIEPCTL7_MPS4                           *((volatile unsigned int*)(0x43013C10UL))
#define bM4_USH_DIEPCTL7_MPS5                           *((volatile unsigned int*)(0x43013C14UL))
#define bM4_USH_DIEPCTL7_MPS6                           *((volatile unsigned int*)(0x43013C18UL))
#define bM4_USH_DIEPCTL7_MPS7                           *((volatile unsigned int*)(0x43013C1CUL))
#define bM4_USH_DIEPCTL7_MPS8                           *((volatile unsigned int*)(0x43013C20UL))
#define bM4_USH_DIEPCTL7_MPS9                           *((volatile unsigned int*)(0x43013C24UL))
#define bM4_USH_DIEPCTL7_MPS10                          *((volatile unsigned int*)(0x43013C28UL))
#define bM4_USH_DIEPCTL7_USBACTEP                       *((volatile unsigned int*)(0x43013C3CUL))
#define bM4_USH_DIEPCTL7_DPID                           *((volatile unsigned int*)(0x43013C40UL))
#define bM4_USH_DIEPCTL7_NAKSTS                         *((volatile unsigned int*)(0x43013C44UL))
#define bM4_USH_DIEPCTL7_EPTYPE0                        *((volatile unsigned int*)(0x43013C48UL))
#define bM4_USH_DIEPCTL7_EPTYPE1                        *((volatile unsigned int*)(0x43013C4CUL))
#define bM4_USH_DIEPCTL7_STALL                          *((volatile unsigned int*)(0x43013C54UL))
#define bM4_USH_DIEPCTL7_TXFNUM0                        *((volatile unsigned int*)(0x43013C58UL))
#define bM4_USH_DIEPCTL7_TXFNUM1                        *((volatile unsigned int*)(0x43013C5CUL))
#define bM4_USH_DIEPCTL7_TXFNUM2                        *((volatile unsigned int*)(0x43013C60UL))
#define bM4_USH_DIEPCTL7_TXFNUM3                        *((volatile unsigned int*)(0x43013C64UL))
#define bM4_USH_DIEPCTL7_CNAK                           *((volatile unsigned int*)(0x43013C68UL))
#define bM4_USH_DIEPCTL7_SNAK                           *((volatile unsigned int*)(0x43013C6CUL))
#define bM4_USH_DIEPCTL7_SETD0PID                       *((volatile unsigned int*)(0x43013C70UL))
#define bM4_USH_DIEPCTL7_SETD1PID                       *((volatile unsigned int*)(0x43013C74UL))
#define bM4_USH_DIEPCTL7_EPDIS                          *((volatile unsigned int*)(0x43013C78UL))
#define bM4_USH_DIEPCTL7_EPENA                          *((volatile unsigned int*)(0x43013C7CUL))
#define bM4_USH_DIEPINT7_XFERCOMPL                      *((volatile unsigned int*)(0x43013D00UL))
#define bM4_USH_DIEPINT7_EPDISBLD                       *((volatile unsigned int*)(0x43013D04UL))
#define bM4_USH_DIEPINT7_AHBERR                         *((volatile unsigned int*)(0x43013D08UL))
#define bM4_USH_DIEPINT7_TIMEOUT                        *((volatile unsigned int*)(0x43013D0CUL))
#define bM4_USH_DIEPINT7_INTKNTXFEMP                    *((volatile unsigned int*)(0x43013D10UL))
#define bM4_USH_DIEPINT7_INTKNEPMIS                     *((volatile unsigned int*)(0x43013D14UL))
#define bM4_USH_DIEPINT7_INEPNAKEFF                     *((volatile unsigned int*)(0x43013D18UL))
#define bM4_USH_DIEPINT7_TXFEMP                         *((volatile unsigned int*)(0x43013D1CUL))
#define bM4_USH_DIEPINT7_TXFIFOUNDRN                    *((volatile unsigned int*)(0x43013D20UL))
#define bM4_USH_DIEPINT7_BNAINTR                        *((volatile unsigned int*)(0x43013D24UL))
#define bM4_USH_DIEPINT7_PKTDRPSTS                      *((volatile unsigned int*)(0x43013D2CUL))
#define bM4_USH_DIEPINT7_BBLEERR                        *((volatile unsigned int*)(0x43013D30UL))
#define bM4_USH_DIEPINT7_NAKINTRPT                      *((volatile unsigned int*)(0x43013D34UL))
#define bM4_USH_DIEPINT7_NYETINTRPT                     *((volatile unsigned int*)(0x43013D38UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE0                     *((volatile unsigned int*)(0x43013E00UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE1                     *((volatile unsigned int*)(0x43013E04UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE2                     *((volatile unsigned int*)(0x43013E08UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE3                     *((volatile unsigned int*)(0x43013E0CUL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE4                     *((volatile unsigned int*)(0x43013E10UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE5                     *((volatile unsigned int*)(0x43013E14UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE6                     *((volatile unsigned int*)(0x43013E18UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE7                     *((volatile unsigned int*)(0x43013E1CUL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE8                     *((volatile unsigned int*)(0x43013E20UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE9                     *((volatile unsigned int*)(0x43013E24UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE10                    *((volatile unsigned int*)(0x43013E28UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE11                    *((volatile unsigned int*)(0x43013E2CUL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE12                    *((volatile unsigned int*)(0x43013E30UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE13                    *((volatile unsigned int*)(0x43013E34UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE14                    *((volatile unsigned int*)(0x43013E38UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE15                    *((volatile unsigned int*)(0x43013E3CUL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE16                    *((volatile unsigned int*)(0x43013E40UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE17                    *((volatile unsigned int*)(0x43013E44UL))
#define bM4_USH_DIEPTSIZ7_XFERSIZE18                    *((volatile unsigned int*)(0x43013E48UL))
#define bM4_USH_DIEPTSIZ7_PKTCNT0                       *((volatile unsigned int*)(0x43013E4CUL))
#define bM4_USH_DIEPTSIZ7_PKTCNT1                       *((volatile unsigned int*)(0x43013E50UL))
#define bM4_USH_DIEPTSIZ7_PKTCNT2                       *((volatile unsigned int*)(0x43013E54UL))
#define bM4_USH_DIEPTSIZ7_PKTCNT3                       *((volatile unsigned int*)(0x43013E58UL))
#define bM4_USH_DIEPTSIZ7_PKTCNT4                       *((volatile unsigned int*)(0x43013E5CUL))
#define bM4_USH_DIEPTSIZ7_PKTCNT5                       *((volatile unsigned int*)(0x43013E60UL))
#define bM4_USH_DIEPTSIZ7_PKTCNT6                       *((volatile unsigned int*)(0x43013E64UL))
#define bM4_USH_DIEPTSIZ7_PKTCNT7                       *((volatile unsigned int*)(0x43013E68UL))
#define bM4_USH_DIEPTSIZ7_PKTCNT8                       *((volatile unsigned int*)(0x43013E6CUL))
#define bM4_USH_DIEPTSIZ7_PKTCNT9                       *((volatile unsigned int*)(0x43013E70UL))
#define bM4_USH_DIEPTSIZ7_MC0                           *((volatile unsigned int*)(0x43013E74UL))
#define bM4_USH_DIEPTSIZ7_MC1                           *((volatile unsigned int*)(0x43013E78UL))
#define bM4_USH_DOEPCTL0_MPS0                           *((volatile unsigned int*)(0x43016000UL))
#define bM4_USH_DOEPCTL0_MPS1                           *((volatile unsigned int*)(0x43016004UL))
#define bM4_USH_DOEPCTL0_USBACTEP                       *((volatile unsigned int*)(0x4301603CUL))
#define bM4_USH_DOEPCTL0_NAKSTS                         *((volatile unsigned int*)(0x43016044UL))
#define bM4_USH_DOEPCTL0_EPTYPE0                        *((volatile unsigned int*)(0x43016048UL))
#define bM4_USH_DOEPCTL0_EPTYPE1                        *((volatile unsigned int*)(0x4301604CUL))
#define bM4_USH_DOEPCTL0_SNP                            *((volatile unsigned int*)(0x43016050UL))
#define bM4_USH_DOEPCTL0_STALL                          *((volatile unsigned int*)(0x43016054UL))
#define bM4_USH_DOEPCTL0_CNAK                           *((volatile unsigned int*)(0x43016068UL))
#define bM4_USH_DOEPCTL0_SNAK                           *((volatile unsigned int*)(0x4301606CUL))
#define bM4_USH_DOEPCTL0_EPDIS                          *((volatile unsigned int*)(0x43016078UL))
#define bM4_USH_DOEPCTL0_EPENA                          *((volatile unsigned int*)(0x4301607CUL))
#define bM4_USH_DOEPINT0_XFERCOMPL                      *((volatile unsigned int*)(0x43016100UL))
