RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_DOEPINT0_EPDISBLD                       *((volatile unsigned int*)(0x43016104UL))
#define bM4_USH_DOEPINT0_AHBERR                         *((volatile unsigned int*)(0x43016108UL))
#define bM4_USH_DOEPINT0_SETUP                          *((volatile unsigned int*)(0x4301610CUL))
#define bM4_USH_DOEPINT0_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43016110UL))
#define bM4_USH_DOEPINT0_STSPHSERCVD                    *((volatile unsigned int*)(0x43016114UL))
#define bM4_USH_DOEPINT0_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43016118UL))
#define bM4_USH_DOEPINT0_OUTPKTERR                      *((volatile unsigned int*)(0x43016120UL))
#define bM4_USH_DOEPINT0_BNAINTR                        *((volatile unsigned int*)(0x43016124UL))
#define bM4_USH_DOEPINT0_PKTDRPSTS                      *((volatile unsigned int*)(0x4301612CUL))
#define bM4_USH_DOEPINT0_BBLEERR                        *((volatile unsigned int*)(0x43016130UL))
#define bM4_USH_DOEPINT0_NAKINTRPT                      *((volatile unsigned int*)(0x43016134UL))
#define bM4_USH_DOEPINT0_NYETINTRPT                     *((volatile unsigned int*)(0x43016138UL))
#define bM4_USH_DOEPINT0_STUPPKTRCVD                    *((volatile unsigned int*)(0x4301613CUL))
#define bM4_USH_DOEPTSIZ0_XFERSIZE0                     *((volatile unsigned int*)(0x43016200UL))
#define bM4_USH_DOEPTSIZ0_XFERSIZE1                     *((volatile unsigned int*)(0x43016204UL))
#define bM4_USH_DOEPTSIZ0_XFERSIZE2                     *((volatile unsigned int*)(0x43016208UL))
#define bM4_USH_DOEPTSIZ0_XFERSIZE3                     *((volatile unsigned int*)(0x4301620CUL))
#define bM4_USH_DOEPTSIZ0_XFERSIZE4                     *((volatile unsigned int*)(0x43016210UL))
#define bM4_USH_DOEPTSIZ0_XFERSIZE5                     *((volatile unsigned int*)(0x43016214UL))
#define bM4_USH_DOEPTSIZ0_XFERSIZE6                     *((volatile unsigned int*)(0x43016218UL))
#define bM4_USH_DOEPTSIZ0_PKTCNT                        *((volatile unsigned int*)(0x4301624CUL))
#define bM4_USH_DOEPTSIZ0_SUPCNT0                       *((volatile unsigned int*)(0x43016274UL))
#define bM4_USH_DOEPTSIZ0_SUPCNT1                       *((volatile unsigned int*)(0x43016278UL))
#define bM4_USH_DOEPCTL1_MPS0                           *((volatile unsigned int*)(0x43016400UL))
#define bM4_USH_DOEPCTL1_MPS1                           *((volatile unsigned int*)(0x43016404UL))
#define bM4_USH_DOEPCTL1_MPS2                           *((volatile unsigned int*)(0x43016408UL))
#define bM4_USH_DOEPCTL1_MPS3                           *((volatile unsigned int*)(0x4301640CUL))
#define bM4_USH_DOEPCTL1_MPS4                           *((volatile unsigned int*)(0x43016410UL))
#define bM4_USH_DOEPCTL1_MPS5                           *((volatile unsigned int*)(0x43016414UL))
#define bM4_USH_DOEPCTL1_MPS6                           *((volatile unsigned int*)(0x43016418UL))
#define bM4_USH_DOEPCTL1_MPS7                           *((volatile unsigned int*)(0x4301641CUL))
#define bM4_USH_DOEPCTL1_MPS8                           *((volatile unsigned int*)(0x43016420UL))
#define bM4_USH_DOEPCTL1_MPS9                           *((volatile unsigned int*)(0x43016424UL))
#define bM4_USH_DOEPCTL1_MPS10                          *((volatile unsigned int*)(0x43016428UL))
#define bM4_USH_DOEPCTL1_USBACTEP                       *((volatile unsigned int*)(0x4301643CUL))
#define bM4_USH_DOEPCTL1_DPID                           *((volatile unsigned int*)(0x43016440UL))
#define bM4_USH_DOEPCTL1_NAKSTS                         *((volatile unsigned int*)(0x43016444UL))
#define bM4_USH_DOEPCTL1_EPTYPE0                        *((volatile unsigned int*)(0x43016448UL))
#define bM4_USH_DOEPCTL1_EPTYPE1                        *((volatile unsigned int*)(0x4301644CUL))
#define bM4_USH_DOEPCTL1_SNP                            *((volatile unsigned int*)(0x43016450UL))
#define bM4_USH_DOEPCTL1_STALL                          *((volatile unsigned int*)(0x43016454UL))
#define bM4_USH_DOEPCTL1_CNAK                           *((volatile unsigned int*)(0x43016468UL))
#define bM4_USH_DOEPCTL1_SNAK                           *((volatile unsigned int*)(0x4301646CUL))
#define bM4_USH_DOEPCTL1_SETD0PID                       *((volatile unsigned int*)(0x43016470UL))
#define bM4_USH_DOEPCTL1_SETD1PID                       *((volatile unsigned int*)(0x43016474UL))
#define bM4_USH_DOEPCTL1_EPDIS                          *((volatile unsigned int*)(0x43016478UL))
#define bM4_USH_DOEPCTL1_EPENA                          *((volatile unsigned int*)(0x4301647CUL))
#define bM4_USH_DOEPINT1_XFERCOMPL                      *((volatile unsigned int*)(0x43016500UL))
#define bM4_USH_DOEPINT1_EPDISBLD                       *((volatile unsigned int*)(0x43016504UL))
#define bM4_USH_DOEPINT1_AHBERR                         *((volatile unsigned int*)(0x43016508UL))
#define bM4_USH_DOEPINT1_SETUP                          *((volatile unsigned int*)(0x4301650CUL))
#define bM4_USH_DOEPINT1_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43016510UL))
#define bM4_USH_DOEPINT1_STSPHSERCVD                    *((volatile unsigned int*)(0x43016514UL))
#define bM4_USH_DOEPINT1_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43016518UL))
#define bM4_USH_DOEPINT1_OUTPKTERR                      *((volatile unsigned int*)(0x43016520UL))
#define bM4_USH_DOEPINT1_BNAINTR                        *((volatile unsigned int*)(0x43016524UL))
#define bM4_USH_DOEPINT1_PKTDRPSTS                      *((volatile unsigned int*)(0x4301652CUL))
#define bM4_USH_DOEPINT1_BBLEERR                        *((volatile unsigned int*)(0x43016530UL))
#define bM4_USH_DOEPINT1_NAKINTRPT                      *((volatile unsigned int*)(0x43016534UL))
#define bM4_USH_DOEPINT1_NYETINTRPT                     *((volatile unsigned int*)(0x43016538UL))
#define bM4_USH_DOEPINT1_STUPPKTRCVD                    *((volatile unsigned int*)(0x4301653CUL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE0                     *((volatile unsigned int*)(0x43016600UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE1                     *((volatile unsigned int*)(0x43016604UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE2                     *((volatile unsigned int*)(0x43016608UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE3                     *((volatile unsigned int*)(0x4301660CUL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE4                     *((volatile unsigned int*)(0x43016610UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE5                     *((volatile unsigned int*)(0x43016614UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE6                     *((volatile unsigned int*)(0x43016618UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE7                     *((volatile unsigned int*)(0x4301661CUL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE8                     *((volatile unsigned int*)(0x43016620UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE9                     *((volatile unsigned int*)(0x43016624UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE10                    *((volatile unsigned int*)(0x43016628UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE11                    *((volatile unsigned int*)(0x4301662CUL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE12                    *((volatile unsigned int*)(0x43016630UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE13                    *((volatile unsigned int*)(0x43016634UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE14                    *((volatile unsigned int*)(0x43016638UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE15                    *((volatile unsigned int*)(0x4301663CUL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE16                    *((volatile unsigned int*)(0x43016640UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE17                    *((volatile unsigned int*)(0x43016644UL))
#define bM4_USH_DOEPTSIZ1_XFERSIZE18                    *((volatile unsigned int*)(0x43016648UL))
#define bM4_USH_DOEPTSIZ1_PKTCNT0                       *((volatile unsigned int*)(0x4301664CUL))
#define bM4_USH_DOEPTSIZ1_PKTCNT1                       *((volatile unsigned int*)(0x43016650UL))
#define bM4_USH_DOEPTSIZ1_PKTCNT2                       *((volatile unsigned int*)(0x43016654UL))
#define bM4_USH_DOEPTSIZ1_PKTCNT3                       *((volatile unsigned int*)(0x43016658UL))
#define bM4_USH_DOEPTSIZ1_PKTCNT4                       *((volatile unsigned int*)(0x4301665CUL))
#define bM4_USH_DOEPTSIZ1_PKTCNT5                       *((volatile unsigned int*)(0x43016660UL))
#define bM4_USH_DOEPTSIZ1_PKTCNT6                       *((volatile unsigned int*)(0x43016664UL))
#define bM4_USH_DOEPTSIZ1_PKTCNT7                       *((volatile unsigned int*)(0x43016668UL))
#define bM4_USH_DOEPTSIZ1_PKTCNT8                       *((volatile unsigned int*)(0x4301666CUL))
#define bM4_USH_DOEPTSIZ1_PKTCNT9                       *((volatile unsigned int*)(0x43016670UL))
#define bM4_USH_DOEPTSIZ1_RXDPID0                       *((volatile unsigned int*)(0x43016674UL))
#define bM4_USH_DOEPTSIZ1_RXDPID1                       *((volatile unsigned int*)(0x43016678UL))
#define bM4_USH_DOEPCTL2_MPS0                           *((volatile unsigned int*)(0x43016800UL))
#define bM4_USH_DOEPCTL2_MPS1                           *((volatile unsigned int*)(0x43016804UL))
#define bM4_USH_DOEPCTL2_MPS2                           *((volatile unsigned int*)(0x43016808UL))
#define bM4_USH_DOEPCTL2_MPS3                           *((volatile unsigned int*)(0x4301680CUL))
#define bM4_USH_DOEPCTL2_MPS4                           *((volatile unsigned int*)(0x43016810UL))
#define bM4_USH_DOEPCTL2_MPS5                           *((volatile unsigned int*)(0x43016814UL))
#define bM4_USH_DOEPCTL2_MPS6                           *((volatile unsigned int*)(0x43016818UL))
#define bM4_USH_DOEPCTL2_MPS7                           *((volatile unsigned int*)(0x4301681CUL))
#define bM4_USH_DOEPCTL2_MPS8                           *((volatile unsigned int*)(0x43016820UL))
#define bM4_USH_DOEPCTL2_MPS9                           *((volatile unsigned int*)(0x43016824UL))
#define bM4_USH_DOEPCTL2_MPS10                          *((volatile unsigned int*)(0x43016828UL))
#define bM4_USH_DOEPCTL2_USBACTEP                       *((volatile unsigned int*)(0x4301683CUL))
#define bM4_USH_DOEPCTL2_DPID                           *((volatile unsigned int*)(0x43016840UL))
#define bM4_USH_DOEPCTL2_NAKSTS                         *((volatile unsigned int*)(0x43016844UL))
#define bM4_USH_DOEPCTL2_EPTYPE0                        *((volatile unsigned int*)(0x43016848UL))
#define bM4_USH_DOEPCTL2_EPTYPE1                        *((volatile unsigned int*)(0x4301684CUL))
#define bM4_USH_DOEPCTL2_SNP                            *((volatile unsigned int*)(0x43016850UL))
#define bM4_USH_DOEPCTL2_STALL                          *((volatile unsigned int*)(0x43016854UL))
#define bM4_USH_DOEPCTL2_CNAK                           *((volatile unsigned int*)(0x43016868UL))
#define bM4_USH_DOEPCTL2_SNAK                           *((volatile unsigned int*)(0x4301686CUL))
#define bM4_USH_DOEPCTL2_SETD0PID                       *((volatile unsigned int*)(0x43016870UL))
#define bM4_USH_DOEPCTL2_SETD1PID                       *((volatile unsigned int*)(0x43016874UL))
#define bM4_USH_DOEPCTL2_EPDIS                          *((volatile unsigned int*)(0x43016878UL))
#define bM4_USH_DOEPCTL2_EPENA                          *((volatile unsigned int*)(0x4301687CUL))
#define bM4_USH_DOEPINT2_XFERCOMPL                      *((volatile unsigned int*)(0x43016900UL))
#define bM4_USH_DOEPINT2_EPDISBLD                       *((volatile unsigned int*)(0x43016904UL))
#define bM4_USH_DOEPINT2_AHBERR                         *((volatile unsigned int*)(0x43016908UL))
#define bM4_USH_DOEPINT2_SETUP                          *((volatile unsigned int*)(0x4301690CUL))
#define bM4_USH_DOEPINT2_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43016910UL))
#define bM4_USH_DOEPINT2_STSPHSERCVD                    *((volatile unsigned int*)(0x43016914UL))
#define bM4_USH_DOEPINT2_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43016918UL))
#define bM4_USH_DOEPINT2_OUTPKTERR                      *((volatile unsigned int*)(0x43016920UL))
#define bM4_USH_DOEPINT2_BNAINTR                        *((volatile unsigned int*)(0x43016924UL))
#define bM4_USH_DOEPINT2_PKTDRPSTS                      *((volatile unsigned int*)(0x4301692CUL))
#define bM4_USH_DOEPINT2_BBLEERR                        *((volatile unsigned int*)(0x43016930UL))
#define bM4_USH_DOEPINT2_NAKINTRPT                      *((volatile unsigned int*)(0x43016934UL))
#define bM4_USH_DOEPINT2_NYETINTRPT                     *((volatile unsigned int*)(0x43016938UL))
#define bM4_USH_DOEPINT2_STUPPKTRCVD                    *((volatile unsigned int*)(0x4301693CUL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE0                     *((volatile unsigned int*)(0x43016A00UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE1                     *((volatile unsigned int*)(0x43016A04UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE2                     *((volatile unsigned int*)(0x43016A08UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE3                     *((volatile unsigned int*)(0x43016A0CUL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE4                     *((volatile unsigned int*)(0x43016A10UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE5                     *((volatile unsigned int*)(0x43016A14UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE6                     *((volatile unsigned int*)(0x43016A18UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE7                     *((volatile unsigned int*)(0x43016A1CUL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE8                     *((volatile unsigned int*)(0x43016A20UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE9                     *((volatile unsigned int*)(0x43016A24UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE10                    *((volatile unsigned int*)(0x43016A28UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE11                    *((volatile unsigned int*)(0x43016A2CUL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE12                    *((volatile unsigned int*)(0x43016A30UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE13                    *((volatile unsigned int*)(0x43016A34UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE14                    *((volatile unsigned int*)(0x43016A38UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE15                    *((volatile unsigned int*)(0x43016A3CUL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE16                    *((volatile unsigned int*)(0x43016A40UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE17                    *((volatile unsigned int*)(0x43016A44UL))
#define bM4_USH_DOEPTSIZ2_XFERSIZE18                    *((volatile unsigned int*)(0x43016A48UL))
#define bM4_USH_DOEPTSIZ2_PKTCNT0                       *((volatile unsigned int*)(0x43016A4CUL))
#define bM4_USH_DOEPTSIZ2_PKTCNT1                       *((volatile unsigned int*)(0x43016A50UL))
#define bM4_USH_DOEPTSIZ2_PKTCNT2                       *((volatile unsigned int*)(0x43016A54UL))
#define bM4_USH_DOEPTSIZ2_PKTCNT3                       *((volatile unsigned int*)(0x43016A58UL))
#define bM4_USH_DOEPTSIZ2_PKTCNT4                       *((volatile unsigned int*)(0x43016A5CUL))
#define bM4_USH_DOEPTSIZ2_PKTCNT5                       *((volatile unsigned int*)(0x43016A60UL))
#define bM4_USH_DOEPTSIZ2_PKTCNT6                       *((volatile unsigned int*)(0x43016A64UL))
#define bM4_USH_DOEPTSIZ2_PKTCNT7                       *((volatile unsigned int*)(0x43016A68UL))
#define bM4_USH_DOEPTSIZ2_PKTCNT8                       *((volatile unsigned int*)(0x43016A6CUL))
#define bM4_USH_DOEPTSIZ2_PKTCNT9                       *((volatile unsigned int*)(0x43016A70UL))
#define bM4_USH_DOEPTSIZ2_RXDPID0                       *((volatile unsigned int*)(0x43016A74UL))
#define bM4_USH_DOEPTSIZ2_RXDPID1                       *((volatile unsigned int*)(0x43016A78UL))
#define bM4_USH_DOEPCTL3_MPS0                           *((volatile unsigned int*)(0x43016C00UL))
#define bM4_USH_DOEPCTL3_MPS1                           *((volatile unsigned int*)(0x43016C04UL))
#define bM4_USH_DOEPCTL3_MPS2                           *((volatile unsigned int*)(0x43016C08UL))
#define bM4_USH_DOEPCTL3_MPS3                           *((volatile unsigned int*)(0x43016C0CUL))
#define bM4_USH_DOEPCTL3_MPS4                           *((volatile unsigned int*)(0x43016C10UL))
#define bM4_USH_DOEPCTL3_MPS5                           *((volatile unsigned int*)(0x43016C14UL))
#define bM4_USH_DOEPCTL3_MPS6                           *((volatile unsigned int*)(0x43016C18UL))
#define bM4_USH_DOEPCTL3_MPS7                           *((volatile unsigned int*)(0x43016C1CUL))
#define bM4_USH_DOEPCTL3_MPS8                           *((volatile unsigned int*)(0x43016C20UL))
#define bM4_USH_DOEPCTL3_MPS9                           *((volatile unsigned int*)(0x43016C24UL))
#define bM4_USH_DOEPCTL3_MPS10                          *((volatile unsigned int*)(0x43016C28UL))
#define bM4_USH_DOEPCTL3_USBACTEP                       *((volatile unsigned int*)(0x43016C3CUL))
#define bM4_USH_DOEPCTL3_DPID                           *((volatile unsigned int*)(0x43016C40UL))
#define bM4_USH_DOEPCTL3_NAKSTS                         *((volatile unsigned int*)(0x43016C44UL))
#define bM4_USH_DOEPCTL3_EPTYPE0                        *((volatile unsigned int*)(0x43016C48UL))
#define bM4_USH_DOEPCTL3_EPTYPE1                        *((volatile unsigned int*)(0x43016C4CUL))
#define bM4_USH_DOEPCTL3_SNP                            *((volatile unsigned int*)(0x43016C50UL))
#define bM4_USH_DOEPCTL3_STALL                          *((volatile unsigned int*)(0x43016C54UL))
#define bM4_USH_DOEPCTL3_CNAK                           *((volatile unsigned int*)(0x43016C68UL))
#define bM4_USH_DOEPCTL3_SNAK                           *((volatile unsigned int*)(0x43016C6CUL))
#define bM4_USH_DOEPCTL3_SETD0PID                       *((volatile unsigned int*)(0x43016C70UL))
#define bM4_USH_DOEPCTL3_SETD1PID                       *((volatile unsigned int*)(0x43016C74UL))
#define bM4_USH_DOEPCTL3_EPDIS                          *((volatile unsigned int*)(0x43016C78UL))
#define bM4_USH_DOEPCTL3_EPENA                          *((volatile unsigned int*)(0x43016C7CUL))
#define bM4_USH_DOEPINT3_XFERCOMPL                      *((volatile unsigned int*)(0x43016D00UL))
#define bM4_USH_DOEPINT3_EPDISBLD                       *((volatile unsigned int*)(0x43016D04UL))
#define bM4_USH_DOEPINT3_AHBERR                         *((volatile unsigned int*)(0x43016D08UL))
#define bM4_USH_DOEPINT3_SETUP                          *((volatile unsigned int*)(0x43016D0CUL))
#define bM4_USH_DOEPINT3_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43016D10UL))
#define bM4_USH_DOEPINT3_STSPHSERCVD                    *((volatile unsigned int*)(0x43016D14UL))
#define bM4_USH_DOEPINT3_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43016D18UL))
#define bM4_USH_DOEPINT3_OUTPKTERR                      *((volatile unsigned int*)(0x43016D20UL))
#define bM4_USH_DOEPINT3_BNAINTR                        *((volatile unsigned int*)(0x43016D24UL))
#define bM4_USH_DOEPINT3_PKTDRPSTS                      *((volatile unsigned int*)(0x43016D2CUL))
#define bM4_USH_DOEPINT3_BBLEERR                        *((volatile unsigned int*)(0x43016D30UL))
#define bM4_USH_DOEPINT3_NAKINTRPT                      *((volatile unsigned int*)(0x43016D34UL))
#define bM4_USH_DOEPINT3_NYETINTRPT                     *((volatile unsigned int*)(0x43016D38UL))
#define bM4_USH_DOEPINT3_STUPPKTRCVD                    *((volatile unsigned int*)(0x43016D3CUL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE0                     *((volatile unsigned int*)(0x43016E00UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE1                     *((volatile unsigned int*)(0x43016E04UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE2                     *((volatile unsigned int*)(0x43016E08UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE3                     *((volatile unsigned int*)(0x43016E0CUL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE4                     *((volatile unsigned int*)(0x43016E10UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE5                     *((volatile unsigned int*)(0x43016E14UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE6                     *((volatile unsigned int*)(0x43016E18UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE7                     *((volatile unsigned int*)(0x43016E1CUL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE8                     *((volatile unsigned int*)(0x43016E20UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE9                     *((volatile unsigned int*)(0x43016E24UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE10                    *((volatile unsigned int*)(0x43016E28UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE11                    *((volatile unsigned int*)(0x43016E2CUL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE12                    *((volatile unsigned int*)(0x43016E30UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE13                    *((volatile unsigned int*)(0x43016E34UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE14                    *((volatile unsigned int*)(0x43016E38UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE15                    *((volatile unsigned int*)(0x43016E3CUL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE16                    *((volatile unsigned int*)(0x43016E40UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE17                    *((volatile unsigned int*)(0x43016E44UL))
#define bM4_USH_DOEPTSIZ3_XFERSIZE18                    *((volatile unsigned int*)(0x43016E48UL))
#define bM4_USH_DOEPTSIZ3_PKTCNT0                       *((volatile unsigned int*)(0x43016E4CUL))
#define bM4_USH_DOEPTSIZ3_PKTCNT1                       *((volatile unsigned int*)(0x43016E50UL))
#define bM4_USH_DOEPTSIZ3_PKTCNT2                       *((volatile unsigned int*)(0x43016E54UL))
#define bM4_USH_DOEPTSIZ3_PKTCNT3                       *((volatile unsigned int*)(0x43016E58UL))
#define bM4_USH_DOEPTSIZ3_PKTCNT4                       *((volatile unsigned int*)(0x43016E5CUL))
#define bM4_USH_DOEPTSIZ3_PKTCNT5                       *((volatile unsigned int*)(0x43016E60UL))
#define bM4_USH_DOEPTSIZ3_PKTCNT6                       *((volatile unsigned int*)(0x43016E64UL))
#define bM4_USH_DOEPTSIZ3_PKTCNT7                       *((volatile unsigned int*)(0x43016E68UL))
#define bM4_USH_DOEPTSIZ3_PKTCNT8                       *((volatile unsigned int*)(0x43016E6CUL))
#define bM4_USH_DOEPTSIZ3_PKTCNT9                       *((volatile unsigned int*)(0x43016E70UL))
#define bM4_USH_DOEPTSIZ3_RXDPID0                       *((volatile unsigned int*)(0x43016E74UL))
#define bM4_USH_DOEPTSIZ3_RXDPID1                       *((volatile unsigned int*)(0x43016E78UL))
#define bM4_USH_DOEPCTL4_MPS0                           *((volatile unsigned int*)(0x43017000UL))
#define bM4_USH_DOEPCTL4_MPS1                           *((volatile unsigned int*)(0x43017004UL))
#define bM4_USH_DOEPCTL4_MPS2                           *((volatile unsigned int*)(0x43017008UL))
#define bM4_USH_DOEPCTL4_MPS3                           *((volatile unsigned int*)(0x4301700CUL))
#define bM4_USH_DOEPCTL4_MPS4                           *((volatile unsigned int*)(0x43017010UL))
#define bM4_USH_DOEPCTL4_MPS5                           *((volatile unsigned int*)(0x43017014UL))
#define bM4_USH_DOEPCTL4_MPS6                           *((volatile unsigned int*)(0x43017018UL))
#define bM4_USH_DOEPCTL4_MPS7                           *((volatile unsigned int*)(0x4301701CUL))
#define bM4_USH_DOEPCTL4_MPS8                           *((volatile unsigned int*)(0x43017020UL))
#define bM4_USH_DOEPCTL4_MPS9                           *((volatile unsigned int*)(0x43017024UL))
#define bM4_USH_DOEPCTL4_MPS10                          *((volatile unsigned int*)(0x43017028UL))
#define bM4_USH_DOEPCTL4_USBACTEP                       *((volatile unsigned int*)(0x4301703CUL))
#define bM4_USH_DOEPCTL4_DPID                           *((volatile unsigned int*)(0x43017040UL))
#define bM4_USH_DOEPCTL4_NAKSTS                         *((volatile unsigned int*)(0x43017044UL))
