RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_DOEPCTL4_EPTYPE0                        *((volatile unsigned int*)(0x43017048UL))
#define bM4_USH_DOEPCTL4_EPTYPE1                        *((volatile unsigned int*)(0x4301704CUL))
#define bM4_USH_DOEPCTL4_SNP                            *((volatile unsigned int*)(0x43017050UL))
#define bM4_USH_DOEPCTL4_STALL                          *((volatile unsigned int*)(0x43017054UL))
#define bM4_USH_DOEPCTL4_CNAK                           *((volatile unsigned int*)(0x43017068UL))
#define bM4_USH_DOEPCTL4_SNAK                           *((volatile unsigned int*)(0x4301706CUL))
#define bM4_USH_DOEPCTL4_SETD0PID                       *((volatile unsigned int*)(0x43017070UL))
#define bM4_USH_DOEPCTL4_SETD1PID                       *((volatile unsigned int*)(0x43017074UL))
#define bM4_USH_DOEPCTL4_EPDIS                          *((volatile unsigned int*)(0x43017078UL))
#define bM4_USH_DOEPCTL4_EPENA                          *((volatile unsigned int*)(0x4301707CUL))
#define bM4_USH_DOEPINT4_XFERCOMPL                      *((volatile unsigned int*)(0x43017100UL))
#define bM4_USH_DOEPINT4_EPDISBLD                       *((volatile unsigned int*)(0x43017104UL))
#define bM4_USH_DOEPINT4_AHBERR                         *((volatile unsigned int*)(0x43017108UL))
#define bM4_USH_DOEPINT4_SETUP                          *((volatile unsigned int*)(0x4301710CUL))
#define bM4_USH_DOEPINT4_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43017110UL))
#define bM4_USH_DOEPINT4_STSPHSERCVD                    *((volatile unsigned int*)(0x43017114UL))
#define bM4_USH_DOEPINT4_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43017118UL))
#define bM4_USH_DOEPINT4_OUTPKTERR                      *((volatile unsigned int*)(0x43017120UL))
#define bM4_USH_DOEPINT4_BNAINTR                        *((volatile unsigned int*)(0x43017124UL))
#define bM4_USH_DOEPINT4_PKTDRPSTS                      *((volatile unsigned int*)(0x4301712CUL))
#define bM4_USH_DOEPINT4_BBLEERR                        *((volatile unsigned int*)(0x43017130UL))
#define bM4_USH_DOEPINT4_NAKINTRPT                      *((volatile unsigned int*)(0x43017134UL))
#define bM4_USH_DOEPINT4_NYETINTRPT                     *((volatile unsigned int*)(0x43017138UL))
#define bM4_USH_DOEPINT4_STUPPKTRCVD                    *((volatile unsigned int*)(0x4301713CUL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE0                     *((volatile unsigned int*)(0x43017200UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE1                     *((volatile unsigned int*)(0x43017204UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE2                     *((volatile unsigned int*)(0x43017208UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE3                     *((volatile unsigned int*)(0x4301720CUL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE4                     *((volatile unsigned int*)(0x43017210UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE5                     *((volatile unsigned int*)(0x43017214UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE6                     *((volatile unsigned int*)(0x43017218UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE7                     *((volatile unsigned int*)(0x4301721CUL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE8                     *((volatile unsigned int*)(0x43017220UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE9                     *((volatile unsigned int*)(0x43017224UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE10                    *((volatile unsigned int*)(0x43017228UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE11                    *((volatile unsigned int*)(0x4301722CUL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE12                    *((volatile unsigned int*)(0x43017230UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE13                    *((volatile unsigned int*)(0x43017234UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE14                    *((volatile unsigned int*)(0x43017238UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE15                    *((volatile unsigned int*)(0x4301723CUL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE16                    *((volatile unsigned int*)(0x43017240UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE17                    *((volatile unsigned int*)(0x43017244UL))
#define bM4_USH_DOEPTSIZ4_XFERSIZE18                    *((volatile unsigned int*)(0x43017248UL))
#define bM4_USH_DOEPTSIZ4_PKTCNT0                       *((volatile unsigned int*)(0x4301724CUL))
#define bM4_USH_DOEPTSIZ4_PKTCNT1                       *((volatile unsigned int*)(0x43017250UL))
#define bM4_USH_DOEPTSIZ4_PKTCNT2                       *((volatile unsigned int*)(0x43017254UL))
#define bM4_USH_DOEPTSIZ4_PKTCNT3                       *((volatile unsigned int*)(0x43017258UL))
#define bM4_USH_DOEPTSIZ4_PKTCNT4                       *((volatile unsigned int*)(0x4301725CUL))
#define bM4_USH_DOEPTSIZ4_PKTCNT5                       *((volatile unsigned int*)(0x43017260UL))
#define bM4_USH_DOEPTSIZ4_PKTCNT6                       *((volatile unsigned int*)(0x43017264UL))
#define bM4_USH_DOEPTSIZ4_PKTCNT7                       *((volatile unsigned int*)(0x43017268UL))
#define bM4_USH_DOEPTSIZ4_PKTCNT8                       *((volatile unsigned int*)(0x4301726CUL))
#define bM4_USH_DOEPTSIZ4_PKTCNT9                       *((volatile unsigned int*)(0x43017270UL))
#define bM4_USH_DOEPTSIZ4_RXDPID0                       *((volatile unsigned int*)(0x43017274UL))
#define bM4_USH_DOEPTSIZ4_RXDPID1                       *((volatile unsigned int*)(0x43017278UL))
#define bM4_USH_DOEPCTL5_MPS0                           *((volatile unsigned int*)(0x43017400UL))
#define bM4_USH_DOEPCTL5_MPS1                           *((volatile unsigned int*)(0x43017404UL))
#define bM4_USH_DOEPCTL5_MPS2                           *((volatile unsigned int*)(0x43017408UL))
#define bM4_USH_DOEPCTL5_MPS3                           *((volatile unsigned int*)(0x4301740CUL))
#define bM4_USH_DOEPCTL5_MPS4                           *((volatile unsigned int*)(0x43017410UL))
#define bM4_USH_DOEPCTL5_MPS5                           *((volatile unsigned int*)(0x43017414UL))
#define bM4_USH_DOEPCTL5_MPS6                           *((volatile unsigned int*)(0x43017418UL))
#define bM4_USH_DOEPCTL5_MPS7                           *((volatile unsigned int*)(0x4301741CUL))
#define bM4_USH_DOEPCTL5_MPS8                           *((volatile unsigned int*)(0x43017420UL))
#define bM4_USH_DOEPCTL5_MPS9                           *((volatile unsigned int*)(0x43017424UL))
#define bM4_USH_DOEPCTL5_MPS10                          *((volatile unsigned int*)(0x43017428UL))
#define bM4_USH_DOEPCTL5_USBACTEP                       *((volatile unsigned int*)(0x4301743CUL))
#define bM4_USH_DOEPCTL5_DPID                           *((volatile unsigned int*)(0x43017440UL))
#define bM4_USH_DOEPCTL5_NAKSTS                         *((volatile unsigned int*)(0x43017444UL))
#define bM4_USH_DOEPCTL5_EPTYPE0                        *((volatile unsigned int*)(0x43017448UL))
#define bM4_USH_DOEPCTL5_EPTYPE1                        *((volatile unsigned int*)(0x4301744CUL))
#define bM4_USH_DOEPCTL5_SNP                            *((volatile unsigned int*)(0x43017450UL))
#define bM4_USH_DOEPCTL5_STALL                          *((volatile unsigned int*)(0x43017454UL))
#define bM4_USH_DOEPCTL5_CNAK                           *((volatile unsigned int*)(0x43017468UL))
#define bM4_USH_DOEPCTL5_SNAK                           *((volatile unsigned int*)(0x4301746CUL))
#define bM4_USH_DOEPCTL5_SETD0PID                       *((volatile unsigned int*)(0x43017470UL))
#define bM4_USH_DOEPCTL5_SETD1PID                       *((volatile unsigned int*)(0x43017474UL))
#define bM4_USH_DOEPCTL5_EPDIS                          *((volatile unsigned int*)(0x43017478UL))
#define bM4_USH_DOEPCTL5_EPENA                          *((volatile unsigned int*)(0x4301747CUL))
#define bM4_USH_DOEPINT5_XFERCOMPL                      *((volatile unsigned int*)(0x43017500UL))
#define bM4_USH_DOEPINT5_EPDISBLD                       *((volatile unsigned int*)(0x43017504UL))
#define bM4_USH_DOEPINT5_AHBERR                         *((volatile unsigned int*)(0x43017508UL))
#define bM4_USH_DOEPINT5_SETUP                          *((volatile unsigned int*)(0x4301750CUL))
#define bM4_USH_DOEPINT5_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43017510UL))
#define bM4_USH_DOEPINT5_STSPHSERCVD                    *((volatile unsigned int*)(0x43017514UL))
#define bM4_USH_DOEPINT5_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43017518UL))
#define bM4_USH_DOEPINT5_OUTPKTERR                      *((volatile unsigned int*)(0x43017520UL))
#define bM4_USH_DOEPINT5_BNAINTR                        *((volatile unsigned int*)(0x43017524UL))
#define bM4_USH_DOEPINT5_PKTDRPSTS                      *((volatile unsigned int*)(0x4301752CUL))
#define bM4_USH_DOEPINT5_BBLEERR                        *((volatile unsigned int*)(0x43017530UL))
#define bM4_USH_DOEPINT5_NAKINTRPT                      *((volatile unsigned int*)(0x43017534UL))
#define bM4_USH_DOEPINT5_NYETINTRPT                     *((volatile unsigned int*)(0x43017538UL))
#define bM4_USH_DOEPINT5_STUPPKTRCVD                    *((volatile unsigned int*)(0x4301753CUL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE0                     *((volatile unsigned int*)(0x43017600UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE1                     *((volatile unsigned int*)(0x43017604UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE2                     *((volatile unsigned int*)(0x43017608UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE3                     *((volatile unsigned int*)(0x4301760CUL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE4                     *((volatile unsigned int*)(0x43017610UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE5                     *((volatile unsigned int*)(0x43017614UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE6                     *((volatile unsigned int*)(0x43017618UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE7                     *((volatile unsigned int*)(0x4301761CUL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE8                     *((volatile unsigned int*)(0x43017620UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE9                     *((volatile unsigned int*)(0x43017624UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE10                    *((volatile unsigned int*)(0x43017628UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE11                    *((volatile unsigned int*)(0x4301762CUL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE12                    *((volatile unsigned int*)(0x43017630UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE13                    *((volatile unsigned int*)(0x43017634UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE14                    *((volatile unsigned int*)(0x43017638UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE15                    *((volatile unsigned int*)(0x4301763CUL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE16                    *((volatile unsigned int*)(0x43017640UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE17                    *((volatile unsigned int*)(0x43017644UL))
#define bM4_USH_DOEPTSIZ5_XFERSIZE18                    *((volatile unsigned int*)(0x43017648UL))
#define bM4_USH_DOEPTSIZ5_PKTCNT0                       *((volatile unsigned int*)(0x4301764CUL))
#define bM4_USH_DOEPTSIZ5_PKTCNT1                       *((volatile unsigned int*)(0x43017650UL))
#define bM4_USH_DOEPTSIZ5_PKTCNT2                       *((volatile unsigned int*)(0x43017654UL))
#define bM4_USH_DOEPTSIZ5_PKTCNT3                       *((volatile unsigned int*)(0x43017658UL))
#define bM4_USH_DOEPTSIZ5_PKTCNT4                       *((volatile unsigned int*)(0x4301765CUL))
#define bM4_USH_DOEPTSIZ5_PKTCNT5                       *((volatile unsigned int*)(0x43017660UL))
#define bM4_USH_DOEPTSIZ5_PKTCNT6                       *((volatile unsigned int*)(0x43017664UL))
#define bM4_USH_DOEPTSIZ5_PKTCNT7                       *((volatile unsigned int*)(0x43017668UL))
#define bM4_USH_DOEPTSIZ5_PKTCNT8                       *((volatile unsigned int*)(0x4301766CUL))
#define bM4_USH_DOEPTSIZ5_PKTCNT9                       *((volatile unsigned int*)(0x43017670UL))
#define bM4_USH_DOEPTSIZ5_RXDPID0                       *((volatile unsigned int*)(0x43017674UL))
#define bM4_USH_DOEPTSIZ5_RXDPID1                       *((volatile unsigned int*)(0x43017678UL))
#define bM4_USH_DOEPCTL6_MPS0                           *((volatile unsigned int*)(0x43017800UL))
#define bM4_USH_DOEPCTL6_MPS1                           *((volatile unsigned int*)(0x43017804UL))
#define bM4_USH_DOEPCTL6_MPS2                           *((volatile unsigned int*)(0x43017808UL))
#define bM4_USH_DOEPCTL6_MPS3                           *((volatile unsigned int*)(0x4301780CUL))
#define bM4_USH_DOEPCTL6_MPS4                           *((volatile unsigned int*)(0x43017810UL))
#define bM4_USH_DOEPCTL6_MPS5                           *((volatile unsigned int*)(0x43017814UL))
#define bM4_USH_DOEPCTL6_MPS6                           *((volatile unsigned int*)(0x43017818UL))
#define bM4_USH_DOEPCTL6_MPS7                           *((volatile unsigned int*)(0x4301781CUL))
#define bM4_USH_DOEPCTL6_MPS8                           *((volatile unsigned int*)(0x43017820UL))
#define bM4_USH_DOEPCTL6_MPS9                           *((volatile unsigned int*)(0x43017824UL))
#define bM4_USH_DOEPCTL6_MPS10                          *((volatile unsigned int*)(0x43017828UL))
#define bM4_USH_DOEPCTL6_USBACTEP                       *((volatile unsigned int*)(0x4301783CUL))
#define bM4_USH_DOEPCTL6_DPID                           *((volatile unsigned int*)(0x43017840UL))
#define bM4_USH_DOEPCTL6_NAKSTS                         *((volatile unsigned int*)(0x43017844UL))
#define bM4_USH_DOEPCTL6_EPTYPE0                        *((volatile unsigned int*)(0x43017848UL))
#define bM4_USH_DOEPCTL6_EPTYPE1                        *((volatile unsigned int*)(0x4301784CUL))
#define bM4_USH_DOEPCTL6_SNP                            *((volatile unsigned int*)(0x43017850UL))
#define bM4_USH_DOEPCTL6_STALL                          *((volatile unsigned int*)(0x43017854UL))
#define bM4_USH_DOEPCTL6_CNAK                           *((volatile unsigned int*)(0x43017868UL))
#define bM4_USH_DOEPCTL6_SNAK                           *((volatile unsigned int*)(0x4301786CUL))
#define bM4_USH_DOEPCTL6_SETD0PID                       *((volatile unsigned int*)(0x43017870UL))
#define bM4_USH_DOEPCTL6_SETD1PID                       *((volatile unsigned int*)(0x43017874UL))
#define bM4_USH_DOEPCTL6_EPDIS                          *((volatile unsigned int*)(0x43017878UL))
#define bM4_USH_DOEPCTL6_EPENA                          *((volatile unsigned int*)(0x4301787CUL))
#define bM4_USH_DOEPINT6_XFERCOMPL                      *((volatile unsigned int*)(0x43017900UL))
#define bM4_USH_DOEPINT6_EPDISBLD                       *((volatile unsigned int*)(0x43017904UL))
#define bM4_USH_DOEPINT6_AHBERR                         *((volatile unsigned int*)(0x43017908UL))
#define bM4_USH_DOEPINT6_SETUP                          *((volatile unsigned int*)(0x4301790CUL))
#define bM4_USH_DOEPINT6_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43017910UL))
#define bM4_USH_DOEPINT6_STSPHSERCVD                    *((volatile unsigned int*)(0x43017914UL))
#define bM4_USH_DOEPINT6_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43017918UL))
#define bM4_USH_DOEPINT6_OUTPKTERR                      *((volatile unsigned int*)(0x43017920UL))
#define bM4_USH_DOEPINT6_BNAINTR                        *((volatile unsigned int*)(0x43017924UL))
#define bM4_USH_DOEPINT6_PKTDRPSTS                      *((volatile unsigned int*)(0x4301792CUL))
#define bM4_USH_DOEPINT6_BBLEERR                        *((volatile unsigned int*)(0x43017930UL))
#define bM4_USH_DOEPINT6_NAKINTRPT                      *((volatile unsigned int*)(0x43017934UL))
#define bM4_USH_DOEPINT6_NYETINTRPT                     *((volatile unsigned int*)(0x43017938UL))
#define bM4_USH_DOEPINT6_STUPPKTRCVD                    *((volatile unsigned int*)(0x4301793CUL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE0                     *((volatile unsigned int*)(0x43017A00UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE1                     *((volatile unsigned int*)(0x43017A04UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE2                     *((volatile unsigned int*)(0x43017A08UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE3                     *((volatile unsigned int*)(0x43017A0CUL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE4                     *((volatile unsigned int*)(0x43017A10UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE5                     *((volatile unsigned int*)(0x43017A14UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE6                     *((volatile unsigned int*)(0x43017A18UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE7                     *((volatile unsigned int*)(0x43017A1CUL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE8                     *((volatile unsigned int*)(0x43017A20UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE9                     *((volatile unsigned int*)(0x43017A24UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE10                    *((volatile unsigned int*)(0x43017A28UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE11                    *((volatile unsigned int*)(0x43017A2CUL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE12                    *((volatile unsigned int*)(0x43017A30UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE13                    *((volatile unsigned int*)(0x43017A34UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE14                    *((volatile unsigned int*)(0x43017A38UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE15                    *((volatile unsigned int*)(0x43017A3CUL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE16                    *((volatile unsigned int*)(0x43017A40UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE17                    *((volatile unsigned int*)(0x43017A44UL))
#define bM4_USH_DOEPTSIZ6_XFERSIZE18                    *((volatile unsigned int*)(0x43017A48UL))
#define bM4_USH_DOEPTSIZ6_PKTCNT0                       *((volatile unsigned int*)(0x43017A4CUL))
#define bM4_USH_DOEPTSIZ6_PKTCNT1                       *((volatile unsigned int*)(0x43017A50UL))
#define bM4_USH_DOEPTSIZ6_PKTCNT2                       *((volatile unsigned int*)(0x43017A54UL))
#define bM4_USH_DOEPTSIZ6_PKTCNT3                       *((volatile unsigned int*)(0x43017A58UL))
#define bM4_USH_DOEPTSIZ6_PKTCNT4                       *((volatile unsigned int*)(0x43017A5CUL))
#define bM4_USH_DOEPTSIZ6_PKTCNT5                       *((volatile unsigned int*)(0x43017A60UL))
#define bM4_USH_DOEPTSIZ6_PKTCNT6                       *((volatile unsigned int*)(0x43017A64UL))
#define bM4_USH_DOEPTSIZ6_PKTCNT7                       *((volatile unsigned int*)(0x43017A68UL))
#define bM4_USH_DOEPTSIZ6_PKTCNT8                       *((volatile unsigned int*)(0x43017A6CUL))
#define bM4_USH_DOEPTSIZ6_PKTCNT9                       *((volatile unsigned int*)(0x43017A70UL))
#define bM4_USH_DOEPTSIZ6_RXDPID0                       *((volatile unsigned int*)(0x43017A74UL))
#define bM4_USH_DOEPTSIZ6_RXDPID1                       *((volatile unsigned int*)(0x43017A78UL))
#define bM4_USH_DOEPCTL7_MPS0                           *((volatile unsigned int*)(0x43017C00UL))
#define bM4_USH_DOEPCTL7_MPS1                           *((volatile unsigned int*)(0x43017C04UL))
#define bM4_USH_DOEPCTL7_MPS2                           *((volatile unsigned int*)(0x43017C08UL))
#define bM4_USH_DOEPCTL7_MPS3                           *((volatile unsigned int*)(0x43017C0CUL))
#define bM4_USH_DOEPCTL7_MPS4                           *((volatile unsigned int*)(0x43017C10UL))
#define bM4_USH_DOEPCTL7_MPS5                           *((volatile unsigned int*)(0x43017C14UL))
#define bM4_USH_DOEPCTL7_MPS6                           *((volatile unsigned int*)(0x43017C18UL))
#define bM4_USH_DOEPCTL7_MPS7                           *((volatile unsigned int*)(0x43017C1CUL))
#define bM4_USH_DOEPCTL7_MPS8                           *((volatile unsigned int*)(0x43017C20UL))
#define bM4_USH_DOEPCTL7_MPS9                           *((volatile unsigned int*)(0x43017C24UL))
#define bM4_USH_DOEPCTL7_MPS10                          *((volatile unsigned int*)(0x43017C28UL))
#define bM4_USH_DOEPCTL7_USBACTEP                       *((volatile unsigned int*)(0x43017C3CUL))
#define bM4_USH_DOEPCTL7_DPID                           *((volatile unsigned int*)(0x43017C40UL))
#define bM4_USH_DOEPCTL7_NAKSTS                         *((volatile unsigned int*)(0x43017C44UL))
#define bM4_USH_DOEPCTL7_EPTYPE0                        *((volatile unsigned int*)(0x43017C48UL))
#define bM4_USH_DOEPCTL7_EPTYPE1                        *((volatile unsigned int*)(0x43017C4CUL))
#define bM4_USH_DOEPCTL7_SNP                            *((volatile unsigned int*)(0x43017C50UL))
#define bM4_USH_DOEPCTL7_STALL                          *((volatile unsigned int*)(0x43017C54UL))
#define bM4_USH_DOEPCTL7_CNAK                           *((volatile unsigned int*)(0x43017C68UL))
#define bM4_USH_DOEPCTL7_SNAK                           *((volatile unsigned int*)(0x43017C6CUL))
#define bM4_USH_DOEPCTL7_SETD0PID                       *((volatile unsigned int*)(0x43017C70UL))
#define bM4_USH_DOEPCTL7_SETD1PID                       *((volatile unsigned int*)(0x43017C74UL))
#define bM4_USH_DOEPCTL7_EPDIS                          *((volatile unsigned int*)(0x43017C78UL))
#define bM4_USH_DOEPCTL7_EPENA                          *((volatile unsigned int*)(0x43017C7CUL))
#define bM4_USH_DOEPINT7_XFERCOMPL                      *((volatile unsigned int*)(0x43017D00UL))
#define bM4_USH_DOEPINT7_EPDISBLD                       *((volatile unsigned int*)(0x43017D04UL))
#define bM4_USH_DOEPINT7_AHBERR                         *((volatile unsigned int*)(0x43017D08UL))
#define bM4_USH_DOEPINT7_SETUP                          *((volatile unsigned int*)(0x43017D0CUL))
#define bM4_USH_DOEPINT7_OUTTKNEPDIS                    *((volatile unsigned int*)(0x43017D10UL))
#define bM4_USH_DOEPINT7_STSPHSERCVD                    *((volatile unsigned int*)(0x43017D14UL))
#define bM4_USH_DOEPINT7_BACK2BACKSETUP                 *((volatile unsigned int*)(0x43017D18UL))
#define bM4_USH_DOEPINT7_OUTPKTERR                      *((volatile unsigned int*)(0x43017D20UL))
#define bM4_USH_DOEPINT7_BNAINTR                        *((volatile unsigned int*)(0x43017D24UL))
#define bM4_USH_DOEPINT7_PKTDRPSTS                      *((volatile unsigned int*)(0x43017D2CUL))
#define bM4_USH_DOEPINT7_BBLEERR                        *((volatile unsigned int*)(0x43017D30UL))
#define bM4_USH_DOEPINT7_NAKINTRPT                      *((volatile unsigned int*)(0x43017D34UL))
#define bM4_USH_DOEPINT7_NYETINTRPT                     *((volatile unsigned int*)(0x43017D38UL))
#define bM4_USH_DOEPINT7_STUPPKTRCVD                    *((volatile unsigned int*)(0x43017D3CUL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE0                     *((volatile unsigned int*)(0x43017E00UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE1                     *((volatile unsigned int*)(0x43017E04UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE2                     *((volatile unsigned int*)(0x43017E08UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE3                     *((volatile unsigned int*)(0x43017E0CUL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE4                     *((volatile unsigned int*)(0x43017E10UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE5                     *((volatile unsigned int*)(0x43017E14UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE6                     *((volatile unsigned int*)(0x43017E18UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE7                     *((volatile unsigned int*)(0x43017E1CUL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE8                     *((volatile unsigned int*)(0x43017E20UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE9                     *((volatile unsigned int*)(0x43017E24UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE10                    *((volatile unsigned int*)(0x43017E28UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE11                    *((volatile unsigned int*)(0x43017E2CUL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE12                    *((volatile unsigned int*)(0x43017E30UL))
