RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/common/hc32f480.h
#define bM4_USH_DOEPTSIZ7_XFERSIZE13                    *((volatile unsigned int*)(0x43017E34UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE14                    *((volatile unsigned int*)(0x43017E38UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE15                    *((volatile unsigned int*)(0x43017E3CUL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE16                    *((volatile unsigned int*)(0x43017E40UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE17                    *((volatile unsigned int*)(0x43017E44UL))
#define bM4_USH_DOEPTSIZ7_XFERSIZE18                    *((volatile unsigned int*)(0x43017E48UL))
#define bM4_USH_DOEPTSIZ7_PKTCNT0                       *((volatile unsigned int*)(0x43017E4CUL))
#define bM4_USH_DOEPTSIZ7_PKTCNT1                       *((volatile unsigned int*)(0x43017E50UL))
#define bM4_USH_DOEPTSIZ7_PKTCNT2                       *((volatile unsigned int*)(0x43017E54UL))
#define bM4_USH_DOEPTSIZ7_PKTCNT3                       *((volatile unsigned int*)(0x43017E58UL))
#define bM4_USH_DOEPTSIZ7_PKTCNT4                       *((volatile unsigned int*)(0x43017E5CUL))
#define bM4_USH_DOEPTSIZ7_PKTCNT5                       *((volatile unsigned int*)(0x43017E60UL))
#define bM4_USH_DOEPTSIZ7_PKTCNT6                       *((volatile unsigned int*)(0x43017E64UL))
#define bM4_USH_DOEPTSIZ7_PKTCNT7                       *((volatile unsigned int*)(0x43017E68UL))
#define bM4_USH_DOEPTSIZ7_PKTCNT8                       *((volatile unsigned int*)(0x43017E6CUL))
#define bM4_USH_DOEPTSIZ7_PKTCNT9                       *((volatile unsigned int*)(0x43017E70UL))
#define bM4_USH_DOEPTSIZ7_RXDPID0                       *((volatile unsigned int*)(0x43017E74UL))
#define bM4_USH_DOEPTSIZ7_RXDPID1                       *((volatile unsigned int*)(0x43017E78UL))
#define bM4_USH_PCGCCTL_STOPPCLK                        *((volatile unsigned int*)(0x4301C000UL))
#define bM4_USH_PCGCCTL_GATEHCLK                        *((volatile unsigned int*)(0x4301C004UL))
#define bM4_USH_PCGCCTL_PWRCLMP                         *((volatile unsigned int*)(0x4301C008UL))
#define bM4_USH_PCGCCTL_RSTPDWNMODULE                   *((volatile unsigned int*)(0x4301C00CUL))
#define bM4_USH_PCGCCTL_PHYSLEEP                        *((volatile unsigned int*)(0x4301C018UL))
#define bM4_USH_PCGCCTL_L1SUSPENDED                     *((volatile unsigned int*)(0x4301C01CUL))
#define bM4_USH_PCGCCTL_RESETAFTERSUSP                  *((volatile unsigned int*)(0x4301C020UL))
#define bM4_VBAT_CMU_XTAL32CR_XTAL32STP                 *((volatile unsigned int*)(0x42970000UL))
#define bM4_VBAT_CMU_XTAL32CFGR_XTAL32DRV0              *((volatile unsigned int*)(0x42970020UL))
#define bM4_VBAT_CMU_XTAL32CFGR_XTAL32DRV1              *((volatile unsigned int*)(0x42970024UL))
#define bM4_VBAT_CMU_XTAL32CFGR_XTAL32SUPDRV            *((volatile unsigned int*)(0x42970028UL))
#define bM4_VBAT_CMU_XTAL32NFR_XTAL32NF0                *((volatile unsigned int*)(0x429700A0UL))
#define bM4_VBAT_CMU_XTAL32NFR_XTAL32NF1                *((volatile unsigned int*)(0x429700A4UL))
#define bM4_VBAT_CMU_LRCCR_LRCSTP                       *((volatile unsigned int*)(0x42970200UL))
#define bM4_VBAT_CMU_RTCLRCCR_RTCLRCSTP                 *((volatile unsigned int*)(0x42970220UL))
#define bM4_VBAT_BRAMC0_RAMPWDN                         *((volatile unsigned int*)(0x42970740UL))
#define bM4_VBAT_BRAMC0_RAMVALID                        *((volatile unsigned int*)(0x42970744UL))
#define bM4_VBAT_BRAMC0_RAMPDFLG                        *((volatile unsigned int*)(0x42970748UL))
#define bM4_WDT_CR_PERI0                                *((volatile unsigned int*)(0x42920000UL))
#define bM4_WDT_CR_PERI1                                *((volatile unsigned int*)(0x42920004UL))
#define bM4_WDT_CR_CKS0                                 *((volatile unsigned int*)(0x42920010UL))
#define bM4_WDT_CR_CKS1                                 *((volatile unsigned int*)(0x42920014UL))
#define bM4_WDT_CR_CKS2                                 *((volatile unsigned int*)(0x42920018UL))
#define bM4_WDT_CR_CKS3                                 *((volatile unsigned int*)(0x4292001CUL))
#define bM4_WDT_CR_WDPT0                                *((volatile unsigned int*)(0x42920020UL))
#define bM4_WDT_CR_WDPT1                                *((volatile unsigned int*)(0x42920024UL))
#define bM4_WDT_CR_WDPT2                                *((volatile unsigned int*)(0x42920028UL))
#define bM4_WDT_CR_WDPT3                                *((volatile unsigned int*)(0x4292002CUL))
#define bM4_WDT_CR_SLPOFF                               *((volatile unsigned int*)(0x42920040UL))
#define bM4_WDT_CR_RESV                                 *((volatile unsigned int*)(0x42920060UL))
#define bM4_WDT_CR_ITS                                  *((volatile unsigned int*)(0x4292007CUL))
#define bM4_WDT_SR_CNT0                                 *((volatile unsigned int*)(0x42920080UL))
#define bM4_WDT_SR_CNT1                                 *((volatile unsigned int*)(0x42920084UL))
#define bM4_WDT_SR_CNT2                                 *((volatile unsigned int*)(0x42920088UL))
#define bM4_WDT_SR_CNT3                                 *((volatile unsigned int*)(0x4292008CUL))
#define bM4_WDT_SR_CNT4                                 *((volatile unsigned int*)(0x42920090UL))
#define bM4_WDT_SR_CNT5                                 *((volatile unsigned int*)(0x42920094UL))
#define bM4_WDT_SR_CNT6                                 *((volatile unsigned int*)(0x42920098UL))
#define bM4_WDT_SR_CNT7                                 *((volatile unsigned int*)(0x4292009CUL))
#define bM4_WDT_SR_CNT8                                 *((volatile unsigned int*)(0x429200A0UL))
#define bM4_WDT_SR_CNT9                                 *((volatile unsigned int*)(0x429200A4UL))
#define bM4_WDT_SR_CNT10                                *((volatile unsigned int*)(0x429200A8UL))
#define bM4_WDT_SR_CNT11                                *((volatile unsigned int*)(0x429200ACUL))
#define bM4_WDT_SR_CNT12                                *((volatile unsigned int*)(0x429200B0UL))
#define bM4_WDT_SR_CNT13                                *((volatile unsigned int*)(0x429200B4UL))
#define bM4_WDT_SR_CNT14                                *((volatile unsigned int*)(0x429200B8UL))
#define bM4_WDT_SR_CNT15                                *((volatile unsigned int*)(0x429200BCUL))
#define bM4_WDT_SR_UDF                                  *((volatile unsigned int*)(0x429200C0UL))
#define bM4_WDT_SR_REF                                  *((volatile unsigned int*)(0x429200C4UL))
#define bM4_WDT_SR_RESV                                 *((volatile unsigned int*)(0x429200E0UL))


#ifdef __cplusplus
}
#endif

#endif /* __HC32F480_H__ */

